[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The bell rings. The fourth graders are still chatting as Mr. Garrison enters."
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay, children, let's take our seats. Did you take attendance, Mr. Slave?"
    },
    {
        "character": "Mr. Slave",
        "line": "[at his own little desk off to the side] All donesy wunsy. [has a clipboard to prove it]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay, let's all take out our math homework and go over the problem."
    },
    {
        "character": "Cartman",
        "line": "[searching his notebook] Math homework, Math homework. Where did I file that?"
    },
    {
        "character": "Mr. Garrison",
        "line": "[about to write on the board, but turns around] Oh, and by the way, children, there's a walkout scheduled today to protest the war in Iraq. So, uh, if you're against the war, run along outside, and if you're for the war, uh, stay here and we'll do math problems. [the kids quickly stare at each other]"
    },
    {
        "character": "",
        "line": "South Park Elementary, front entrance. The door open and all the kids run out. A cloud of paper signals their exit. Some of them twirl with delight. The boys come out singing."
    },
    {
        "character": "The Boys",
        "line": "We got out of schoo-l! No more school toda-ay!"
    },
    {
        "character": "Kyle",
        "line": "What should we do?"
    },
    {
        "character": "Stan",
        "line": "Let's go see a movie! [they stop in their tracks as they hear \"No war! No war!\"]"
    },
    {
        "character": "Protesters",
        "line": "No war! No war! [a sea of them mill around on South Park Avenue waving various signs around] No war! No war! [One man wields an American flag. He lowers it while another reaches for a lighter and set the flag aflame.] No war! No war! [three men break into Tele's through its large window and steal various TVs] No war! No war! No war!"
    },
    {
        "character": "Mr. Mackey",
        "line": "[walks up to the boys with several signs in his hands] No war, m'kay?! No war, m'kay?! Oh uh, here you go, boys. [hands each of them a sign] These will help you protest. It's good to see that you care about peace, boys, m'kay? No war, m'kay?!"
    },
    {
        "character": "A voice",
        "line": "Excuse me, boys. [the boys look and the adult is shown] Tom Stansel, HBC news. Can you kids tell me why you marched out of school today? [behind him is the cameraman and an assistant, and behind her, the news van]"
    },
    {
        "character": "Stan",
        "line": "[pause] Uh... war?"
    },
    {
        "character": "Tom",
        "line": "Right. What about the war?"
    },
    {
        "character": "Kyle",
        "line": "[pause] Ih ih ih-t's g-gay?"
    },
    {
        "character": "Tom",
        "line": "Uh huh, and what aspect of it do you think is most gay?"
    },
    {
        "character": "Kyle",
        "line": "[looks at his sign] Uuuh, n-no blood for oil."
    },
    {
        "character": "Stan",
        "line": "Yeah. [the mic moves back to him as he looks at his sign] War is not my voice."
    },
    {
        "character": "Cartman",
        "line": "[reading Kenny's sign] Bush is a Naizi"
    },
    {
        "character": "Skeeter",
        "line": "[arrives with a crowd] Hey all you un-American bastards! If you don't like America, why don't you git out?! [moves his right thumb in front of his shoulder and to his right. With him are Jimbo, Ned, Stuart, and Craig's father Tom]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Don't you call us un-American! This country was founded on the right to protest! M'kay?"
    },
    {
        "character": "Protesters",
        "line": "Yeah! Right!"
    },
    {
        "character": "Stuart",
        "line": "If the Founding Fathers saw you burning your flag an' callin' the President a Nazi, they'd roll over in their grave!"
    },
    {
        "character": "Supporters",
        "line": "Yeah! Right!"
    },
    {
        "character": "Randy",
        "line": "The Founding Fathers would agree with our right to protest!"
    },
    {
        "character": "Skeeter",
        "line": "Foundin' Fathers would kick all your asses!"
    },
    {
        "character": "Tom",
        "line": "Boys, what do you think the Founding Fathers would say?"
    },
    {
        "character": "Cartman",
        "line": "...Eh the... Foggy who? [seconds later, both sides rush each other and attack]"
    },
    {
        "character": "",
        "line": "South Park Elementary, Garrison's classroom. He stares at the children angrily, his arms crossed."
    },
    {
        "character": "Mr. Garrison",
        "line": "[drops his arm, putting his right hand on his hip] Well, I hope you little Commies are pretty pleased with yourselves! [crosses his arms again] Going out there and protesting America, and then saying on national television that you don't even know who the Founding Fathers are! You kids don't know squat about America, do you?!"
    },
    {
        "character": "Butters",
        "line": "Mmuh well, not really, no."
    },
    {
        "character": "Mr. Garrison",
        "line": "Well that's just jingles! Because I'm assigning all you little flag-burners a full report on seventeen seventy-siyix, and the Founding Fathers!"
    },
    {
        "character": "Class",
        "line": "Awwwwww!"
    },
    {
        "character": "Mr. Garrison",
        "line": "SHUT UP! I want you all in your study groups of four, and if you can't give an outstanding report on what the Founding Fathers would have to say about all this protesting, then it's Fs for you! [walks off]"
    },
    {
        "character": "",
        "line": "South Park Elementary, Garrison's classroom, moments later. The class has separated in groups of four and five. Group 1: Jimmy, Red, Clyde, Bebe, Wendy. Group 2: Butters, Jordan, Kevin, Tolkien. Group 3: Cartman, Kenny, Stan, Kyle. Group 4: Tweek, Pip, blond boy, Craig, another boy. All are studying quietly. Camera angle moves from the front of the room to the side of the room opposite the door."
    },
    {
        "character": "Cartman",
        "line": "[beginning to slack off] Ugh. Ughuh. [tries to resume studying, but his eyes grow heavy. He panics] I can't do it! This is waaay too much material for a nine-year-old! [yawns loudly and promptly sleeps on his book]"
    },
    {
        "character": "Kyle",
        "line": "[smacks Cartman] Oh no you don't, Cartman! Every time we get put in a study group, you sit on your ass while the rest of us do all the work!"
    },
    {
        "character": "Cartman",
        "line": "But you guys are such better studiers than me. I know you can pull it off."
    },
    {
        "character": "Stan",
        "line": "[pointing] You're gonna read this stuff and study like the rest of us!"
    },
    {
        "character": "Cartman",
        "line": "Maaaa. M-maaaa."
    },
    {
        "character": "Kyle",
        "line": "[annoyed] SHUT UP AND STUDY!"
    },
    {
        "character": "Cartman",
        "line": "Maaaa. Mah mah mh. [reluctantly returns to reading. He begins to fidget, then reads more, then fidgets again, turns the page, fidgets once more, then just thinks] Hmmm, 1776. When our Founding Fathers created America. I wonder what it used to be like in those days? [repeats the question, his voice fading at each repetition] In those days? In those days? In those days?"
    },
    {
        "character": "Kyle",
        "line": "[noticing] What are you doing?"
    },
    {
        "character": "Cartman",
        "line": "I'm trying to have a flashback."
    },
    {
        "character": "Kenny",
        "line": "(A what?)"
    },
    {
        "character": "Cartman",
        "line": "You know. If I have a flashback, then I can see what 1776 was like first-hand!"
    },
    {
        "character": "Stan",
        "line": "No, you just have to study."
    },
    {
        "character": "Cartman",
        "line": "No. I've seen this work before. Just give me a second. [thinks] Oh okay, okay. How about this: Say guys, 1776 was so long ago. I wonder what life would have been like back then? [repeats the last two words, his voice fading at each repetition] Back then? Back then? Back then? [nothing happens. Stan, Kyle, and Kenny look at him] Um... Oh waitwait, I know, I know! Heheh, you know guys, I don't even care about 1776. It was so long ago, that I don't think it has anything to do with me. [his voice begins to fade and he begins moving his hands around like a pantomime. The camera closes in] With me. With... anything to do with me. With me."
    },
    {
        "character": "Kyle",
        "line": "That isn't gonna work, dumbass!"
    },
    {
        "character": "Mr. Slave",
        "line": "Kids, let's keep it down for study group, or else Mr. Garrison is going to punish me."
    },
    {
        "character": "Stan",
        "line": "[from behind his book] Just face it, Cartman. You're gonna have to study!"
    },
    {
        "character": "Cartman",
        "line": "[throws a fit] Maaaaa. Meh mameh, Maaaaa!"
    },
    {
        "character": "",
        "line": "South Park Avenue. The opposing groups face each other in front of the tallest building in town. Skeeter paints a line across the span of the street and looks up."
    },
    {
        "character": "Skeeter",
        "line": "There! All finished. From now on, this is the pro-war side of town, and that's the unpatriotic side. [the war supporters begin to clamor]"
    },
    {
        "character": "Randy",
        "line": "How about we call this the rational side of town, and that the redneck side?!"
    },
    {
        "character": "Protesters",
        "line": "Hahahaha, yeah."
    },
    {
        "character": "Jimbo",
        "line": "You just keep all your flag burnin' and your hippie-rock protest songs on YOUR side of the town!"
    },
    {
        "character": "Protester",
        "line": "Hey wait a minute, your side of town has the post office."
    },
    {
        "character": "Stuart",
        "line": "Well your side has the grocery store."
    },
    {
        "character": "Jimbo",
        "line": "Well you can come to our side of town to use the post office and we can go to your side to use the grocery store."
    },
    {
        "character": "Gerald",
        "line": "Aaah, can we cross the line to take our kids to school?"
    },
    {
        "character": "Jimbo",
        "line": "W-hell, naturally you could cross the line for that. Just like ...we could cross the line for hardware, supplies, gas, and pharmaceutical needs."
    },
    {
        "character": "Townsfolk",
        "line": "Yup, yes sir, yeah, right, uh huh."
    },
    {
        "character": "Skeeter",
        "line": "Hey everybody, this is never going to work. Don't you see? All this dividin' up the town, it's just ridiculous. What we really should be doing, is just beatin' the hell out of each other like we were."
    },
    {
        "character": "Randy",
        "line": "He's right. [looks at Sheila] Boy, do I feel like a fool. [moments later, both sides attack each other again. Among the skirmishes: Kenny's mom attacks Gerald, Sheila attacks Ned]"
    },
    {
        "character": "",
        "line": "Cartman's house, upstairs. The boys walk down the hallway and reach Cartman's room. He's rigged up a way to ... knock himself out. Three pulley wheels and a nail guide a string tied to the door across the entrance, up the wall, and back to the top of the door entrance. At the other end of the string is a big rock."
    },
    {
        "character": "Kyle",
        "line": "Cartman, what the hell are you doing?! You're supposed to be studying! [the boys stop at the entrance to Cartman's room]"
    },
    {
        "character": "Cartman",
        "line": "That's what I'm doing. I'm about to find out all about what happened back in 1776. [tests the tautness of the string]"
    },
    {
        "character": "Stan",
        "line": "How?!"
    },
    {
        "character": "Cartman",
        "line": "All I have to do is be thinking about American history when I walk through this doorway. I'll trip the rope, causing the rock to fall on my head. And then I will have a flashback to the times of our Founding Fathers!"
    },
    {
        "character": "Kyle",
        "line": "Cartman, you are hereby declared a full-fledged retard!"
    },
    {
        "character": "Cartman",
        "line": "Haha, make fun of me all you want, Kyle! But I will have the last laugh. Gentlemen, if you will clear the doorway, please? [Stan and Kyle look at each other, Kenny looks at them. They clear the doorway. Kyle stands on one side, Stan and Kenny on the other. Cartman backs up, clears his throat, then begins to walk with purpose] Oh Gee. I wonder what it used to be like in the year 1776. [trips the string. The rock immediately falls on his head, knocking him out. He moans a few times.]"
    },
    {
        "character": "Kyle",
        "line": "Cartman? Cartman?? [the boys gather around Cartman. Kyle turns him over.]"
    },
    {
        "character": "Cartman",
        "line": "Benjamin Franklin?"
    },
    {
        "character": "Kyle",
        "line": "No, turdpants, it's Kyle!"
    },
    {
        "character": "Cartman",
        "line": "[touches Kyle, then in a weak raspy voice] Kyle! Get out of my flashback, you God-damned Jew!"
    },
    {
        "character": "",
        "line": "City Hall, day. Both sides of the war issue are in the office."
    },
    {
        "character": "Townsfolk",
        "line": "Rabble! Rabble! Rabble! Rabble! Rabble! Rabble! Rabble! Rabble! Rabble!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Okay, people. What are we rambling about now?"
    },
    {
        "character": "Randy",
        "line": "[steps forward] Mayor, our peace rally has always been set for this Saturday! Now, these pro-war bastards are suddenly trying to say they get the town square."
    },
    {
        "character": "Skeeter",
        "line": "[steps forward, past a few war supporters] That's bullcrap, Mayor! Our rally to support the war was set up months ago!"
    },
    {
        "character": "Gerald",
        "line": "There was no war months ago!"
    },
    {
        "character": "Skeeter",
        "line": "Hey, if you don't like America, then you can git out!"
    },
    {
        "character": "Randy",
        "line": "Look, nobody wants to hear a bunch of twangy country music propaganda!"
    },
    {
        "character": "Stuart",
        "line": "Well nobody wants to hear a bunch o' rock protest songs! [both side begin to clamor again]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Well up yours, rednecks!"
    },
    {
        "character": "Townsfolk",
        "line": "Rabble! Rabble! Rabble! Rabble! Rabble! Rabble! Rabble! Rabble! Rabble!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Quiet people! The town square is public space. That means if neither group will nicely and maturely move the day of its rally, I'll just have to give the town square to both groups."
    },
    {
        "character": "Jimbo",
        "line": "All right, that's fine! Because our war support songs will be a thousand times better!"
    },
    {
        "character": "Randy",
        "line": "Oh, you think so? Bring the shizzle!"
    },
    {
        "character": "Skeeter",
        "line": "We'll trizzle the shizzle all over the hizzle!"
    },
    {
        "character": "Gerald",
        "line": "Yeah?! See you Saturday, makizzer shanna sharilla shaz biuznatch gazizzah!"
    },
    {
        "character": "",
        "line": "Cartman's house, night. The front door opens and in walk the boys."
    },
    {
        "character": "Stan",
        "line": "Cartman?"
    },
    {
        "character": "Kyle",
        "line": "Cartman? You'd better be studying, God-damnit! [there's debris all over the living room. The boys arrive at Cartman hanging from a candy-cane colored swing set with the swings removed. Beneath him is a tub of water. Cartman has it rigged so that he pulls a string, which releases him and at the same time triggers a sledgehammer, which hits a box, which is supposed to land in the tub with him.]"
    },
    {
        "character": "Cartman",
        "line": "Ah, Stan, Kyle, Kenny, you're just in time."
    },
    {
        "character": "Stan",
        "line": "Oh no..."
    },
    {
        "character": "Cartman",
        "line": "Oh yes! I am just about to flash back to the days of our Founding Fathers!"
    },
    {
        "character": "Kyle",
        "line": "Cartman, you're supposed to be studying! What the hell is all this?!"
    },
    {
        "character": "Cartman",
        "line": "I have programmed TiVo to record over fifty hours of the History channel. When TiVo is full, both TiVo and I will be dropped into the water, combining our electrowhatever fields and sending me into a flashback of history!"
    },
    {
        "character": "Stan",
        "line": "Uh Cartman, I think that's a really bad idea."
    },
    {
        "character": "Cartman",
        "line": "Or a really sweet one. [a bell is heard]"
    },
    {
        "character": "TV OH",
        "line": "Your Tivo is full."
    },
    {
        "character": "Cartman",
        "line": "Whoa, here it goes! [triggers the sledgehammer as he falls. Both he and the TiVo land in the tub, and the house shorts out. Cartman is electrocuted as he lands in the water. The boys spend a few seconds in the darkness looking at Cartman, wondering if he'll come to. Kenny turns and walks away slowly]"
    },
    {
        "character": "Kyle",
        "line": "Cartman? [no response] Cartman??"
    },
    {
        "character": "Stan",
        "line": "Aww crap."
    },
    {
        "character": "",
        "line": "The flashback. Cartman is seen in period dress, face down on a dirt road. He comes to, looks up, sits up and looks around, then notices his clothes. He quickly rises and looks at Philadelphia in the distance."
    },
    {
        "character": "Cartman",
        "line": "Ohhh awesome!!! [a horse-drawn carriage approaches, driven by a teenage boy.]"
    },
    {
        "character": "Official messenger boy",
        "line": "Worthy young lad, are you all right?"
    },
    {
        "character": "Cartman",
        "line": "Yeah yeah. Can you tell me what year it is?"
    },
    {
        "character": "Official messenger boy",
        "line": "This year? Why it's 1776, it is."
    },
    {
        "character": "Cartman",
        "line": "Oho yes! I did it I did it!"
    },
    {
        "character": "Official messenger boy",
        "line": "Would you like a ride into town? I'm on my way to Master Thomas Jefferson's house to get a very important document, I am."
    },
    {
        "character": "Cartman",
        "line": "Oho kick fucking ass, dude! [approaches the carriage and climbs up to sit alongside the driver]"
    },
    {
        "character": "Official messenger boy",
        "line": "Never seen you around here, friend. Might you be from up North?"
    },
    {
        "character": "Cartman",
        "line": "No, I'm not from here at all. I'm having a flashback."
    },
    {
        "character": "Official messenger boy",
        "line": "A flashback? Why, what is that?"
    },
    {
        "character": "Cartman",
        "line": "Well you know, it's a... [points at something] H-ho, awesome! [they've entered the town and Cartman begins to sing.]\nLook at me, I'm back in time, in 1776.\nWith gaslight corners, cobblestone streets, and humble houses made of bricks.\nWhat a special magic time, and it's all alive for me\nI'm so glad Stan and Kyle aren't here. I hate those guys, seriously.\nSeriously hate those guys. Hate Stan and Kyle.\n\n\n"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, day, Cartman's recovery room. Cartman's mom sits by his bed as Stan and Kyle look on. Dr. Doctor enters."
    },
    {
        "character": "Liane",
        "line": "[jumps up worried] Is he going to be all right, doctor??"
    },
    {
        "character": "Dr. Doctor",
        "line": "Your son tried to kill himself in a ritualistic fashion I've never seen before. His chances of surviving are very slim. I'm so sorry."
    },
    {
        "character": "Liane",
        "line": "[quickly returns to embrace him, with emotion in her voice.] Oh baby baby, you can't die."
    },
    {
        "character": "Kyle",
        "line": "Yeah. We have a report to do, asshole! Get up! Get up!! [shakes him hard]"
    },
    {
        "character": "Liane",
        "line": "Whoa. Easy, Kyle."
    },
    {
        "character": "Kyle",
        "line": "But it's not fair! We have to do a full report on the Founding Fathers, and Cartman got out of helping us again!"
    },
    {
        "character": "Stan",
        "line": "I guess we're just gonna have to do it with the three of us! Come on, guys!"
    },
    {
        "character": "Liane",
        "line": "I know you're in a very dark place now, sweetie. But you must come toward the light! Come toward the light!"
    },
    {
        "character": "",
        "line": "Flashback, night. The driver and Cartman approach Jefferson's house."
    },
    {
        "character": "Official messenger boy",
        "line": "Here we are, then. The current residence of Master Thomas Jefferson."
    },
    {
        "character": "Cartman",
        "line": "Super neato! [both driver and Cartman disboard and walk towards the door]"
    },
    {
        "character": "Official messenger boy",
        "line": "[stops and turns] I'm afraid you'll have to wait here."
    },
    {
        "character": "Cartman",
        "line": "But, I need to talk to the Founding Fathers to do my report."
    },
    {
        "character": "Official messenger boy",
        "line": "Sorry. Only the official messenger boy is allowed to talk to Mister Jefferson"
    },
    {
        "character": "Cartman",
        "line": "Oh, okay.I guess I understand. [the driver walks off. Cartman notices some firewood and picks up a log of it, then follows the driver while singing to himself]\nI don't wanna wait for our life to be over...[he quickly assaults the driver and beats him with the log, then drags the body away and returns to the Jefferson residence, knocking on the door]\nI don't wanna wait for our life to be over...\n\n\n"
    },
    {
        "character": "Jefferson",
        "line": "Hello. I am Thomas Jefferson."
    },
    {
        "character": "Cartman",
        "line": "And I am the official messenger boy, I am."
    },
    {
        "character": "Jefferson",
        "line": "[holding a document] Very well. Take this document to the Continental Congress. [hands it to Cartman]"
    },
    {
        "character": "Cartman",
        "line": "[beholding it] Wow, the Declaration of Independence Day."
    },
    {
        "character": "Jefferson",
        "line": "Some favor going to war with England and others want to avoid war at all cost."
    },
    {
        "character": "Cartman",
        "line": "It's a bitch, ain't it?"
    },
    {
        "character": "Jefferson",
        "line": "Perhaps this document will make the reasons for war obvious to all. Good luck, young messenger! [Cartman turns and heads for the carriage] Now make haste!"
    },
    {
        "character": "",
        "line": "Stan's house, day. Kyle, Stan, and Kenny study at the coffee table in the living room."
    },
    {
        "character": "Stan",
        "line": "Okay, so Thomas Jefferson wrote the Declaration of Independence, then the Continental Congress-"
    },
    {
        "character": "Protesters",
        "line": "[first heard, then seen as they enter from screen left] No war! No war! No war!"
    },
    {
        "character": "Kyle",
        "line": "Oh, Jesus..."
    },
    {
        "character": "Randy",
        "line": "Uh, boys, would you mind clearing the living room. We have to practice our big war protest song."
    },
    {
        "character": "Stan",
        "line": "Dad, we have to study. Mr. Garrison is making us do a presentation on what the Founding Fathers would say about the war."
    },
    {
        "character": "Mr. Mackey",
        "line": "Hey... That's a terrific idea!"
    },
    {
        "character": "Gerald",
        "line": "Yeah! We could have the boys do their presentation as part of our peace rally on Saturday!"
    },
    {
        "character": "Stan",
        "line": "Oh, no, nononono."
    },
    {
        "character": "Supporters",
        "line": "[first heard, then they enter through the front door] Support our troops! Support our troops! Support our troops!"
    },
    {
        "character": "Skeeter",
        "line": "See? I told you they had your son."
    },
    {
        "character": "Stuart",
        "line": "Kenny. What are you doing over here with all these un-American traitors?!"
    },
    {
        "character": "Kenny",
        "line": "(I'm doing my homework.)"
    },
    {
        "character": "Randy",
        "line": "The boys are going to give a presentation at our rally about how the Founding Fathers would agree with our right to protest! [the war supporters clamor against Randy]"
    },
    {
        "character": "Stan",
        "line": "Actually, we hadn't really come to a decision-"
    },
    {
        "character": "Stuart",
        "line": "Look! My son is a patriot and LOVES his country! [grabs Kenny's jacket] Come on, Kenny!"
    },
    {
        "character": "Kenny",
        "line": "(But Dad, I-)"
    },
    {
        "character": "Stuart",
        "line": "NOW!"
    },
    {
        "character": "Skeeter",
        "line": "Yeah!"
    },
    {
        "character": "Supporters",
        "line": "Support our troops! Support our troops! Support our troops! Support our troops! [they walk out the front door. Kenny follows his dad out. Stan follows him ]"
    },
    {
        "character": "Stan",
        "line": "[stops at the open door] Kenny, no- ohhh! Awww. [turns around and returns to the table] Awww, now we lost two in our study group!"
    },
    {
        "character": "Kyle",
        "line": "[shoves his book off the table] God damnit!"
    },
    {
        "character": "Randy",
        "line": "Can you believe those hick sons of bitches? Manipulating those kids to be on their side."
    },
    {
        "character": "Gerald",
        "line": "Disgraceful! Stan and Kyle, it's up to you to show all those war-mongerers that the Founding Fathers agree with us!"
    },
    {
        "character": "Protester 1",
        "line": "Yeah, that's right!"
    },
    {
        "character": "Protester 2",
        "line": "Come on, guys!"
    },
    {
        "character": "Protester 3",
        "line": "Get back to work!"
    },
    {
        "character": "Kyle",
        "line": "Do you think kids in every town have to deal with this crap?"
    },
    {
        "character": "",
        "line": "Philadelphia, day. Independence Hall is shown. Cartman enters and finds the Congress room. The doors open before him."
    },
    {
        "character": "A voice",
        "line": "Enter, young messenger. [Cartman enters the room, awed by the people he sees around him, and approaches the main desk. He hands the document to the man waiting there] I am John Hancock, President of the Congress."
    },
    {
        "character": "Cartman",
        "line": "Wow."
    },
    {
        "character": "Hancock",
        "line": "Mr. John Adams?"
    },
    {
        "character": "Adams",
        "line": "Aye. [rises and approaches the table]"
    },
    {
        "character": "Hancock",
        "line": "Will you do the honors of reading the document to Congress, please? [Cartman takes an empty chair nearby]"
    },
    {
        "character": "Adams",
        "line": "[reading from the Declaration] WHEN in the Course of human Events, it becomes necessary for one Penis to rise up- [cut to the end of the Declaration] -we mutually pledge to each other our Lives, our Fortunes, and our sacred Honor.P.S. - Every Thursday should be Free Ice Cream Day. [rolls up the Declaration. Cartman looks around]"
    },
    {
        "character": "A Congressman",
        "line": "Excuse me, but does this Declaration actually suggest that we should go to go war with England?"
    },
    {
        "character": "Adams",
        "line": "We have no choice, Mr. Dickinson. [chatter erupts]"
    },
    {
        "character": "",
        "line": "South Park, day. The town square stage. On stage are decorations for the two sides. On the left is a large peace sign on a green curtain surrounded by peace signs and protest signs, on the right is a large eagle surrounded by yellow ribbons. Both groups are on stage."
    },
    {
        "character": "Mr. Mackey",
        "line": "All right everyone, thank you all for comin' out to protest the war, m'kay? [people within the crowd clap. Randy comes out dressed in an Elvis outfit]."
    },
    {
        "character": "Skeeter",
        "line": "Don't kid yourselves. These people have come out to support our troops, right?! [raises a fist. Other people within the crowd clap]"
    },
    {
        "character": "Mr. Mackey",
        "line": "And now, Randy Marsh is gonna sing a protest song he wrote about the war."
    },
    {
        "character": "Skeeter",
        "line": "Oh no you don't! We're doing our pro-war song first!"
    },
    {
        "character": "Jimbo",
        "line": "Yeah! The last thing these people want is a bleedin'-heart rock protest song!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "[intervenes] People, I told you, you have to share the stage."
    },
    {
        "character": "Randy",
        "line": "Nobody wants to here another pro-war country song!"
    },
    {
        "character": "Skeeter",
        "line": "Well excuse me if... I'm a little bit country."
    },
    {
        "character": "Randy",
        "line": "Well I'm a little bit rock-n-roll-AH!"
    },
    {
        "character": "Skeeter",
        "line": "I'm a little for supportin' our troops."
    },
    {
        "character": "Randy",
        "line": "And I'm a little for bringin' 'em home."
    },
    {
        "character": "Skeeter",
        "line": "I believe freedom isn't free."
    },
    {
        "character": "Randy",
        "line": "No, but war shouldn't be our goal."
    },
    {
        "character": "Skeeter",
        "line": "We must defend our country."
    },
    {
        "character": "Randy",
        "line": "If it means war, then we say NO!"
    },
    {
        "character": "Somebody",
        "line": "Yeehaw!"
    },
    {
        "character": "Skeeter",
        "line": "[walks to the edge of the stage in front of the war support crowd, then sits on the edge]\nDid you forget them towers in New York?\nDid you forget how it made you feel\nTo see them towers come down?\nWere you like me? Did you think it weren't real?\n\n\n"
    },
    {
        "character": "Randy",
        "line": "I like to rock, but I don't wanna rock Iraq!\nThe only kind of rockin' America should do, is the kind that we can all dance to, yeah!\n\n\n"
    },
    {
        "character": "Skeeter",
        "line": "We got GPS, ICBMs, and good old-fashioned lead.\nWe're gonna show Saddam what America means; that son of a bitch'll be dead.\n\n\n"
    },
    {
        "character": "Randy",
        "line": "Why are we fightin' this war?\nThere's a man in the office we didn't vote for.\nThey didn't give me a choice.\nWar is not my voice! Yeaaaaahhhh!\n\n\n"
    },
    {
        "character": "",
        "line": "Philadelphia, day, Independence Hall. There's plenty of argument going on."
    },
    {
        "character": "Adams",
        "line": "We must go to war!"
    },
    {
        "character": "Dickinson",
        "line": "But what about the violence?! The lives lost?! If we found a country, it should be founded on peace and diplomacy."
    },
    {
        "character": "Congressman 1",
        "line": "England will only understand one thing: Force."
    },
    {
        "character": "Congressman 2",
        "line": "[rises] I must state again for the record that South Carolina, North Carolina, Pennsylvania, Maryland, and Georgia are against war! [pounds the table with his fist]"
    },
    {
        "character": "Congressman 3",
        "line": "Yeah, because you don't care about the fate of the Colonies like we do! You're all unpatriotic! And if you don't like the Colonies, then you can get out!"
    },
    {
        "character": "Dickinson",
        "line": "Don't you call us unpatriotic! We're protesting this war because we care so deeply for the fate of our Colonies! You are all unpatriotic for leading the Colonies into a war that half of them don't want! [the various Congressmen begin babbling with each other]"
    },
    {
        "character": "Cartman",
        "line": "[observing] Whoa, how very very relevant."
    },
    {
        "character": "",
        "line": "South Park, day, town square. The rally is still going on, and a reporter files the following report."
    },
    {
        "character": "Tom",
        "line": "Tom, I'm standing in the town square where the war rally has been going on for an incredible eighty-seven hours. The crowd still appears to be split right down the middle - half of them support country music, and the other half rock-n-roll. Let's listen in."
    },
    {
        "character": "Mr. Mackey",
        "line": "And now we'd like to bring out a couple of very special South Park students who did a report on what the Founding Fathers would have to say about the war. [Stan walks up to the mic, watching the crowd on the way there. Kyle follows. The crowd claps appreciatively]"
    },
    {
        "character": "Protesters",
        "line": "Booooo!!"
    },
    {
        "character": "Randy",
        "line": "[steps up] For you people who still think war is the answer, perhaps you can listen to the voices ... of the children. [shows them off and backs out of the scene. The crowd applauds and quiets down]"
    },
    {
        "character": "Stan",
        "line": "Uh, we didn't do it."
    },
    {
        "character": "Mr. Mackey",
        "line": "What?"
    },
    {
        "character": "Kyle",
        "line": "We didn't do our homework."
    },
    {
        "character": "Sharon",
        "line": "Boys! You were supposed to come out here and tell everyone about the Founding Fathers!"
    },
    {
        "character": "Stan",
        "line": "Well, first we lost one study partner when Cartman put himself in the hospital, and then they took Kenny away, and then Kyle forgot to set his clock ahead for Daylight Savings and we couldn't find anything in the history books about Iraq and then-"
    },
    {
        "character": "Skeeter",
        "line": "That's because the Founding Fathers would have supported the war!"
    },
    {
        "character": "Mr. Mackey",
        "line": "The Founding Fathers would have protested like us!"
    },
    {
        "character": "Supporters",
        "line": "Support!"
    },
    {
        "character": "Protesters",
        "line": "Protest!"
    },
    {
        "character": "Supporters",
        "line": "Country!"
    },
    {
        "character": "Protesters",
        "line": "Rock-n-roll!"
    },
    {
        "character": "",
        "line": "The two sides charge at each other on stage, then off stage. They attack each other with their signs. One man drives his \"War is not my voice\" sign straight down into another man's head. A man drives his \"Bush is a Nazi\" sign up a woman's nose after she swats him with her \"Support Your Troops\" sign. A woman strikes someone else down with her \"No Blood for Oil\" sign. Stan and Kyle just look on."
    },
    {
        "character": "",
        "line": "Philadelphia, day, Independence Hall. There's plenty of argument still going on."
    },
    {
        "character": "Congressmen",
        "line": "Rabble Rabble Rabble Rabble Rabble Rabble Rabble Rabble Rabble Rabble Rabble Rabble!"
    },
    {
        "character": "Dickinson",
        "line": "We cannot found a country based on war!"
    },
    {
        "character": "Adams",
        "line": "We cannot found a country that is afraid to fight!"
    },
    {
        "character": "Congressman",
        "line": "Rabble!"
    },
    {
        "character": "Congressmen",
        "line": "Rabble Rabble Rabble Rabble Rabble Rabble Rabble! [the doors open and in walks an august figure. The boisterous voices become hushed] Oh my, it's Benjamin Franklin. It's Benjamin Franklin. It's Benjamin Franklin. [they keep murmuring this as Franklin walks towards the main desk]"
    },
    {
        "character": "Cartman",
        "line": "Oh, it's Benjamin Franklin. It's Benjamin Franklin. It's Benjamin Franklin."
    },
    {
        "character": "Hancock",
        "line": "Mr. Franklin, where do you stand on the war issue?"
    },
    {
        "character": "Franklin",
        "line": "I believe that if we are to form a new country, we cannot be a country that appears war-hungry and violent to the rest of the world. However, we also cannot be a country that appears weak and unwilling to fight to the rest of the world. So, what if we form a country that appears to want both?"
    },
    {
        "character": "Jefferson",
        "line": "Yes. Yes of course. We go to war, and protest going to war at the same time."
    },
    {
        "character": "Dickinson",
        "line": "Right. If the people of our new country are allowed to do whatever they wish, then some will support the war and some will protest it."
    },
    {
        "character": "Franklin",
        "line": "And that means that as a nation, we could go to war with whomever we wished, but at the same time, act like we didn't want to. If we allow the people to protest what the government does, then the country will be forever blameless."
    },
    {
        "character": "Adams",
        "line": "[holding a slice of chocolate cake] It's like having your cake, and eating it, too."
    },
    {
        "character": "Congressman 2",
        "line": "Think of it: an entire nation founded on saying one thing and doing another."
    },
    {
        "character": "Hancock",
        "line": "And we will call that country the United States of America."
    },
    {
        "character": "Cartman",
        "line": "Wow, I get it now! I get it! [senses his flashback coming to an end] Whoa, here it goes. I wish I could go back to my time. To my time, to, to my time."
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, day, Cartman's room. Cartman comes to and looks around."
    },
    {
        "character": "Cartman",
        "line": "Wow!"
    },
    {
        "character": "",
        "line": "South Park, town square. The townsfolk are still attacking each other and killing more of their number. One man kills another with a \"PEACE NOW\" sign. A war supporter runs a flag pole through a protester, then pulls it back out again. Stan, Kyle, and Kenny watch from the other end of the square, towards the stage as the carnage continues."
    },
    {
        "character": "Cartman",
        "line": "[appears on stage in his hospital gown, his hair disheveled] Everyone, stop! Please! [everyone stops and looks at him]"
    },
    {
        "character": "Townsman",
        "line": "The-the child! The child, from the hospital."
    },
    {
        "character": "Cartman",
        "line": "If you all don't mind, I would like to do my report now. I know what the founding fathers would say."
    },
    {
        "character": "Stan",
        "line": "He does? [he and Kyle are shocked]"
    },
    {
        "character": "Kyle",
        "line": "He does?"
    },
    {
        "character": "Cartman",
        "line": "I learned somethin' today. This country was founded by some of the smartest thinkers the world has ever seen. And they knew one thing: that a truly great country can go to war, and at the same time, act like it doesn't want to. [a shot of the crowd] "
    },
    {
        "character": "Cartman",
        "line": "You people who are for the war, you need the protesters. Because they make the country look like it's made of sane, caring individuals. And you people who are anti-war, you need these flag-wavers, because, if our whole country was made up of nothing but soft pussy protesters, we'd get taken down in a second. That's why the founding fathers decided we should have both. It's called \"having your cake and eating it too.\""
    },
    {
        "character": "Randy",
        "line": "He's right. The strength of this country is the ability to do one thing and say another."
    },
    {
        "character": "Skeeter",
        "line": "Yeah, but... if it weren't for all you guys protesting, why everyone around the world would hate the American people instead of just the President."
    },
    {
        "character": "Gerald",
        "line": "And if it weren't for you people flexing your arms, America could easily get taken over by terrorists or... or China."
    },
    {
        "character": "Mr. Mackey",
        "line": "I guess we... owe you an apology."
    },
    {
        "character": "Stuart",
        "line": "Eh-ah, I guess we owe you one."
    },
    {
        "character": "Townsfolk",
        "line": "Awww. [amid a chorus of awwws they hug each other.]"
    },
    {
        "character": "Kyle",
        "line": "Cartman? Cartman saved the day?"
    },
    {
        "character": "Stan",
        "line": "Can't be"
    },
    {
        "character": "Cartman",
        "line": "The Founding Fathers want you all to know that we can disagree all we want, as long as we agree that America kicks ass."
    },
    {
        "character": "Skeeter",
        "line": "Hey I'm a little bit country"
    },
    {
        "character": "Randy",
        "line": "And I'm a little bit rock-n-roll-AH!"
    },
    {
        "character": "",
        "line": "Cartman takes his mic and backs out of the scene, leaving Randy and Skeeter to sing together."
    },
    {
        "character": "Skeeter",
        "line": "I'll be the muscle of America"
    },
    {
        "character": "Randy",
        "line": "And me, I'll be the caring soul."
    },
    {
        "character": "Together",
        "line": "And when you put us together you get a nation with one goal\nTo thrive and prosper, with a little country and rock and roll.\n\n\n"
    },
    {
        "character": "Skeeter",
        "line": "Come on up here, everybody! [the crowd surges onto the stage. Stan and Kyle look dumbfounded]"
    },
    {
        "character": "Everybody",
        "line": "We're a little bit country, and we're a little bit rock-n-roll"
    },
    {
        "character": "Stuart",
        "line": "We can be a nation that believes in war."
    },
    {
        "character": "Mr. Mackey",
        "line": "And still tells the world that we don't.[moments later the back of the stage begins to rise, revealing guests from many previous episodes]\n\n"
    },
    {
        "character": "Everybody",
        "line": "Let the flag for hypocrisy fly high from every pole\nCuz we're a little bit country, and we're a little bit rock-n-roll.\n\n\n"
    },
    {
        "character": "Randy",
        "line": "Well, goodnight everybody. It sure has been great bringing you a hundred episodes."
    },
    {
        "character": "Skeeter",
        "line": "We want to thank our guests, the pro-war people. [shown, including Halfy. Some applause is heard] And the anti-war people. [shown. Some applause is heard]"
    },
    {
        "character": "Stan",
        "line": "What the hell are they doing now?"
    },
    {
        "character": "Kyle",
        "line": "[covers his nose and shuts his eyes tight] I-I don't know."
    },
    {
        "character": "Everybody",
        "line": "For the war, against, the war, WHO CARES?? One hundred episodes!"
    },
    {
        "character": "",
        "line": "Randy and Skeeter perform some nifty footwork as they finish the song."
    },
    {
        "character": "Kyle",
        "line": "I hate this town. I-I really really do."
    }
]