[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park neighborhood, day. The boys walk up to Butters' house. Stan knocks on the door. The door opens and Butters' father looks out."
    },
    {
        "character": "Chris",
        "line": "Yes? [looks down] Oh, hello, boys."
    },
    {
        "character": "Cartman",
        "line": "Hello, sir. South Park Junior Detectives. We're wondering if you have any crimes to be solved, for a dollar."
    },
    {
        "character": "Chris",
        "line": "Oooo, little crime stoppers, huh? Well, I'm afraid I don't have any crimes I need solved right now."
    },
    {
        "character": "Kyle",
        "line": "Awww, shit!"
    },
    {
        "character": "Stan",
        "line": "All right, sir, well, please call us if you need anything. [offers up a business card]"
    },
    {
        "character": "Chris",
        "line": "I'll do that. Have fun, boys. [steps back and closes the door. The boys turn and walk away]"
    },
    {
        "character": "Cartman",
        "line": "Stupid assholes! [turns and follows] How come nobody has a crime to solve?"
    },
    {
        "character": "Kyle",
        "line": "Yeah, maybe starting a detective club isn't such a great idea."
    },
    {
        "character": "Stan",
        "line": "It's a great idea, we just have to keep working at it. [moments later they reach a pink house and Stan knocks again. The door opens and an elderly woman looks out]"
    },
    {
        "character": "Mrs. Farnickle",
        "line": "Oh, hello there boys."
    },
    {
        "character": "Stan",
        "line": "Hello, ma'am, we're detectives with the South Park Crime Unit. Do you have any crimes you need solved, for a dollar?"
    },
    {
        "character": "Mrs. Farnickle",
        "line": "Ohh, neighborhood detectives, huh? Well let me thi-oh yes! There is something!"
    },
    {
        "character": "Kyle",
        "line": "Really?"
    },
    {
        "character": "Mrs. Farnickle",
        "line": "Yes. Two days ago I put a fresh baked cherry pie out on my window sill to cool. [Stan and Kyle look over at the window] And later, when I went to get it, it was gone."
    },
    {
        "character": "Cartman",
        "line": "My God..."
    },
    {
        "character": "Stan",
        "line": "Have you reported this to any other authorities?"
    },
    {
        "character": "Mrs. Farnickle",
        "line": "Noo, but I think it's a perfect case for you kids."
    },
    {
        "character": "Kyle",
        "line": "Cool! We'll see what we can find, ma'am."
    },
    {
        "character": "Stan",
        "line": "We're on the case."
    },
    {
        "character": "",
        "line": "Mrs. Farnickle's house, backyard."
    },
    {
        "character": "Cartman",
        "line": "What have you got, Marsh?"
    },
    {
        "character": "Stan",
        "line": "Detective McCormick found something interesting. [a shot of Kenny, who just raises his arm and point to his right. The camera pans to Duke, the house pet, licking off the last of the pie]"
    },
    {
        "character": "Cartman",
        "line": "[puts a hand on Kyle, looks away and closes his eyes] Jesus, we're too late."
    },
    {
        "character": "Kyle",
        "line": "I think we can piece this case together now."
    },
    {
        "character": "",
        "line": "Mrs. Farnickle's house, living room. She and her husband sit back in arm chairs looking at news. The door opens and the boys rush in with the pie tin."
    },
    {
        "character": "Mrs. Farnickle",
        "line": "My pie tin! Oooh, but what happened to the pie?"
    },
    {
        "character": "Kyle",
        "line": "Well, we've all talked it through and we've come up with a theory."
    },
    {
        "character": "Mr. Farnickle",
        "line": "Well, what do you think happened, little detectives?"
    },
    {
        "character": "Stan",
        "line": "You said you set the pie in the window sill, where it must have sat for some time. [the scenario shows Mrs. Farnickle setting the pie on the sill, closing the windows and walking away] But its sweet smell attracted the attention of somebody. [Mr. Farnickle shows up at the kitchen window, looking at the pie from inside the kitchen]"
    },
    {
        "character": "Kyle",
        "line": "Your husband. [he looks closer at it, putting his hands on the window] He wanted that pie badly, but he knew that he was not allowed to eat it yet."
    },
    {
        "character": "Cartman",
        "line": "Slowly the rage built inside his mind. [Mr. Farnickle is shown in bed, getting angry. Dramatic lighting enhances the mood] \"Why won't she let me eat that pie? Why does she always stop me from doing what I wanna do?!\" His only solution became obvious: Kill her!"
    },
    {
        "character": "Stan",
        "line": "His plan was to use a hammer."
    },
    {
        "character": "Cartman",
        "line": "Bash, bash, BASH your skull in, causing instant death. [the scenario shows Mr. Farnickle walking up behind his wife as she dusts the TV and whacking her three times, killing her and fracturing her skull]"
    },
    {
        "character": "Stan",
        "line": "Then to make it impossible for police to identify the body, he'd use a shovel to remove your head. [the man plunges the shovel through the woman's neck and cleaves the head from the body. Blood pours out and stains the carpet]"
    },
    {
        "character": "Kyle",
        "line": "Then saw off the arms and legs. [shown in all its graphic glory]"
    },
    {
        "character": "Cartman",
        "line": "The torso he would dump into the lake. [Mr. Farnickle tosses his wife's torso over the side of his boat, then watches as the torso heads for the lake bottom]"
    },
    {
        "character": "Stan",
        "line": "The arms and legs he would dissolve with acid and lye in the bathtub. [the man is shown tossing the second leg into the tub, then stirring the solution so that the leg would sink in and disappear]"
    },
    {
        "character": "Cartman",
        "line": "And then, finally, he'd be able to eat that pie."
    },
    {
        "character": "Kyle",
        "line": "But before he could go through with his entire plan, he discovered that the pie had already been eaten... [a new scenario: the man now has the hammer, but the pie is gone when he checks up on it] ...by your dog. [a shot of Duke eating the pie in his doghouse]"
    },
    {
        "character": "Cartman",
        "line": "Looks like the game is over, old man! [the surprised couple looks at them]"
    },
    {
        "character": "Mrs. Farnickle",
        "line": "Oh my God, what kind of television have you kids been watching??"
    },
    {
        "character": "Stan",
        "line": "Just the news."
    },
    {
        "character": "Mrs. Farnickle",
        "line": "All right, all right, you you boys run along now."
    },
    {
        "character": "Stan",
        "line": "[stays behind] Hey, you owe us a dollar, lady."
    },
    {
        "character": "Mrs. Farnickle",
        "line": "Fine, here, just go! [gives him the dollar, and he joins the others outside]"
    },
    {
        "character": "Stan",
        "line": "Wow, look, you guys! Our first dollar! [shows off a crisp new one-dollar bill]"
    },
    {
        "character": "Kyle",
        "line": "We're in business!"
    },
    {
        "character": "",
        "line": "A basement, some time later. The dollar bill is newly framed and hung on a wall in ... Cartman's basement, which is now the South Park Detectives headquarters. Pictures of suspects are on the wall below the framed dollar, a chalkboard has some instructions listed, and some suspects already interviewed are listed on the wall beneath the stairs. Kyle puts a file away in a filing cabinet as the other boys do other tasks."
    },
    {
        "character": "Cartman",
        "line": "Kenny, you got the f-a-g on that perp in Washington."
    },
    {
        "character": "Liane",
        "line": "Boys, you have a little visitor. [a little girl descends the stairs past Liane]"
    },
    {
        "character": "Girl",
        "line": "Is this the South Park Crime Unit?"
    },
    {
        "character": "The boys",
        "line": "Ah! Oh. [they jump up and leave their tasks to meet their first client]"
    },
    {
        "character": "Stan",
        "line": "Yes it is!"
    },
    {
        "character": "Girl",
        "line": "I lost my dolly."
    },
    {
        "character": "Cartman",
        "line": "[waving his mom off] Thank you, Ms. Secretary, that will be all. [Liane goes upstairs. Cartman looks up] And get us some more cookies and coffee! We're not paying you to sit on your ass!"
    },
    {
        "character": "Kyle",
        "line": "Do you know where your doll is?"
    },
    {
        "character": "Girl",
        "line": "If I knew where it was, it wouldn't be lost."
    },
    {
        "character": "Stan",
        "line": "All right, Sarah, come over here. [everyone moves over to Kenny's desk. Sarah hops up on the witness chair] Now, I want you to describe what the doll looks like to our sketch artist, Kenny."
    },
    {
        "character": "Sarah",
        "line": "[Kenny begins to draw as she talks] She has curly blonde hair. And a wed dress. And a turned-up nose. And a blue bow in her hair."
    },
    {
        "character": "Stan",
        "line": "You got it, Ken? [Kenny finishes and nods]"
    },
    {
        "character": "Kyle",
        "line": "All right, let's see. [Kenny turns the paper around and shows off a crudely-drawn woman with huge, olive-shaped boobs] Dammit Kenny, that's not what she said!"
    },
    {
        "character": "Stan",
        "line": "Put that away, dude! [Kenny walks up to a small bulletin board of KeNnY'S mOST WANtED women, all of which have large boobs]"
    },
    {
        "character": "Cartman",
        "line": "Don't worry, ma'am. We'll find your doll."
    },
    {
        "character": "",
        "line": "Sarah's house, day. The boys swarm into the girl's bedroom and check out all the possibilities."
    },
    {
        "character": "Cartman",
        "line": "No sign of forced entry."
    },
    {
        "character": "Kyle",
        "line": "[at the window] But the window isn't locked."
    },
    {
        "character": "Stan",
        "line": "[turns to address Cartman] Right, so it's possible that the thief sat out in that tree. [the scenario begins. A view into the bedroom from the tree at night] He would have watched Sarah with her doll, possibly while cutting the palms of his hands with a large knife. [a hand appears, then the opposite hand with a knife. The knife cuts the first hand as Sarah drops her doll on the bedroom floor] The pain gave him sick pleasure."
    },
    {
        "character": "Kyle",
        "line": "Disposing of the doll wouldn't be easy. He would have had to have brought a shovel to decapitate it."
    },
    {
        "character": "Cartman",
        "line": "We're going to need semen samples from everything in this room."
    },
    {
        "character": "",
        "line": "As they pause, another group of boys swarm in and start their own investigation."
    },
    {
        "character": "A Boy",
        "line": "All right, let's do this by the books! McDonnell, [one boy steps forward] give me smears of all the places the doll used to be! [goes off to get samples] Mitchell, [another boy steps forward] run a tap on the phone! [goes off to tap the phone]"
    },
    {
        "character": "Stan",
        "line": "[approaches the boy] Hey, kid, what are you doing?"
    },
    {
        "character": "The Boy",
        "line": "Agent Tucker, FBI! And you?"
    },
    {
        "character": "Stan",
        "line": "Detective Marsh. I'm in charge of this investigation!"
    },
    {
        "character": "Tucker",
        "line": "...Not anymore, you're not!"
    },
    {
        "character": "Cartman",
        "line": "Hey, this is our case! You can't come in and take over!"
    },
    {
        "character": "Tucker",
        "line": "Can't we? You guys are playing Detectives. We're playing FBI. That gives us jurisdiction over you!"
    },
    {
        "character": "Stan",
        "line": "Aw crap!"
    },
    {
        "character": "Tucker",
        "line": "I want choppers on the roof ready to go! [one of his friends goes to the window, the other two head out of the room]"
    },
    {
        "character": "Kyle",
        "line": "Dude, we've been working this case since two-thirty!"
    },
    {
        "character": "Tucker",
        "line": "Good. Then you can help us by telling me everything you know."
    },
    {
        "character": "",
        "line": "Sarah's house, afternoon, outside. The boys have been kicked out by the FBI boys and head for the sidewalk."
    },
    {
        "character": "Stan",
        "line": "Son of a bitch stupid FBI!"
    },
    {
        "character": "Cartman",
        "line": "Well, I guess we can go back to playing laundromat."
    },
    {
        "character": "Stan",
        "line": "No! We're not gonna stop playing detectives! We've just gotta find that little girl's doll before those FBI guys do."
    },
    {
        "character": "Kenny",
        "line": "(Yeah!)"
    },
    {
        "character": "Kyle",
        "line": "Yeah, but how?"
    },
    {
        "character": "Stan",
        "line": "We're gonna have to just start bringing in people for questioning."
    },
    {
        "character": "Cartman",
        "line": "Right. I think I know exactly where to start."
    },
    {
        "character": "",
        "line": "Cartman's basement, later. The boys have called Butters in and he's confused, being under the spotlight."
    },
    {
        "character": "Cartman",
        "line": "[thinks hard of how to start the interrogation] Where were you this morning at nine o'clock, Butters?!"
    },
    {
        "character": "Butters",
        "line": "Ah, I was at home."
    },
    {
        "character": "Cartman",
        "line": "Your story is full of holes and I'm gonna beat your ass if you don't start tellin' the truth! [behind him, Stan and Kyle watch from a makeshift booth]"
    },
    {
        "character": "Kenny",
        "line": "[patting Butters' shoulder] (Awww, don't be so mean. Butters is our friend, huh?) [Butters smiles]"
    },
    {
        "character": "Stan",
        "line": "[behind the booth] They've gotten really good at this good-cop bad-cop thing."
    },
    {
        "character": "Cartman",
        "line": "You're going down, Butters! You hear me?!"
    },
    {
        "character": "Kenny",
        "line": "(Aw, now don't say that. Poor little kid.)"
    },
    {
        "character": "Cartman",
        "line": "You're a worthless two-dollar criminal and you're lying!"
    },
    {
        "character": "Kenny",
        "line": "(Aww, it's okay, little fella.)"
    },
    {
        "character": "Butters",
        "line": "Well I don't have nothin' to confess. Honestly."
    },
    {
        "character": "Cartman",
        "line": "Fine! Then you won't mind giving us a semen sample. [holds out a cup for Butters to take]"
    },
    {
        "character": "Butters",
        "line": "How do I do that?"
    },
    {
        "character": "Cartman",
        "line": "You just make the semen come out of your body and put it in this cup!"
    },
    {
        "character": "Butters",
        "line": "Well how do I make semen... come out of my body?"
    },
    {
        "character": "Cartman",
        "line": "Stop playing games!"
    },
    {
        "character": "Butters",
        "line": "I'm not playing. I really don't know!"
    },
    {
        "character": "Cartman",
        "line": "That does it! Wait right here! [goes behind the booth and laughs] Guys, did you hear that? Butters doesn't know how you make semen come out of your body."
    },
    {
        "character": "Kyle",
        "line": "How... do you make semen come out?"
    },
    {
        "character": "Cartman",
        "line": "I don't know. I was hoping you guys did."
    },
    {
        "character": "Stan",
        "line": "It's that thing we learned about in school where you pull on your wiener until white stuff comes out."
    },
    {
        "character": "Cartman",
        "line": "Really?"
    },
    {
        "character": "Kyle",
        "line": "Ohh, right, you're supposed to pull and master-benate your wiener really fast."
    },
    {
        "character": "Cartman",
        "line": "Oh okay. [returns to the table] Okay, retard, you really don't know how to make semen come out?!"
    },
    {
        "character": "Butters",
        "line": "No!"
    },
    {
        "character": "Cartman",
        "line": "Follow me to the bathroom. [goes upstairs]"
    },
    {
        "character": "Kenny",
        "line": "[soothing] (Aw, it's okay, kid. It's not going to hurt.) [Butters hops off the chair and follows Cartman upstairs]"
    },
    {
        "character": "",
        "line": "The Cartman hallway. Cartman takes Butters to the restroom."
    },
    {
        "character": "Cartman",
        "line": "Now, go sit on the toilet and pull and tug on your wiener until white stuff comes out, and then put it in this cup."
    },
    {
        "character": "Butters",
        "line": "My wiener??"
    },
    {
        "character": "Cartman",
        "line": "Yes, retard. Semen comes from your wiener. Now do it! [Butters grabs the door handle and shuts the door. Cartman waits for a few second before doing anything] Well, Butters?!"
    },
    {
        "character": "Butters",
        "line": "Ah I'm pullin' on my wiener, but nothin's happening."
    },
    {
        "character": "Cartman",
        "line": "Well pull harder!"
    },
    {
        "character": "Butters",
        "line": "...ow... Ow... It's not workin'."
    },
    {
        "character": "Cartman",
        "line": "Try doin' it faster."
    },
    {
        "character": "Butters",
        "line": "[increasing the speed] Ow. Ow. Ow ow ow ow ow ow ow ow ow. Naw, nothin'."
    },
    {
        "character": "Cartman",
        "line": "Butters, do you wanna go to jail for the rest of your life?!"
    },
    {
        "character": "Butters",
        "line": "NOOooo!"
    },
    {
        "character": "Cartman",
        "line": "The you'd better get that semen sample no matter how long it takes!"
    },
    {
        "character": "Butters",
        "line": "Okay!!"
    },
    {
        "character": "Stan",
        "line": "[rushing up with Kyle and Kenny] Cartman! Cartman! We just got a tip that a doll was found near Fosse's house!"
    },
    {
        "character": "Cartman",
        "line": "Let's go! [They leave. Butters remains in the bathroom]"
    },
    {
        "character": "Butters",
        "line": "...ow... Ow!"
    },
    {
        "character": "",
        "line": "Fosse's house, a nice rambling house. Cartman approaches the front door as Stan, Kyle, and Kenny stand off to one side. He turns and places his back against the wall, then sneaks up to a window. He looks in just a bit. Inside, Fosse plays with a doll... red dress, turned-up nose, blonde curly hair with two blue bows attached... just as Sarah had described. The two boys giggle as they play."
    },
    {
        "character": "Fosse",
        "line": "Huhuh, Okay Ms., Ms. Jones, heh, me and Doctor... Flick here just need to... check your vagina. [pulls up the front of the doll's dress and giggles with Bill]"
    },
    {
        "character": "Bill",
        "line": "That's gay. [giggles with Fosse]"
    },
    {
        "character": "Fosse",
        "line": "Yeah, that's gay. [Cartman looks in intently. He then turns his back against the wall and backs away with his water pistol drawn]"
    },
    {
        "character": "Cartman",
        "line": "[in hushed tones] Kyle!"
    },
    {
        "character": "",
        "line": "Kyle looks on as Cartman starts signing to him. Cartman holds up his index finger and shows the fleshy side to Kyle, then points two fingers to his own eyeballs, then turns the fingers out and shows them, then motions inside with his thumb, then makes a grabbing gesture, then something like a fist, then a thumbs-up, then a fist turned out, then points to Kyle, then points again, then taps the side of his own head, then makes a J sign on his head, then rests."
    },
    {
        "character": "Kyle",
        "line": "What? [Cartman repeats the gestures again] What??"
    },
    {
        "character": "Cartman",
        "line": "[repeats the gestures] I see two guys inside. They have Sarah Peterson's doll, you stupid Jew!"
    },
    {
        "character": "Kyle",
        "line": "[gasps, then with determination, in hushed tones] They've got the doll! [he, Stan, and Kenny move in and the four boys take positions around the door. Kyle stands at the door, Cartman and Kenny on either side, Stan at Kyle's back]"
    },
    {
        "character": "Stan",
        "line": "[in hushed tones] Okay, okay. Ready? Break the door down! [Kenny turns and rings the bell. Inside, Bill and Fosse stop their play and go to the door]"
    },
    {
        "character": "Fosse",
        "line": "Huh huh who is it?!"
    },
    {
        "character": "Stan",
        "line": "South Park Junior Detectives! We know you have Sarah Peterson's doll!"
    },
    {
        "character": "Fosse",
        "line": "[giggles] They're playing Detective. [they giggle]"
    },
    {
        "character": "Bill",
        "line": "That's gay. [they giggle]"
    },
    {
        "character": "Fosse",
        "line": "[calls out] You're gay! [outside, the boys lower their guns.]"
    },
    {
        "character": "Kyle",
        "line": "What do we do now?"
    },
    {
        "character": "Stan",
        "line": "I don't know."
    },
    {
        "character": "Cartman",
        "line": "Well if they're not gonna give us back the doll, then we have no choice. Let's go tell on them. [hops down from the porch and walks away]"
    },
    {
        "character": "Stan",
        "line": "Dude, we just can't tell on them."
    },
    {
        "character": "Cartman",
        "line": "Why not?"
    },
    {
        "character": "Kyle",
        "line": "Because, dude, we're playing detectives! Detectives don't just go tell on people."
    },
    {
        "character": "Fosse",
        "line": "[from inside] Detectives! [Cartman returns, and the camera angle switches to the living room. Bill and Fosse have made the doll a hostage, having tied her up on a chair. Fosse continues, giggling] If you don't get out of here, we're gonna rip the doll's head off!"
    },
    {
        "character": "Bill",
        "line": "Yeah."
    },
    {
        "character": "Fosse",
        "line": "We were playing gynecologists and now we're playing criminals."
    },
    {
        "character": "Bill",
        "line": "That's gay."
    },
    {
        "character": "Fosse",
        "line": "We're gay."
    },
    {
        "character": "Stan",
        "line": "Jesus! They're gonna kill her!"
    },
    {
        "character": "Kyle",
        "line": "We've got to do something."
    },
    {
        "character": "Cartman",
        "line": "Time! Time is what we need, but time is something we ain't got!"
    },
    {
        "character": "Tucker",
        "line": "[offscreen] Attention! You in the house! [the other kids are shown, with their own little car] This is Agent Tucker with the FBI! We have you surrounded. Sort of."
    },
    {
        "character": "Stan",
        "line": "[he and the others approach the FBI kids] Hey, you butt-holes can't play FBI here!"
    },
    {
        "character": "Cartman",
        "line": "Yeah! This was our hot lead!"
    },
    {
        "character": "Tucker",
        "line": "And you did a great job leading us here. Now you just stay out of our way! [into the megaphone] The gig is up, Fosse! Bring out the doll! Or we'll tell on you!"
    },
    {
        "character": "Stan",
        "line": "We're gonna charge the front door and go get it."
    },
    {
        "character": "Tucker",
        "line": "No you're not."
    },
    {
        "character": "Cartman",
        "line": "Dammit man, this is not the time for negotiations! There's a little doll in there about to have her head twisted off!"
    },
    {
        "character": "Tucker",
        "line": "Climb off, kid! We say you can't charge the front door, and you have to obey what the FBI says! That's the rules!"
    },
    {
        "character": "Stan",
        "line": "Just because your parents can afford better toys than ours doesn't make you better than us!"
    },
    {
        "character": "Tucker",
        "line": "Yes it does so! [a long pause]"
    },
    {
        "character": "Kyle",
        "line": "...Grrrr!!! [the boys turn and walk away]"
    },
    {
        "character": "Kenny",
        "line": "(What do we do now?)"
    },
    {
        "character": "Stan",
        "line": "We go get the doll ourselves."
    },
    {
        "character": "Kyle",
        "line": "But they said we can't charge the front door."
    },
    {
        "character": "Stan",
        "line": "That's right. [cocks his left hand] But they didn't say anything about going in the back."
    },
    {
        "character": "Tucker",
        "line": "Come on guys. You don't wanna hurt that doll."
    },
    {
        "character": "Bill",
        "line": "Huhuh. [notices the SP boys coming in] Oh crap, they're coming in the back! [the shootout begins. The boys fan out and make firing noises as they aim at Bill and Fosse. Bill and Fosse return fire with their own noises] That's gay. [he and Fosse hide behind an armchair]"
    },
    {
        "character": "Stan",
        "line": "[pops up from the couch and fires away, using the back of the couch as a shield] Bang bang bang! I got you, Fosse!"
    },
    {
        "character": "Fosse",
        "line": "No you didn't!"
    },
    {
        "character": "Stan",
        "line": "Did so!"
    },
    {
        "character": "Fosse",
        "line": "No, 'cause I got... special wizard armor on."
    },
    {
        "character": "Kyle",
        "line": "We're not playing Dungeons and Dragons, ass-face!"
    },
    {
        "character": "Cartman",
        "line": "All right, that does it! Cover me! I'm going slo-mo! [moves out from behind the couch, shooting slowly but walking normally] Wwwaaahhh!"
    },
    {
        "character": "Fosse",
        "line": "[makes sweeping gestures with his hands] Oooh, they got me! [falls a bit further with each] Whooaaa, whooaaa, whooaaa. [now fully stretched on the floor, closes his eyes as if dead]"
    },
    {
        "character": "Bill",
        "line": "[follows suit] rr uh rr uh, uhhhh. [makes like he's dead]"
    },
    {
        "character": "Fosse",
        "line": "[opens his eyes and giggles] We're dead."
    },
    {
        "character": "Bill",
        "line": "[opens his eyes and giggles] That's gay."
    },
    {
        "character": "Stan",
        "line": "[getting the doll after he, Kyle and Kenny approach the chair] We got it."
    },
    {
        "character": "",
        "line": "Sarah's house, later. Stan and the boys walk up to the house again. Stan knocks on the door, and Sarah's mother answers."
    },
    {
        "character": "Stan",
        "line": "Ms. Peterson, is your daughter home?"
    },
    {
        "character": "Sarah",
        "line": "[appears at the doorway and lights up as she runs for her doll] My dolly! [gets it and holds it tight]"
    },
    {
        "character": "Cartman",
        "line": "We got her back safe. Lost a lot of good men in the process."
    },
    {
        "character": "Sarah's Mom",
        "line": "Well you boys are little heroes. I'm going to call the police department and let them know what brave little detectives you are! [the boys smile proudly]"
    },
    {
        "character": "",
        "line": "Park County Police Station, day. This building is much bigger than the building Barbrady upholds the law from in South Park."
    },
    {
        "character": "Dawson",
        "line": "Hello there little crime stoppers, I'm Lieutenant Dawson with the Park County Police. I heard you did a great job finding Sarah Peterson's doll."
    },
    {
        "character": "Stan",
        "line": "We do what we can, sir."
    },
    {
        "character": "Dawson",
        "line": "Well, that's fantastic, kids. And for all your terrific sleuth-solving, I'm hereby making you all Junior Detectives. [hands out badges]"
    },
    {
        "character": "Kyle",
        "line": "[Kyle opens his] Wow! [the others have similar reactions]"
    },
    {
        "character": "Dawson",
        "line": "That means you boys are now an official part of the department."
    },
    {
        "character": "Cartman",
        "line": "Kewl!"
    },
    {
        "character": "Dawson",
        "line": "All right, so ready for your first assignment?"
    },
    {
        "character": "Stan",
        "line": "Sure."
    },
    {
        "character": "Dawson",
        "line": "Okay. There's a meth lab down at 567 Mala Vista. The operators are probably armed to the hilt with illegal weapons. I want you to get down there and see what you can find!"
    },
    {
        "character": "Kyle",
        "line": "Ah... a a a meth lab?"
    },
    {
        "character": "Dawson",
        "line": "[sits at his desk] I don't want any problems. Just take 'em down by the books. Now get over there; the mayor's all over my ass on this one! [the boys turn to leave] On, and deputies: you screw this up and I'll have you working graveyard shift behind a desk! Move it! [the boys run off]"
    },
    {
        "character": "",
        "line": "Nighttime in the boondocks. The boys walk along a barren stretch of road."
    },
    {
        "character": "Kyle",
        "line": "What is a meth lab, anyway?"
    },
    {
        "character": "Stan",
        "line": "I don't know. Let's just hurry up. I wanna get home in time to watch Crime Drama. [they turn and walk towards a large building in the distance]"
    },
    {
        "character": "",
        "line": "The meth lab. Three men sit around a table as a fourth man works behind them. The junior detectives approach the front door. Stan knocks. The men inside quickly arm themselves."
    },
    {
        "character": "Stan",
        "line": "Uh police. Open up. ...Oh crap, did you guys do your math homework?"
    },
    {
        "character": "Kyle",
        "line": "Nah. Dude, I totally spaced it. [windows begin breaking as shots are fired at the boys]"
    },
    {
        "character": "Man 1",
        "line": "You die, pigs! [gunfire continues breaking windows] You want to die, huh? [loses control of the gun, which causes a bullet to ricochet and hit some flammable liquids. A fire erupts and begins to spread, torching one of the man's friends. The burning friend breaks through the front door and runs out. The first man and another man hop into a truck and break through the garage door. The passenger pulls out his gun]"
    },
    {
        "character": "Man 3",
        "line": "You won't take us alive! [their truck hits a ramp and goes into the air, twisting to the left and ending up in the middle of a road. Another truck arrives and its driver honks his horn. The oncoming truck strikes the disabled truck and pushes it along. At a nearby intersection, a car strikes the disabled truck and that truck blows up. Three burning people get out of the truck and run around. The fourth man in the meth lab flies a plane]"
    },
    {
        "character": "Man 4",
        "line": "So long, coppers! [his fuel level hits empty] Oh, shit! [the plane goes straight down and hits the post office and another building. More burning people run around, and the boys can barely believe what they're seeing]"
    },
    {
        "character": "Stan",
        "line": "Damn."
    },
    {
        "character": "",
        "line": "Park County Police Dept., Dawson's office, later that night. He reads the police report and paces behind his desk."
    },
    {
        "character": "Dawson",
        "line": "One UPS vehicle valued at twenty-five thousand dollars, one civilian vehicle worth sixteen thousand, the second floor of the post office AND a coffee shop valued at sixty thousand! The mayor's gonna have my ass!"
    },
    {
        "character": "Stan",
        "line": "Uh, sir, we just kinda got blind-sided by the-"
    },
    {
        "character": "Dawson",
        "line": "You got careless! Now, I don't know how they do things down at that dog-and-pony show they call the Fourth Grade, but here we have rules! Jesus, we don't even have guys to question now, because you killed them all!"
    },
    {
        "character": "Kyle",
        "line": "We're sorry."
    },
    {
        "character": "Dawson",
        "line": "One more slip-up like that and I'll have your badges! You hear me?! Now hit the showers!"
    },
    {
        "character": "",
        "line": "Park County Police Dept., locker room. Three men are changing clothes, so they're all in their briefs. The boys enter."
    },
    {
        "character": "Officer 1",
        "line": "Well well well, if it isn't the super-cops. [the officers begin to giggle]"
    },
    {
        "character": "Officer 2",
        "line": "Hey Murphy, think they'll let me borrow their G.I. Joes?"
    },
    {
        "character": "Officer 4",
        "line": "Come on, you guys. Leave them alone."
    },
    {
        "character": "Murphy",
        "line": "[Officer 1] Relax, Hopkins! [removes his briefs and drops them to the ground] All fun and games, right? [moves to the end of the lockers and hides behind it, only to peek out] Soho, tell us, rookies, you ah... find yourself a little bonus in that house??"
    },
    {
        "character": "Cartman",
        "line": "Uh bonus?"
    },
    {
        "character": "Murphy",
        "line": "Come on! We all skim a little off the top. Oh. Or are you too good for that? [walks back to the other officers] You think you're gonna waltz in here and clean up the system. Is that it?"
    },
    {
        "character": "Stan",
        "line": "[softly] We just wanna be junior detectives."
    },
    {
        "character": "Murphy",
        "line": "LOOK, we all work hard! And we deserve more than the thirty-thousand a year we get paid! So what if we take in a little on the side?"
    },
    {
        "character": "Officer 2",
        "line": "Yeah! Who the hell are you to change that?!"
    },
    {
        "character": "Hopkins",
        "line": "I said, back off Murphy!"
    },
    {
        "character": "Murphy",
        "line": "Why don't you and your rookie friends make us"
    },
    {
        "character": "Officer 2",
        "line": "That's right. Come on, bring it!"
    },
    {
        "character": "Officer 3",
        "line": "Yeah, let's go! Come on, bring it!"
    },
    {
        "character": "Dawson",
        "line": "What the hell is the problem here??"
    },
    {
        "character": "Murphy",
        "line": "No problem, sir. No problem at all."
    },
    {
        "character": "Dawson",
        "line": "Then hit the showers, all of you!"
    },
    {
        "character": "",
        "line": "The shower room, moments later. Stan, Kyle, and Cartman are taking their showers. Kyle drops his soap to fart, then picks it up again. Cartman works on his hair."
    },
    {
        "character": "Kyle",
        "line": "Dude, I don't wanna play Detective anymore."
    },
    {
        "character": "Cartman",
        "line": "Me neither."
    },
    {
        "character": "Stan",
        "line": "It'll get better, guys."
    },
    {
        "character": "Kyle",
        "line": "Better how, dude?"
    },
    {
        "character": "Stan",
        "line": "[puts his soap away] Look, we said we wanted to form a club to protect and serve South Park. We put all this time into it, I mean... What do you guys wanna do, huh? Go back to playing Car Mechanics? Or Laundromat Owners?"
    },
    {
        "character": "Kyle",
        "line": "We were happy playing Laundromat Owners."
    },
    {
        "character": "Stan",
        "line": "I wasn't. We started playing Detective because we wanted our play time to mean something. Or have you forgotten why you joined the force, Kyle?"
    },
    {
        "character": "Cartman",
        "line": "[intervening] Hey! Broflovski's a good cop!"
    },
    {
        "character": "Stan",
        "line": "You guys can go back to playing Laundromat Owners if you want, but... I'm not gonna give those kids playing the FBI a chance to laugh at us. I'll see you guys at school tomorrow."
    },
    {
        "character": "",
        "line": "Cartman's house, night. His door opens, and a tired Cartman walks in."
    },
    {
        "character": "Cartman",
        "line": "Awwwwrrr-auugh. [hangs up his coat and holster on the coat tree in the living room]"
    },
    {
        "character": "Liane",
        "line": "Eric, where have you been? It's ten thirty."
    },
    {
        "character": "Cartman",
        "line": "We had to take down a meth lab on Mala Vista."
    },
    {
        "character": "Liane",
        "line": "Well you should've called Mommy."
    },
    {
        "character": "Cartman",
        "line": "[turns and snaps at her] Will you get off my back?! It's hard enough I gotta work the beat, and now I gotta come home to your nagging?! [realizes what he's doing, then turns away] Look look, I'm I'm sorry. It's just this case, and... the guys down at the station, I... I'm tired, alright? I'm I'm tired."
    },
    {
        "character": "Liane",
        "line": "Well, why don't you get ready for snoogums' night-night, and I'll bring you some toasty chocolate nummers?"
    },
    {
        "character": "Cartman",
        "line": "[straightens up and smiles] Okay. [turns and walks off to bed. He passes by the bathroom. Butters is still in there]"
    },
    {
        "character": "Butters",
        "line": "Who-o-o-o-a. Oowwww!"
    },
    {
        "character": "Cartman",
        "line": "[stops] Butters?"
    },
    {
        "character": "Butters",
        "line": "Yes?"
    },
    {
        "character": "Cartman",
        "line": "Are you still trying to give a semen sample?"
    },
    {
        "character": "Butters",
        "line": "Well I'm tryin', but nothing's comin' out."
    },
    {
        "character": "Cartman",
        "line": "Well, keep tryin', Butters."
    },
    {
        "character": "Butters",
        "line": "Okay. [Cartman walks off] Ow. Ooww!"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The boys are in class, sleeping. As Butters was at home at 9 am the previous day, this day is Monday."
    },
    {
        "character": "Mr. Garrison",
        "line": "And so you can see, children, that the women's movement of the late fifties and the early sixties had a profound effect on feminism in America. [turns around and quickly notices the sleeping boys] Uh, boys! [the boys stir and wake up] Would it trouble you terribly not to sleep in my class?"
    },
    {
        "character": "Kyle",
        "line": "Uh we weren't sleeping, Mr. Garrison."
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh well, then maybe you can tell me who was in charge of the feminist movement of the early sixties!"
    },
    {
        "character": "Cartman",
        "line": "[thinks] A bunch of fat old skanks on their periods?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Right, but who was the fattest oldest skank on her period?! [the boys look at each other, confused and afraid] That's what I thought! Now pay attention! [turns back to the board] Okay, children, now, the biggest skank of all was was an old fat-ass by the name of-"
    },
    {
        "character": "Dawson",
        "line": "[bursting through the classroom door] Marsh! Broflovski! McCormick! Cartman! In my office! [leaves]"
    },
    {
        "character": "The boys",
        "line": "[hanging their heads] Eeagh!"
    },
    {
        "character": "",
        "line": "Park County Police Department, later. The boys walk in sleepily. Dawson holds a file in his right hand."
    },
    {
        "character": "Dawson",
        "line": "Looks like that meth lab you took down was the tip of the iceberg. They found a paper trail leading all the way to the biggest crime syndicate in Colorado."
    },
    {
        "character": "Cartman",
        "line": "Uh oh..."
    },
    {
        "character": "Dawson",
        "line": "The operators apparently run their business out of a sleazy strip joint down in Inglewood. They're all cop killers, so I'm sending you in undercover. [the boys look at each other]"
    },
    {
        "character": "Kyle",
        "line": "Uh, sir, d'I have a lot of homework to do tonight and I was-"
    },
    {
        "character": "Dawson",
        "line": "What?! Now you listen to me! I'm givin' you one last chance! You're good cops, but you let your emotions get in the way! And your little \"shoot first ask questions later\" technique has no place in this century! Now you get down to that strip joint and you do it by the books, you got it?! The mayor is on my ass and blablablah! [the boys turn left and walk off. As they head for the entrance they walk down the hall. Around one corner are two of the officers they met in the locker room]"
    },
    {
        "character": "Murphy",
        "line": "So, what did you boys have to say to the lieutenant?"
    },
    {
        "character": "Stan",
        "line": "Nothing, he just told us a bunch of stuff."
    },
    {
        "character": "Murphy",
        "line": "Maybe you decided you needed to tell him about our... bonus money."
    },
    {
        "character": "Kyle",
        "line": "No. [the boys walk away]"
    },
    {
        "character": "Officer 2",
        "line": "They're lying."
    },
    {
        "character": "Murphy",
        "line": "They're dead!"
    },
    {
        "character": "",
        "line": "Inglewood, Colorado, night. A big city. The strip club shown is The Peppermint Hippo. Inside there are several dancers undulating for their patrons on individual stages. Other dancers dance on the club floor for individual patrons. The boys enter the club."
    },
    {
        "character": "Kyle",
        "line": "Dude, if my mom knew I was in here, I would be in super big trouble."
    },
    {
        "character": "Kenny",
        "line": "[stops and looks around, then jumps for joy] (Woohoo!!) [rushes up to catch the other boys, who now sit around a small stage]"
    },
    {
        "character": "Stripper",
        "line": "[bloated woman with a coarse voice, opens an embrace to Stan] Would you like a dance?"
    },
    {
        "character": "Stan",
        "line": "No thanks."
    },
    {
        "character": "Stripper",
        "line": "[moves to Kyle] Dance? [moves on] Anyone like a dance?"
    },
    {
        "character": "DJ",
        "line": "Well all right, guests, put your hands together. Be sure to tip the dancers. And now, come on, let's hear it for Candy!"
    },
    {
        "character": "Bouncer",
        "line": "[walks up to the boys] Whoa whoa, what the hell are you kids doin' in here? This isn't an appropriate place for children."
    },
    {
        "character": "Stripper",
        "line": "[walking in the foreground, on the other side of the small stage] Dance? Anyone like a dance?"
    },
    {
        "character": "Kyle",
        "line": "Uh, it's okay. We know the owner."
    },
    {
        "character": "Bouncer",
        "line": "[crosses his arms] Oh, really? Let's go see."
    },
    {
        "character": "",
        "line": "The Peppermint Hippo back room."
    },
    {
        "character": "Owner",
        "line": "All right, so we'll have to start havin' the McCormicks make our meth again and-"
    },
    {
        "character": "Bouncer",
        "line": "Hey Gino, these kids say they know you."
    },
    {
        "character": "Gino",
        "line": "What? Ha-I don't know no kids."
    },
    {
        "character": "Bouncer",
        "line": "I didn't think so. All right, you kids-"
    },
    {
        "character": "Gino",
        "line": "Hey wait a minute. These kids might be just what we need to get our drugs past the security at DIA. How would you like to join our family?"
    },
    {
        "character": "Tall goon",
        "line": "Yo Gino, I know I've seen these kids before, man. These kids are 5-0!"
    },
    {
        "character": "Gino",
        "line": "What?"
    },
    {
        "character": "Tall goon",
        "line": "These kids are cops, man! [the five men in the room assume positions and start firing away at the boys. A man at the door is shot and he falls away. The boys begin pretending to fire back and make shooting noises.]"
    },
    {
        "character": "Cartman",
        "line": "Bang bang bang... [the boys move behind a chair. The men continue firing. The boys move back into view]"
    },
    {
        "character": "Stan, Kyle, Cartman",
        "line": "Bang bang bang... [the men move to lesser-powered weapons]"
    },
    {
        "character": "Kenny",
        "line": "(Pakew! Pakew!)"
    },
    {
        "character": "Cartman",
        "line": "[looks at Kenny] Kenny, it doesn't go \"Pakew! Pakew!\", it goes \"BANG BANG BANG!!\" [outside, police cars of all types pull up to the club. Dawson quickly jumps out of his car. An explosion appears in two windows of the club, and Dawson ducks a little]"
    },
    {
        "character": "Dawson",
        "line": "God damnit! Those junior detectives and their heroically reckless ways! Murphy! Jenkins! Hopkins! Get in there! [The three men move in. Jenkins is Officer 2. Inside, two of the owner's men rush out of the back room, and the strippers rush out of the way. The men turn around and shoot back at the boys. The boys return fire. None of the four boys has yet been hit. The gunfight continues. The old stripper walks by again]"
    },
    {
        "character": "Stripper",
        "line": "Dance??? Anybody like a dance??? [walks by without being hit once. The other two men appear and shoot at the boys]"
    },
    {
        "character": "Hopkins",
        "line": "[enters the club] Freeze! South Park detectives! [Murphy and Jacobs quickly enter and take aim. Everyone stops and turns around to face the detectives. The DJ stands in his booth] Great job, boys. You found the meth boss!"
    },
    {
        "character": "Gino",
        "line": "Detective Murphy! Jenkins! Uh what the hell are you doing? We had a deal."
    },
    {
        "character": "Hopkins",
        "line": "[looks at his colleagues with suspicion] A deal?"
    },
    {
        "character": "Murphy",
        "line": "That's right. We're partners in the drug business. Everything was fine until these \"super-cops\" joined the force. [the boys look stunned at the revelation: these cops are crooked]"
    },
    {
        "character": "Jenkins",
        "line": "Now we've gotta kill you all."
    },
    {
        "character": "Hopkins",
        "line": "Boys! Down! [the boys look for cover as the two crooked cops join the five men in firing at Hopkins. The boys huddle under a table]"
    },
    {
        "character": "DJ",
        "line": "Huh alright guys, put your hands together, a lot of shootin' and killin' goin' on, but be sure to tip your waitress let's hear it for Rebecca."
    },
    {
        "character": "Dawson",
        "line": "Christ! Those junior detectives have no regard for the law! [FBI trucks pull up and agents pour out of them]"
    },
    {
        "character": "Lead FBI agent",
        "line": "Get me a hard line to the phone! And I want choppers on the roof!"
    },
    {
        "character": "Dawson",
        "line": "[walks up] Who the hell are you??"
    },
    {
        "character": "Lead FBI agent",
        "line": "[whips out his badge] Agent Fields, FBI!"
    },
    {
        "character": "Dawson",
        "line": "Hey, I'm in charge of this investigation."
    },
    {
        "character": "Fields",
        "line": "Not anymore, you're not."
    },
    {
        "character": "Dawson",
        "line": "But that's not fair!"
    },
    {
        "character": "Fields",
        "line": "Is so! Is so! [inside, the gunfight continues. Hopkins is shot, and he quickly kills two of Gino's men. Jenkins quickly shoots at Hopkins and gets the right arm. Hopkins winces and falls down]"
    },
    {
        "character": "Jenkins",
        "line": "Sorry, Detective Hopkins. We can't let anybody know about our partnership."
    },
    {
        "character": "Gino",
        "line": "That's right. We split it all, fifty-fifty!"
    },
    {
        "character": "Murphy",
        "line": "That's right. [raises his gun and shoots Gino through the forehead. Gino's body slides down along the wall behind him] I think we'll take a hundred percent now."
    },
    {
        "character": "Jenkins",
        "line": "Huhuh yeah. Sorry, Gino, but in business like this, sometimes partnerships need to end."
    },
    {
        "character": "Murphy",
        "line": "That's right. [raises his gun and shoots Jenkins through the side of the head, and Jenkins wavers and falls] Sometimes partnerships need to end. [now seeing the boys] Well, super-cops, looks like I'll be taking in all the money now. I'm in business alone. And that means that the only person I can't trust... is myself. [raises the gun and shoots himself through his chin, then falls alongside Hopkins]"
    },
    {
        "character": "",
        "line": "Outside the Peppermint Club. The paramedics have arrived and are removing the bodies. Hopkins, up and about, reaches the boys."
    },
    {
        "character": "Hopkins",
        "line": "[his arm in a sling] It looks like Murphy and Jenkins got what they deserved. If it weren't for you boys, we would have never cleaned up the department."
    },
    {
        "character": "Dawson",
        "line": "[approaches the boys] All right, detectives, let's get one thing straight! I do not agree with your methods! You're uncontrolled, and you're negligent! But by God you get the job done. Congratulations!"
    },
    {
        "character": "Stan",
        "line": "Thanks."
    },
    {
        "character": "Dawson",
        "line": "I'm probably going to regret this, but, well, I'm promoting you to full detectives. There'll be lots of action, and that big paycheck you've always wanted. [the paramedics close up the ambulance, then climb in and leave. The boys mull over the offer]"
    },
    {
        "character": "Stan",
        "line": "...I think I have a better idea."
    },
    {
        "character": "",
        "line": "Cartman's basement, next day. The boys are back at playing Laundromat. The wall under the stairs has been removed to show the washer and dryer, which are now framed by a doorway saying \"Employees Only.\" Two clothes racks are seen, and the detectives' desks are refashioned as washer/dryer combos. A \"Laundromat\" sign on the wall looks over the whole thing."
    },
    {
        "character": "Kyle",
        "line": "Hello, sir. Welcome to the Broflovski Laundromat."
    },
    {
        "character": "Stan",
        "line": "[walks up with one of his outfits] Yes, I have a suit I need dry-cleaned, and pressed, please."
    },
    {
        "character": "Kyle",
        "line": "Certainly."
    },
    {
        "character": "Cartman",
        "line": "[walks up with some clothes] Here you are, Mister McCormick. Your laundry is all done and folded. That will be nine ninety five. [Kenny hands him a card] On your American Express."
    },
    {
        "character": "Butters",
        "line": "[coming down the stairs] Fellas! Hey fellas! I got it! Ah I got my semen sample!"
    },
    {
        "character": "Cartman",
        "line": "You did?"
    },
    {
        "character": "Butters",
        "line": "Yeah. I was up there poundin' my wiener for two days straight, aaand finally, I thought about Stan's Mom's boobs, and this little tiny spooge of... this white stuff came out."
    },
    {
        "character": "Kyle",
        "line": "That's great, Butters, but we're not playing Detective anymore. We're playing laundromat owners."
    },
    {
        "character": "Cartman",
        "line": "Would you like those pants cleaned for four ninety five?"
    }
]