[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Three Feathers Casino, night. People flock in. The building is massive, the front entrance is prefaced with a long pool with water jets shooting water into the air. The interior is shown, with its slot machines and milling crowds. The boys enter with the Marshes and the Broflovskis. Randy and Gerald carry cigars in their hands."
    },
    {
        "character": "Stan",
        "line": "Wow, dude."
    },
    {
        "character": "Cartman",
        "line": "Man, Indians have it good, huh?"
    },
    {
        "character": "Randy",
        "line": "Now, Eric, they're called Native Americans, remember? Show some respect."
    },
    {
        "character": "Native American chief",
        "line": "Welcome to the Three Feathers Casino. I'm your host, Chief Runs With Premise. Please try your luck at one of our many games."
    },
    {
        "character": "Cartman",
        "line": "[eagerly] All right, let's go! [moves forward]"
    },
    {
        "character": "Runs With Premise",
        "line": "Halt. [spreads his arms out] I am afraid minors cannot go onto the casino floor."
    },
    {
        "character": "Cartman",
        "line": "I'm not a miner, dumbass! Do you see a shovel in my hand?!"
    },
    {
        "character": "Runs With Premise",
        "line": "You kids can enjoy our Native American Comedy Club."
    },
    {
        "character": "Gerald",
        "line": "All right, we're gonna hit the tables. Why don't you kids run along to the comedy club? [Stan shrugs and the boys leave. The adults move forward]"
    },
    {
        "character": "Randy",
        "line": "All right, time to win some money!"
    },
    {
        "character": "Gerald",
        "line": "Oh yeah! blackjack table!"
    },
    {
        "character": "Blackjack dealer",
        "line": "Welcome to the blackjack table. May luck run through you, like the spirit of the buffalo."
    },
    {
        "character": "Sheila",
        "line": "Gerald, this is ten dollars a hand!"
    },
    {
        "character": "Gerald",
        "line": "Relax, sweetie [in hushed tones] I know how to count cards."
    },
    {
        "character": "Sheila",
        "line": "Well I don't wanna play here!"
    },
    {
        "character": "Sharon",
        "line": "Yeah. Come on, Sheila, let's go to the nickel slots."
    },
    {
        "character": "Randy",
        "line": "Oooo, the nickel slots! You might win the thirty-dollar jackpot! Ahh, women, huh? God I hate 'em. [smokes]"
    },
    {
        "character": "Gerald",
        "line": "All right, time to show these people how to gamble!"
    },
    {
        "character": "",
        "line": "An entrance is shown - The Laughing Coyote Comedy Lodge, then the interior of the lodge itself. A Native American drummer sits on stage."
    },
    {
        "character": "Announcer",
        "line": "Welcome to the Three Feathers Comedy Club. Please put your hands together for Johnny Manymoons! [Johnny approaches the mic]"
    },
    {
        "character": "Kyle",
        "line": "What is Native American comedy, anyway?"
    },
    {
        "character": "Manymoons",
        "line": "[takes the mic] Thank you, thank you. Bear walked into a bar. Bear said to Deer, \"May I please... have a drink?\" And so Deer said to Bear, \"Why the big paws?\" [the drums strikes three beats]"
    },
    {
        "character": "Audience",
        "line": "Ha ha ha ha! Ha ha ha ha! Ha ha ha ha! Ha ha ha ha! [the boys are confused]"
    },
    {
        "character": "Manymoons",
        "line": "Many moons ago, Pony and Eagle walked up to Coyote. Pony said to Coyote, \"I am very mad at Eagle. Will you yell at him for me?\" Coyote said to Pony, \"Why can you not yell yourself?\" And Pony replied, \"Because I am a little horse.\" [the drums strikes three beats]"
    },
    {
        "character": "Audience",
        "line": "Ha ha ha ha! Ha ha ha ha!"
    },
    {
        "character": "",
        "line": "The blackjack table. Gerald sits alone fiddling with some chips. Randy returns from somewhere with a cup of coins."
    },
    {
        "character": "Randy",
        "line": "How's it goin', Gerald?"
    },
    {
        "character": "Gerald",
        "line": "[nervous, fidgeting] Ohh, not so good."
    },
    {
        "character": "Randy",
        "line": "Yeah, I know what you mean. I'm down three hundred bucks."
    },
    {
        "character": "Gerald",
        "line": "Yeah. I'm down twenty-six thousand."
    },
    {
        "character": "Randy",
        "line": "Yeah, well, maybe we should- ...wait. Twenty-six thousand dollars??"
    },
    {
        "character": "Gerald",
        "line": "I forgot to tell you, ah I have a gambling problem."
    },
    {
        "character": "Randy",
        "line": "Gerald, twenty-six thousand-!"
    },
    {
        "character": "Gerald",
        "line": "Sshhhh! I have to win it back before Sheila finds out!"
    },
    {
        "character": "Randy",
        "line": "Where did you get that kind of money??"
    },
    {
        "character": "Gerald",
        "line": "The casino gave me credit! I put the house up as collateral! But I still have this ten-dollar chip."
    },
    {
        "character": "Blackjack dealer",
        "line": "Dealer, twenty one. [takes the last chip] Sorry."
    },
    {
        "character": "Gerald",
        "line": "[collapses on the table] That's it. I'm destitute. [leaps up and grabs Randy] Loan me money! You've gotta have money in the cup! [grabs the cup and tries to wrest it from Randy] Wha- what's in the cup?"
    },
    {
        "character": "Randy",
        "line": "[keeps the cup] Just six quarters!"
    },
    {
        "character": "Gerald",
        "line": "[sits down and mopes] Oh God. Oh Jesus."
    },
    {
        "character": "Blackjack dealer",
        "line": "Thank you for playing at Three Feathers. May your life be filled with the song of the sparrow."
    },
    {
        "character": "Gerald",
        "line": "[bolts upright again] Oh, shove the song of the sparrow up your ass!"
    },
    {
        "character": "",
        "line": "Three Bears Casino, sometime later. Randy and Gerald sit on a bench next to some slot machines. Gerald's head hangs low."
    },
    {
        "character": "Gerald",
        "line": "How am I going to tell my family? [raises his head] How do I tell them that tomorrow, we have to ...pack up our things and ...get out of the house? [Sheila and Sharon show up in the background with the boys.]"
    },
    {
        "character": "Sheila",
        "line": "There's daddy!"
    },
    {
        "character": "Gerald",
        "line": "[hangs his head] Oh, Jesus. [the boys and the women arrive.]"
    },
    {
        "character": "Sheila",
        "line": "Where have you guys been? We've been looking all over."
    },
    {
        "character": "Kyle",
        "line": "Yeah. Come on, Dad, this place sucks. I wanna go."
    },
    {
        "character": "Gerald",
        "line": "[raises his head] What, What did you say?"
    },
    {
        "character": "Kyle",
        "line": "I said I wanna leave."
    },
    {
        "character": "Gerald",
        "line": "[shifts gears and stands] Oh, you wanna leave, huh?! Okay, fine, Kyle, when we get home, we'll just pack up our things, load them in the car, and we'll leave! [Sheila and Kyle are baffled]"
    },
    {
        "character": "Kyle",
        "line": "What?? No, no, I mean, I-"
    },
    {
        "character": "Gerald",
        "line": "No, no, no, if you wanna leave South Park, fine! Tomorrow we're leaving!"
    },
    {
        "character": "Sheila",
        "line": "Gerald, what are you talking about?"
    },
    {
        "character": "Gerald",
        "line": "Oh, you heard him, Sheila! Kyle wants to leave! Our nice old house doesn't interest Kyle anymore! Well I'm calling a moving company right now! [leaves]"
    },
    {
        "character": "Cartman",
        "line": "Well, you shouldn't be such a dick, dude. [Kyle remains baffled, even as he looks at Cartman]"
    },
    {
        "character": "Sharon",
        "line": "[walks up to Randy] What's wrong with Gerald?"
    },
    {
        "character": "Randy",
        "line": "He... he lost his house to the Native Americans."
    },
    {
        "character": "Sharon",
        "line": "What?? But don't the Native Americans know he has nowhere else to go?"
    },
    {
        "character": "Randy",
        "line": "They don't care. [the camera rises and focuses on a window behind them]"
    },
    {
        "character": "",
        "line": "The casino office. Chief Runs with Premise looks out over the floor."
    },
    {
        "character": "Runs with Premise",
        "line": "Look at them! Small-minded idiots pouring their life-savings away!"
    },
    {
        "character": "Elder 1",
        "line": "Their cash flows out of them like diarrhea from the buffalo."
    },
    {
        "character": "Elder 2",
        "line": "[wearing glasses] Yes, but we have milked these simple mountain folk almost dry. If we really want to see cash flow, we need to bring in city-people from Denver."
    },
    {
        "character": "Runs with Premise",
        "line": "[turns around] Yeessss. It is time for us to implement our plan. [walks over to an easel on which sits a map of Colorado, with a new highway drawn on it between the casino and Denver] A superhighway, built from Denver right to our casino!"
    },
    {
        "character": "Aide 1",
        "line": "And what do we do about the small town of South Park that lies in the highway's way?"
    },
    {
        "character": "Runs with Premise",
        "line": "[holding up large stacks of bills] Simple. We buy it, and we demolish it! Ha ha ha ha! Ha ha ha ha!"
    },
    {
        "character": "Elders",
        "line": "Ha ha ha ha!"
    },
    {
        "character": "",
        "line": "South Park Elementary, next day. A town meeting is being held in the gym. Mayor McDaniels sits at a table with four aides, two on either side of her."
    },
    {
        "character": "Mayor McDaniels",
        "line": "And that's really all I can tell you. The town of South Park is going to be leveled, in order to make way for a twelve-lane superhighway."
    },
    {
        "character": "Randy",
        "line": "[rises] But how can they do that?!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "The Native Americans have purchased the land out from under us. Tomorrow, they're buying the last of what they need to have complete ownership."
    },
    {
        "character": "Jimbo",
        "line": "[rises] Well can't we stop them? Let's call the bank."
    },
    {
        "character": "Mayor McDaniels",
        "line": "The Native Americans bought the bank."
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh my God."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Now, look, it isn't all horrible. The Native Americans are offering you retail values on your homes."
    },
    {
        "character": "Randy",
        "line": "No, screw that! We'll just pool our money together and buy the town ourselves! [the town clamors in agreement]"
    },
    {
        "character": "Chef",
        "line": "[rises] Yeah! Let the South Park people own South Park! [the town clamors in agreement]"
    },
    {
        "character": "Randy",
        "line": "How much do we have to raise, Mayor?"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Three hundred thousand dollars. [the town thinks, then grumbles]"
    },
    {
        "character": "Randy",
        "line": "Ohhh, never mind. [sits down]"
    },
    {
        "character": "",
        "line": "The town library. Nine boys sit in front of it: Timmy, Jimmy, Tweek, Butters, Stan, Kyle, Cartman, Kenny, and Alex."
    },
    {
        "character": "Butters",
        "line": "How can they do that, huh? How can they make us all move away?"
    },
    {
        "character": "Cartman",
        "line": "Because they're rich, greedy-ass Indians!"
    },
    {
        "character": "Kyle",
        "line": "[correcting] Native Americans. [Stan rises and walks away from the building]"
    },
    {
        "character": "Stan",
        "line": "Our whole town, gone. We'd had such great times here. [begins to reminisce]"
    },
    {
        "character": "",
        "line": "The scenes are as follows:Zombies destroy the town as the boys walk through in their Halloween costumes.\nTrapper Keeper grabs a phone booth as it reaches mammoth dimensions.\nThe townsfolk fight the mutant turkeys.\nChristopher Reeve throws a truck at some people, and they dive out of the way.\nThe giant fireworks snake demolishes the town.\nThe Geldon causes havoc on the Drew Carey Show as the Knights of Standards and Practices watch.\nThe pirate ghost ship fires off a cannon shot and the townsfolk dive out of the way. Some of them are killed on impact.\nThe pro-war and anti-war factions fight over the Iraq war.\nThe town reenacts the Civil War\nMr. Hankey summons up massive amounts of crap in order to get rid of the Hollywood gliterati\nMecha-Streisand fights off Ultura Marutin and Megara Poatia.\n"
    },
    {
        "character": "Stan",
        "line": "[stops reminiscing, turns around, and walks back to the boys] We can't let them do it, you guys! We have to find a way to stop those Native Americans!"
    },
    {
        "character": "The boys",
        "line": "Yeah!"
    },
    {
        "character": "Alex",
        "line": "Yeah, this is our town!"
    },
    {
        "character": "Stan",
        "line": "We shouldn't have to make a bunch of new friends somewhere else. We're a team!"
    },
    {
        "character": "Kyle, Butters, Tweek",
        "line": "Yeah!"
    },
    {
        "character": "Cartman",
        "line": "That's right!"
    },
    {
        "character": "Butters",
        "line": "Yeah, ahh, that's right!"
    },
    {
        "character": "Alex",
        "line": "Yeah, we're a team!"
    },
    {
        "character": "Stan",
        "line": "We just gotta figure out a way to raise three hundred thousand dollars! [the boys start thinking]"
    },
    {
        "character": "Cartman",
        "line": "[rises and moves to the sidewalk] Wait a minute! I've got it, you guys! We can get Kyle infected with AIDS! And then start a charity organization that we steal money from! Come on, let's go! [trots off excitedly. The other boys just watch him leave. Cartman returns a few seconds later] No? We can't give Kyle AIDS?"
    },
    {
        "character": "Stan",
        "line": "We need something that'll get us money tomorrow!"
    },
    {
        "character": "Butters",
        "line": "Hey, I know! How about a dog parade? [smiles]"
    },
    {
        "character": "Kyle",
        "line": "Dog parade?"
    },
    {
        "character": "Butters",
        "line": "Yeah! We dress up all our dogs in little outfits, and parade them down the street. [closes his eyes and beams] It'll be so adorable!"
    },
    {
        "character": "Kyle",
        "line": "How do we make three hundred thousand dollars doing that?"
    },
    {
        "character": "Butters",
        "line": "Oh... Uh well, we could sell tickets to our moms and dads."
    },
    {
        "character": "Stan",
        "line": "Our moms and dads are the ones who need money, Butters!"
    },
    {
        "character": "Butters",
        "line": "Oh... [the boys go back to thinking]"
    },
    {
        "character": "Cartman",
        "line": "Maybe give Kyle AIDS, huh? Lookin' a little better now."
    },
    {
        "character": "",
        "line": "South Park, later on, day. The Broflovski house is shown, and a massive bulldozer rolls up to knock it down. A large chunk of it is torn off by the scoop."
    },
    {
        "character": "Sheila",
        "line": "Oh, Gerald, I, I can't watch!"
    },
    {
        "character": "Randy",
        "line": "[walks up to the Chief] How can you do this to people?"
    },
    {
        "character": "Runs with Premise",
        "line": "We're sorry. But if we do not build a superhighway, our casino might stop seeing profits."
    },
    {
        "character": "Randy",
        "line": "There's more to life than profits!"
    },
    {
        "character": "Runs with Premise",
        "line": "Well like what?"
    },
    {
        "character": "Randy",
        "line": "Well like, you know, Slurpees and stuff. [more of the house is torn down]"
    },
    {
        "character": "Chris",
        "line": "Well, come on, honey, I guess we should start packing up our things as well."
    },
    {
        "character": "Mr. Garrison",
        "line": "Yeah. [begins to wave] So long, South Park."
    },
    {
        "character": "Stan",
        "line": "Mom! Dad! We figured out a way we could raise three hundred thousand dollars!"
    },
    {
        "character": "Chris",
        "line": "A dog parade? [smiles in anticipation]"
    },
    {
        "character": "Stan",
        "line": "No!"
    },
    {
        "character": "Randy",
        "line": "Stan, we've all tried to raise money, but we only raise ten thousand dollars, and the deadline is tomorrow."
    },
    {
        "character": "Stan",
        "line": "I know. So how about we take the ten thousand dollars back to the Indian casino? Tell them, Kyle!"
    },
    {
        "character": "Kyle",
        "line": "[opens a book he's carrying and reads] The odds on a single number in roulette are thirty-five to one. [looks up and closes the book] That means, with a ten thousand dollar bet, you win three hundred and fifty thousand."
    },
    {
        "character": "Sheila",
        "line": "Boys, that's ridiculous."
    },
    {
        "character": "Stan",
        "line": "Look, we- we've got nothing to lose."
    },
    {
        "character": "Chef",
        "line": "What do you guys think?"
    },
    {
        "character": "Jimbo",
        "line": "It's a long shot."
    },
    {
        "character": "Randy",
        "line": "Yeah. [turns around and makes fists with determination] But it's the only shot we've got to save our town."
    },
    {
        "character": "",
        "line": "Three Feathers Casino, that night. The townsfolk are there once more."
    },
    {
        "character": "Runs With Premise",
        "line": "[reading from a newspaper] The residents of South Park had hoped to raise three hundred thousand dollars. but in the end managed to raise only ten. The loss of their town may be imminent for the poor people of South Park. [fakes sadness] Awww, I think I'm going to cwy."
    },
    {
        "character": "Two Elders",
        "line": "HA ha ha ha! HA ha ha ha!"
    },
    {
        "character": "",
        "line": "The doors open and the townsfolk surge in. Randy carries a large amount of yellow chips."
    },
    {
        "character": "Randy",
        "line": "All right, boys. You're gonna have to wait here. [the adults begin to move past the boys]"
    },
    {
        "character": "Stan",
        "line": "Dad. [Randy turns around] Good luck."
    },
    {
        "character": "Randy",
        "line": "It's in God's hand now. [turns around and moves forward] Stand aside, everyone! [the adults move towards the roulette table. The Chief notices a change in atmosphere and rises to see what's going on from his office.]"
    },
    {
        "character": "Runs With Premise",
        "line": "What are they doing?"
    },
    {
        "character": "Randy",
        "line": "We're gonna try and beat you at your own game, Chief Runs With Premise! Ten thousand dollars! [sets the yellow chips down] On thirty one black! [moves the chips towards the number. Everyone gasps. The dealer takes the chips and puts them away, substituting some blue chips for the yellow ones.]"
    },
    {
        "character": "Runs With Premise",
        "line": "Impossible!"
    },
    {
        "character": "Stan",
        "line": "[begins to wish hard] Come on! Come on! [the dealer starts the wheel and tosses the ball in the opposite direction. Everyone looks on in anticipation. The ball slows down and settles in on thirty one black.]"
    },
    {
        "character": "Runs With Premise",
        "line": "Thirty one. Black. [the town erupts with joy]"
    },
    {
        "character": "Townsfolk",
        "line": "Yeah! All right! Woohoo! Oh we did it! We did it! Oh my God! Oh this is amazing!"
    },
    {
        "character": "Runs With Premise",
        "line": "No... NOOO! [The boys cheer. Cartman and Kenny hug]"
    },
    {
        "character": "Alex",
        "line": "South Park is saved. [the dealer adds more blue chips to the amount bet]"
    },
    {
        "character": "Mr. Mackey",
        "line": "We have plenty enough to save our town now!"
    },
    {
        "character": "Gerald",
        "line": "Yeah! But wait. [the rush of winning gets to him] Three hundred and fifty thousand dollars. That means if we won again, it will be twelve and a quarter million! [the people gasp a bit at the possibility]"
    },
    {
        "character": "Mr. Garrison ",
        "line": "We can save the town and be super-rich!"
    },
    {
        "character": "Randy",
        "line": "Oh hell yeah! Let it ride!"
    },
    {
        "character": "Gerald",
        "line": "Let it ride!!"
    },
    {
        "character": "Townsfolk",
        "line": "Woohoo! Yeah! [they stay with thirty one black, and the dealer spins again]"
    },
    {
        "character": "Kyle",
        "line": "What the hell are they doing??"
    },
    {
        "character": "Jimbo",
        "line": "Let's go thirty one! Let's see it! [the ball bounces around and settles in on two red.]"
    },
    {
        "character": "Roulette Dealer",
        "line": "Two, red. You lose."
    },
    {
        "character": "Townsfolk",
        "line": "AWWWWWWW!!"
    },
    {
        "character": "Randy",
        "line": "Dammit!"
    },
    {
        "character": "Runs With Premise",
        "line": "[satisfied with this result] Hmmm! [walks off]"
    },
    {
        "character": "Stan",
        "line": "They, they had it! They freakin' had it!"
    },
    {
        "character": "",
        "line": "The road. The Marshes drive home in their car. Randy drives, Sharon sits on the passenger side. Stan sits between Shelly and Grandpa in the back seat."
    },
    {
        "character": "Stan",
        "line": "You totally had it! You had enough to save the town and then some."
    },
    {
        "character": "Randy",
        "line": "Stan? Okay? You just don't understand the fine points of gambling. You're never supposed to stop when you're on a winning streak."
    },
    {
        "character": "Stan",
        "line": "A winning streak??!! You played one game!!!!"
    },
    {
        "character": "Randy",
        "line": "Stan? Okay?"
    },
    {
        "character": "Stan",
        "line": "What???"
    },
    {
        "character": "Randy",
        "line": "All right? Stan? Okay?"
    },
    {
        "character": "Stan",
        "line": "You people just got greedy, like the Native Americans! [Randy brakes the car angrily]"
    },
    {
        "character": "Randy",
        "line": "[menacingly] Hey, mister!! We're not like them, all right?! [turns and faces Stan] Now, we may have pie in the sky dreams once in a while, but we aren't the ones kicking people out of their homes! So don't you compare us to those cold-hearted, money-grubbing, evil stinky Indians! [turns back to the wheel] I'm sorry, Native Americans."
    },
    {
        "character": "",
        "line": "South Park, next day. A \"SOLD\" sign is placed above the town sign, indicating that the town, indeed, has been sold. At South Park Elementary, the residents stand in long lines waiting for the checks being offered for their homes."
    },
    {
        "character": "Elder 2",
        "line": "[facing Mr. Garrison] There you are, sir. There's the check for your home. Just sign here, and here."
    },
    {
        "character": "Mr. Garrison",
        "line": "[signing] Well, this is it, Mr. Slave. We're officially homeless."
    },
    {
        "character": "Mr. Slave",
        "line": "[sobbing] Jesus! Jesus Christ!"
    },
    {
        "character": "Stan",
        "line": "[walks up to Randy, who is in line with the others] Dad, what are you doing?! Don't take their dirty money!"
    },
    {
        "character": "Randy",
        "line": "Stanley, we don't have a choice. The Native Americans own South Park now. We have to take what they'll give us for our homes."
    },
    {
        "character": "Elder 3",
        "line": "There you go. Have a nice day. [hands a check to Liane, who turns around and walks off with it]"
    },
    {
        "character": "Stan",
        "line": "[walks with his friends to a clearing where he could be heard] Come on, you guys! This is our town!"
    },
    {
        "character": "Mr. Mackey",
        "line": "It's over, Stanley. What else can we do?"
    },
    {
        "character": "Stan",
        "line": "We can stay. And fight."
    },
    {
        "character": "Cartman",
        "line": "Yeah! When the Indians come to tear up our town, we kick 'em in the nuts!"
    },
    {
        "character": "Kenny",
        "line": "(Yeah!)"
    },
    {
        "character": "Alex",
        "line": "Yeah! They don't own our town! We do!"
    },
    {
        "character": "Chef",
        "line": "I'm sorry, boys. You just don't understand economics."
    },
    {
        "character": "Randy",
        "line": "It'll be okay, boys, we'll just... move to the next town over."
    },
    {
        "character": "Stan",
        "line": "Oh sure. Until the Native Americans decide they want that land, too! What if the Native Americans just keep building their casinos and their highways uh, until we have nowhere else to go?? We have to stand up to them now! [the adults look back helplessly] Rrrgh! Forget it! Come on, you guys! [the boys leave. Cartman stays behind.]"
    },
    {
        "character": "Cartman",
        "line": "You're all a bunch of God-damned pussies! [follows his friends them out. The adults just watch]"
    },
    {
        "character": "",
        "line": "South Park, day. Moments later, a train of bulldozers roll down into town. Runs with Premise, riding on the lead bulldozer, looks happy until he sees the boys standing abreast on the street, blocking the way."
    },
    {
        "character": "Runs with Premise",
        "line": "Get out of our way."
    },
    {
        "character": "Stan",
        "line": "No! We won't let you destroy our town!"
    },
    {
        "character": "Runs with Premise",
        "line": "Boys. It isn't your town anymore."
    },
    {
        "character": "Stan",
        "line": "Just because you have a piece of paper saying you own it doesn't make it yours. We grew up here. Our parents grew up here. We shop at that Wal-Mart, and eat at that Chili's. We take fish from the streams and bread them and freeze them to make fish sticks. This is not just a town, it is our way of life."
    },
    {
        "character": "Elder 1",
        "line": "Well your way of life is about to change, little boys. Now move! [points the way to the side of the street]"
    },
    {
        "character": "Kyle",
        "line": "You can't just roll into places and take people's lives away!"
    },
    {
        "character": "A Driver",
        "line": "And what are four little boys going to do to stop us, huh? [the boys stand unsure, but a sound rises up behind them. Townsfolk appear in mass and walk down the street.]"
    },
    {
        "character": "Townsfolk",
        "line": "We are strong\nNo one can tell us we're wrong\n[Stan looks behind him, smiles, then looks up to his left. People now appear on the roofs of the buildings as well as on the street.]\nSearching our hearts for so lohh-oo-ohh-oo-ong\n[Stan looks at the roofs on the other side of the street, smiling.]\nAll of us knowing...\n[The boys grin]\nLove Is A Battlefield\n\n\n"
    },
    {
        "character": "Stan",
        "line": "This land is not for sale."
    },
    {
        "character": "Runs with Premise",
        "line": "Dammit! I thought you said they were dealt with!"
    },
    {
        "character": "Elder 1",
        "line": "They were!"
    },
    {
        "character": "Mr. Garrison",
        "line": "Sorry, Charlies! You can just keep your filthy bastard Indian money!"
    },
    {
        "character": "Principal Victoria",
        "line": "Filthy bastard Native American money!"
    },
    {
        "character": "Mr. Garrison",
        "line": "Uh oh, right, huh. Sorry about that."
    },
    {
        "character": "Runs with Premise",
        "line": "This isn't over! [he and the others get into their bulldozers and pull out of town]"
    },
    {
        "character": "Jimbo",
        "line": "We'll never give up! You bastards!"
    },
    {
        "character": "Alex",
        "line": "Yeah! South Park is ours."
    },
    {
        "character": "Mr. Mackey",
        "line": "But, what do we do now? I mean, we can't just stand here and block their way forever."
    },
    {
        "character": "Randy",
        "line": "We can stand here as long as it takes. [no one moves. The scene stays for a few seconds, then...]"
    },
    {
        "character": "",
        "line": "Three Feathers Casino, night. Chief Runs with Premise looks over the casino floor from his office."
    },
    {
        "character": "Runs with Premise",
        "line": "What is the state of our people?"
    },
    {
        "character": "Elder 2",
        "line": "Last night I spoke with the spirit of the bear, and Bear said that if we do not build our highway soon, our investors may soon sell off their shares of the new casino."
    },
    {
        "character": "Elder 1",
        "line": "Yes, and Eagle says the cumulative shared market loss on the revenue of the new casino drops fifteen percent every day."
    },
    {
        "character": "Runs with Premise",
        "line": "Then we must force the South Park people off their petty land."
    },
    {
        "character": "Elder 1",
        "line": "But they are determined and proud. And the spirit of the wind has stated that if we use force, it could be a publicity nightmare, further hurting our net assets."
    },
    {
        "character": "Runs with Premise",
        "line": "I already have a plan how we can force them off their land... sneakily. [begins to move off] We're going to give them... [stops in front of a wall] blankets. [three of them are shown]"
    },
    {
        "character": "Elder 1",
        "line": "Blankets?"
    },
    {
        "character": "Runs with Premise",
        "line": "Yes. We will present the blankets as a peace offering. But what the round-eyes will not know is that the blankets are infected with SARS. [his fellow tribespeople look at each other] They will all get SARS! And then SARS will run through their town like a buffalo. Now I need your help getting the SARS onto the blankets. [everyone puts on their little white face masks] Okay, bring them in!"
    },
    {
        "character": "Runs with Premise",
        "line": " [The office doors open and several naked Chinese men are brought in] Let's see how South Park deals with this! [he picks up one of the men and rubs him on a blanket. The Chinese man looks at him bewildered] Everyone grab a Chinese person and rub them on a blanket. [other elders pick up the other Chinese them and carry them over to other blankets hanging on the wall] Make sure you rub them all over. Get the SARS nice and deep in there. [the Chinese men grumble at their treatment]"
    },
    {
        "character": "",
        "line": "South Park, next day. The deadline has arrived."
    },
    {
        "character": "Field reporter",
        "line": "Tom, I'm standing in chilly South Park, Colorado, where the residents are entering the third day of their sit-in to try and stop Native Americans from building a superhighway through their town. The temperature is low, but spirits are pretty low, too. [a Three Casinos Humvee rolls into town and four elders, including Runs with Premise, exit the vehicle]"
    },
    {
        "character": "Randy",
        "line": "[looking on suspiciously, huddled with his family] What do they want?"
    },
    {
        "character": "Mr. Garrison",
        "line": "We're not moving, ass-faces!"
    },
    {
        "character": "Runs with Premise",
        "line": "[walks up to Mr. Garrison with a blanket] Free blanket? [presents it to him] Though I know we have differences, we believe that a compromise can be reached. In the meantime, it hurts us to see you all on television sitting in the cold. Will you not take this offering as a gesture of good-will?"
    },
    {
        "character": "Mr. Garrison",
        "line": "You had me at \"free blanket.\" [Runs with Premise nods and Garrison takes the blanket and opens it. Runs with Premise moves on to other townsfolk and the other elders join in, passing out blankets to the townsfolk.]"
    },
    {
        "character": "Elders",
        "line": "Free blanket? Free blanket? Free blanket..."
    },
    {
        "character": "Field reporter",
        "line": "Tom, it now looks as if the Native Americans are handing out blankets as a sign of good-will towards the South Park people. What an incredible display of compassion. I certainly hope there's nothing sinister behind it."
    },
    {
        "character": "Runs with Premise",
        "line": "[walks up to Randy] Please. As a token of good faith."
    },
    {
        "character": "Randy",
        "line": "You... understand if I'm a little wary of trusting you."
    },
    {
        "character": "Runs with Premise",
        "line": "It is only a blanket, Mister Marsh."
    },
    {
        "character": "Randy",
        "line": "Well, thanks. [takes the blanket and opens it up. The Chief walks away]"
    },
    {
        "character": "Runs with Premise",
        "line": "Oh. You're welcome."
    },
    {
        "character": "",
        "line": "South Park, day, later. People are anywhere from asleep to sick."
    },
    {
        "character": "Field reporter",
        "line": "[leaning to his left] Tom, it's Tuesday morning now, and the outbreak of SARS in South Park has reached epic proportions. [coughs twice and sniffs] The entire town has been quarantined by the federal government, nobody allowed in our out, which means, nobody can come to our aid. [sniffs twice] It appears this town, and this reporter, are done for. Coming up next, choosing the right hair conditioner. What you don't know about hair care products could be costing you a bundle."
    },
    {
        "character": "",
        "line": "Randy has taken ill and now lies under a lean-to. Sharon sits on one side of the lean-to, Shelly on the other. Stan walks up to his dad with a can of beer in his hand. Randy coughs."
    },
    {
        "character": "Stan",
        "line": "It's all right, dad."
    },
    {
        "character": "Randy",
        "line": "How's your... mother?"
    },
    {
        "character": "Stan",
        "line": "[looks over] She's hanging in there. [looks at Randy again] Here, drink some beer. [Randy turns his head aside a bit so he can take a sip, then resets his head]"
    },
    {
        "character": "Randy",
        "line": "It's cool on my tongue."
    },
    {
        "character": "Stan",
        "line": "You're gonna be all right."
    },
    {
        "character": "Randy",
        "line": "Stanley, listen to me. I have SARS. There's only a ninety-eight percent chance that I will live."
    },
    {
        "character": "Stan",
        "line": "No, Dad, NO."
    },
    {
        "character": "Randy",
        "line": "Listen, Stan. SARS is destroying our people. The Native Americans put it in the blankets they gave us. [coughs and sniffs] Soon there will be only ninety-eight percent of us left. [runs out of air, then turns aside and breathes in. His voice turns raspy]"
    },
    {
        "character": "Stan",
        "line": "What can I do?"
    },
    {
        "character": "Randy",
        "line": "You... must find a cure for SARS, son. And save our people."
    },
    {
        "character": "Stan",
        "line": "Cure SARS? Aw, Jesus!"
    },
    {
        "character": "Randy",
        "line": "The spirit of middle-class white people is strong in you, son. Seek out the wise man in Bellow Creek. Now go. GO! [Stan steps away, then runs. Randy relaxes and lays down]"
    },
    {
        "character": "",
        "line": "Bellocreek Trailer Park. Stan approaches it and enters. He walks up to a trailer and knocks on the door."
    },
    {
        "character": "Wise man",
        "line": "[answers the door] What?"
    },
    {
        "character": "Stan",
        "line": "Hey, my name's Stan, and I was-"
    },
    {
        "character": "Wise man",
        "line": "Your coming was foretold to me. You've come to save our people. Come in. [steps aside and Stan enters] Watch the cats."
    },
    {
        "character": "Stan",
        "line": "Uh so, do you know how to cure SARS?"
    },
    {
        "character": "Wise man",
        "line": "Me?? Huh, no. I am just a guide. Sit down."
    },
    {
        "character": "",
        "line": " [Stan sits down on a bucket seat from a car. Beer bottles litter the trailer floor. The walls are dingy. An open doorway reveals the man's bedroom, which shows a cross hanging on the opposite wall. A poster of a swimsuit model posing on a car hangs on the living room wall. The man sits on the couch]."
    },
    {
        "character": "Wise man",
        "line": " You must find the answer yourself, by taking an inward journey. [picks up a can of paint thinner and pours it into a brown paper bag]"
    },
    {
        "character": "Stan",
        "line": "An inward journey? That sounds kinda gay."
    },
    {
        "character": "Wise man",
        "line": "Let the voices of our ancestors show you the way. [offers the bag to Stan] Breathe. Breathe from the bag of visions. [Stan takes the bag, looks at it, then takes a deep breath from it]"
    },
    {
        "character": "Stan",
        "line": "[disgusted] Ah! Oh, dude!"
    },
    {
        "character": "",
        "line": "Three Feathers Casino, night. Chief Runs with Premise holds a meeting in his second-story office."
    },
    {
        "character": "Runs with Premise",
        "line": "How much longer must we wait for our superhighway??"
    },
    {
        "character": "Elder 1",
        "line": "SARS has spread throughout the entire town of South Park, Chief Runs with Premise. Their wills will break soon."
    },
    {
        "character": "Runs with Premise",
        "line": "Then I suppose we must be patient."
    },
    {
        "character": "Woman",
        "line": "Runs with Premise, come quickly!"
    },
    {
        "character": "Runs with Premise",
        "line": "What is the matter, wife?"
    },
    {
        "character": "Woman",
        "line": "It is our son, Premise Running Thin. He is very sick."
    },
    {
        "character": "",
        "line": "Premise Running Thin's bedroom. He's in bed, wearing a headband with a feather attached to it. His parents approach."
    },
    {
        "character": "Runs with Premise",
        "line": "Premise Running Thin, what is the matter?"
    },
    {
        "character": "Woman",
        "line": "He, he shared a cup with one of the people from China. He has SARS!"
    },
    {
        "character": "Runs with Premise",
        "line": "No! I told you not to touch them!"
    },
    {
        "character": "Premise Running Thin",
        "line": "Papa. Papa..."
    },
    {
        "character": "Medicine Man",
        "line": "[wearing a wolf skin over his head and back] I have given him herbs from the desert plant and water from the cactus of life. But nothing seems to be working."
    },
    {
        "character": "Runs with Premise",
        "line": "This would not have happened if those townspeople would have just moved away! No more waiting around! Tomorrow we begin the final stage of our plan! Shock and Awe!"
    },
    {
        "character": "",
        "line": "South Park, next day. The townspeople are still sick. Stan runs up to Randy."
    },
    {
        "character": "Stan",
        "line": "Dad! Dad!"
    },
    {
        "character": "Randy",
        "line": "Stanley. Did you have an inward journey with the old man? Did you have a vision??"
    },
    {
        "character": "Stan",
        "line": "Ah, I don't know if I did or not. I, I saw something, someone spoke to me and... told me the middle-class white way to cure SARS. [reaches into the bag and pulls out each item as he names it] Campbell's Chicken Noodle Soup, Dayquil, and Sprite."
    },
    {
        "character": "Randy",
        "line": "Yes. Yes, of course. Quickly, Stan, we must give it to everyone! [a few hours later, everyone is standing around enjoying the soup, soda, and medicine prescribed, and chatting]"
    },
    {
        "character": "Kyle",
        "line": "Boy, that really did the trick, Stan. I thought we were kind of, sort of, not really done for."
    },
    {
        "character": "Alex",
        "line": "Thanks to you, we're all safe now, Stan."
    },
    {
        "character": "",
        "line": "In the distance the bulldozers return and a yell is heard. As the bulldozers draw near, Chief Runs with Premise is seen standing on the running board of the lead bulldozer."
    },
    {
        "character": "Runs with Premise",
        "line": "Now, I will blow your weak, SARS-infested bodies off the Earth! [the townsfolk look at the coming vehicles and slowly close ranks] What the? [thinks quickly] Wait a minute. [to his men] Stop! Stop! [hops off the bulldozer and walks up to the people] Your, your SARS. Where did it go?"
    },
    {
        "character": "Randy",
        "line": "We have cured ourselves using the medicines of our culture."
    },
    {
        "character": "Runs with Premise",
        "line": "My son... Premise Running Thin has the SARS as well. [makes a truce sign with his hands] You... you can cure him?"
    },
    {
        "character": "",
        "line": "Three Feathers Casino, upstairs. Premise Running Thin sits in bed sipping his soup. A can of Sprite and some Dayquil are on his tray. Around his bed are the Three Feathers tribe on one side, the South Park residents on the other."
    },
    {
        "character": "Elder 1",
        "line": "It is amazing. All our plants and herbs failed to heal him."
    },
    {
        "character": "Elder 2",
        "line": "But your people's remedy brings the spirit of the buffalo back into his heart. Perhaps there are many things we can learn from your way of life."
    },
    {
        "character": "Randy",
        "line": "We're a simple people. All we want is to be allowed to live our lives."
    },
    {
        "character": "Runs with Premise",
        "line": "You have cured Premise Running Thin. In return, I shall give you all five dollars credit at the casino. [his wife nudges him with her elbow a few times and he gets irritated] All right, all right, I will not build a superhighway through your town. And you can all have your homes back."
    },
    {
        "character": "Townsfolk",
        "line": "All right! Yeah! [townspeople jump and cheer. Sheila and Gerald hug each other.] Woohoo!"
    },
    {
        "character": "Alex",
        "line": "Well, I guess we all learned that South Park is more than just a town. It's a community that nobody can split up."
    },
    {
        "character": "Stan",
        "line": "Dude, who the hell are you?"
    },
    {
        "character": "Alex",
        "line": "Alex. Alex Glick. I got to come on and do the guest voice thingy."
    },
    {
        "character": "Kyle",
        "line": "What?! Get the hell out of here!"
    },
    {
        "character": "Alex",
        "line": "Hi Mom! Hi Dad! Hi Jill!"
    }
]