[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Kyle's house, night. \"Happy Chanukah\" The Broflovski family sings as Gerald lights the first candle on the Chanukah menorah."
    },
    {
        "character": "The Broflovskis",
        "line": "Chanukah, Chanukah, sivivon, sov, sov"
    },
    {
        "character": "Ike",
        "line": "I gotta go tinkle."
    },
    {
        "character": "Kyle",
        "line": "No Ike! Shh!"
    },
    {
        "character": "The Broflovskis",
        "line": "[while Ike and Kyle talk] Sov, sov, sov! Sov, sov, sov! Ma nayim vi-tov."
    },
    {
        "character": "Gerald",
        "line": "We thank God for our blessings this Chanukah. Our little family is so loving, and perfect, and nothing will ever tear us apart. [the doorbell rings] I'll get it. [goes to answer the door. A Canadian couple stands at the entrance]"
    },
    {
        "character": "Man",
        "line": "Gerald Broflovski?"
    },
    {
        "character": "Gerald",
        "line": "Yes?"
    },
    {
        "character": "Man",
        "line": "My name is Harry Gintz and this is my wife Elise. We're from Canada."
    },
    {
        "character": "Gerald",
        "line": "Yes, I can tell."
    },
    {
        "character": "Harry",
        "line": "My wife and I had a child a few years back, and, we weren't ready to have a child, so we put him up for adoption. [Kyle and Ike come into view] We were told that you might be the-"
    },
    {
        "character": "Elise",
        "line": "Peter! [rushes in] Oh God, Harry! It's our son! [approaches and kneels. Ike hides behind Kyle] Peter, it's Mommy."
    },
    {
        "character": "Sheila",
        "line": "Gerald, what the hell is going on?"
    },
    {
        "character": "Gerald",
        "line": "I'm not sure."
    },
    {
        "character": "",
        "line": "Moments later, both couples are at the dining room table."
    },
    {
        "character": "Harry",
        "line": "It was a tough time for us. It was a tough time for all of Canada. The whole country was devastated by the cola wars. It just seemed we couldn't take care of a baby."
    },
    {
        "character": "Elise",
        "line": "So we put him up for adoption. But as the years passed, I, I just felt an emptiness in my heart. [Kyle eavesdrops on the conversation, with Ike at his side] Oh it's so good to see him."
    },
    {
        "character": "Sheila",
        "line": "Well, we wish you all the best, Mr. and Mrs. Gintz, but to be honest, I think it would be best for Ike if you didn't come around again."
    },
    {
        "character": "Elise",
        "line": "I don't think you understand. We didn't come to visit Peter, we came to take him back."
    },
    {
        "character": "Gerald",
        "line": "What?"
    },
    {
        "character": "Harry",
        "line": "We want to take Peter home, to Canada."
    },
    {
        "character": "Sheila",
        "line": "Are you crazy?!"
    },
    {
        "character": "Gerald",
        "line": "Look, you gave Ike up. You can't just change your mind."
    },
    {
        "character": "Harry",
        "line": "Changing your mind is a Canadian custom that we hold quite dear. And besides, the new Canadian Prime Minister has issued a decree that all adopted Canadians must be returned home."
    },
    {
        "character": "Sheila",
        "line": "The new Canadian Prime Minister?"
    },
    {
        "character": "Gerald",
        "line": "Look, Ike is our son now!"
    },
    {
        "character": "Harry",
        "line": "He doesn't belong here. He belongs in Canada with his own kind."
    },
    {
        "character": "Sheila",
        "line": "I think you'd better leave."
    },
    {
        "character": "Harry",
        "line": "Please, don't make things any harder for Peter."
    },
    {
        "character": "Gerald",
        "line": "Harder for Peter?! Now you two just blow in here and say you're gonna haul him back to Canada, and we're being hard on Peter?!"
    },
    {
        "character": "Harry",
        "line": "We're prepared to go to court! We had hoped it wouldn't come to that!"
    },
    {
        "character": "Gerald",
        "line": "Well you bet your ass it'll come to that!"
    },
    {
        "character": "",
        "line": "Park County courtroom, day."
    },
    {
        "character": "Judge",
        "line": "I'm sorry to say that my hands are tied. The new Prime Minister of Canada has authority this court cannot override. By Canadian law I must award custody of the child to his birth parents."
    },
    {
        "character": "The Gintzes",
        "line": "Yes!"
    },
    {
        "character": "Elise",
        "line": "Yes!"
    },
    {
        "character": "Sheila",
        "line": "No!"
    },
    {
        "character": "Kyle",
        "line": "[frightened] Ike's not my little brother anymore?"
    },
    {
        "character": "Sheila",
        "line": "Gerald, do something!"
    },
    {
        "character": "Gerald",
        "line": "There's nothing I can do."
    },
    {
        "character": "",
        "line": "Kyle's house, day. Sheila cries as Gerald sends Ike off."
    },
    {
        "character": "Gerald",
        "line": "Good-bye, Ike. You... [wipes a tear from his eyes] be a good boy, huh? You... remember all the things we taught you. [kisses Ike on the head and steps back to console Sheila. Kyle steps forward.]"
    },
    {
        "character": "Kyle",
        "line": "Ike, you'll always be my little brother, okay?"
    },
    {
        "character": "Harry",
        "line": "Come on, Peter, we should get going."
    },
    {
        "character": "Ike",
        "line": "[holds onto Kyle] No!"
    },
    {
        "character": "Elise",
        "line": "Peter, you must come with Mommy and Daddy."
    },
    {
        "character": "Ike",
        "line": "No no no no no!"
    },
    {
        "character": "Harry",
        "line": "[whips out a chocolate bar] I have some chocolate."
    },
    {
        "character": "Ike",
        "line": "Chocolate! [rushes for the candy, and Harry settles him inside the car]"
    },
    {
        "character": "Harry",
        "line": "We're going to take good care of him."
    },
    {
        "character": "Kyle",
        "line": "You'd better! [Harry closes the car door and goes to his side, then settles in to drive. The car lunges forward on square wheels. Kyle looks as Ike goes away. Ike looks back] Dad, can't we talk to this new Canadian Prime Minister? If he knew the situation, he might be-"
    },
    {
        "character": "Gerald",
        "line": "Oh! Kyle, appealing to the Prime Minister of Canada would take... time and money we don't have."
    },
    {
        "character": "",
        "line": "Luau's Toys, night. It's dressed for Christmas. Stan, Cartman, and Kenny look inside the shop through the window."
    },
    {
        "character": "Cartman",
        "line": "Dude, look at that. Sprinkle Time Make Your Own Marshmallow Factory. I'm definitely asking for that for Christmas."
    },
    {
        "character": "Stan",
        "line": "Dude, I'm gonna tell my parents to get me that John Elway doll with the karate-chop action."
    },
    {
        "character": "Kyle",
        "line": "Guys. [the other boys turn to face him] Guys, I need your help."
    },
    {
        "character": "Stan",
        "line": "Sure dude."
    },
    {
        "character": "Kyle",
        "line": "It's been a week since Ike's been gone, and every day my parents seem worse. I have to try to go to Canada and speak with the new Canadian Prime Minister, but I can't do it alone."
    },
    {
        "character": "Cartman",
        "line": "We can't go to Canada, dumbass! It's Christmas!"
    },
    {
        "character": "Stan",
        "line": "Yeah, dude. What if we miss out on some great Christmas adventure?"
    },
    {
        "character": "Kyle",
        "line": "Please, you guys, you don't understand. [walks off some distance] My family is devastated. My mom just walks around the house like a zombie, and my dad can't stop crying."
    },
    {
        "character": "Cartman",
        "line": "Well, I didn't wanna say anything, Kyle, but I think this is what your family gets for being Jewish at Christmas time."
    },
    {
        "character": "Stan",
        "line": "Dude, Cartman."
    },
    {
        "character": "Cartman",
        "line": "I'm just saying, maybe Jesus is having a little revenge, that's all."
    },
    {
        "character": "Kyle",
        "line": "[returns] I found the number for a really cheap airline to Canada. If we go as soon as possible, then-"
    },
    {
        "character": "Stan",
        "line": "Dude, we just can't up and go to Canada. Look, they're about to light the Christmas tree. Maybe you can get your brother back some other way. [he, Cartman and Kenny leave. Cartman stops and returns]"
    },
    {
        "character": "Cartman",
        "line": "Kyle, I just want you to know, if it were any other time of the year, I still wouldn't help you. [walks off in the direction of the other boys. Kyle walks off sadly in the other direction]"
    },
    {
        "character": "",
        "line": "South Park City Hall, night. The town Christmas tree is up, City Hall is decked out in Christmas decorations."
    },
    {
        "character": "Crowd",
        "line": "Three! Two! One! [The lights to the Christmas tree are plugged in] Yaaaaay!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "As we celebrate this glorious time, we can't forget those families who are suffering. As many of you know, the Broflovski family has recently had their child torn away from them. As a community, we must do all we can to ease their pain. Are there any suggestions how we might help?"
    },
    {
        "character": "Mr. Garrison",
        "line": "How about, we get rid of all the Mexicans? [a few seconds of silence]"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Mr. Garrison, every Christmas you suggest we get rid of all the Mexicans, and every Christmas we tell you \"NO!\""
    },
    {
        "character": "Mr. Garrison",
        "line": "Rats!"
    },
    {
        "character": "Chef",
        "line": "The Broflovskis need money to appeal that case to the new Canadian Prime Minister. What if this Christmas, instead of buyin' presents, we all use that money to give to the Broflovskis?"
    },
    {
        "character": "Cartman",
        "line": "HA! Yeah, right! Like our parents aren't gonna buy us presents for Christmas!"
    },
    {
        "character": "Liane",
        "line": "That's a great idea, Chef."
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Randy",
        "line": "Yeah. Who needs more stuff, anyway? This Christmas we can do somethin' that really matters!"
    },
    {
        "character": "Stan",
        "line": "[trying to rein in his dad's enthusiasm] Dad, don't get carried away."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Then it's settled: This year we'll give all our Christmas money to the Broflovskis, in hopes that they may someday have their child returned to them. [the crowd cheers and disperses]"
    },
    {
        "character": "Cartman",
        "line": "No! No, this can't be happening! [Kenny, Heidi and Clyde remain there as well. Clyde begins to cry.]"
    },
    {
        "character": "",
        "line": "Kyle walks down the street still depressed. Cartman bounds in before him."
    },
    {
        "character": "Cartman",
        "line": "You fucking asshole!! This is all your fault!!"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "Everyone's gonna be charitable and give money to your family instead of buying Christmas presents!! [Stan and Kenny walk in behind him] You fucking Jews ruined Christmas again!! [lunges after Kyle] AAAAAA!! [Stan and Kenny jump in and hold him back]"
    },
    {
        "character": "Stan",
        "line": "Whoa whoa, Cartman."
    },
    {
        "character": "Cartman",
        "line": "It wasn't enough for you people to kill Jesus, now you have to kill Christmas too, huh?!"
    },
    {
        "character": "Stan",
        "line": "Cartman, calm down!"
    },
    {
        "character": "Kyle",
        "line": "[to Stan] Is that true?"
    },
    {
        "character": "Stan",
        "line": "It's true, dude. Christmas is ruined."
    },
    {
        "character": "Cartman",
        "line": "[takes off his mittens and coat] This is it, Kyle. You and me. We're throwin' down. Right now."
    },
    {
        "character": "Kyle",
        "line": "I'm sorry you guys, but there is something we can do. We can go to Canada and see the Prime Minister like I said. If we can change his mind before Christmas, then your parents won't have to give my family money."
    },
    {
        "character": "Cartman",
        "line": "You really think if we go to Canada we might still get Christmas presents?"
    },
    {
        "character": "Kyle",
        "line": "It's worth a shot. Come on, you guys, we can do this."
    },
    {
        "character": "Stan",
        "line": "Oh all right, but we'd better not miss out on great Christmas adventures."
    },
    {
        "character": "Kyle",
        "line": "[reassuring] We'll get back in time for a Christmas adventure."
    },
    {
        "character": "Cartman",
        "line": "Fine. But if it doesn't work, you and me are gonna have it out, Kyle. Once and for all."
    },
    {
        "character": "",
        "line": "City Wok, night. \"Christmas Special: Chinese Food For The Holidays\" Mr. Kim sits at one of his tables with nothing to do."
    },
    {
        "character": "Mr. Kim",
        "line": "No business... Christmas time come and nobody wanna eat Chinese food. Looks like I might as well close. [a phone rings. He perks up and runs to get it] Oh boy! Some business! [puts on his chef hat and grabs a notepad] Finally! [grabs the phone and waits for the order] Herro? Shitty Wok, take ur orda prease!"
    },
    {
        "character": "Kyle",
        "line": "Uh, I must have the wrong number. We were trying to reach City Airlines."
    },
    {
        "character": "Mr. Kim",
        "line": "Oh, oh yes, just a moment prease. [flips a sign over so it now reads \"City Airlines\" and switches to a captain's hat] Herro, Shitty Airrines. Can I help you take ur orda prease?"
    },
    {
        "character": "Kyle",
        "line": "Uh, we need to go to Canada. As soon as possible."
    },
    {
        "character": "Mr. Kim",
        "line": "Oooh, Canada. Okay, that's uh pretty far. Gonna cost ya a lot of money... hmm let's see. How many people?"
    },
    {
        "character": "Kyle",
        "line": "Four."
    },
    {
        "character": "Mr. Kim",
        "line": "Okay. Four people, Canada, cost a lot of money, that uh gonna be about ah six thousand five hundred dolla."
    },
    {
        "character": "Kyle",
        "line": "How about fifty daura?"
    },
    {
        "character": "Mr. Kim",
        "line": "Fifty daura?! You flight to Canada cost at least three thousand dollar!"
    },
    {
        "character": "Kyle",
        "line": "Fifty-five daura."
    },
    {
        "character": "Mr. Kim",
        "line": "Hey! Stop wasting my time with fifty-five daura! No way I take my plane to Canada for less than a thousand daura!"
    },
    {
        "character": "Kyle",
        "line": "Okay. Sixty daura."
    },
    {
        "character": "Mr. Kim",
        "line": "Sixty-two daura."
    },
    {
        "character": "Kyle",
        "line": "Okay."
    },
    {
        "character": "Mr. Kim",
        "line": "Okay. Meet me Park County Airfield, yellow Cessna, tail number 432G."
    },
    {
        "character": "Kyle",
        "line": "Got it. [hangs up]"
    },
    {
        "character": "Mr. Kim",
        "line": "[hangs up, then giggles] Hehehehe, never try to barter with a Chinese man."
    },
    {
        "character": "",
        "line": "Park County Airfield, night. A plane comes in for a landing in the background as the boys approach the yellow Cessna."
    },
    {
        "character": "Cartman",
        "line": "We have exactly fifty-two hours before Christmas. [this sets it at 8 p.m. December 22] That means we have to be back in twenty-eight hours to still give our patents twenty-four hours to buy us presents. Synchronize watches on my mark. Mark."
    },
    {
        "character": "Mr. Kim",
        "line": "Herro, welcome Shitty Airrine. [Stan and Kyle move ahead. Kenny stays with Cartman]"
    },
    {
        "character": "Cartman",
        "line": "[shakes his head vigorously] Oh no, no no nono, I am NOT flying in that thing!"
    },
    {
        "character": "Kenny",
        "line": "(Me neither!)"
    },
    {
        "character": "Kyle",
        "line": "Why not?"
    },
    {
        "character": "Kenny",
        "line": "('Cause, dude, I'll fuckin' die!)"
    },
    {
        "character": "Kyle",
        "line": "You're not gonna die, Kenny. Don't be stupid."
    },
    {
        "character": "Cartman",
        "line": "You guys go get Ike. Kenny and I will stay here and watch the fort."
    },
    {
        "character": "Stan",
        "line": "No, you're both coming. Do you care about Christmas or not?"
    },
    {
        "character": "Cartman",
        "line": "Of course I care about Christmas- oh, Christ on a stick! [he and Kenny head for the plane]"
    },
    {
        "character": "",
        "line": "Cessna 432G, inside."
    },
    {
        "character": "Cartman",
        "line": "Aw dude, it smells like Kung Pao chicken in here!"
    },
    {
        "character": "Mr. Kim",
        "line": "Okay, welcome aboard Shitty Airrines. This is your captain speaking. Looking about a two hour fright. I'll be turning on the seatbelt sign now. If your seats have seatbelts, this is the time you will fasten them. Please sit back, relax, and enjoy your Shitty fright. [he turns off the intercom and takes flight after a small bump.]"
    },
    {
        "character": "Kyle",
        "line": "All right! We're going to Canada!"
    },
    {
        "character": "Cartman",
        "line": "Weak."
    },
    {
        "character": "",
        "line": "Cessna 432G, day. The flight has taken longer than two hours. The boys are sleeping in their seats - and so is Mr. Kim. The plane begins to hit turbulence and lose power."
    },
    {
        "character": "Mr. Kim",
        "line": "Hey, turn off the right. ...Wha- oh! [a sudden noisy dip awakens the boys]"
    },
    {
        "character": "Stan",
        "line": "What's going on??"
    },
    {
        "character": "Mr. Kim",
        "line": "Herro from the cockpit, this is your captain speaking. As you can see, it appears that we are goin' down. Now would be a good time to reflect on your rife, and pray to whatever deity you believe in. Thank you for flying Shitty Airlines. We know you have a choice in airlines, and it looks like you made the wrong one. [quickly puts on a parachute and opens his door to drop away]"
    },
    {
        "character": "Kyle",
        "line": "Hey, where the hell are you going?? [Mr. Kim jumps out and away. A few seconds later he pulls the rip cord and the parachute comes out]"
    },
    {
        "character": "Stan",
        "line": "Do something, Kyle! [Kyle grabs the controls and tries to steer the plane]"
    },
    {
        "character": "Kyle",
        "line": "I'm trying! [the plane bounces around in the air]"
    },
    {
        "character": "Cartman",
        "line": "Look out!"
    },
    {
        "character": "Kenny",
        "line": "(N-O-O-O-O-O-O-O-O-O-O-O-O-O!) [the plane makes a steep descent and crashes onto the ground. It flips over and crumples up, resting near a town. The boys scramble out of the rubble and walk into the town]"
    },
    {
        "character": "",
        "line": "Now begins the \"Wizard of Oz\" sequence. The boys look around in wonder. A pair of legs is seen at a bench, but no head is shown."
    },
    {
        "character": "Stan",
        "line": "You guys, I don't think we're in America anymore. [As they look in one direction, four Canadians pop up from some bushes and look at them. They drop back into the bushes before the boys turn back around]"
    },
    {
        "character": "Canadian man",
        "line": "Excuse me? [a head pops up over the legs at the bench] Uh, is this an invasion?"
    },
    {
        "character": "Kyle",
        "line": "No."
    },
    {
        "character": "Canadian man",
        "line": "[a doctor, it seems] Oh thank heavens! It's okay. Everyone, it's not an invasion! [people come out of their hiding places. A man pops up out of a manhole mumbling something as the others mill around]"
    },
    {
        "character": "Kyle",
        "line": "Hey! We're in Canada!"
    },
    {
        "character": "Doctor",
        "line": "Well of course you are! And Canada Friends welcomes you!"
    },
    {
        "character": "Canadians",
        "line": "Welcome, friend, to Canada! Canada Friends loves you!We're just like any other country without the big tattoo!"
    },
    {
        "character": "Sailor",
        "line": "[walks up] We greet thee with pleasure, but one question, if we may?"
    },
    {
        "character": "Businessman",
        "line": "[walks up and joins him] What brings you folks to Canada? Why are you here today?"
    },
    {
        "character": "Kyle",
        "line": "Uh. My adopted brother got taken back here to Canada? So, we want to talk to the new Canadian Prime Minister about getting him back?"
    },
    {
        "character": "Canadians",
        "line": "His brother is our quest. The question is, is what? You must talk to the new Prime Minister if you think his brother's home's back there."
    },
    {
        "character": "Cartman",
        "line": "Oh Jesus Christ."
    },
    {
        "character": "Scott",
        "line": "[shows up] Hey! What the hell is going on?!"
    },
    {
        "character": "Canadians",
        "line": "It's Scott! AAAAHHHH! [they all take off in different directions]"
    },
    {
        "character": "Scott",
        "line": "Who damaged our beloved Canadian land?!"
    },
    {
        "character": "Kyle",
        "line": "Who's that?"
    },
    {
        "character": "Doctor",
        "line": "That's Scott! He's a dick"
    },
    {
        "character": "Scott",
        "line": "[fixes his gaze on the boys and approaches] A-ha! Americans! I should've known! You think you're the police of the world! You think you own Canada! Well, you aren't welcome here! Get out now!"
    },
    {
        "character": "Doctor",
        "line": "Oh no you don't, Scott! Leave these boys alone!"
    },
    {
        "character": "Scott",
        "line": "This isn't over, you American scum! I swear to God: you'll rue this day!! [walks off]"
    },
    {
        "character": "Man in barrel",
        "line": "God, what a dick!"
    },
    {
        "character": "Kyle",
        "line": "Look, we don't have a lot of time here, okay? Can you just tell us where the new Prime Minister is?"
    },
    {
        "character": "Doctor",
        "line": "The new Prime Minister doesn't live in this part of Canada. He's in Ottawa. [the other Canadians concur]"
    },
    {
        "character": "Kyle",
        "line": "So how do we get to Ottawa?"
    },
    {
        "character": "Wrestler",
        "line": "Oh that's easy. You just have to follow the road."
    },
    {
        "character": "Cartman",
        "line": "Which road?!"
    },
    {
        "character": "Firefighter",
        "line": "This is Canada. We only have one road. [he moves to one side and the crowd splits in two to allow the boys through]"
    },
    {
        "character": "Priest",
        "line": "Follow the only road."
    },
    {
        "character": "Man",
        "line": "Follow the only road."
    },
    {
        "character": "Canadians",
        "line": "To go anywhere in Canada, you just follow the only road.\nThere's only one road in Canada. We call it the Road, the only road.\nHip-hip, hooray, let's hear it for our Road.\n\n\n"
    },
    {
        "character": "Road workers",
        "line": "And it's paved and wide and up to code."
    },
    {
        "character": "Stan",
        "line": "All right dude, let's get the hell out of here!"
    },
    {
        "character": "Kyle",
        "line": "Word!"
    },
    {
        "character": "Canadians",
        "line": "You're off to see the Prime Minister, the Prime Minister of Canada!"
    },
    {
        "character": "Doctor",
        "line": "Good-bye, friends! Good luck with the new Prime Minister! And remember to watch out for Scott! He's a dick!"
    },
    {
        "character": "Canadians",
        "line": "Good-bye, good-bye, see ya, good luck."
    },
    {
        "character": "",
        "line": "The Road, day."
    },
    {
        "character": "Cartman",
        "line": "[checking his watch] Twenty hours until Christmas. Our parents still have time to buy us presents IF we hurry. [a mountie appears]"
    },
    {
        "character": "Mountie",
        "line": "Ahoy there, travelers."
    },
    {
        "character": "Kyle",
        "line": "Who are you?"
    },
    {
        "character": "Mountie",
        "line": "I am Rick, the proud Canadian Mountie. [he's shown riding a sheep]"
    },
    {
        "character": "Sheep",
        "line": "Baaaah."
    },
    {
        "character": "Stan",
        "line": "I thought mounties were supposed to ride horses."
    },
    {
        "character": "Rick",
        "line": "[hangs his head a bit] Yes. Yes, we are. But our funding has been cut and now we're forced to ride..."
    },
    {
        "character": "Sheep",
        "line": "Baaaah."
    },
    {
        "character": "Cartman",
        "line": "But if you don't mind, we're in a rush to see the new Prime Minister."
    },
    {
        "character": "Rick",
        "line": "You're going to see the new Prime Minister. Oh, I would so like to meet him myself. It's his strange new laws that took our horses away. Perhaps I will go with you."
    },
    {
        "character": "Kyle",
        "line": "That's okay, we'd rather just go by ourselves."
    },
    {
        "character": "Rick",
        "line": "Follow me this way! We're going to see the Prime Minister, the Prime Minister of Canada!"
    },
    {
        "character": "Scott",
        "line": "[monitoring their progress over remote cameras] Power-hungry Americans! I'll fix you!"
    },
    {
        "character": "",
        "line": "Further down the Road, Rick and the boys pass through another town."
    },
    {
        "character": "Cartman",
        "line": "Oh Jesus, eighteen hours. We're running out of time!"
    },
    {
        "character": "Rick",
        "line": "All right boys, prepare yourselves. We're about to enter... French Canada."
    },
    {
        "character": "Kyle",
        "line": "French Canada?"
    },
    {
        "character": "French Canadians",
        "line": "[Before them, lots of French Canadians cavort like it is Euro Disney, with circus performers of all stripes doing what they do best.]\nThere'z no Canada like French Canada, it'z za bezt Canada in ze land.\nZe ozer Canada is hardly Canada. If you lived here for a day, you'd understand.\n\n\n"
    },
    {
        "character": "Mime",
        "line": "Honh honh honnnh! Welcome to French Canada."
    },
    {
        "character": "Hockey player",
        "line": "We have everything your heart could desire. Trapezes. Trampolines. And lots and lots of cheese."
    },
    {
        "character": "Artist",
        "line": "[takes off his mustache] Would you like a moustache?"
    },
    {
        "character": "Rick",
        "line": "Just stay calm, boys. French Canadians are a little... odd. [behind them, two of them walk by. One is dressed in blue and looks a bit like an alien. The other is dressed something like He-Man, with long flowing locks.]"
    },
    {
        "character": "Stan",
        "line": "Ah, we're just passing through to see the new Prime Minister."
    },
    {
        "character": "Mime",
        "line": "Well first you must answer that phone. [makes his left hand into a phone receiver] Ring-ring. Ring-ring."
    },
    {
        "character": "Kyle",
        "line": "We don't have time for this."
    },
    {
        "character": "Mime",
        "line": "You cannot pass through French Canada unless you take zat phone call! [holds out his \"phone\"] Ring-ring. Ring-ring. [Kyle responds by make his right hand into a phone and answering]"
    },
    {
        "character": "Kyle",
        "line": "Hello?"
    },
    {
        "character": "Mime",
        "line": "Allo. If you are going to see za new Prime Minister, then I want to go with you. He has passed a new law forbidding us French Canadians to drink wine."
    },
    {
        "character": "Artist",
        "line": "[walks up to the boys] How can ze French not drink wine?? Travestie!"
    },
    {
        "character": "Kyle",
        "line": "Okay, you can come with us."
    },
    {
        "character": "Mime",
        "line": "Honh honnnh! Very good! Let us make haste!"
    },
    {
        "character": "French Canadians",
        "line": "[they escort the boys out and on their way with the Mime and the Mountie]\nThere'z no Canada like French Canada, it'z za bezt Canada in ze land.\nAnd ze ozer Canada.\n\n\n"
    },
    {
        "character": "Mime",
        "line": "Is a bullshit Canada"
    },
    {
        "character": "French Canadians",
        "line": "If you lived here for a day, you'd understand. [the small group leaves the town behind]"
    },
    {
        "character": "Mime",
        "line": "I think you'd understand. ...You understand."
    },
    {
        "character": "",
        "line": "Newfoundland. The group arrives at a dark place."
    },
    {
        "character": "Rick",
        "line": "Oh my! This certainly is a desolate place!"
    },
    {
        "character": "Mime",
        "line": "It reminds me of death and fear."
    },
    {
        "character": "Cartman",
        "line": "How much further to Ottawa?! Christmas is only twelve hours away."
    },
    {
        "character": "Rick",
        "line": "We must be very close now."
    },
    {
        "character": "Scott",
        "line": "[jumps out in front of them] Ey! What are you doing?!"
    },
    {
        "character": "Rick",
        "line": "Waaaah!"
    },
    {
        "character": "Mime",
        "line": "Oh no. It's Scott."
    },
    {
        "character": "Scott",
        "line": "What are you two doing helping these Americans?! Don't you know America thinks it owns Canada along with the rest of the world?!"
    },
    {
        "character": "Rick",
        "line": "You're a dick, Scott!"
    },
    {
        "character": "Scott",
        "line": "You're a dick! And by helping Americans, you're just as smelly as they are! Now I'm going to get you!"
    },
    {
        "character": "Fisherman",
        "line": "[exits a house with a fish in his left hand and a pole in his right] Not so fast, Scott!"
    },
    {
        "character": "Scott",
        "line": "Who the hell are you?!"
    },
    {
        "character": "Fisherman",
        "line": "I'm Steve the Newfoudlander. And you're on Newfoundland property now! Get off before I have you arrested!"
    },
    {
        "character": "Scott",
        "line": "Ugh! This isn't over! Not by a long shot! I'll fix you. I'll fix all of you!! [leaves in a huff. Steve draws closer to the group]"
    },
    {
        "character": "Rick",
        "line": "Woo, that was a close call. Thank you, kind Newfie!"
    },
    {
        "character": "Kyle",
        "line": "God-damnit, we need to get to the new Prime Minister! NOW!"
    },
    {
        "character": "Steve",
        "line": "Oh yeah, the Prime Minister, eh? He sure has screwed up things for Newfoundland. Life just hasn't been the same since he made sodomy illegal."
    },
    {
        "character": "Mime",
        "line": "Well, come with us! Maybe you can ask him to take his sodomy ban away."
    },
    {
        "character": "Kyle",
        "line": "Can we just get going, please?"
    },
    {
        "character": "Steve",
        "line": "Yeah, sure, except there's just one problem."
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Steve",
        "line": "You folks are goin' the wrong way."
    },
    {
        "character": "Stan",
        "line": "What?? But I thought there was one road in Canada."
    },
    {
        "character": "Steve",
        "line": "Yeah. And you all went the wrong direction on it."
    },
    {
        "character": "Rick",
        "line": "Ohh, that's right. Ottawa is that way. [points behind the group]"
    },
    {
        "character": "Mime",
        "line": "Of course. Ottawa left, Newfoundland right!"
    },
    {
        "character": "Stan",
        "line": "[grimacing] Oh no!"
    },
    {
        "character": "Cartman",
        "line": "[glaring at Rick] How could you be so stupid!"
    },
    {
        "character": "Kyle",
        "line": "There's no way we can go all the way back. We'll never make it now!"
    },
    {
        "character": "Rick",
        "line": "It's okay, boys. The power is inside us to get to Ottawa! We can wish ourselves there!"
    },
    {
        "character": "Mime",
        "line": "Ah yes, let's wish ourselves there. [the three Canadians close their eyes and wish real hard]"
    },
    {
        "character": "Rick",
        "line": "[peeks with his left eye] Is it working?"
    },
    {
        "character": "Cartman",
        "line": "Oh, God-damnit! Well I warned you Kyle! I told you if I missed Christmas we were gonna throw down! [puts up his fists] Well it's on! We're gonna have it our RIGHT NOW! [grabs Kyle by the collar]"
    },
    {
        "character": "Steve",
        "line": "[now in his boat at the end of a dock] Of course, we could always take my boat, eh?"
    },
    {
        "character": "Rick",
        "line": "Oh yes! On the river we could travel to Ottawa in no time!"
    },
    {
        "character": "Kyle",
        "line": "Well come on! [everyone hops into the boat]"
    },
    {
        "character": "Steve",
        "line": "Okay, next stop, the new Prime Minister. [the boat leaves the dock and goes on its way]"
    },
    {
        "character": "Kyle",
        "line": "Do you think we can still make it in time?"
    },
    {
        "character": "Cartman",
        "line": "We'd better, Kyle. Or you're dead."
    },
    {
        "character": "",
        "line": "The Parliament building, dawn. Steve and the rest of the party pull up to the small dock at one end of the grounds."
    },
    {
        "character": "Steve",
        "line": "Here we are at the Parliament buildin'."
    },
    {
        "character": "Mime",
        "line": "Ze Prime Minister is inside."
    },
    {
        "character": "Cartman",
        "line": "[hops off the boat and runs towards Parliament] Well come on, let's hurry! It's almost Christmas! [the rest of the group follows]"
    },
    {
        "character": "",
        "line": "The Parliament building, entrance. Kyle knocks on the heavy wooden doors. A wooden panel opens up to reveal a window. A doorman looks out through it."
    },
    {
        "character": "Doorman",
        "line": "Yes?"
    },
    {
        "character": "Kyle",
        "line": "We need to see the new Prime Minister."
    },
    {
        "character": "Doorman",
        "line": "Ha! Impossible! The new Prime Minister isn't seeing anybody! [slams the window shut]"
    },
    {
        "character": "Mime",
        "line": "Oh well, so much for zat. [turns around and slowly walks away]"
    },
    {
        "character": "Steve",
        "line": "Yeah, we gave it our best, but our best wasn't good enough, eh? [joins the Mime]"
    },
    {
        "character": "Kyle",
        "line": "No. No!! [knocks on the door again. Steve and the Mime turn around]"
    },
    {
        "character": "Doorman",
        "line": "[opens his window again] Yes?"
    },
    {
        "character": "Kyle",
        "line": "Please, sir. I traveled a long way to get here. He's the only person who can help me."
    },
    {
        "character": "Doorman",
        "line": "[a big smug] The Prime Minister isn't here. He's in China on official business. So you might as well go home. Good-bye!"
    },
    {
        "character": "Kyle",
        "line": "[turns around and walks off slowly] Then that's it. I'm... I'm never going to get my brother back. [sits down on the steps farther away from the door]"
    },
    {
        "character": "Cartman",
        "line": "And... I'm not going to get any Christmas presents. [sits on the steps]"
    },
    {
        "character": "Stan",
        "line": "And... I'm not gonna have a Christmas adventure. [sits between the two of them]"
    },
    {
        "character": "Kenny",
        "line": "(And I'm not gonna have last 5 days without death...) [his voice trails off and he joins the others on the steps. They all cry]"
    },
    {
        "character": "Doorman",
        "line": "[begins to cry with the boys] Oh please! Please stop crying."
    },
    {
        "character": "Cartman",
        "line": "[through his tears] I'm gonna kill you, Kyle."
    },
    {
        "character": "Doorman",
        "line": "All right all right, I was lying. The Prime Minister IS here."
    },
    {
        "character": "Kyle",
        "line": "[turns around] Really? [the boys stand and approach the doors]"
    },
    {
        "character": "Doorman",
        "line": "Yes yes. Come in. [opens the large wooden doors, and the group enters.]"
    },
    {
        "character": "",
        "line": "The Parliament building, inside. The group walks down a long hallway and approach a large sanctum with three fire pits. Two small ones burn before and on each side of the huge one, which sits at the center and has a holograph of the Prime Minister hovering over it"
    },
    {
        "character": "Prime Minister",
        "line": "I am the Prime Minister of Canada. What do you guys want?"
    },
    {
        "character": "Kyle",
        "line": "[after a few moments, steps forth] Sir, you recently passed a new law allowing parents who have given their children up for adoption to change their minds. My little brother was-"
    },
    {
        "character": "Scott",
        "line": "Not so fast! [soon appears with the Gintses]"
    },
    {
        "character": "Kyle",
        "line": "Ike!"
    },
    {
        "character": "Ike",
        "line": "Kyle!"
    },
    {
        "character": "Scott",
        "line": "Prime Minister, these are the child's Canadian parents! Their Canadian blood pumps through his veins! Would you send him back to America with those world-hungry scum?!"
    },
    {
        "character": "Kyle",
        "line": "Please, sir. I came because I don't think Ike belongs here. Family isn't about whose blood you have in you, family is about the people who cared about you and took care of you. We're not the same blood, but I love my little brother. We've taken care of him because he needed us to, and that makes us more family than anything. [Harry and Elise look at each other]"
    },
    {
        "character": "Prime Minister",
        "line": "That is a great speech, guy. But the answer is no! All of my new laws will stay in effect forever!"
    },
    {
        "character": "Scott",
        "line": "Haha, you lose, Americans!"
    },
    {
        "character": "Rick",
        "line": "Then, I suppose us mounties will never get our horses."
    },
    {
        "character": "Mime",
        "line": "And we won't get our wine."
    },
    {
        "character": "Steve",
        "line": "And we can't perform sodomy, eh?"
    },
    {
        "character": "Kyle",
        "line": "But why are you making such strange laws??"
    },
    {
        "character": "Prime Minister",
        "line": "I SAID GO! [a blast from his holographic eyes incinerates Kenny]"
    },
    {
        "character": "Kenny",
        "line": "(Aah!) [Kenny explodes and pieces of him splatter all over the boys]"
    },
    {
        "character": "Stan",
        "line": "Oh my God, they've killed Kenny!"
    },
    {
        "character": "Kyle",
        "line": "[walks over to the charred remains] You... bastards! [brushes off a bit of Kenny from his jacket] Wha, what the hell is wrong with you?? What kind of Prime Minister bases his decisions on hatred? [Stan dusts himself off] And, and takes away mounties' horses? [Stan notices a purple curtain nearby and walks over to it] And French people's wine? What the hell kind of Prime Minister are you, anyway?!"
    },
    {
        "character": "Prime Minister",
        "line": "I am the Prime Minister of Canada. [as he says this, Stan pulls the curtain back and Saddam Hussein appears behind it, cramped behind a console] I can do whatever I- [notices his cover is blown] Uh oh. Uh, don't mind that guy hiding in the spider hole, he's just my friend."
    },
    {
        "character": "Kyle",
        "line": "[the other members of the group gather in, as well as other people nearby] What the hell??"
    },
    {
        "character": "Rick",
        "line": "Hey, that looks like Saddam Hussein!"
    },
    {
        "character": "Saddam Hussein",
        "line": "Saddam Hussein?? Naw, relax, buddah. I'm not him."
    },
    {
        "character": "Mime",
        "line": "Zat explains everything! Za new Prime Minister was Saddam Hussein, once again trying to take over our beloved Canada like he did before."
    },
    {
        "character": "Soldier 1",
        "line": "Saddam Hussein?"
    },
    {
        "character": "Soldier 2",
        "line": "He was fooling us?"
    },
    {
        "character": "Businessman",
        "line": "Get him! [the soldiers quickly seize him and haul him away]"
    },
    {
        "character": "Saddam Hussein",
        "line": "Ahh, don't shoot. I want to negotiate. Hey, relax! [the crowd pounces on him and tear him apart] Gah!"
    },
    {
        "character": "Rick",
        "line": "Wait a minute. This means all the Prime Minister's new laws are null and void. We can have our horses back!"
    },
    {
        "character": "Mime",
        "line": "And we can drink our wine."
    },
    {
        "character": "Steve",
        "line": "And I can sodomize me boys again"
    },
    {
        "character": "Harry",
        "line": "[brings Ike over to Kyle] Young man, you... must really care for Peter to have come all this way."
    },
    {
        "character": "Elise",
        "line": "Perhaps we were wrong to try and take Peter back. He doesn't belong here. He belongs with his family."
    },
    {
        "character": "Harry",
        "line": "[gently drops Ike to the floor] Peter, would you like to go back to your home in Colorado? [Ike walks over to Kyle and hugs him. Kyle returns the hug, and the Gintses hug as well, looking at the bond between Kyle and Ike. An alarm goes off. Cartman looks at his watch]"
    },
    {
        "character": "Stan",
        "line": "What is that?"
    },
    {
        "character": "Cartman",
        "line": "It's Christmas. We officially missed it. It's Christmas Day and ... I'm in Canada."
    },
    {
        "character": "Kyle",
        "line": "Well yeah, but ah-I got my brother back."
    },
    {
        "character": "Cartman",
        "line": "Yeah! You got your brother back, but I didn't get any presents! [takes off his mittens] And what did I tell you, Kyle?! [unbuttons his jacket, takes it off, and bunches it up] I told you that if we didn't make it back in time for Christmas I was gonna whup your ass, didn't I?! [tosses his jacket away]"
    },
    {
        "character": "Kyle",
        "line": "Dude, come on."
    },
    {
        "character": "Cartman",
        "line": "Well now you're gonna get it, motherfucker! That's right! You and me! Right now! [puts up his fists] We're havin' it out! Let's go! Come on! Come on!! [Kyle puts up his fists and gives Cartman a quick right hook across the face. Cartman blinks a few times and begins to bawl while he's crying.] Mooooooom! Moooooooom!"
    },
    {
        "character": "Rick",
        "line": "Hey, come on, boys! You can spend Christmas with us, Canada style!"
    },
    {
        "character": "",
        "line": "Ottawa, day. A Christmas parade goes by and the crowds cheer and throw confetti. Saddam is paraded on his own float, with huge candy canes around him."
    },
    {
        "character": "Canadians",
        "line": "Ding dong, they caught Saddam! Merry Christmas to the world!\nDing dong, the Americans caught Saddam!\n[Santa's sleigh passes by and the boys are hoisted into it]\nNow Canada is free for you and you and me\nIt's the best Christmas presents we ever got\nCanadian Christmas, it's the best! We drink and dance and show our breasts!\nLet's celebrate! Saddam Hussein's been caught!\n\n\n"
    },
    {
        "character": "Stan",
        "line": "[sighs] Oh well. Maybe we'll get to have a Christmas adventure next year. [Cartman holds a towel over his left nostril, which is bleeding]"
    }
]