[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Cartman's house, day. A minivan rocks gently on the street. Inside, the boys make their interpretations of spaceship noises. Being the good boys that they are, they're strapped in. They're wearing football helmets and makeshift Starfleet uniforms."
    },
    {
        "character": "Cartman",
        "line": "[in the driver's seat] Captain Cartman reporting from Shuttlecraft Spontaneity. Approaching planet Omega Nine."
    },
    {
        "character": "Stan",
        "line": "Warp drive disengaged. Landing sequence initiated."
    },
    {
        "character": "Cartman",
        "line": "What kind of atmosphere are you reading on the planet surface, Jew?"
    },
    {
        "character": "Kyle",
        "line": "I'm a Vulcan!"
    },
    {
        "character": "Cartman",
        "line": "All right, what kind of atmosphere are you reading, Vulcan Jew?"
    },
    {
        "character": "Kyle",
        "line": "[looking into an imaginary viewer] The atmosphere is oxygen-based, should support our breathing."
    },
    {
        "character": "Cartman",
        "line": "All right, hang on. We're about to land. [the boys make landing noises, with Stan finishing off with a thump. Cartman removes his seatbelt] Okay, First Officer Stan and Engineer Kenny, you come with me on the away team. Vulcan Jew Kyle will wait here."
    },
    {
        "character": "Kyle",
        "line": "No! I'm on the away team too! [he and Kenny remove their belts]"
    },
    {
        "character": "Cartman",
        "line": "[looks back] It's my Mom's new minivan, so I'm the captain, Kyle!"
    },
    {
        "character": "Kyle",
        "line": "I don't care! You're not making me wait in the van again!"
    },
    {
        "character": "Cartman",
        "line": "Fine, Kyle! But if something goes wrong out there on the planet surface, don't hold me responsible."
    },
    {
        "character": "",
        "line": "The side door slides open. Cartman leads the other three out."
    },
    {
        "character": "Cartman",
        "line": "Set phasers on stun."
    },
    {
        "character": "Stan",
        "line": "Things seem pretty quiet."
    },
    {
        "character": "Cartman",
        "line": "Yes. A little too quiet."
    },
    {
        "character": "Kyle",
        "line": "I am picking up carbon-based life forms in Sector C. I believe we will find a village of peaceful aliens over that ridge. [Cartman sighs silently]"
    },
    {
        "character": "Cartman",
        "line": "Okay, fine, I guess we'll look for- Oh no!! Look out! It's a giant four-headed lava frog! Shoot it! [the boys take their positions and start firing away] Oh no, it got Kyle!"
    },
    {
        "character": "Kyle",
        "line": "[stops firing and stands still] No it doesn't. [the other boys continue with their phaser noises]"
    },
    {
        "character": "Cartman",
        "line": "Aw, it got Kyle and it's tearing his head off! [pretends to be the monster ripping Kyle's head off] Aw you guys, it looks like Kyle is done for!"
    },
    {
        "character": "Kyle",
        "line": "No I'm not! God damn it Cartman, you're not gonna kill me off again!"
    },
    {
        "character": "Cartman",
        "line": "Agh! You see guys, this is why you don't bring Jews along on the away team: they don't play along!"
    },
    {
        "character": "Kyle",
        "line": "Shut up about Jews, fatass! You don't know anything!"
    },
    {
        "character": "Stan",
        "line": "Oh God, here we go again."
    },
    {
        "character": "Cartman",
        "line": "Oh yeah?! I saw Mel Gibson's movie, The Passion, and Mel Gibson says, in the movie, Jews are the Devil!"
    },
    {
        "character": "Kyle",
        "line": "He does not!"
    },
    {
        "character": "Cartman",
        "line": "How do you know?! I've seen The Passion thirty-four times now, Kyle! You haven't seen it once! There's even one part where the Jews have a chance to save Jesus, and you know what they do? They let Barabbas, a serial killer, go free instead and laugh about it."
    },
    {
        "character": "Kyle",
        "line": "Naw uh!"
    },
    {
        "character": "Cartman",
        "line": "Go see the movie, Kyle!"
    },
    {
        "character": "Stan",
        "line": "That does it! I'm sick of you guys arguing about The Passion! I'm out of here."
    },
    {
        "character": "Kenny",
        "line": "(Me too!) [they leave]"
    },
    {
        "character": "Kyle",
        "line": "I'm not arguing about The Passion! He's being an asshole!"
    },
    {
        "character": "Cartman",
        "line": "You know what it is? You're scared. You're scared of the truth. You don't want that movie to show you just how bad the Jews are, and why everyone hates you."
    },
    {
        "character": "Kyle",
        "line": "People don't hate the Jews!"
    },
    {
        "character": "Cartman",
        "line": "[focuses Kyle's attention to him] Really? Three hundred million domestic box-office, Kyle. The top-grossing film of all time, Kyle. Those numbers don't lie. If you're not scared of The Passion then go see it. Go see it and tell me I'm wrong. Mel Gibson, Kyle. Mel Gibson."
    },
    {
        "character": "Kyle",
        "line": "...You're a stupid asshole! [turns and walks off. Cartman turns left and glances at Kyle]"
    },
    {
        "character": "Cartman",
        "line": "Sweet, now I can just play with myself. [fires off his phaser] Pewpeww-pewww! Get back in the shuttlecraft! [races into the minivan]"
    },
    {
        "character": "",
        "line": "The Bijou, day. Mel Gibson's The Passion of The Christ is now playing. Kyle walks up to the ticket booth, stops, turns back, stops again, and steps up to the window. He gives the ticket salesman $10."
    },
    {
        "character": "Kyle",
        "line": "One please."
    },
    {
        "character": "Ticket Salesman",
        "line": "This is an R-rated movie."
    },
    {
        "character": "Kyle",
        "line": "Yeah, I know, but I have to-"
    },
    {
        "character": "Ticket Salesman",
        "line": "But, because this is such an important film that actually depicts the selfless act of Jesus Christ, I'll let you in to see it."
    },
    {
        "character": "Kyle",
        "line": "...Thanks. [makes his way towards the doors, glancing back at the cashier in wonder]"
    },
    {
        "character": "",
        "line": "The Bijou, inside. Kyle enters and makes his way to a seat. He watches."
    },
    {
        "character": "Soldier 1",
        "line": "Hac bashtud Christo."
    },
    {
        "character": "Soldier 2",
        "line": "Et lac Hesus. Belaca veshtad."
    },
    {
        "character": "Jesus",
        "line": "Wa! [the whipping begins and Jesus screams. This goes on for a long time. Kyle's mouth widens, his eyes get bigger. The next scene, he's got his coat over his mouth and he's almost in a fetal position. The next scene has him turned to his left, grimacing, his hat pulled over his ears as he winces. The next scene has him trembling]"
    },
    {
        "character": "Kyle",
        "line": "Haaaah! [Next scene has Kyle with his eyes squeezed shut and his hands over his face. He's now curled up in a ball]"
    },
    {
        "character": "Jesus",
        "line": "Non. Non. Nono, non, non, WAAAAHH!! [the whipping continues and Kyle dares to peek again. His stomach reacts and he vomits. The next scene has him almost passed out with vomit dribbling from his chin. The film ends and Kyle doesn't move.]"
    },
    {
        "character": "",
        "line": "The Bijou, outside. Kyle walks outside in a daze."
    },
    {
        "character": "Kyle",
        "line": "How? How could the Jews do that to Jesus?"
    },
    {
        "character": "Ticket Salesman",
        "line": "Pretty brutal, isn't it? Kinda wanna make you change your life, huh?"
    },
    {
        "character": "",
        "line": "Cartman's house, day. He's on the couch eating cereal."
    },
    {
        "character": "Announcer",
        "line": "And now, back to Terrance and Phillip. [the doorbell rings]"
    },
    {
        "character": "Phillip",
        "line": "Hey Terrance, I think I have a-"
    },
    {
        "character": "Cartman",
        "line": "Mom! Doorbell!"
    },
    {
        "character": "Terrance",
        "line": "Wait, before you do, pull my thumb. [a second laughter and laughter is heard.]"
    },
    {
        "character": "Cartman",
        "line": "[the doorbell rings] Mom! Answer the door!"
    },
    {
        "character": "Terrance",
        "line": "Hey Phillip, guess what?"
    },
    {
        "character": "Cartman",
        "line": "God damn it, lazy-ass whore. [gets up and answers the door himself.]"
    },
    {
        "character": "Phillip",
        "line": "What?"
    },
    {
        "character": "Terrance",
        "line": "Faaart.[Terrance farts. Cartman opens the door and sees Kyle soaking wet from the heavy rain]"
    },
    {
        "character": "Kyle",
        "line": "You were right. You were right all along. I thought you were just an asshole when you ripped on Jews, but... I didn't know, I... I didn't know."
    },
    {
        "character": "Cartman",
        "line": "It's okay, Kyle. It's okay. Just... say that first part again?"
    },
    {
        "character": "Kyle",
        "line": "You were, you were right?"
    },
    {
        "character": "Cartman",
        "line": "[closes his eyes and relishes the moment] Mmm, one more time, Kyle."
    },
    {
        "character": "Kyle",
        "line": "You were right. [Cartman opens his eyes and beams brightly]"
    },
    {
        "character": "",
        "line": "Cartman's house, his bedroom. Cartman's on his knees."
    },
    {
        "character": "Cartman",
        "line": "I want to thank you for all the blessings you have brought me. You have shown me the way so many times in the past and... now you are making all my dreams come true. You give me strength when there is doubt, and I praise you for all you have done. [a shot of Mel Gibson's poster, without the \"Braveheart\" on it.] Only you, Mel Gibson, have had the wisdom and the courage to show the world the truth. From this day forward I will dedicate my life to making sure your film is seen by everyone. I will organize the masses so that we may do thy bidding. Hail Mel Gibson. Amen."
    },
    {
        "character": "",
        "line": "Stan's house. He and Kenny are in his bedroom reading a newspaper."
    },
    {
        "character": "Stan",
        "line": "Look at that, dude. The Passion has made almost 400 million dollars at the box office now."
    },
    {
        "character": "Kenny",
        "line": "(Goddamn.)"
    },
    {
        "character": "Stan",
        "line": "[rises] Everyone in the country's gonna see that movie. I guess... we have to go see it too."
    },
    {
        "character": "",
        "line": "The Bijou, day. No clouds around. Stan and Kenny sit inside in the middle, looking at the movie. The movie ends."
    },
    {
        "character": "Stan",
        "line": "Dude. That movie sucked."
    },
    {
        "character": "Kenny",
        "line": "(Yeah, it totally sucked!)"
    },
    {
        "character": "Stan",
        "line": "How can they even call that a movie?"
    },
    {
        "character": "Kenny",
        "line": "(I don't know!)"
    },
    {
        "character": "Stan",
        "line": "That's bullcrap dude, let's go get our money back."
    },
    {
        "character": "Kenny",
        "line": "(Yeah!) [they leave their seats]"
    },
    {
        "character": "",
        "line": "The Bijou, outside. A couple emerges."
    },
    {
        "character": "Jack",
        "line": "Wow, I didn't realize how horrible Christ's death was."
    },
    {
        "character": "Elise",
        "line": "Me neither. Oh honey, let's be good Christians from now on! [they walk off, screen left. A second couple emerges]"
    },
    {
        "character": "Man 1",
        "line": "[brown shirt, green sweater] I think if more people saw The Passion they'd have faith in Jesus."
    },
    {
        "character": "Woman 1",
        "line": "[orange blouse, necklace] Yeah, it really guilt-trips you into believing. [they walk off, screen right. Stan and Kenny come out and approach the window]"
    },
    {
        "character": "Stan",
        "line": "Hey, we want our money back."
    },
    {
        "character": "Ticket Salesman",
        "line": "Huh?"
    },
    {
        "character": "Stan",
        "line": "That movie sucked ass. Give us back our eighteen dollars."
    },
    {
        "character": "Ticket Salesman",
        "line": "I can't refund your money. You sat through the whole movie."
    },
    {
        "character": "Stan",
        "line": "That wasn't a movie, that was a snuff film!"
    },
    {
        "character": "Kenny",
        "line": "(Yeah!)"
    },
    {
        "character": "Stan",
        "line": "You can't charge people to watch a guy get tortured for two hours!"
    },
    {
        "character": "Ticket Salesman",
        "line": "That guy happened to be Jesus, and he went through all that to pay for your sins!"
    },
    {
        "character": "Stan",
        "line": "We go to church to learn that stuff! We go to movies to be entertained! We weren't entertained, and we want our money back!"
    },
    {
        "character": "Ticket Salesman",
        "line": "I'm not allowed to give you your money back after you sat through the whole movie! You'd have to take your complaint up with the film's producers."
    },
    {
        "character": "Stan",
        "line": "W-what? Mel Gibson? You're saying we have to get our money back from Mel Gibson?"
    },
    {
        "character": "Ticket Salesman",
        "line": "Yeah. I'd like to see you try."
    },
    {
        "character": "Stan",
        "line": "Oh, we will! This is America! And in America, if something sucks, you're supposed to be able to get your money back! Come on, Kenny! [he and Kenny storm off]"
    },
    {
        "character": "",
        "line": "Kyle's house, night. Kyle tosses and turns while asleep. Scenes from the movie fill his mind: Jesus carrying the cross past the high priests, who have scowling faces. Flashes of Renaissance Passion art go by."
    },
    {
        "character": "Priests",
        "line": "Kill him! Guilty! Kill him! [sketches of a nail driven through the left palm are animated, then a realistic view of Jesus crucified] Kill him! Kill him! Die!"
    },
    {
        "character": "Kyle",
        "line": "Kill Jesus! Yesss! Arrrgh! [a spear pierces Jesus' side. The one piercing him is Kyle himself, who seems to be relishing this, as he pierces Jesus a few more times. A review of images, then an image of Alan Alda, and Kyle wakes up frightened. After a few screams he looks around]"
    },
    {
        "character": "",
        "line": "Stan's house, day. Stan and Kenny are at Stan's computer."
    },
    {
        "character": "Stan",
        "line": "Okay, search for Mel Gibson. Mel Gibson bio, Mel Gibson news, Mel Gibson... home page. Here we go. [clicks on the link] Welcome to Mel Gibson's ThePassion.com, your source for everything Mel. Pictures, philosophy, upcoming projects. Damn it, no phone number! Oh wait! \"For more information on Mel Gibson, call the Webmaster at 1-800-43..\" Okay, okay, wait, here we go. [picks up the phone and dials in]"
    },
    {
        "character": "",
        "line": "MEL GIBSON FAN CLUB LINE"
    },
    {
        "character": "",
        "line": "The phone rings. Cartman answers."
    },
    {
        "character": "Cartman",
        "line": "Mel Gibson's The Passion Fan Club."
    },
    {
        "character": "Stan",
        "line": "Hi, uh, my friend and I just went to see The Passion."
    },
    {
        "character": "Cartman",
        "line": "Uh huh, and so you want to join the fan club now. Our first meeting is at 5:30 p.m."
    },
    {
        "character": "Stan",
        "line": "No, no, no, no, we want our money back."
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Stan",
        "line": "We think the movie sucked and we want Mel Gibson to give us back our eighteen dollars. Do you know how we can get in touch with him?"
    },
    {
        "character": "Cartman",
        "line": "You thought it sucked? Sir, apparently, you don't understand what Mel Gibson was trying to do! He was trying to express, through cinema, the horror and filthiness of the common Jew. It has made people the world over open their eyes."
    },
    {
        "character": "Stan",
        "line": "Look, kid, we just thought it was a bad movie, so tell us how to get in touch with Mel Gibson so we can get our money back!"
    },
    {
        "character": "Cartman",
        "line": "If I knew where Mel Gibson was, I'd be down on the floor licking his balls at this very moment, sir. All I know is he lives somewhere in Malibu. Now stop wasting me and Mel Gibson's time, you little wussy prick."
    },
    {
        "character": "Stan",
        "line": "Hey, don't take that tone with me, kid! I'll kick your ass!"
    },
    {
        "character": "Cartman",
        "line": "Oh yeah?! I'd like to see you try, asshole! I'm like six feet tall!"
    },
    {
        "character": "Stan",
        "line": "I don't care! You sound like a little bitch to me!"
    },
    {
        "character": "Cartman",
        "line": "Bitch?! Don't call me bitch! I'll pop your fuckin' head open!"
    },
    {
        "character": "Stan",
        "line": "Yeah?! You wanna bring it, you little pussy?!"
    },
    {
        "character": "Cartman",
        "line": "I already brought it, bitch! I brought it, set it down on the table and opened it, bitch!"
    },
    {
        "character": "Stan",
        "line": "[in recognition] Wait a minute. Cartman?! [realizing he's been recognized, Cartman is speechless]"
    },
    {
        "character": "Cartman",
        "line": "Eup. [hangs up and skulks away]"
    },
    {
        "character": "Stan",
        "line": "[packing] Come on, Kenny, we're going to Malibu!"
    },
    {
        "character": "Kenny",
        "line": "(Malibu? But how?)"
    },
    {
        "character": "Stan",
        "line": "We'll take the bus! Look, this isn't about the eighteen dollars ticket money anymore. This is about being able to hold bad filmmakers responsible! [He leads Kenny out of his room] This is just like when we got our money back for BASEketball!"
    },
    {
        "character": "",
        "line": "Cartman's house, day. Cartman dons a Nazi outfit, taking care to look sharp."
    },
    {
        "character": "Liane",
        "line": "Eric, sweetie, there's a bunch of people showing up in our backyard saying something about a meeting?"
    },
    {
        "character": "Cartman",
        "line": "Yeah Mom, I'm holding a meeting for all the people who loved The Passion as much as I did."
    },
    {
        "character": "Liane",
        "line": "Oh, that's great, sweetie."
    },
    {
        "character": "Cartman",
        "line": "[turns right so his profile will look sharp as well] Tell them I'll be down shortly"
    },
    {
        "character": "Liane",
        "line": "Okay, hon."
    },
    {
        "character": "Cartman",
        "line": "[wields his short whip]Töten sie die Juden. Wir können nicht still stehen bis sie alle tot sind! Okay, I'm ready. I'm ready to do thy bidding, Mel Gibson. [a shot of the poster.]"
    },
    {
        "character": "",
        "line": "Cartman's backyard. Some people are seated, others chat, others help themselves to chips and fingerfoods."
    },
    {
        "character": "Man 1",
        "line": "Hello, are you folks holding this Passion meeting?"
    },
    {
        "character": "Jack",
        "line": "No. Actually, we're guests as well. I'm Jack Garrett and this is my wife Elise."
    },
    {
        "character": "Elise",
        "line": "Hello."
    },
    {
        "character": "Man 2",
        "line": "I think it's so great that someone took the initiative to have a meeting like this."
    },
    {
        "character": "Elise",
        "line": "Oh I agree. There are so many of us who are moved by The Passion. It's a perfect idea to have us organize so we can strengthen the Christian community."
    },
    {
        "character": "Man 2",
        "line": "And apparently the organizer is just an eight year old boy who was touched by the film."
    },
    {
        "character": "Jack",
        "line": "Leave it to a child to show us all the way, huh?"
    },
    {
        "character": "Ticket Salesman",
        "line": "Yeah, so I see this ad on the Internet saying if you love The Passion to come to this meeting, so here I am!"
    },
    {
        "character": "Woman 2",
        "line": "It's great that everyone came here to figure out how to use The Passion to enrich everyone's lives. [Cartman approaches the dais.]"
    },
    {
        "character": "Cartman",
        "line": "Ah, hello everyone. Achtung. [the last few standing people take their seats] My name is Eric Cartman and I'm the President of the Mel Gibson Fan Club. [applause] Ah thank you, thank you. I'm happy to see that all of you.were affected by The Passion like I was. Now, we all know why we're here, and I believe we all what needs to be done."
    },
    {
        "character": "Woman 3",
        "line": "[in pink dress] We sure do. [the crowd voices its approval]"
    },
    {
        "character": "Cartman",
        "line": "But, I think it's best we don't talk out loud about it until we have most of them on the trains heading to the camps. [the guests fall silent]"
    },
    {
        "character": "Elise",
        "line": "[in orange blouse] Wha- what does that mean, sweetie?"
    },
    {
        "character": "Jack",
        "line": "I'm not sure, but- uh. [stands up] Folks, I just wanna interrupt for a second and say how remarkable it is that this little boy brought us all together. The Passion is causing a revolution of spirituality, and we owe Mel Gibson and this little boy our thanks. [the crowd voices its approval]"
    },
    {
        "character": "Cartman",
        "line": "[bows a few times] Thank you, thank you very much. Now, in order to do what we [his face turns ugly] all know needs to be done, we are first going to need more support. I think we should all go out and take at least one other person to see The Passion."
    },
    {
        "character": "Man 3",
        "line": "Oh, what a great idea! We each make it our responsibility to convert one more person!"
    },
    {
        "character": "Guests",
        "line": "Heheh, great! Yeah! Great idea."
    },
    {
        "character": "Cartman",
        "line": "Yes, and then we can begin the cleansing, if you know what I mean."
    },
    {
        "character": "Ticket Salesman",
        "line": "We sure do!"
    },
    {
        "character": "Guests",
        "line": "Yeah. All right. Woohoo!"
    },
    {
        "character": "",
        "line": "Mel's Malibu mansion, day. A rusty Beetle rolls up to the front security gate, stops, and lets out some passengers, then rolls away. Stan and Kenny remain."
    },
    {
        "character": "Stan",
        "line": "Thank you. [looks over his Map To The Stars' Homes] This must be the place. [they walk through a side door right under a guard's nose. He fails to notice them. They walk up the driveway and past the massive fountain] Goddamn, Mel Gibson must be loaded. [rings the doorbell. The door opens and Mel appears]"
    },
    {
        "character": "Mel",
        "line": "Yes?"
    },
    {
        "character": "Stan",
        "line": "Oh, hi, uh, my name is Stan, and this is Kenny."
    },
    {
        "character": "Kenny",
        "line": "(Hello.)"
    },
    {
        "character": "Stan",
        "line": "Uh, we saw your movie, The Passion, and we didn't like it, so, can we have our money back, please?"
    },
    {
        "character": "Mel",
        "line": "You can't not like The Passion! I just followed the Bible! Christ died for you. Go home. [leaves, but the boys follow him in.]"
    },
    {
        "character": "",
        "line": "Mel Gibson's mansion, inside."
    },
    {
        "character": "Stan",
        "line": "Look, dude, we came a long way. We're not leaving until you give us our money."
    },
    {
        "character": "Mel",
        "line": "Oh yeah? Well you're gonna have to find it first. [unbuttons his shirt] But I won't tell you where I keep my money. [takes off his shirt] You can torture me all you want, I still won't tell you!"
    },
    {
        "character": "Stan",
        "line": "Tor- torture you?"
    },
    {
        "character": "Mel",
        "line": "[removes his pants and socks] Ha! So you do intend to torture me, huh?! [runs up to a torture rack and lies down in it] Well go ahead! Do your worst! [shackles himself in] You still won't get your ticket money back! I can take whatever you can dish out!"
    },
    {
        "character": "Stan",
        "line": "We don't want to torture you."
    },
    {
        "character": "Mel",
        "line": "I get it, but you don't have a choice, is that it?! Well go ahead! I just sure hope you don't use those whips over there on the wall!"
    },
    {
        "character": "Stan",
        "line": "Dude, can we please just have the eighteen dollars back from you?"
    },
    {
        "character": "Mel",
        "line": "[unshackles himself and walks up to the boys] I have to use that money to build my church! I brought the fire and brimstone back to Christianity with The Passion and now I'm gonna start my own church! And do you know why?! So I can play banjo! [whips out a hat and banjo, puts on the hat, and starts playing] Jesus, oh how I love ya, how I love ya Jesus!"
    },
    {
        "character": "Stan",
        "line": "Dude, this guy is freakin' daffy!"
    },
    {
        "character": "Mel",
        "line": "How dare you call me crazy! This means war! [jumps up and whoops like an Indian, twirls around a few times, and fires off blanks at the boys. Stan and Kenny run]"
    },
    {
        "character": "",
        "line": "South Park Church, rectory. Fr. Maxi sits at his desk explaining things to Kyle."
    },
    {
        "character": "Father Maxi",
        "line": "And so it was that God sent his only son down from heaven, to die for our sins."
    },
    {
        "character": "Kyle",
        "line": "Oh okay, but did God sent Jesus TO die, or did Jesus just get kind of screwed over."
    },
    {
        "character": "Father Maxi",
        "line": "...What is troubling you, my child?"
    },
    {
        "character": "Kyle",
        "line": "Well, I have this friend, see? And this friend belongs to a certain, Chosen People of Israel. And it... so happens that these chosen people killed your Lord."
    },
    {
        "character": "Father Maxi",
        "line": "Ah! You mean he's a Jew!"
    },
    {
        "character": "Kyle",
        "line": "Right. But he can't live with the guilt anymore. Because, even if Jesus wasn't really the Son of God, he was still a nice guy. And he didn't deserve what happened to him in Mel Gibson's movie. I I can't sleep at night. I mean, my... friend can't sleep at night."
    },
    {
        "character": "Father Maxi",
        "line": "Yes, The Passion is very powerful. The truth is, there's not a whole lot in the Bible about the Crucifixion. The Passion was actually done as a performance piece back in the Middle Ages to incite people against the Jews."
    },
    {
        "character": "Kyle",
        "line": "But how can the Jews make it better??"
    },
    {
        "character": "Father Maxi",
        "line": "Well, if you really care about your friend's soul, then perhaps show him the way of Jesus. Remember: Christianity is about atonement."
    },
    {
        "character": "Kyle",
        "line": "Wait. That's it. Atonement. Of course. [gets off the chair] I know what I have to do now. Thank you, Father. [turns and walks out]"
    },
    {
        "character": "",
        "line": "Back at Mel's mansion, Stan and Kenny are still running from Mel, who's chasing after them in a cartoonish way. Mel passes a mirror, then gets back to it a second later."
    },
    {
        "character": "Stan and Kenny",
        "line": "Aaaah!"
    },
    {
        "character": "Mel",
        "line": "Two days ago, I saw a vehicle that would haul that tanker. You wanna get outta here? Talk to me. [resumes hopping like a mad rabbit]"
    },
    {
        "character": "Stan",
        "line": "Mel Gibson is fucking crazy dude! [catches a glimpse of a wallet on a table] Wait! There's his wallet! [runs up to it with Kenny]"
    },
    {
        "character": "Mel",
        "line": "Freedom! [Stan grabs the wallet and rifles through it]"
    },
    {
        "character": "Stan",
        "line": "Awww crap, he's only got twenties! You got two dollars, Kenny? [Kenny hands Stan $2]"
    },
    {
        "character": "Mel",
        "line": "Jesus is Lord! [Stan puts the $2 in and takes out $20]"
    },
    {
        "character": "Stan",
        "line": "All right, let's get the hell out of here! [heads for the doors and opens one. Mel dances in wearing a Carmen Miranda outfit. Stan and Kenny head for another pair of doors. Stan opens it and Mel enters dressed as a clown]"
    },
    {
        "character": "Mel",
        "line": "When you're a clown, nobody takes you seriously!"
    },
    {
        "character": "",
        "line": "Outside."
    },
    {
        "character": "Stan",
        "line": "Aah! Run, dude, run!"
    },
    {
        "character": "Mel",
        "line": "[hopping out behind them, in Braveheart face paint and wielding a sword] K'plagh! K'plagh! And good evening, frieeeeeeends!"
    },
    {
        "character": "",
        "line": "The Bijou, day. A large cross is erected atop the Bijou sign. A crowd gathers and acclaims it."
    },
    {
        "character": "Cartman",
        "line": "One month ago today, this amazing film opened in theaters. And now, we proud few gather here as a people brought together by its message! [some applause] Fellow fans of Mel Gibson, our numbers have grown and now, together, we have the power to change the world! [the crowd applauds] Now I believe we should take to the streets and march in unwavering support of this important movie!"
    },
    {
        "character": "Ticket Salesman",
        "line": "Woah! Great idea!"
    },
    {
        "character": "Man 3",
        "line": "It'll be like a parade!"
    },
    {
        "character": "Man 4",
        "line": "Good idea!"
    },
    {
        "character": "Cartman",
        "line": "And as we march for The Passion we should also voice our support! So, when I say \"Es ist Zeit für Säuberung,\" you all chant back \"Wir müssen die Juden ausrotten.\""
    },
    {
        "character": "Elise",
        "line": "Well, what does that mean, dear?"
    },
    {
        "character": "Jack",
        "line": "Oh, I think it's Aramaic. You know, like in the movie."
    },
    {
        "character": "Ticket Salesman",
        "line": "Ooo, Aramaic. Cool."
    },
    {
        "character": "Townsfolk",
        "line": "Neato! That'll be awesome. Great!"
    },
    {
        "character": "Jack",
        "line": "What was our Aramaic line again?"
    },
    {
        "character": "Cartman",
        "line": "[pounds the table a few times] Wir müssen die Juden ausrotten!! [his hair gets messed up from the impacts]"
    },
    {
        "character": "Townsfolk",
        "line": "[repeats, gaining confidence with each syllable] Wir müssen die Juden ausrotten."
    },
    {
        "character": "Cartman",
        "line": "Es ist Zeit fër Rache!"
    },
    {
        "character": "Townsfolk",
        "line": "Wir müssen die Juden ausrotten."
    },
    {
        "character": "Elise",
        "line": "Oh, this is fun! [smiles]"
    },
    {
        "character": "Cartman",
        "line": "[picks a mark in front of the crowd] All right, everyone! Forward, march! [they all move forward] Es ist Zeit für Rache!"
    },
    {
        "character": "Townsfolk",
        "line": "Wir müssen die Juden ausrotten."
    },
    {
        "character": "Cartman",
        "line": "Es ist Zeit für Rache!"
    },
    {
        "character": "Townsfolk",
        "line": "Wir müssen die Juden ausrotten."
    },
    {
        "character": "Cartman",
        "line": "Nice."
    },
    {
        "character": "",
        "line": "A synagogue. A service is going on, and the synagogue is full."
    },
    {
        "character": "Rabbi",
        "line": "Shalom hak nak shalom. And now one of our fine young shlokas, Kyle Broflovski, has asked if he could speak to the congregation. [Kyle approaches the lectern]"
    },
    {
        "character": "Kyle",
        "line": "Thank you, rabbi. [Sheila smiles and gets Gerald's attention. Kyle clears his throat.] In 1973, the United States officially issued an apology to the African American community for slavery. In 1956, Germany officially apologized for World War II AND the Holocaust. And now, I believe, in 2004, the Jewish community needs to apologize for the death of Jesus."
    },
    {
        "character": "Man 4",
        "line": "What? [others murmur their shock]"
    },
    {
        "character": "Sheila",
        "line": "Whatwhatwhaaat?!"
    },
    {
        "character": "Kyle",
        "line": "If we as a people choose not to believe that Jesus is the Son of God, then we can still apologize for the brutal way in which he was killed, and take our share of the responsibility for it."
    },
    {
        "character": "Man 5",
        "line": "Oh my God! [the other congregants groan]"
    },
    {
        "character": "Gerald",
        "line": "Kyle, what on earth has gotten into you?!"
    },
    {
        "character": "Kyle",
        "line": "I saw The Passion!"
    },
    {
        "character": "Man 6",
        "line": "Oh no! The Passion?! [others murmur]"
    },
    {
        "character": "Man 7",
        "line": "This proves the anti-Semitic effect that movie is having!"
    },
    {
        "character": "Man 8",
        "line": "Yeah, it makes Jews into stereotypes."
    },
    {
        "character": "Man 9",
        "line": "Stereotyping Jews is terrible."
    },
    {
        "character": "Woman 4",
        "line": "Something must be done to stop that movie!"
    },
    {
        "character": "Rabbi",
        "line": "Now, now, everyone calm down. We live in a rational community, and everyone knows this is just a movie. There's no cause for alarm."
    },
    {
        "character": "Mob",
        "line": "[from outside] Wir müssen die Juden ausrotten!"
    },
    {
        "character": "Cartman",
        "line": "[from outside] Es ist Zeit für Rache! [congregants rise and face the doors in the back, others look out the windows. They see Cartman leading a march past the synagogue]"
    },
    {
        "character": "Mob",
        "line": "Wir müssen die Juden ausrotten!"
    },
    {
        "character": "Cartman",
        "line": "Es ist Zeit für Rache!"
    },
    {
        "character": "Mob",
        "line": "Wir müssen die Juden ausrotten! [the rabbi and his congregants look on, confused]"
    },
    {
        "character": "Cartman",
        "line": "Es ist Zeit für Rache!"
    },
    {
        "character": "",
        "line": "The southwest, desert territory. A tour bus heads east, with Stan and Kenny riding inside."
    },
    {
        "character": "Stan",
        "line": "Well it looks like with these bus tickets we spend about eighty... seven dollars getting our money back from Mel Gibson. [net loss, sixty-nine dollars] But I think it's the principle of the thing that matters."
    },
    {
        "character": "Kenny",
        "line": "(Yeah. I agree.) [a truck horn blows and Stan stands to see who it is. Kenny joins him]"
    },
    {
        "character": "Stan",
        "line": "Oh, you've got to be shittin' me. [Mel Gibson closes in fast in his Mad Max gas truck and wearing Braveheart face paint]"
    },
    {
        "character": "Mel",
        "line": "Give me back my money! [blows his horn again]"
    },
    {
        "character": "Stan",
        "line": "Goddamn, that guy's crazy. [hops off his seat and runs up to the driver] Hey dude, you've gotta speed up."
    },
    {
        "character": "Driver",
        "line": "Huh?"
    },
    {
        "character": "Stan",
        "line": "Mel Gibson is chasing after us. You've gotta go faster."
    },
    {
        "character": "Driver",
        "line": "Haha, very funny, kid. Sit down and stop playing games."
    },
    {
        "character": "Stan",
        "line": "I'm not playing games. Mel Gibson is right behind you and he's gonna- [Mel plows into the bus, making both vehicles screech. The riders sway in their seats]"
    },
    {
        "character": "Driver",
        "line": "What the hell?"
    },
    {
        "character": "Mel",
        "line": "[shaking his fist in the air] Haaaa! K'Plaaaa!"
    },
    {
        "character": "Driver",
        "line": "Hey! That's Mel Gibson!"
    },
    {
        "character": "Stan",
        "line": "Yeah. I told you that!"
    },
    {
        "character": "Driver",
        "line": "Well, what the hell does he want?!"
    },
    {
        "character": "Stan",
        "line": "He wouldn't give us our money back for The Passion, so we kinda took it."
    },
    {
        "character": "Driver",
        "line": "You didn't like The Passion? But it shows how Christ suffered for you. Mel Gibson is a very spiritual man. [Mel rams into them again]"
    },
    {
        "character": "",
        "line": "The Bijou, night. The synagogue's congregation moves quickly down the street towards the theater."
    },
    {
        "character": "Kyle",
        "line": "[to his parents] Both you guys, stop! Please. You're gonna make people hate us more!"
    },
    {
        "character": "Ticket Salesman",
        "line": "Can I help you?"
    },
    {
        "character": "Rabbi",
        "line": "This movie is causing anti-Semitism! You must remove it from your theater!"
    },
    {
        "character": "Congregants",
        "line": "That's right! Yeah! Remove your movie!"
    },
    {
        "character": "Shlomo",
        "line": "Remove it from the theater? Fat chance!"
    },
    {
        "character": "Man 10",
        "line": "We demand you stop showing it!"
    },
    {
        "character": "Congregants",
        "line": "Yeah! Yeah!"
    },
    {
        "character": "Kyle",
        "line": "[facing the congregants] No, no, no! Don't become an angry mob! [behind him Cartman is seen leading his mob to the theater] The last time we did that we killed Jesus!"
    },
    {
        "character": "Cartman",
        "line": "[points] Juden!"
    },
    {
        "character": "Jack",
        "line": "What's going on here?"
    },
    {
        "character": "Ticket Salesman",
        "line": "They're trying to have The Passion pulled from the theater."
    },
    {
        "character": "Rabbi",
        "line": "This film is anti-Semitic and it must be stopped!"
    },
    {
        "character": "Man 11",
        "line": "Nonsense! Mel Gibson is a smart and spiritual man! There's nothing anti-Semitic about it!"
    },
    {
        "character": "Elise",
        "line": "It has reaffirmed all of our faith in Christ."
    },
    {
        "character": "Rabbi",
        "line": "It's made one of our little Jewish boys want to apologize for the death of Jesus!"
    },
    {
        "character": "Jack",
        "line": "Well, maybe you should apologize."
    },
    {
        "character": "Mob",
        "line": "That's right! What he said."
    },
    {
        "character": "Woman 5",
        "line": "How dare you?! [the sound of a truck is faintly heard, but gets stronger.]"
    },
    {
        "character": "Kyle",
        "line": "[noticing] Look out!! [The crowds move to the other side of the street as the tour bus skids to a stop just past the theater. Mel Gibson roars into town and crashes into the ticket booth, and his gas truck blows up. The crowds crawl out of their safety places and merge]"
    },
    {
        "character": "Mel",
        "line": "Give me my eighteen dollars!"
    },
    {
        "character": "Cartman",
        "line": "Mel! Gibson! [brightens and approaches him, then grovels at his feet] Oh mein Savior! Mein Führer! You're actually here! Mr. Gibson, I have assembled the masses! We are ready to do thy bidding! [grovels some more] Have I been a good boy, Mr. Gibson?!"
    },
    {
        "character": "Mel",
        "line": "Ha! [ignores Cartman and walks up to Stan and Kenny] So! You boys have led me here to your secret base, huh? I guess now you're gonna start torturing me! Well! [grabs his nipples and falls on his knees. The crowd steps back as he twists his nipples] Oh, my nipples are so tender! Don't squeeze them anymore!"
    },
    {
        "character": "Ticket Salesman",
        "line": "That's... Mel Gibson?"
    },
    {
        "character": "Jack",
        "line": "H- he's not... quite as eloquent as I had pictured."
    },
    {
        "character": "Mel",
        "line": "[backs up towards a building] Yeah... [grabs a piece of crap from his ass and removes it from his briefs, turns around, and defaces the building] I'll bet you wanna torture me now, don't you?!"
    },
    {
        "character": "Kyle",
        "line": "[joins Stan and Kenny] Dude, what's wrong with him?"
    },
    {
        "character": "Stan",
        "line": "He's koo-koo, dude. He's absolutely out of his mind."
    },
    {
        "character": "Mel",
        "line": "You! You would all love to torture me, wouldn't you? [gets down on all fours and hoists his ass up] Okay, fine. See what you can fit in there, I can take it!"
    },
    {
        "character": "Kyle",
        "line": "Dude! I've been freaked out this whole time because of that guy's movie?"
    },
    {
        "character": "Mel",
        "line": "[rises and walks up to the boys] Fine! If nobody here is man enough to torture me, then just give me my eighteen dollars!"
    },
    {
        "character": "Stan",
        "line": "It's our eighteen dollars! Your movie sucked!"
    },
    {
        "character": "Mel",
        "line": "You can't say my movie sucked, or else you're saying Christianity sucked!"
    },
    {
        "character": "Stan",
        "line": "No, dude, if you wanna be Christian, that's cool, but, you should follow what Jesus taught instead of how he got killed. Focusing on how he got killed is what people did in the Dark Ages and it ends up with really bad results."
    },
    {
        "character": "Jack",
        "line": "You know, he's right, Elise. We shouldn't focus our faith on the torture and execution of Christ."
    },
    {
        "character": "Ticket Salesman",
        "line": "Yeah. Lots of people got crucified in those times. We shouldn't rely on violence to inspire faith."
    },
    {
        "character": "Cartman",
        "line": "Aw, aw, no, come on, people, we're so close to completing my final solution!"
    },
    {
        "character": "Kyle",
        "line": "Oh, dude, I feel so much better about being Jewish now that I see that Mel Gibson is just a big wacko douche. [a grinning Mel squats and farts on Cartman, defecating on Cartman]"
    },
    {
        "character": "Mel",
        "line": "Woohoohoo! Woohoohoohoohoo! [hops towards the camera.]"
    }
]