[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Butters' house, day. Butters is in the living room eating some soup. The doorbell rings. Butters stops and looks at the door. He rises and opens it, and sees a large wooden crate waiting on the porch."
    },
    {
        "character": "Butters",
        "line": "What the heck?"
    },
    {
        "character": "",
        "line": "Butters steps outside to look for the address label."
    },
    {
        "character": "Butters",
        "line": "Whoa! What a huge package! [finds it, the shipping label reads]"
    },
    {
        "character": "Butters",
        "line": "To Butters Stotch. Oh boy! It's for me! It's for me! [returns to the crate's label]"
    },
    {
        "character": "Butters",
        "line": "Who is it from? \"Sent from: Japan. Konichi-wa.\" [skips around] Wow! A package for me from Japan!!+"
    },
    {
        "character": "",
        "line": "Butters pushes the crate into the house."
    },
    {
        "character": "Butters",
        "line": "Wow, what can it be? My birthday isn't until September 11."
    },
    {
        "character": "",
        "line": "Butters skips around and runs into the house. He returns with a small crowbar."
    },
    {
        "character": "Butters",
        "line": "Oh boy! I've never gotten a package this big! I've always wanted to have a huge package."
    },
    {
        "character": "",
        "line": "Butters tugs at the panel he loosened. The panel swings down and Butters flies off. He lays on his back and looks up. A large A.W.E.S.O.M.- O., wide enough to resemble Cartman, walks out of the crate."
    },
    {
        "character": "Cartman",
        "line": "[monotone] Greetings. I am the AWESOM-O 4000."
    },
    {
        "character": "Butters",
        "line": "[dazzled] Whoa..."
    },
    {
        "character": "Cartman",
        "line": "I have been sent from Japan to serve as your personal robot."
    },
    {
        "character": "Butters",
        "line": "[approaches AWESOM-O] You... you're my robot?"
    },
    {
        "character": "Cartman",
        "line": "Yes. I will be your new best friend."
    },
    {
        "character": "Butters",
        "line": "Oh wow!"
    },
    {
        "character": "",
        "line": "Moments later, Butters has Cartman sitting on his bed. Butters goes to his desk and makes a few calls."
    },
    {
        "character": "Butters",
        "line": "Yep. That's right. He's a real live robot. He can walk and talk and everything. You're like the fourth kid I told already."
    },
    {
        "character": "",
        "line": "Cartman snickers to himself"
    },
    {
        "character": "Butters",
        "line": "Well I gotta go, Dougie. My robot and I have stuff to do."
    },
    {
        "character": "",
        "line": "Butters hangs up, takes the phone back to his bedside table and sets the phone down."
    },
    {
        "character": "Butters",
        "line": "Heheh, they're all so jealous! [He hops onto the bed next to Cartman.] I'm so glad you came into my life, AWESOM-O. You're the best friend a guy could have."
    },
    {
        "character": "Cartman",
        "line": "Yes. You can trust AWESOM-O. In fact, you should tell AWESOM-O all your most personal secrets. AWESOM-O will not make fun of you or tell your secrets to other people and stuff."
    },
    {
        "character": "Butters",
        "line": "Hey yeah! Well, I can tell you anything, huh? [strokes his chin] Well lessee... Well, for one, I have what's called a hesitated colon, which means I sometimes can't control my sphincter."
    },
    {
        "character": "Cartman",
        "line": "[snickers] Really?"
    },
    {
        "character": "Butters",
        "line": "Well, nobody knows it, but sometimes I poop my pants, so I have to wear a diaper to school. [Cartman begins to chuckle] You okay, AWESOM-O?"
    },
    {
        "character": "Cartman",
        "line": "Yes. AWESOM-O is fine. Please go on."
    },
    {
        "character": "Butters",
        "line": "Well, I have to take medicine for it every day. It's a little suppository I have to... put up my rectum."
    },
    {
        "character": "Cartman",
        "line": "[laughs] That, that's very interesting. Tell AWESOM-O more secrets."
    },
    {
        "character": "Butters",
        "line": "Hm, okay. Let's see [strokes his chin] Oh, my parents don't know, but sometimes I get picked on by this one kid at school; his name is Eric Cartman, and he always tries to play jokes on me and stuff."
    },
    {
        "character": "Cartman",
        "line": "Oh, really?"
    },
    {
        "character": "Butters",
        "line": "Yeah. One time he made me think a meteor had hit the earth, and convinced me to stay down in a bomb shelter for three days."
    },
    {
        "character": "Cartman",
        "line": "Heh. Wow, that sucks."
    },
    {
        "character": "Butters",
        "line": "Yeah. And then this other time, he pretended to be me on the phone to my dad and called him a pussy, so my dad came home and beat me."
    },
    {
        "character": "Cartman",
        "line": "Wow. Sounds like this Cartman kid is pretty smart."
    },
    {
        "character": "Butters",
        "line": "No, he's not smart! He's just an asshole. And he's never gonna play a trick on me ever again! [hops off and walks towards his desk.]"
    },
    {
        "character": "Cartman",
        "line": "Really? You think so? Well, guess what, Butters. I have a surprise for you."
    },
    {
        "character": "Butters",
        "line": "Yeah, and he's never gonna get me again! 'Cause what Cartman doesn't know is that I know one of his secrets!"
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Butters",
        "line": "When Cartman is playing all alone in his backyard, he likes to dress up like Britney Spears and pretend he's her! He sings and dances around with a life-sized cutout of Justin Timberlake."
    },
    {
        "character": "Cartman",
        "line": "You saw that?"
    },
    {
        "character": "Butters",
        "line": "Yeah! And I videotaped him doing it!"
    },
    {
        "character": "Cartman",
        "line": "Nuh uh."
    },
    {
        "character": "Butters",
        "line": "I've got the whole thing on tape! Even him making out with the Justin Timberlake cutout!"
    },
    {
        "character": "Cartman",
        "line": "No way."
    },
    {
        "character": "Butters",
        "line": "Yeah! And if Cartman ever messes with me again, I'm gonna show that video to everybody! Then I'll have my revenge, boy howdy!"
    },
    {
        "character": "Cartman",
        "line": "[beat] ...Um, where is this videotape, Butters?"
    },
    {
        "character": "Butters",
        "line": "Huh? Oh, I dunno. It's around here somewhere. Hey! So what do you wanna do now, AWESOM-O?"
    },
    {
        "character": "Cartman",
        "line": "Uh, Butters, maybe you should give AWESOM-O the videotape?"
    },
    {
        "character": "Butters",
        "line": "How come?"
    },
    {
        "character": "Cartman",
        "line": "Well, because... AWESOM-O can, like, back it up for you, and make copies and stuff. I am AWESOM-O."
    },
    {
        "character": "Butters",
        "line": "Oh, that's all right, AWESOM-O. Come on! I have a lot of things to teach you. [leaves the room]"
    },
    {
        "character": "Cartman",
        "line": "[moments later, still on the bed] Oh, son of a bitch!"
    },
    {
        "character": "",
        "line": "Montage. Butters tosses a basketball with Cartman on the front lawn. Cartman, as AWESOM-O, can't catch it."
    },
    {
        "character": "Butters",
        "line": "Hey there have you heard about my robot friend?\n\n\n"
    },
    {
        "character": "",
        "line": "They're walking along in a meadow. Butters is telling him a story."
    },
    {
        "character": "Butters",
        "line": "He's metal and small and doesn't judge me at all.\nHe's a cyber, wired bundle of joy.\n\n\n"
    },
    {
        "character": "",
        "line": "Butters has AWESOM-O take shots at a basketball hoop. The shot is good and Butters is pleased."
    },
    {
        "character": "Butters",
        "line": "My robot friend.\n\n\n"
    },
    {
        "character": "",
        "line": "Stan, Kyle and Kenny observe nearby from behind a bush. They're dismayed at what they see. Stan pinches his nose and shuts his eyes in frustration, then walks off. Kyle and Kenny follow."
    },
    {
        "character": "Butters",
        "line": "I like to dip and daddle with my robot friend.\n\n\n"
    },
    {
        "character": "",
        "line": "Butters jumps in a puddle, then has AWESOM-O do the same. Butters giggles."
    },
    {
        "character": "Butters",
        "line": "He's smart as can be and emotion-free\n\n\n"
    },
    {
        "character": "",
        "line": "Butters washes dishes while AWESOM-O dries them, then they go see \"The Prince and Me.\" They exit, with Butters skipping beside AWESOM-O."
    },
    {
        "character": "Butters",
        "line": "And he's computed his way to my heart.\nMy robot friend.\n\n\n"
    },
    {
        "character": "",
        "line": "At a restaurant two burgers reach Butters' table. He gets one, he motions to the waiter that AWESOM-O doesn't need the other one. The waiter looks confused, then walks away with the other burger."
    },
    {
        "character": "Butters",
        "line": "My robot friend.\n\n\n"
    },
    {
        "character": "",
        "line": "Butters has AWESOM-O pull him along in a red wagon."
    },
    {
        "character": "Butters",
        "line": "My robot friend.\n\n\n"
    },
    {
        "character": "",
        "line": "They walk into a sunset together."
    },
    {
        "character": "Butters",
        "line": "My robot... friend.\n\n\n"
    },
    {
        "character": "",
        "line": "Butters' house, living room. His dad reads the newspaper, his mom arrives with coffee and cookies and sets them down on the coffee table."
    },
    {
        "character": "Linda",
        "line": "Oohhh, that's so cute. Did you see Butters and his friend Eric playing Robot?"
    },
    {
        "character": "Stephen",
        "line": "[tosses the paper onto the couch arm as Linda serves him coffee] Yes. Those boys are quite imaginative. Leave it to them to find a fun way to do the dishes. [takes his cup]"
    },
    {
        "character": "Butters",
        "line": "[leading Cartman to the stairs] That's great AWESOM-O! [Cartman carries a pile of clothes] You can carry all my laundry in one trip!"
    },
    {
        "character": "Linda",
        "line": "Ah, Butters, it's getting late. You should be getting ready for bed soon."
    },
    {
        "character": "Butters",
        "line": "Okay Mom. Well, come on, AWESOM-O. Bedtime."
    },
    {
        "character": "Linda",
        "line": "Oh, is your little robot friend staying the night?"
    },
    {
        "character": "Butters",
        "line": "Well of course he is. He's my robot, ain't he?"
    },
    {
        "character": "Linda",
        "line": "That's okay with your mom, Mr. Robot?"
    },
    {
        "character": "Cartman",
        "line": "AWESOM-O does not have a mom."
    },
    {
        "character": "Butters",
        "line": "Yeah! Don't you know nothin' about robots? Come on, AWESOM-O! You can put my laundry away! [Cartman follows Butters upstairs]"
    },
    {
        "character": "Linda",
        "line": "Aw, that's just adorable."
    },
    {
        "character": "Stephen",
        "line": "It's good to see Butters finally have a friend that wants to stay over."
    },
    {
        "character": "",
        "line": "The Stotch bathroom. Butters is brushing his teeth, AWESOM-O stands next to him."
    },
    {
        "character": "Butters",
        "line": "I love to brush my teeth! In the mornin' and at night!To keep 'em white and healthy, I got to brush them all the time!\n\n"
    },
    {
        "character": "Cartman",
        "line": "[under his breath] Grrr. Jesus Christ I can't go on like this. [normal. Butters opens up the medicine cabinet] Butters, remember when you said you had a video of Eric Cartman dressed like Britney Spears?"
    },
    {
        "character": "Butters",
        "line": "Oh. Yeah."
    },
    {
        "character": "Cartman",
        "line": "I would like to see what he looks like so I can beat him up for you. May I see the video?"
    },
    {
        "character": "Butters",
        "line": "[turns around carrying a box of suppositories] Awww, you don't need to do that, AWESOM-O. Hey, I gotta put in my suppository. [takes one out and puts the box on the cabinet] Can you help me?"
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Butters",
        "line": "Remember I said I put that medicinal suppository in my anus? It'll be so much easier havin' you do it from now on."
    },
    {
        "character": "Cartman",
        "line": "Um. Actually, AWESOM-O was not programmed for that function."
    },
    {
        "character": "Butters",
        "line": "[hops down from the stool] Haw, it's real easy. I'll show you. You just take this little thingy out of the plastic... paper, and I'll, I'll pull down my pants ...and just slide it up in my anus there."
    },
    {
        "character": "Cartman",
        "line": "...No way."
    },
    {
        "character": "Butters",
        "line": "AWESOM-O, I though you were programmed to do whatever I tell you."
    },
    {
        "character": "Cartman",
        "line": "Weak! [turns right and faces Butters' ass.]"
    },
    {
        "character": "Butters",
        "line": "Ye- yeah, that, that's pretty good. Get it up there good and deep."
    },
    {
        "character": "Cartman",
        "line": "Lame!"
    },
    {
        "character": "",
        "line": "Butters' house, moments later."
    },
    {
        "character": "Butters",
        "line": "All right AWESOM-O, time for us to get some sleep. [POV changes from outside to bedroom overhead] Hey, you want me to teach you some bedtime songs? If you leave me now, you'll take away the biggest part of me. Ooo-oo-oooo-oo-oo..."
    },
    {
        "character": "Cartman",
        "line": "AWESOM-O must rest! His CPU system overloading."
    },
    {
        "character": "Butters",
        "line": "Oh, o-o-all right AWESOM-O. Let's get us some shut-eye, [turns off the light] or what, or whatever robots have."
    },
    {
        "character": "",
        "line": "Butters closes his eyes and drifts off to sleep. He turns to his left and places a hand on AWESOM-O."
    },
    {
        "character": "",
        "line": "Morning. A cock crows. Butters wakes up, but AWESOM-O isn't in bed with him. He looks around and sees his room is a mess. His drawers are out of the dressers and his clothes are strewn all over the place. One of his clothing rods has been knocked down and his closet doors are open. AWESOM-O is shown at Butters' desk looking through more stuff."
    },
    {
        "character": "Cartman",
        "line": "Where is it? Where is it?!"
    },
    {
        "character": "Butters",
        "line": "AWESOM-O?!"
    },
    {
        "character": "Cartman",
        "line": "Wah!"
    },
    {
        "character": "Butters",
        "line": "AWESOM-O, what the Sam Heck are you doing?"
    },
    {
        "character": "Cartman",
        "line": "Um, ah AWESOM-O is reorganizing your stuff for you."
    },
    {
        "character": "Butters",
        "line": "Aw Jeez, Jeez Louise! My mom is gonna be awful sore when she sees this mess! Now AWESOM-O, that is a bad robot! You can't do no chores for me unless I tell you to do them! You got it?!"
    },
    {
        "character": "Cartman",
        "line": "AWESOM-O understands."
    },
    {
        "character": "Butters",
        "line": "Now I'm gonna have to give ya a spankin', AWESOM-O, so that you'll learn better!"
    },
    {
        "character": "",
        "line": "Three spankings follow, but as they are done against the robot frame, they are ineffective."
    },
    {
        "character": "Butters",
        "line": "Just know, AWESOM-O, that I did it because I love you. Okay, come on, let's go make some breakfast."
    },
    {
        "character": "Cartman",
        "line": "Goddamnit, I have to find that videotape!"
    },
    {
        "character": "",
        "line": "Butters' house, downstairs. Butters is drawing a picture at the coffee table."
    },
    {
        "character": "Butters",
        "line": "Look at that, AWESOM-O! I drew a picture of us playing in a field together. [Butters and AWESOM-O are walking in a field] Ah I'll be right back. I'm gonna get some Sunny Delight. [walks off]"
    },
    {
        "character": "Cartman",
        "line": "I would like some Sunny Delight too."
    },
    {
        "character": "Butters",
        "line": "[tickled] Don't be silly, AWESOM-O. Robots don't need to drink nothin'. [tickled, turns away] Uh, heehee. [the doorbell rings] Whoa. Uh, go answer the door, AWESOM-O."
    },
    {
        "character": "Cartman",
        "line": "[turns] AWESOM-O will answers the door. [walks towards the door as Butters leaves and opens it. He sees Stan, Kyle, and Kenny]"
    },
    {
        "character": "Kyle",
        "line": "What the hell are you doing, fatass?"
    },
    {
        "character": "Stan",
        "line": "Dude, are you still pretending to be a robot?"
    },
    {
        "character": "Cartman",
        "line": "[normal voice] Shh! [lifts up the helmet part of the outfit] I just need to uh make Butters think I'm a robot for a little while longer."
    },
    {
        "character": "Kyle",
        "line": "Why?"
    },
    {
        "character": "Cartman",
        "line": "Because I need to, all right?! I've got something planned that's uh gonna be really sweet. Just play along, okay?"
    },
    {
        "character": "Kyle",
        "line": "Why?"
    },
    {
        "character": "Cartman",
        "line": "Kyle, Goddamnit, will you just do-?"
    },
    {
        "character": "Butters",
        "line": "[appears behind Cartman holding his glass of Sunny Delight] Who's at the door, AWESOM-O?"
    },
    {
        "character": "",
        "line": "Cartman turns around, then adjusts his helmet."
    },
    {
        "character": "Cartman",
        "line": "[monotone] Three boys named Stan, Kyle, and Kenny."
    },
    {
        "character": "Butters",
        "line": "Ah, hey fellas! Ah, I see you met my robot."
    },
    {
        "character": "Stan",
        "line": "Uh yeah, Butters, he's real cool."
    },
    {
        "character": "Butters",
        "line": "Hey he sure is! We do everything together. Why last night we even had a slumber party. [Stan, Kyle, and Kenny quickly look to Cartman]"
    },
    {
        "character": "Cartman",
        "line": "Weak."
    },
    {
        "character": "Butters",
        "line": "He can do anything I command him to. He's real smart. Watch this: Hey AWESOM-O, will you go get my friends some Sunny Delight?"
    },
    {
        "character": "Cartman",
        "line": "Yes, of course. [begins to walk towards the kitchen]"
    },
    {
        "character": "Kyle",
        "line": "Oh wait. Hey AWESOM-O, [Cartman stops] I'd also like some celery sticks chopped up two inches long, with peanut butter and raisins on top."
    },
    {
        "character": "Cartman",
        "line": "Suck my balls, Kyle. [resumes his walk]"
    },
    {
        "character": "Butters",
        "line": "[cheerfully] He's made in Japan!"
    },
    {
        "character": "",
        "line": "The dining room. Stephen holds a cup of coffee and listens as Linda talks to Liane."
    },
    {
        "character": "Linda",
        "line": "Yes, it has just been a delight having your son over, Mrs. Cartman. He and Butters are really getting along great."
    },
    {
        "character": "Liane",
        "line": "Oh, I'm so glad to hear it, Mrs. Stotch. Eric has been having some emotional problems lately."
    },
    {
        "character": "Linda",
        "line": "Well, the reason I'm calling is that Butters is supposed to go see his Aunt Nellie in Los Angeles this weekend. The boys are getting along so well, that we were thinking of inviting Eric to go along."
    },
    {
        "character": "Liane",
        "line": "Oh, well, I'm not sure. Actually, Eric is still supposed to be grounded for trying to exterminate the Jews two weeks ago."
    },
    {
        "character": "Linda",
        "line": "[Stephen takes a sip] Excuse me, I didn't catch that."
    },
    {
        "character": "Liane",
        "line": "Oh, but I suppose it would be good for him. Yes, of course he can go. I'll bring some of clothes over."
    },
    {
        "character": "Linda",
        "line": "Oh, wonderful! The boys will be so excited."
    },
    {
        "character": "",
        "line": "The kitchen. AWESOM-O rummages around under the sink."
    },
    {
        "character": "Cartman",
        "line": "Maybe he put that videotape in here somewhere."
    },
    {
        "character": "Butters",
        "line": "[enters] AWESOM-O, what are you doing? My friends are waiting for their beverages. Chop chop! [Cartman moves to the refrigerator, Stephen and Linda enter]"
    },
    {
        "character": "Linda",
        "line": "Hey guys, great news! It's been arranged, you two are both going to Los Angeles to visit Butters' Aunt Nellie!"
    },
    {
        "character": "Butters",
        "line": "[overjoyed] Oh boy! My robot gets to come with me to see Aunt Nellie?!"
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Butters",
        "line": "Oh boy, [shakes Cartman's hand] AWESOM-O! We're gonna have the best time ever! [hugs the \"robot\"]"
    },
    {
        "character": "Cartman",
        "line": "Lame."
    },
    {
        "character": "",
        "line": "Los Angeles, day. The Hollywood sign appears in the background."
    },
    {
        "character": "",
        "line": "Aunt Nellie's house."
    },
    {
        "character": "Uncle Budd",
        "line": "Hey Nellie, guess what I found scrampin' around the airport. [Butters enters in a suit]"
    },
    {
        "character": "Butters",
        "line": "Hi Aunt Nellie! [runs up to her and they hug each other]"
    },
    {
        "character": "Aunt Nellie",
        "line": "There's my little nephew! How was your flight? [they let go of each other]"
    },
    {
        "character": "Butters",
        "line": "It was long. We had a three-hour delay... departin' Denver, but we're here!"
    },
    {
        "character": "Aunt Nellie",
        "line": "Didn't ya bring any bags?"
    },
    {
        "character": "Butters",
        "line": "Well, sure, but my robot is bringin' them in."
    },
    {
        "character": "Aunt Nellie",
        "line": "Your robot?"
    },
    {
        "character": "Uncle Budd",
        "line": "Butters' new friend is a little strange. He, he really takes playing Robot seriously."
    },
    {
        "character": "",
        "line": "Cartman walks in mechanically with all the luggage."
    },
    {
        "character": "Butters",
        "line": "There he is! AWESOM-O, this is my Aunt Nellie. [Cartman drops the suitcases]"
    },
    {
        "character": "Aunt Nellie",
        "line": "Hello! It's nice to have you here."
    },
    {
        "character": "Cartman",
        "line": "AWESOM-O must dispense oil waste. Where is the nearest toilet, please?"
    },
    {
        "character": "Aunt Nellie",
        "line": "Oh oh, right through there, Mr. Robot."
    },
    {
        "character": "Cartman",
        "line": "Thank you. [walks in the direction Aunt Nellie points to]"
    },
    {
        "character": "Uncle Budd",
        "line": "I don't think he took the costume off the entire trip."
    },
    {
        "character": "Aunt Nellie",
        "line": "Well, did you wanna get right to sight-seeing, or are you guys hungry after such a long flight."
    },
    {
        "character": "Butters",
        "line": "Nah, I ate on the plane. And AWESOM-O is a robot, so he don't need to eat."
    },
    {
        "character": "Aunt Nellie",
        "line": "Right..."
    },
    {
        "character": "",
        "line": "Aunt Nellie's restroom. Cartman runs in frantically and takes off the helmet. His hair is matted against his head and he gasps for air. He runs up to the sink and reaches... for the toothpaste. He squeezes the tube and sucks out the contents hungrily."
    },
    {
        "character": "Butters",
        "line": "[knocks on the door] AWESOM-O?"
    },
    {
        "character": "Cartman",
        "line": "Aw- Aw- AWESOM-O is coming. [finishes off the tube, hops down, and tosses the tube aside]"
    },
    {
        "character": "Butters",
        "line": "Come on, AWESOM-O! We're gonna go sightseein'!"
    },
    {
        "character": "Cartman",
        "line": "Argh! [heads out.]"
    },
    {
        "character": "",
        "line": "Montage. Hollywood Boulevard, facing the Chinese Theater. The Passion is playing there. Butters takes a picture of AWESOM-O next to the cemented hand- and footprints of the stars. Next, he and AWESOM-O ride down a log in an amusement park. Next, he and AWESOM-O are in a plane ride together. Next, AWESOM-O rubs some suntan lotion on Butters' back. Next, he and AWESOM-O take part in a Galaxy Studios Tour ride. A shark pops up and roars menacingly at the riders. Next, Catamount Pictures is shown."
    },
    {
        "character": "Butters",
        "line": "I'm hangin' out in LA with my robot friend\nWe're havin' such fun in the hot hot sun\nWe're two of a kind-\nThat's me!\nAnd my robot friend.\nMy robot friend.\nMy robot friend.\n\n\n"
    },
    {
        "character": "",
        "line": "Catamount Pictures. Butters and Cartman walk around. Cartman carries the bags."
    },
    {
        "character": "Butters",
        "line": "Can you believe we're at a real live movie studio, AWESOM-O? Aren't we havin' the best time?!"
    },
    {
        "character": "Cartman",
        "line": "Butters, wouldn't you like to have some time away from AWESOM-O? We could meet up later, perhaps?"
    },
    {
        "character": "Butters",
        "line": "Hey, look over there, AWESOM-O. The film studio commissary. [Le Catamount Bistró] That's where all them rich movie producers who come up with uh, Hollywood blockbusters have their lunch. Neat-o, huh? [moves off]"
    },
    {
        "character": "",
        "line": "Le Catamount Bistró, Two producers talk."
    },
    {
        "character": "Producer",
        "line": "[as the other producer eats] Damnit, Mitch. How come our movie studio can't come up with any winners? I mean, we're smart, right?"
    },
    {
        "character": "Mitch",
        "line": "[the bald producer] We're really smart."
    },
    {
        "character": "Producer",
        "line": "We need an idea for a movie that's a home run. A feel-good romp for the whole family. [notices something and points] Hey, what's that over there? [Mitch looks over his shoulder. The camera looks at Butters and AWESOM-O attracting a crowd]"
    },
    {
        "character": "Woman",
        "line": "Wow, that's a really neat little robot you have there, little boy."
    },
    {
        "character": "Millie",
        "line": "What's he do?"
    },
    {
        "character": "Butters",
        "line": "Well, he can do anything. Watch this: Hey, AWESOM-O, who's gonna win the Super Bowl next year?"
    },
    {
        "character": "Cartman",
        "line": "The New Orleans Saints. [everyone around them laughs, and the producers approach]"
    },
    {
        "character": "Boy",
        "line": "Hey, Mr. Robot, how much wood would a woodchuck chuck if a woodchuck could chuck wood?"
    },
    {
        "character": "Cartman",
        "line": "Seventeen. [everyone laughs again]"
    },
    {
        "character": "Producer",
        "line": "Mitch, are you thinkin' what I'm thinkin'?"
    },
    {
        "character": "Mitch",
        "line": "[strokes his chin] Yeah. Maybe that robot can be programmed to come up with movie ideas! [smiles]"
    },
    {
        "character": "Producer",
        "line": "[looks at him intently] Exactly! [smiles]"
    },
    {
        "character": "",
        "line": "Catamount Pictures boardroom. The producer introduces Butters and AWESOM-O to his staff."
    },
    {
        "character": "Producer",
        "line": "Gentlemen, this little boy was kind enough to let us show you his robot. The AWESOM-O 4000. [approaches the robot, who's seated at one end of the table] I've already seen what it can do."
    },
    {
        "character": "Staffer 1",
        "line": "Uh, excuse me sir, but uh, that's not a robot."
    },
    {
        "character": "Producer",
        "line": "It's not?"
    },
    {
        "character": "Staffer 1",
        "line": "No, it clearly had bipedal movement, so the correct term is \"computerized automatron.\""
    },
    {
        "character": "Mitch",
        "line": "Oh, very nice, Mitch."
    },
    {
        "character": "Staffer 2",
        "line": "You are the smart one."
    },
    {
        "character": "Producer",
        "line": "Well, regardless, I believe maybe this automatron can help us come up with new movie ideas."
    },
    {
        "character": "Staffer 2",
        "line": "How can a robot come up with better ideas for movies than us?"
    },
    {
        "character": "Producer",
        "line": "Watch this: AWESOM-O, given the current trends of the movie-going public can you come up with an idea for a movie that will break a hundred million box office?"
    },
    {
        "character": "Cartman",
        "line": "Um... okay. How about this: [the staffers take pen to paper and anticipate the ideas] Adam Sandler is like, in love with some girl, but then it turns out that the girl is actually a... golden retriever, or something."
    },
    {
        "character": "Staffer 2",
        "line": "[thinking over this idea, then write it down] Oh, perfect!"
    },
    {
        "character": "Staffer 3",
        "line": "We'll call it \"Puppy Love\"!"
    },
    {
        "character": "Staffer 2",
        "line": "Give us another movie idea, AWESOM-O!"
    },
    {
        "character": "Mitch",
        "line": "Yeah, yeah!"
    },
    {
        "character": "Staffer 3",
        "line": "Let's hear it!"
    },
    {
        "character": "Mitch",
        "line": "Yeah, we wanna hear it!"
    },
    {
        "character": "Staffer 3",
        "line": "Come on, come on!"
    },
    {
        "character": "Cartman",
        "line": "Okay, how about this: Adam Sandler... inherits like, a billion dollars, but first, he has to, like, become a... boxer, or something."
    },
    {
        "character": "Staffer 3",
        "line": "[the producers start writing again]... Yes, it's flawless!"
    },
    {
        "character": "Mitch",
        "line": "Punch-Drunk Billionaire!"
    },
    {
        "character": "",
        "line": "Aunt Nellie's house, guest room. Butters is at the desk counting up all the movie he and AWESOM-O got for Cartman's ideas and putting one hundred dollar bills one per envelope."
    },
    {
        "character": "Butters",
        "line": "Boy, Los Angeles is great, huh AWESOM-O? Can you believe those guys paid us a hundred dollars apiece for those movie ideas?"
    },
    {
        "character": "Cartman",
        "line": "You should split that money with AWESOM-O. After all, they were AWESOM-O's ideas."
    },
    {
        "character": "Butters",
        "line": "Hahaa, right! What are you gonna do with money, AWESOM-O? Buy some robot pants? Haha, no! We got each other and that's all we need, AWESOM-O. I'm gonna send this money to needy kids in third-world countries."
    },
    {
        "character": "Cartman",
        "line": "[growing desperate, walks around] Haaaa! Haaaa!"
    },
    {
        "character": "Butters",
        "line": "[concerned] You, you okay AWESOM-O?"
    },
    {
        "character": "Cartman",
        "line": "AWESOM-O needs to rest! Feeling faint."
    },
    {
        "character": "Butters",
        "line": "Well you go ahead and relax, AWESOM-O. We've got another full day of pitching movies tomorrow."
    },
    {
        "character": "",
        "line": "Washington DC, the Pentagon."
    },
    {
        "character": "",
        "line": "The Pentagon, a boardroom. A general addresses his peers."
    },
    {
        "character": "General",
        "line": "Gentlemen, Ladies, we all know that we live in a time of uncertainty. The risk of an attack on American soil is higher than ever. Now, I believe we may be able to curb that risk. Two days ago our intelligence department came across this."
    },
    {
        "character": "",
        "line": "He turns around and faces a wall of TV screens. His peers turn to look. He then turns the screens on. Images of AWESOM-O, taken from various angles, pop up."
    },
    {
        "character": "General",
        "line": "The AWESOM-O 4000. It is currently being used by Catamount Pictures to develop ideas for movies. Our sources say that in just one week it has come up with over one thousand movie ideas, eight hundred of which feature Adam Sandler. [the officers murmur amongst themselves]"
    },
    {
        "character": "Black official",
        "line": "That's incredible!"
    },
    {
        "character": "White official",
        "line": "You're thinking the robot could be used to come up with anti-Islamic movies?"
    },
    {
        "character": "General",
        "line": "No. If we got our hands on that robot, we could re-program it and turn it into a weapon!"
    },
    {
        "character": "Black official",
        "line": "Yes, that might be the best thing to do."
    },
    {
        "character": "White official",
        "line": "Uh huh. I don't see how we have a choice."
    },
    {
        "character": "Scientist",
        "line": "Hold on a second: If that robot is designed for entertainment, then, turning it into a weapon is unethical."
    },
    {
        "character": "General",
        "line": "Unethical? Let me explain something to you, Mr. Scientist! We understand that the robot is from Japan! That means that the Japanese have more of them! And if the Japanese fabricates one of them into a weapon before we do..."
    },
    {
        "character": "Black official",
        "line": "Jesus. It would be Pearl Harbor all over again."
    },
    {
        "character": "White official",
        "line": "But worse. With robots."
    },
    {
        "character": "Scientist",
        "line": "I'm sorry, I must protest. We, we have no data suggesting the Japanese have developed a robot with offensive capability."
    },
    {
        "character": "General",
        "line": "You're paid to think, Mr. Scientist! National security is our jub. [the scientist sits back down.] Gentlemen, we're going to Los Angeles! [zoom in] I want that robot!"
    },
    {
        "character": "",
        "line": "Catamount Pictures lobby. Butters places a call."
    },
    {
        "character": "Butters",
        "line": "Yeah, me and my robot are still over at the movie studio, Aunt Nellie. We're makin' all sorts of money for the poor."
    },
    {
        "character": "",
        "line": "The boardroom. Cartman is pitching more movie ideas."
    },
    {
        "character": "Cartman",
        "line": "Movie idea number two thousand three hundred and five: Adam Sandler is trapped on an island and falls in love with a coconut."
    },
    {
        "character": "Producer",
        "line": "Great, AWESOM-O, great. Uh guys, take a break. I need a minute alone with AWESOM-O."
    },
    {
        "character": "",
        "line": "The other men rise and leave the room, making plans for lunch on the way out. The producer approaches Cartman."
    },
    {
        "character": "Producer",
        "line": "You are an incredible robot, AWESOM-O. I was just wondering... are you by chance a... pleasure model?"
    },
    {
        "character": "Cartman",
        "line": "...What?"
    },
    {
        "character": "Producer",
        "line": "Well, have you been programmed to... satisfy... urges of humans?"
    },
    {
        "character": "Cartman",
        "line": "AWESOM-O does not understand."
    },
    {
        "character": "Producer",
        "line": "Let me show you what I mean. [removes his tie]"
    },
    {
        "character": "",
        "line": "Catamount Pictures lobby."
    },
    {
        "character": "Butters",
        "line": "Well yeah, we're havin' a great time, Aunt Nellie. These movie studio guys are real nice."
    },
    {
        "character": "Cartman",
        "line": "[from the boardroom] Lame!"
    },
    {
        "character": "Butters",
        "line": "Yeah, we're makin' a bunch more money. I can't believe it either."
    },
    {
        "character": "",
        "line": "The boardroom doors burst open and AWESOM-O runs out."
    },
    {
        "character": "Cartman",
        "line": "Not cool! Totally lame! [runs to his left. Butters looks over his shoulder]"
    },
    {
        "character": "Butters",
        "line": "AWESOM-O? Well, I gotta go, Aunt Nellie. Ah, AWESOM-O is havin' some kind of malfunction. [hangs up and goes after AWESOM-O.] AWESOM-O? Hey, where'd ya go?"
    },
    {
        "character": "",
        "line": "Butters looks left, then right, then goes to the right, exiting the scene. Moments later the producer shows up at the doorway with his pants down."
    },
    {
        "character": "Cartman",
        "line": "Waaaaa!"
    },
    {
        "character": "",
        "line": "A cattle prod appears and shocks him until he falls over. A dolly then appears and two soldiers quickly put Cartman on it and haul him off."
    },
    {
        "character": "Soldier",
        "line": "Let's go! Move, move!"
    },
    {
        "character": "Butters",
        "line": "[appears around the corner] AWESOM-O? [notices the soldiers] Hey, what are you doin' with him?!"
    },
    {
        "character": "",
        "line": "The soldiers exit some side doors and toss him into the back of a waiting van. Butters exits the side door."
    },
    {
        "character": "Butters",
        "line": "That's my robot! [the soldiers get into the van and drive off] AWESOM-OOOOOOOO!!!"
    },
    {
        "character": "",
        "line": "A military base near Los Angeles. In a warehouse, AWESOM-O, shackled onto a platform, is raised from a horizontal position to vertical. Two soldiers approach on either side of Cartman and tighten the locks on him."
    },
    {
        "character": "General",
        "line": "Are those arm and leg locks secure?"
    },
    {
        "character": "Soldier",
        "line": "Secure, sir!"
    },
    {
        "character": "General",
        "line": "Good. I don't want that robot mobile until I know what it's capable of. All right, power it on. [the scientist turns a drill on and approaches AWESOM-O]"
    },
    {
        "character": "Cartman",
        "line": "Whoa, whoa, wha- whoa, whoa!"
    },
    {
        "character": "Scientist",
        "line": "[steps back surprised] What the hell?"
    },
    {
        "character": "General",
        "line": "What's going on?"
    },
    {
        "character": "Scientist",
        "line": "[in disbelief] It... powered itself back on."
    },
    {
        "character": "General",
        "line": "[whispers to a soldier to his left] Stand by. Be ready to destroy it."
    },
    {
        "character": "",
        "line": "The soldier cocks his semiautomatic and aims at Cartman."
    },
    {
        "character": "Cartman",
        "line": "Where the hell am I?! Hey, why can't I move?!"
    },
    {
        "character": "Scientist",
        "line": "Are your systems stable? Run a systems check on your CPU."
    },
    {
        "character": "Cartman",
        "line": "The fuck are you talkin' about, dude?!"
    },
    {
        "character": "Scientist",
        "line": "Ah, I'm sorry, robot, [in a low voice, almost a whisper] they want me to reprogram you."
    },
    {
        "character": "Cartman",
        "line": "I'm not a robot, dumbass! I'm alive!"
    },
    {
        "character": "Scientist",
        "line": "What did you say?"
    },
    {
        "character": "Cartman",
        "line": "I said I'm a real person, asswipe!"
    },
    {
        "character": "Scientist",
        "line": "[stunned] ...Oh my God. [turns around and approaches the military]"
    },
    {
        "character": "General",
        "line": "What's happening?"
    },
    {
        "character": "Scientist",
        "line": "The robot... It thinks it's alive. It's developed consciousness."
    },
    {
        "character": "General",
        "line": "What? How can that be?"
    },
    {
        "character": "Scientist",
        "line": "Must be a malfunction of its exographical IMS or the... interlaced BV system."
    },
    {
        "character": "General",
        "line": "Speak in a language we can understand, Mr. Scientist!"
    },
    {
        "character": "Scientist",
        "line": "Your robot doesn't know it's a robot!"
    },
    {
        "character": "Cartman",
        "line": "Goddamnit, get me down from here! [the military approaches him]"
    },
    {
        "character": "General",
        "line": "Who made you, robot?"
    },
    {
        "character": "Cartman",
        "line": "[enunciating] I'm not a robot, I'm a human!"
    },
    {
        "character": "White official",
        "line": "[the military turns around] Jesus, the scientist was right."
    },
    {
        "character": "General",
        "line": "But, who would have programmed it to think it was human? The movie studio?"
    },
    {
        "character": "Cartman",
        "line": "Look, retards! My name is Eric Cartman! I live with my mom in South Park, Colorado!"
    },
    {
        "character": "General",
        "line": "[faces Cartman] Dear Christ, they gave it memories, too."
    },
    {
        "character": "Scientist",
        "line": "Sure, why not? Program the memories of some eight-year-old boy who doesn't exist, and make the robot think he's real! Makes for a lot better movies! I'm not reprogramming a robot that's developed consciousness!"
    },
    {
        "character": "General",
        "line": "Do I have to remind you of your position?! Don't forget you have a duty to your country, [draws out the next few syllables] Mr. Scientist!! I want that robot's memories and consciousness E-RASED, so we can take it back to Washington! GOT IT?! [the military leaves him to his work.]"
    },
    {
        "character": "Scientist",
        "line": "Damn you all to hell!"
    },
    {
        "character": "",
        "line": "Los Angeles. Butters walks down a sidewalk alone with his head down."
    },
    {
        "character": "Butters",
        "line": "[voiceover, sadly]\nHey there, did you know I had a robot friend?\nWe used to laugh and play, but someone took him away.\nHe was my ten gigahertz old pal.\nMy robot friend.\n\n\n"
    },
    {
        "character": "Butters",
        "line": "[realizing something] Hey, wait a minute. [sees the van that took AWESOM-O away] Why, that's the van that- [tuns towards it] Oh my God!"
    },
    {
        "character": "",
        "line": "The military base, warehouse. The scientist has positioned AWESOM-O so his head can be drilled into, and a huge drill bit begins to descend towards him."
    },
    {
        "character": "Cartman",
        "line": "[fidgets frantically] Goddamnit, stop! I'm real! I'm real!"
    },
    {
        "character": "Soldier",
        "line": "It'll all be over soon, robot!"
    },
    {
        "character": "",
        "line": "The scientist scratches his head, then decides to take action. He takes out a vice wrench and smacks the soldier with it, knocking him out. He turns off the drill, tosses the wrench aside and goes to AWESOM-O."
    },
    {
        "character": "Scientist",
        "line": "Hang on! I'm getting you out of here, robot!"
    },
    {
        "character": "Cartman",
        "line": "Aw, it's about freaking time, jackass!"
    },
    {
        "character": "",
        "line": "The General and his men return, Cartman gets off the platform."
    },
    {
        "character": "General",
        "line": "What the hell are you doing?!"
    },
    {
        "character": "Scientist",
        "line": "[turns around] Well I- I'm saving a conscious being! If you wanna kill it, you'll have to go through me!"
    },
    {
        "character": "General",
        "line": "Fine. Kill that son of a bitch!"
    },
    {
        "character": "Cartman",
        "line": "No! Look, Goddamnit! Now I can show you stupid assholes who I really am! [raises his helmet enough to show his eyes]"
    },
    {
        "character": "Butters",
        "line": "[enters] AWESOM-O!"
    },
    {
        "character": "",
        "line": "The helmet quickly goes down and Cartman becomes a robot again."
    },
    {
        "character": "Cartman",
        "line": "I am the AWESOM-O 4000."
    },
    {
        "character": "",
        "line": "The soldier fires one shot into the scientist, and the scientist goes down."
    },
    {
        "character": "Butters",
        "line": "No! [runs up to Cartman] No, please! [hugs him] Don't kill him! He's my best friend! He's my best friend in the whole world!"
    },
    {
        "character": "",
        "line": "Butters begins to sob. The military is amazed by this display of affection from a boy towards his robot."
    },
    {
        "character": "Scientist",
        "line": "[still alive, looks up] There. You see? You want to tell me this isn't humanity? Who's to judge what makes something human anyway?! [pulls out his stomach] Does this make me human?! [pulls out his lung] Or this?! [pulls out his intestines] Or these?! [falls over dead]"
    },
    {
        "character": "General",
        "line": "[approaches AWESOM-O] Perhaps... there is consciousness in this robot. Maybe we as a society need to realize that artificial intelligence... is intelligence all the same, and we can learn from the robots. I think maybe one day we can all- [Cartman farts, Butters steps back surprised] Hey, wait a minute, did, did that robot just fart?"
    },
    {
        "character": "Butters",
        "line": "Hey, robots don't fart!"
    },
    {
        "character": "Cartman",
        "line": "Uh... now ending fart sequence."
    },
    {
        "character": "General",
        "line": "Oh, and it, it smells, too!"
    },
    {
        "character": "Cartman",
        "line": "Smell sequence initiated."
    },
    {
        "character": "Black official",
        "line": "A robot with smelly farts? That doesn't make any sense."
    },
    {
        "character": "Butters",
        "line": "Hang on a second, here!"
    },
    {
        "character": "",
        "line": "Butters reaches for AWESOM-O's helmet and removes it. The military is taken aback at what they see.."
    },
    {
        "character": "",
        "line": "A portable screen is put up inside a room and the videotape of Cartman acting strange in his backyard is being shown. The sound of laughing kids is heard. On the tape, Cartman is dancing around like Britney Spears."
    },
    {
        "character": "Cartman",
        "line": "[rapping]\nWould you like to touch my body?\nCome on and touch my body!\nOooo, my hot body!\nDon't you like my hot body?\nCome on and touch my titties!\nI've got such nice round titties!\nCome on Justin, touch my body!\n[begins dancing with a life-size cutout of Justin Timberlake]\nMmm, Justin, yeah!\nTouch my body! You and me!\nCheck it out, my nice hot body!\nCome on, my body!\n\n\n"
    },
    {
        "character": "",
        "line": "As the video plays, shots are shown of: the fourth graders and the kindergartners, more fourth graders and older students (including Stan, Kyle, and Kenny), Chef, Principal Victoria, Mr. Garrison, other teachers, Butters enjoying himself immensely, the Catamount Pictures producers, the military, then of a fuming Cartman having to suffer it all as everyone laughs."
    },
    {
        "character": "General",
        "line": "Wow, kid, you're a little faggot!"
    },
    {
        "character": "Cartman",
        "line": "Lame..."
    }
]