[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, the school gym. Six cheerleaders, all fourth-graders, lead a Pep Rally '04."
    },
    {
        "character": "Cheerleaders",
        "line": "We are South Park, Green and White. Let's go, Cows! Fight, fight, fight! Nobody can beat a Cow! Let's gooo, South Park![in the audience, Cartman yawns.]\n\n \n"
    },
    {
        "character": "Red",
        "line": "Hey, South Park! Do you have school spirit?"
    },
    {
        "character": "Students",
        "line": "[all grades] Moooooooo!"
    },
    {
        "character": "Bebe",
        "line": "I think us Cows have the best school spirit. Huh, Mandy?"
    },
    {
        "character": "Mandy",
        "line": "[new fourth grader, with braces that makes her speak with a lisp] Yeah, and South Park is really gonna stick it to Littleton next week!"
    },
    {
        "character": "Bebe",
        "line": "Let's bring out our mascot and get this pep rally going! [an adult in a cow suit comes out, waves to the kids, then begins to dance.]"
    },
    {
        "character": "Butters",
        "line": "It's Mooey! Mooey, wave to me! Wave to me, Mooey!"
    },
    {
        "character": "Cartman",
        "line": "Butters, shut the hell up! [As Mooey dances, PETA bursts in through the double doors and rushes towards the cheerleaders. They apprehend Mooey and begin beating him up, then pulling his head off]"
    },
    {
        "character": "Blonde PETA woman",
        "line": "[through her megaphone] We are People for the Ethical Treatment of Animals! We protest your insensitive use of cows as your school mascot!"
    },
    {
        "character": "Herbert Garrison",
        "line": "Oh, Jesus, not PETA again."
    },
    {
        "character": "Dreadlocked PETA Man",
        "line": "[approaches Bebe] Cows are maimed and slaughtered and used as a commodity! [throws a bucket of real blood on Bebe. Other PETA members go after the rest of the cheerleaders]"
    },
    {
        "character": "Blonde PETA woman",
        "line": "[showing old slaughterhouse scenes on how to prepare beef] This is the fate of the cow! This is your insensitivity!"
    },
    {
        "character": "Students",
        "line": "Ewww! [a kindergartner begins to cry]"
    },
    {
        "character": "Gas Mask PETA Member",
        "line": "The cow is a slave! The cow is a commodity! To be thrown away by a society gone wrong!"
    },
    {
        "character": "Herbert Garrison",
        "line": "All right, children, I have just been informed that since our school has been attacked by eco-terrorists for the 47th time, we are going to change our school mascot."
    },
    {
        "character": "Class",
        "line": "Awwwwwwww!"
    },
    {
        "character": "Stan",
        "line": "But, Mr. Garrison, if we change our mascot, that means the eco-terrorists win!"
    },
    {
        "character": "Herbert Garrison",
        "line": "That's right, Stanley, the eco-terrorists win. [approaches the students with a stack of papers and begins distributing it] Now, I have here a mascot selection sheet. Every student is supposed to check the box next to the mascot they like the most. And the most popular selection will be the school's new mascot."
    },
    {
        "character": "Clyde",
        "line": "But we like being the Cows! [a bucket of real blood is doused on him and the rest of the class gasps.]"
    },
    {
        "character": "Dreadlocked PETA man",
        "line": "You're responsible for the enslavement and genocide of millions!"
    },
    {
        "character": "Herbert Garrison",
        "line": "[taking action] Ge-get outta here, PETA! We're changin' the mascot already!"
    },
    {
        "character": "Dreadlocked PETA man",
        "line": "Who'll speak for those who cannot speak for themselves?!"
    },
    {
        "character": "Herbert Garrison",
        "line": "[throws some papers at the PETA member] Oh, ge-get outta here! [breaks out a can of mace and sprays it on him] Ge-get out! [the man leaves] Jesus, where do they keep coming from?! [sprays some more for effect] Go on, get outta here."
    },
    {
        "character": "Stan",
        "line": "This is bullcrap, dude!"
    },
    {
        "character": "Herbert Garrison",
        "line": "Now children, it's not that bad. There's plenty of great new mascots on the sheet to chose from. The Hurricanes, the Blizzards, the Redskins, the Indians..."
    },
    {
        "character": "Wendy",
        "line": "But aren't Indians and Redskins just as offensive?"
    },
    {
        "character": "Herbert Garrison",
        "line": "No, those are fine. PETA doesn't care about people."
    },
    {
        "character": "",
        "line": "The school hallway."
    },
    {
        "character": "Cartman",
        "line": "Goddammit, vegans piss me off! Now we're gonna end up with a stupid eagle or a faggy bobcat as a mascot."
    },
    {
        "character": "Kyle",
        "line": "Wait. You guys, I have an awesome idea! We should secretly go around and tell all the students we can, to not check any of the mascots on this election sheet, and instead write in \"Giant Douche.\""
    },
    {
        "character": "Cartman",
        "line": "Ye-heah!"
    },
    {
        "character": "Kenny",
        "line": "(Yeah, totally awesome!)"
    },
    {
        "character": "Cartman",
        "line": "Yeh- no, no, wait, wait. I got a better idea you guys. What we should do is we should secretly go around and tell all the students we can to not check any of the mascots on this election sheet, and instead write in \"Turd Sandwich.\""
    },
    {
        "character": "Kyle",
        "line": "Turd Sandwich isn't better than Giant Douche."
    },
    {
        "character": "Cartman",
        "line": "Heh, it's only about a thousand times better, am I right guys? Come on! We have to tell everybody fast! This is gonna be so funny!"
    },
    {
        "character": "Kyle",
        "line": "It was my idea and we're gonna tell everyone to write in \"Giant Douche!\" It's way funnier!"
    },
    {
        "character": "Cartman",
        "line": "It is not!"
    },
    {
        "character": "Kyle",
        "line": "Kenny, what's funnier? A giant douche or a turd sandwich?"
    },
    {
        "character": "Kenny",
        "line": "(Giant douche.)"
    },
    {
        "character": "Cartman",
        "line": "Aw, you're just saying that because I broke your cat's leg last week."
    },
    {
        "character": "Kyle",
        "line": "Stan, do you pick giant douche or turd sandwich?"
    },
    {
        "character": "Stan",
        "line": "Dude, I really don't care. [walks away]"
    },
    {
        "character": "Kyle",
        "line": "[tallies the votes. Behind him, Butters approaches his locker and prepares to open it] That's two against one, 'cause Stan doesn't care. So it's giant douche."
    },
    {
        "character": "Cartman:",
        "line": "[notices, then runs to Butters and pulls him towards the other boys] ...Wait, wait, what about Butters?"
    },
    {
        "character": "Butters",
        "line": "Huh?"
    },
    {
        "character": "Kyle",
        "line": "You hate Butters."
    },
    {
        "character": "Cartman",
        "line": "Goddammit, you guys, Butters is our friend! And he's allowed to have his opinion! Butters, which is funnier? A stupid not-funny giant douche or a super funny turd sandwich?"
    },
    {
        "character": "Butters",
        "line": "Hahaha, a turd sandwich!"
    },
    {
        "character": "Kyle",
        "line": "You misled him, fatass!"
    },
    {
        "character": "Cartman",
        "line": "It's the best choice, and me and Butters are sticking with it."
    },
    {
        "character": "Butters",
        "line": "[crosses his arms] Yeah! ...What's this for? [the boys approach Jimmy]"
    },
    {
        "character": "Kyle",
        "line": "Jimmy, we're gonna have everyone write in a mascot that's really funny, and you have to tell us which one would be funnier."
    },
    {
        "character": "Jimmy",
        "line": "That's a... fantastic idea fellas. Uh, the key to successful humor is s-staying power. Uh, tell me the first mascot idea."
    },
    {
        "character": "Kyle",
        "line": "A giant douche."
    },
    {
        "character": "Jimmy",
        "line": "Heh, huh okay, that's pretty funny. Now, what's the second?"
    },
    {
        "character": "Cartman",
        "line": "A turd sandwich."
    },
    {
        "character": "Jimmy",
        "line": "Turhr... Ohokahay. Okay, now let's wait ten seconds. [ten seconds pass] Okay now, t-tell me the first one again?"
    },
    {
        "character": "Kyle",
        "line": "Giant douche."
    },
    {
        "character": "Jimmy",
        "line": "[snickers] And the second?"
    },
    {
        "character": "Cartman",
        "line": "Turd sandwich."
    },
    {
        "character": "Jimmy",
        "line": "[snickers] Gee, th-they're both screamingly funny, fellas. Better give it another ten seconds.[ten seconds pass] All right, now we'll see which one really has staying power. Number one?"
    },
    {
        "character": "Kyle",
        "line": "A giant douche."
    },
    {
        "character": "Jimmy",
        "line": "[snickers] Okay, I think, that's it. Number 2?"
    },
    {
        "character": "Cartman",
        "line": "Turd sandwich."
    },
    {
        "character": "Jimmy",
        "line": "[snickers] Gee, I don't know what to say, fellas. They're both instant classics. But I guess I'll have to go with giant douche, simply because the fact that it's a giant renders it useless, adding a parody slant to the satire."
    },
    {
        "character": "Cartman",
        "line": "Awwwww!"
    },
    {
        "character": "Butters",
        "line": "Ohhh, we lost?"
    },
    {
        "character": "Kyle",
        "line": "All right, it's decided. Let's all write in \"Giant Douche.\""
    },
    {
        "character": "Cartman",
        "line": "Okay. You win, Kyle."
    },
    {
        "character": "",
        "line": "The school gym. The students once again assembles on the bleachers. Herbert Garrison stands before the big-screen TV used in the rally earlier, and the TV reads \"New School Mascot '04\"."
    },
    {
        "character": "Herbert Garrison",
        "line": "Attention students, we have tallied your mascot nomination sheets, and there will now be a school-wide vote between the top two nominations. So here is the first most-requested candidate, a giant douche. [a giant douche steps out from behind the TV and begins dancing to 2 Unlimited's \"Get ready for this.\"]"
    },
    {
        "character": "Kyle, Kenny",
        "line": "Go, giant douche!"
    },
    {
        "character": "Giant Douche",
        "line": "Hey, South Park! Have we got school spirit?! [a smattering of applause] We've got spirit, yes we do! Giant douches, me and you! Let's gooooo, Douches! [a smaller smattering of applause]"
    },
    {
        "character": "Herbert Garrison",
        "line": "And now your second nominee, Turd Sandwich. [a turd sandwich steps out from behind the TV and begins dancing to Baha Men's \"Who Let The Dogs Out?\"]"
    },
    {
        "character": "Cartman",
        "line": "All right turd sandwich!"
    },
    {
        "character": "Butters",
        "line": "Yeah!"
    },
    {
        "character": "Kyle",
        "line": "Cartman? What the hell?!"
    },
    {
        "character": "Cartman",
        "line": "Giant Douche sucks!"
    },
    {
        "character": "Turd Sandwich",
        "line": "We've got spirit, yes we do! We are sandwiches filled with poo! Yeeaahhh! [a smattering of applause]"
    },
    {
        "character": "Herbert Garrison",
        "line": "Students can now cast their choice between the Giant Douche and the Turd Sandwich. We'll count up the votes on Tuesday."
    },
    {
        "character": "Kyle",
        "line": "You won't get more votes than us, asshole!"
    },
    {
        "character": "Cartman",
        "line": "Game on, Jew-boy!"
    },
    {
        "character": "Butters",
        "line": "Yeah, game on, Jew-boy! [looks at Cartman, smiles, and looks back at Kyle]"
    },
    {
        "character": "",
        "line": "The front doors of the school. Stan and Kenny flank the entrance and hand out buttons as the other kids come out."
    },
    {
        "character": "Kyle",
        "line": "Be sure to vote for Giant Douche."
    },
    {
        "character": "Kenny",
        "line": "(Giant Douche! Vote for him!)"
    },
    {
        "character": "Kyle",
        "line": "Giant Douche is your man!"
    },
    {
        "character": "Stan",
        "line": "[exiting] Kyle, aren't you taking this a little too far? I mean, do we really want a giant douche to be our school mascot?"
    },
    {
        "character": "Kyle",
        "line": "Dude, I'm not going to lose to Cartman's stupid turd sandwich. [something like an ice cream truck is heard, and Cartman appears driving his Big Wheels bike, pulling a portable stage. Butters is dancing on the stage, dressed as a Hawaiian hula dancer. In his hands he has leis to hand out.]"
    },
    {
        "character": "Cartman",
        "line": "Vote for Turd Sandwich. This is the most important election of our lives. [Butters begins tossing out the leis, and kids step forth to get them. A man shows up as well, but gets nothing] Turd Sandwich brings us hope for change. A vote for Turd Sandwich is a Vote for tomorrow!"
    },
    {
        "character": "Kyle",
        "line": "There. Do you really want that asshole to win?"
    },
    {
        "character": "Stan",
        "line": "I'm not voting!"
    },
    {
        "character": "Kyle",
        "line": "What? Y-you gotta vote, dude. Haven't you seen the Rock the Vote stuff or, or Puff Daddy's Vote or Die?!"
    },
    {
        "character": "Stan",
        "line": "I just think this whole thing is stupid! [walks off angrily]"
    },
    {
        "character": "Kyle",
        "line": "Kenny, we have got to make Stan understand the importance of voting, because he'll definitely vote for our guy."
    },
    {
        "character": "Kenny",
        "line": "(Yeah.)"
    },
    {
        "character": "",
        "line": "The Marsh house, dinnertime. The family is gathered at table, with Marvin at one end, Randy at the other. Sharon comes in with plates and the main course."
    },
    {
        "character": "Sharon",
        "line": "How was school today, Stanley?"
    },
    {
        "character": "Stan",
        "line": "It was ridiculous. We have to have a new school mascot and we're supposed to vote between a giant douche and a turd sandwich."
    },
    {
        "character": "Sharon",
        "line": "...What did you say?"
    },
    {
        "character": "Randy",
        "line": "Did you just say that... voting is ridiculous?"
    },
    {
        "character": "Stan",
        "line": "No, I think voting is great, but, if I have to choose between a douche and a turd, I just don't see the point."
    },
    {
        "character": "Randy",
        "line": "[clenches his fists] You don't see the point! Oh, you young people just make me sick!"
    },
    {
        "character": "Sharon",
        "line": "Stanley, do you know how many people died so you could have the right to vote?!"
    },
    {
        "character": "Stan",
        "line": "Mom, I just don't think there's much of a difference between a douche and a turd. I d-I don't care."
    },
    {
        "character": "Randy",
        "line": "[jumps upright and plants his hands on the table] You don't care?! You really want a turd sandwich as your school mascot?! On your football helmets?! A turd?!"
    },
    {
        "character": "Sharon",
        "line": "Well, hold on, Randy, I think a turd sandwich is a little better than them having a giant douche on their uniforms."
    },
    {
        "character": "Randy",
        "line": "You're crazy!! A d-a douche is at least clean!"
    },
    {
        "character": "Sharon",
        "line": "It's sexist, is what it is!"
    },
    {
        "character": "Randy",
        "line": "You don't understand the issues, Sharon!"
    },
    {
        "character": "Sharon",
        "line": "Are you calling me ignorant?!"
    },
    {
        "character": "Randy",
        "line": "You think the school mascot should be a turd sandwich? Well you're not exactly Einstein!"
    },
    {
        "character": "Sharon",
        "line": "I am sick of you belittling my opinion, you son of a bitch! [picks up the casserole and chucks it at Randy, who ducks and looks back at her angrily. They both leave the table in opposite directions.]"
    },
    {
        "character": "Shelly",
        "line": "[leaving the table as well] I hate this family, I hate it! [Stan looks on, shocked, while Marvin continues eating unruffled. The door bell rings. Stan leaves the table and opens the front door. A black man is outside... with his posse]"
    },
    {
        "character": "Stan",
        "line": "Puff Daddy?"
    },
    {
        "character": "Puff Daddy",
        "line": "Your friend Kyle told me you don't understand the importance of voting."
    },
    {
        "character": "Stan",
        "line": "I..."
    },
    {
        "character": "Puff Daddy",
        "line": "Apparently, you haven't heard of my \"Vote or Die\" campaign. [holds up a shirt with the slogan on it]"
    },
    {
        "character": "Stan",
        "line": "\"Vote or Die\"? [upset] What the hell does that even mean?!"
    },
    {
        "character": "Puff Daddy",
        "line": "[whips out a gun from his back pocket, cocks it, and aims it at Stan] What you think it means, bitch!"
    },
    {
        "character": "Stan",
        "line": "Aaaah!"
    },
    {
        "character": "",
        "line": "Music video. Stan is running down the street. An open-roof car pops up behind him and bears down on him."
    },
    {
        "character": "Posse",
        "line": "Vote or die, motherfucker, motherfucker, vote or die!.\n\n\n"
    },
    {
        "character": "Puff Daddy",
        "line": "Rock the vote or else I'm gonna stick a knife through your eye..\n\n\n"
    },
    {
        "character": "Posse",
        "line": "Democracy is founded on one simple rule!\n\n\n"
    },
    {
        "character": "",
        "line": "Overhead shot of Puff Daddy, dressed in a white suit, then in a black suit."
    },
    {
        "character": "Puff Daddy",
        "line": "Get out there and vote or I will motherfucking kill you.Yeah.\n\n\n"
    },
    {
        "character": "",
        "line": "At a polling station encouraging one female voter."
    },
    {
        "character": "Puff Daddy",
        "line": "I like it when you vote, bitch! (bitch!)\nShake them titties when you vote, bitch! (bitch!)\n[seated as two women dance for him, their asses in his face]\nI slam my jimmy through your mouth roof (mouth roof)\n[gently spanks a woman as she goes in to vote]\nNow get your big ass in the pollin' booth.\n[Fish-eye overhead view of Puff Daddy. He shoves his gun into the camera]\nI said vote, bitch, or I'll fucking kill you!\n\n\n"
    },
    {
        "character": "",
        "line": "Stan runs until he sees a passageway between two buildings. He does in to try to escape, but Puff Daddy and his crew find him."
    },
    {
        "character": "Posse",
        "line": "Vote or die, motherfucker, motherfucker, vote or die!\n\n\n"
    },
    {
        "character": "Puff Daddy",
        "line": "You can't run from a .38, go ahead and try!\n\n\n"
    },
    {
        "character": "",
        "line": "Puffy is seated in an armchair wearing a wig, surrounded by women, all in front of a Vegas-style sign saying \"DIDDY\""
    },
    {
        "character": "Posse",
        "line": "Let your opinion be heard! You gotta make a choice\n\n\n"
    },
    {
        "character": "",
        "line": "Raps to a chrome reflection."
    },
    {
        "character": "Puff Daddy",
        "line": "'Cause after I slit your throat you won't have a fucking voice [Stan runs again, looking behind him, but runs into a gun in his face]\n\n\n"
    },
    {
        "character": "Puff Daddy",
        "line": "Vote or die! Vote or die! [Puff Daddy's gun is joined by the guns of his posse. Stan is looking at five barrels]\n\n\n"
    },
    {
        "character": "Stan",
        "line": "...Okay. I'll vote."
    },
    {
        "character": "",
        "line": "Cartman and Butters begin door-to-door campaigning. Cartman knocks on a door and Clyde answers."
    },
    {
        "character": "Clyde",
        "line": "What do you guys want?"
    },
    {
        "character": "Cartman",
        "line": "We were just wondering who you might be voting for, for the school's new mascot."
    },
    {
        "character": "Clyde",
        "line": "I haven't decided yet."
    },
    {
        "character": "Cartman",
        "line": "Oh really? Well, that's interesting. You certainly should think about it and make the right decision. [pulls out a wrapped hard candy and shows it] Butterscotch candy?"
    },
    {
        "character": "Clyde",
        "line": "[reaches out and grabs it] Sure. [opens it]"
    },
    {
        "character": "Cartman",
        "line": "Clyde, are you aware of what Turd Sandwich can bring to our school?"
    },
    {
        "character": "Butters",
        "line": "A turd sandwich is not only the first turd to be nominated school mascot, but even the first sandwich. [Clyde bites into the candy, producing loud crunches]"
    },
    {
        "character": "Cartman",
        "line": "You see, what Turd Sandwich brings to our school, Clyde, is a complete package. The turd and the bread. And the lettuce, and the olives."
    },
    {
        "character": "Butters",
        "line": "Whe-where as Giant Douche is just, well, ju-just a, ju-ju-just a giant douche."
    },
    {
        "character": "Cartman",
        "line": "So, come voting day, you'll now most likely vote for the turd sandwich, yes?"
    },
    {
        "character": "Clyde",
        "line": "[finishes the candy, then thinks for a few seconds] I'm still not totally sure."
    },
    {
        "character": "Cartman",
        "line": "Well then, perhaps we could interest you in [pulls out another wrapped candy] another butterscotch candy? [Clyde takes the candy and consumes that one as well]"
    },
    {
        "character": "",
        "line": "South Park Elementary, now a polling station. A \"Vote for School Mascot!\" hangs on the back wall and over the hallway. A reluctant Stan takes a ballot, and Kyle smiles, thinking he has Stan on his side."
    },
    {
        "character": "Kyle",
        "line": "You're doing the right thing, Stan. Don't you feel like you're a part of something now?"
    },
    {
        "character": "Stan",
        "line": "I guess... [P Diddy and his posse look on from one end of the polling station, with P cocking his gun]"
    },
    {
        "character": "Kyle",
        "line": "Look, it may not seem important now, but your vote really does count, and we all have to do our part."
    },
    {
        "character": "Stan",
        "line": "Okay. [finishes up and seals his ballot, then walks away]"
    },
    {
        "character": "Kyle",
        "line": "Woah... wait, what are you doing?"
    },
    {
        "character": "Stan",
        "line": "I'm voting."
    },
    {
        "character": "Kyle",
        "line": "No, no, you... you wrote down Turd Sandwich."
    },
    {
        "character": "Stan",
        "line": "Yeah, I know."
    },
    {
        "character": "Kyle",
        "line": "...Dude, you're supposed to vote for Giant Douche."
    },
    {
        "character": "Stan",
        "line": "[annoyed] I thought I was supposed to make my own decision."
    },
    {
        "character": "Kyle",
        "line": "Well yeah, but not if your decision is for Turd Sandwich! What the hell is wrong with you?!"
    },
    {
        "character": "Stan",
        "line": "Wait a minute, you didn't want me to vote, you wanted me to vote for your guy!"
    },
    {
        "character": "Kyle",
        "line": "Well, I just figured you'd vote for my guy! Who's fuckin' friend are you?! [calls out to] Puffy!"
    },
    {
        "character": "Cartman",
        "line": "[interrupts] Hey, fuck off, Kyle. [aside, about Puffy and his crew] Don't let them intimidate you, Stan. I'll help walk you to the booth. And then I'm gonna buy you a nice steak dinner with all the trimmings."
    },
    {
        "character": "Stan",
        "line": "Oh, forget it! I'm not gonna be persuaded into voting and I'm and I'm not gonna be threatened into voting if I don't feel comfortable with it! I'm not gonna vote and you can all just live with it!"
    },
    {
        "character": "",
        "line": "The Principal's Office, later."
    },
    {
        "character": "Principal Victoria",
        "line": "We've simply had it with your son, Mr. and Mrs. Marsh. Voting just doesn't appear to be important to him."
    },
    {
        "character": "Randy",
        "line": "Stanley, when you left for school this morning, you said you were going to vote!"
    },
    {
        "character": "Stan",
        "line": "The whole thing is a joke!"
    },
    {
        "character": "Sharon",
        "line": "You see? He's out of control. It's nearly torn our whole family apart."
    },
    {
        "character": "Principal Victoria",
        "line": "Well, my hands are tied. We can no longer have Stan's behavior jeopardizing the other children. He must be removed."
    },
    {
        "character": "Randy",
        "line": "Oh! Are you happy now, Stan? You just got yourself suspended!"
    },
    {
        "character": "Principal Victoria",
        "line": "No, I'm afraid it's worse than that. By county law I'm bound to enforce the harshest punishment possible."
    },
    {
        "character": "Randy",
        "line": "Expulsion?!"
    },
    {
        "character": "Principal Victoria",
        "line": "No. Banishment."
    },
    {
        "character": "Stan",
        "line": "B-bani-banishment?"
    },
    {
        "character": "Principal Victoria",
        "line": "You can appeal to the city council, but I don't think it'll do any good. Your son must leave South Park, never to return."
    },
    {
        "character": "Sharon",
        "line": "[goes over to Randy and cries into his chest] Oh, Randy!"
    },
    {
        "character": "Randy",
        "line": "Our son, banished! Where did we go wrong?! [cries on Sharon's shoulder]"
    },
    {
        "character": "Stan",
        "line": "You-you're all joking, right?"
    },
    {
        "character": "",
        "line": "A moonlit partly-cloudy night in South Park. The townsfolk are gathered at the edge of town, with Stan facing them all alone. A horse stands at the ready on one side of Main Street."
    },
    {
        "character": "Mayor McDaniels",
        "line": "[steps forth and reads a proclamation] As it was in the times of our forefathers, so it is now. Stan Marsh, for not following our most sacred of rites, you are hereby banished from South Park for all eternity. Or until you decide that voting is important. Good-bye, Stan. May the gods treat you more kindly than we did. [the townsfolk step forth and begin ripping away at Stan's coat and shirt. Herbert Garrison is first: he rips off a piece of Stan's coat, spits on it, and throws it back at Stan. He leaves and Officer Barbady steps forth, repeating what Herbert Garrison did. Craig follows suit, then Kyle steps up]"
    },
    {
        "character": "Kyle",
        "line": "Stan, don't you think this has gone far enough? Is it really that big a deal? [Stan sighs, but says nothing more in response] Yeah, just vote. For Giant Douche."
    },
    {
        "character": "Stan",
        "line": "I'm not voting! [Kyle then steps forth and repeats what the others did before him]"
    },
    {
        "character": "A bodyguard",
        "line": "Yo, Puffy man, are we just gonna let this happen? [cocks his weapon] We've gots to kill this non-votin' fool!"
    },
    {
        "character": "Puff Daddy",
        "line": "No, Justacious, let him go. He won't survive a fore-night in the wilderness. [the adults tie Stan up on the horse backwards and send him off with supplies to tide him over for a while]"
    },
    {
        "character": "Randy",
        "line": "This is breaking your mother's heart, Stan. She couldn't even help tie you to the horse."
    },
    {
        "character": "Stan",
        "line": "Dad, isn't this a little extreme?"
    },
    {
        "character": "Randy",
        "line": "Jesus. I guess maybe you'll never understand how important voting is. [puts a pail over Stan's head] Goodbye, Son. [stops for a few seconds, then swats the horse to get it moving. The horse walks off slowly. Stephen Stotch steps up with a horn and blows into it. Randy and Sharon stand together, embracing shoulders] That's... one of the hardest things a parent ever has to do."
    },
    {
        "character": "",
        "line": "A plain, night. Stan rides into the night and into the morning on the plain, then through a desert, then into a forest. A group of people appear and spot him"
    },
    {
        "character": "Bearded PETA member",
        "line": "Look! What is that?"
    },
    {
        "character": "Blonde PETA member 2",
        "line": "Oh, the poor thing!"
    },
    {
        "character": "Stan",
        "line": "Hello? [the people gather round and remove the pail]"
    },
    {
        "character": "Blonde PETA member 2",
        "line": "Don't worry, we'll free you."
    },
    {
        "character": "Bearded PETA member",
        "line": "Just sit still for a moment."
    },
    {
        "character": "Stan",
        "line": "Oh, thank God."
    },
    {
        "character": "Bearded PETA member",
        "line": "Get offa him, you filthy human! [they throw Stan off the horse. The pail rolls away. Stan looks back, confused, tufts of hair popping out through the holes on his torn cap. The people were apparently talking to the horse, not to him. The camera goes back to the horse, and the people are shown to be members of PETA. They're cleaning the horse up]"
    },
    {
        "character": "Blonde PETA member 2",
        "line": "Poor thing needs water."
    },
    {
        "character": "Bearded PETA member",
        "line": "You're safe now."
    },
    {
        "character": "Blonde PETA member 2",
        "line": "Shame on you, making this horse your slave. [a balding man throws real blood on Stan]"
    },
    {
        "character": "Stan",
        "line": "Awww!"
    },
    {
        "character": "Blonde PETA member 2",
        "line": "Come, you can live with us."
    },
    {
        "character": "Bearded PETA member",
        "line": "We will give you food and shelter."
    },
    {
        "character": "Stan",
        "line": "What about me?"
    },
    {
        "character": "Bearded PETA member",
        "line": "Open the gate! [A pair of gates open up to the PETA compound. The members lead the horse in and Stan trails along. They approach whom looks to be the leader of the compound. The compound itself has all kinds of animals - it's an animal sanctuary]"
    },
    {
        "character": "Blonde PETA member",
        "line": "[presenting the horse]This poor creature is in need of food and water."
    },
    {
        "character": "Balding man",
        "line": "[strokes the horse's mane] You have a home here, friend."
    },
    {
        "character": "Bearded PETA member",
        "line": "The... kid wants to stay, too."
    },
    {
        "character": "Stan",
        "line": "I was put on the horse. I didn't wanna ride it."
    },
    {
        "character": "Balding man",
        "line": "I don't know if you can stay. We'll have to ask Dr. Cornwallis. Come. [they walk among the animals. Stan looks around and takes it all in.] We don't normally allow outsiders. See, here we live in harmony with animals. They're not our pets but our fellow living beings. We work with the animals and try to live as they do. [stops, lowers his pants, and shits onto the ground. Stan looks on astonishment, then walks around the pile of shit as the man pulls his pants back up and walks on.] We make friends with the animals. We coexist, and we... intermarry. [approaches a llama and puts his arm around her neck] This is my wife, Janice. [Stan looks on quizzically] The outside world looks down on a man marrying a llama, but our love knows no boundaries. [he turns to the llama, has her face him, and starts kissing her. Stan just gawks at the pair]"
    },
    {
        "character": "Stan",
        "line": "Wow, you guys really love animals."
    },
    {
        "character": "Balding man",
        "line": "[moves on to a man and a chicken] And why not? Mark here has been with Kelly for three years now. [moves on to another man and an ostrich] And Gary and Sally here have just managed to have a child together. [in a manger is an ostrich-baby, somewhat humanoid with an ostrich beak]"
    },
    {
        "character": "Ostrich-baby",
        "line": "Kill me..."
    },
    {
        "character": "Balding man",
        "line": "Yes, life here is good and natural. But now that you know where our compound is, you'll either have to live with us, or be murdered. [they stop before a tent]"
    },
    {
        "character": "Stan",
        "line": "I'll live with you."
    },
    {
        "character": "Balding man",
        "line": "It's not up to you. You'll have to talk with Dr. Cornwallis. [Stan pauses at the tent's entrance, then enters and approaches a goat, which is munching on hay. The goat stops and looks at Stan, then resumes eating. Stan exits the tent] What did he say?"
    },
    {
        "character": "Stan",
        "line": "He said I can stay."
    },
    {
        "character": "Balding man",
        "line": "Excellent! Dr. Cornwallis is wise beyond his year. Here's your PETA shirt and a bumper sticker. [Stan looks at his new stuff]"
    },
    {
        "character": "",
        "line": "SP Public Access Presents: Debate 2004."
    },
    {
        "character": "Announcer",
        "line": "This is Debate 2004 with your host, Jim Lehrer."
    },
    {
        "character": "Jim Lehrer",
        "line": "Welcome to the cable-access televised debate between a giant douche [screen left] and a turd sandwich [screen right] We'll start with Giant Douche. Sir, some students and parents are reluctant to have a... giant douche represent them. What do you say to those people?"
    },
    {
        "character": "Giant Douche",
        "line": "Jim, first of all I would like to thank you for monitoring this debate. And I would like to thank all of the students and their parents for coming."
    },
    {
        "character": "Cartman",
        "line": "Aww, suck-up, suck-up! [a man behind him and to his right leans over and shushes him] What?! That's an obvious suck-up move."
    },
    {
        "character": "Giant Douche",
        "line": "But I would hope that those students and their parents who question my qualities would simply look at my opponent. He is a turd sandwich"
    },
    {
        "character": "Turd Sandwich",
        "line": "[leaning forward] You're a turd sandwich."
    },
    {
        "character": "Giant Douche",
        "line": "... No, sir, if you'll pardon me, you are in fact, the turd sandwich."
    },
    {
        "character": "Turd Sandwich",
        "line": "[quickly countering] You're a turd sandwich."
    },
    {
        "character": "Giant Douche",
        "line": "... Sir, you are a turd sandwich."
    },
    {
        "character": "Turd Sandwich",
        "line": "[quickly countering] You're a turd sandwich."
    },
    {
        "character": "Jim Lehrer",
        "line": "Ahh, Turd Sandwich, I will ask you not to speak out of turn."
    },
    {
        "character": "Turd Sandwich",
        "line": "I-I'm sorry, Jim."
    },
    {
        "character": "Giant Douche",
        "line": "Anyway, as I was saying, ahh... wait, I-I forgot what I was saying."
    },
    {
        "character": "Turd Sandwich",
        "line": "Ha. What a douche."
    },
    {
        "character": "Jim Lehrer",
        "line": "All right, Turd Sandwich, this next question is for you. How should South Park Elementary enforce its laws of conduct for young athletes during sporting events."
    },
    {
        "character": "Turd Sandwich",
        "line": "[long pause] ...Uh, you know, uh, my opponent wouldn't even know the answer to that question. If you ask him the same question, he would not answer it. [Giant Douche just looks at him] He would stand around and just babble on and on about nothing until he was finally saved by the buzze-. [the buzzer sounds over his last two words.]"
    },
    {
        "character": "Jim Lehrer",
        "line": "Your time is up, Turd."
    },
    {
        "character": "",
        "line": "The PETA compound, next morning. Stan scrubs away at the empty tubs and buckets of food the animals ate from the previous day. The bald man approaches."
    },
    {
        "character": "Balding man",
        "line": "Stan, I want to introduce you to my stepdaughter, Teresa. [the camera pans down to show a lamb with small horns] She seems to have taken a liking to you. [suggestively] And she's ovulating."
    },
    {
        "character": "Stan",
        "line": "Ahh, no thanks, that's okay."
    },
    {
        "character": "Balding man",
        "line": "Stan, some PETA members are growing concerned that maybe you don't love animals."
    },
    {
        "character": "Stan",
        "line": "I do love animals, just ...not like you guys do."
    },
    {
        "character": "Balding man",
        "line": "You... don't belong here, Stan. You should return home."
    },
    {
        "character": "Stan",
        "line": "I can't. I was banished for not voting."
    },
    {
        "character": "Balding man",
        "line": "But, why on earth wouldn't you wanna vote?"
    },
    {
        "character": "Stan",
        "line": "I think voting is great. I just didn't care this time because it was between a giant douche and a turd sandwich."
    },
    {
        "character": "Balding man",
        "line": "But Stan, don't you know? It's always between a giant douche and a turd sandwich. Nearly every election since the beginning of time has been between some douche and some turd. They're the only people who suck up enough to make it that far in politics."
    },
    {
        "character": "Stan",
        "line": "I guess... I guess you're right. [casts his eyes down and to the left in reflection. An arm appears, with a gun at the end aimed at Stan]"
    },
    {
        "character": "Puff Daddy",
        "line": "Yo, what did I say was going to happen to you, bitch? [his four bodyguards aim their guns at Stan as well]"
    },
    {
        "character": "Stan",
        "line": "[jumps] Aaah!"
    },
    {
        "character": "Man in shorts",
        "line": "[pops in] Aaaah!! He's wearing the skin of an animal! [runs off, only to return with a pail of real blood] Take that! [throws the blood at Puff Daddy, who spreads his arms out and down. The man calms down] I... hope that teaches you a lesson about wearing fur."
    },
    {
        "character": "Puff Daddy",
        "line": "Itius, Rodicus! [the bodyguards fire their weapons at the PETA members]"
    },
    {
        "character": "Bodyguard",
        "line": "Vote or die!"
    },
    {
        "character": "Stan",
        "line": "[braves his way through the crossfire, but gets hit on his left shoulder] Aaaah!! [keeps moving]"
    },
    {
        "character": "PETA man",
        "line": "[goes to shield a dog] Protect the animals! Protect the animals! [he's shot and falls away. The dog then urinates on the man's head]"
    },
    {
        "character": "Balding man",
        "line": "[rushes up to his llama and holds her] Janice, we shall die together in each other's arms! [three shots kill him and the llama prances away. More PETA members fall.]"
    },
    {
        "character": "Ostrich-baby",
        "line": "Kill me! Kill meee!! [Dr. Cornwallis is out of his tent and munching on the head of a dead man]"
    },
    {
        "character": "",
        "line": "South Park Elementary polling station. Mr. Mackey tallies up the votes."
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay... that's one more vote for Turd Sandwich."
    },
    {
        "character": "Randy",
        "line": "[through clenched teeth] So who won, Mr. Mackey?"
    },
    {
        "character": "Mr. Mackey",
        "line": "It's pretty close, but it looks like Giant Douche is gonna win."
    },
    {
        "character": "Cartman",
        "line": "Oh, no! Noooo!!"
    },
    {
        "character": "Kyle",
        "line": "Ha! You lose, fatass!"
    },
    {
        "character": "Butters",
        "line": "[by the doors, motions to the others to look] Uh hey, wait a minute! [the others present gather round and look out. Stan approaches the school, battered and injured, and the others stream out of the school]"
    },
    {
        "character": "Randy",
        "line": "Stan!"
    },
    {
        "character": "Sharon",
        "line": "Stan, you came back. Does that mean... you learned the importance of voting?"
    },
    {
        "character": "Stan",
        "line": "I learned that I'd better get used to having to pick between a douche and a turd sandwich because it's usually the choice I'll have."
    },
    {
        "character": "Randy",
        "line": "He's going to vote!"
    },
    {
        "character": "Townsfolk",
        "line": "[murmuring amongst themselves] He's going to vote. He's going to vote. [they gather round and hoist Stan up, carrying him inside. Stan is lowered and he fills out the ballot. He holds his shoulder and thinks a moment while images of an eagle, the White House, and the US flag float in the background. He makes up his mind, he votes for Turd Sandwich. He considers his vote, then approaches the ballot box and drops his ballot in. Mr. Mackey, holding the box, spins around in his chair happily.]"
    },
    {
        "character": "Singer",
        "line": "Let's get out the vote! Let's make our voices heard!\nWe've been given the right to choose between a douche and a turd.\nIt's democracy in action! Put your freedom to the test.\nA big, fat turd or a stupid douche. Which do you like best?\n\n\n"
    },
    {
        "character": "Mr. Mackey",
        "line": "[Adding Stan's vote to the tally] Stan's vote bring the total votes for Turd Sandwich to... thirty six! And Giant Douche has... one thousand, four hundred, and ten. Giant Douche still wins!"
    },
    {
        "character": "Some townsfolk",
        "line": "Yeah! All right!"
    },
    {
        "character": "Other townsfolk",
        "line": "Aawwww!"
    },
    {
        "character": "Stan",
        "line": "Dude, so my vote didn't even really matter!"
    },
    {
        "character": "Randy",
        "line": "Hey! That's not true, Stan."
    },
    {
        "character": "Sharon",
        "line": "[genuflects behind Stan] You can't judge the merits of voting on whether or not your candidate won."
    },
    {
        "character": "Randy",
        "line": "[genuflects behind Stan] Your vote still mattered."
    },
    {
        "character": "Herbert Garrison",
        "line": "[rushing into the school] Hey everybody! [holds up a shredded PETA shirt. Everyone turns and looks] They just found all the PETA members murdered at their compound! [all gasp]"
    },
    {
        "character": "Mr. Mackey",
        "line": "What the? They're all dead? Well, that means..."
    },
    {
        "character": "Clyde",
        "line": "That we can go back to being the South Park Cows! [opens his jacket and shows off his Cows shirt]"
    },
    {
        "character": "All",
        "line": "Hooray! All right!"
    },
    {
        "character": "Randy",
        "line": "[to Stan] Now your vote didn't matter."
    }
]