[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The school bell rings. Some fourth graders chat in the hall as Wendy passes by: Clyde talking to Kenny and Kyle."
    },
    {
        "character": "Clyde",
        "line": "Yeah, and it was called Man from Atlantis, and he had like, webbed fingers... [Stan rushes up to them and grabs Kyle by the coat]"
    },
    {
        "character": "Stan",
        "line": "Kyle, Kenny! I have to talk to you right now!"
    },
    {
        "character": "Kyle",
        "line": "Okay, hang on a second I-"
    },
    {
        "character": "Stan",
        "line": "[pulls Kyle away] Right now, goddamnit!"
    },
    {
        "character": "Kyle",
        "line": "All right, all right! [Stan pulls him further away until there's no one around them] Dude, what is the matter with you?"
    },
    {
        "character": "Stan",
        "line": "[the look of fear is strong on his face] Trent Boyett is being released from Juvenile Hall. [the boys are suddenly afraid]"
    },
    {
        "character": "Kenny",
        "line": "(WHAT??!!!?)"
    },
    {
        "character": "Kyle",
        "line": "Trent Boyett?! The kid from preschool?!"
    },
    {
        "character": "Stan",
        "line": "Yeah! He just got paroled!"
    },
    {
        "character": "Kyle",
        "line": "Oh, no! No!"
    },
    {
        "character": "Cartman",
        "line": "Hey gay-butts, what's goin' on?"
    },
    {
        "character": "Kyle",
        "line": "Trent Boyett is being released from Juvenile Hall."
    },
    {
        "character": "Cartman",
        "line": "Really? That's cool. When did- [realizes what Kyle has just said and stops completely in place] What did you say? [rushes up to Kyle] Trent Boyett?! Meanest, dirtiest, toughest kid in the world, super-pissed off at us, Trent Boyett?!"
    },
    {
        "character": "Kyle",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "Oh, Holy Jesus, God..."
    },
    {
        "character": "Stan",
        "line": "What the hell are we gonna do??"
    },
    {
        "character": "Butters",
        "line": "[runs up to the boys] Is it true?! Trent Boyett is getting out?!"
    },
    {
        "character": "Cartman",
        "line": "It's true."
    },
    {
        "character": "Butters",
        "line": "Oh Jesus, Oh Christ in Heaven, I gotta hide! [rushes off to do that, past the other kids in the hall to the front door...] Uh, oh boy! [bursts through the front doors and runs away babbling]"
    },
    {
        "character": "Cartman",
        "line": "He's gonna come for us, you guys. We are dead men."
    },
    {
        "character": "Kyle",
        "line": "Look, maybe he's forgiven us. I mean, we were only in preschool."
    },
    {
        "character": "",
        "line": "Flashback to preschool days. It's playtime, and the kids are busy doing things, sliding and such."
    },
    {
        "character": "Stan",
        "line": "Dude, let's play Fireman."
    },
    {
        "character": "Kyle",
        "line": "Totally, dude, let's play Fireman."
    },
    {
        "character": "Cartman",
        "line": "Jews can't be firemen."
    },
    {
        "character": "Kyle",
        "line": "Shut up, fat ass!"
    },
    {
        "character": "Cartman",
        "line": "Don't call me fat, you stupid Jew!"
    },
    {
        "character": "Kenny",
        "line": "(How about we put a real fire out?)"
    },
    {
        "character": "Stan",
        "line": "Hey, Kenny's right. We should put out a real fire. Then we'll be heroes!"
    },
    {
        "character": "Cartman",
        "line": "But how do we start a fire?"
    },
    {
        "character": "Kyle",
        "line": "Trent Boyett will do it. He's the toughest, baddest kid in preschool! [a shot of Trent beating up another kid with a play hammer. He delivers two blows]"
    },
    {
        "character": "Trent",
        "line": "Say Uncle!"
    },
    {
        "character": "Boy",
        "line": "Uncle!"
    },
    {
        "character": "Trent",
        "line": "[two more blows] Say Uncle!!!!!!"
    },
    {
        "character": "Boy",
        "line": "Uncle! [satisfied, Trent lets the boy go, and Stan and the others advance to him]"
    },
    {
        "character": "Trent",
        "line": "[turns around] What do you shitheads want?!"
    },
    {
        "character": "Kyle",
        "line": "Do you know how to start a fire?"
    },
    {
        "character": "Trent",
        "line": "Sure! I burn lots stuff."
    },
    {
        "character": "Stan",
        "line": "Start one. Then we're gonna put it out."
    },
    {
        "character": "Kyle",
        "line": "We're firemen!"
    },
    {
        "character": "Trent",
        "line": "Do you dickheads even know how to put out a fire?"
    },
    {
        "character": "Stan",
        "line": "Yeah, yeah. We play Fireman all the time."
    },
    {
        "character": "Cartman",
        "line": "Don't worry, Trent."
    },
    {
        "character": "Trent",
        "line": "All right, fine. [walks back to the table, grabs a sheet of paper, crumples it up, and lays it down on the floor. He sets it on fire]"
    },
    {
        "character": "Butters",
        "line": "[approaches] Hey fellas, you'd better be careful."
    },
    {
        "character": "Cartman",
        "line": "Shut up, Butters! We know what we're doing!"
    },
    {
        "character": "Butters",
        "line": "Oh, all right then. [turns around and walks off. The sheet catches fire]"
    },
    {
        "character": "Stan",
        "line": "Wow, cool!"
    },
    {
        "character": "Kyle",
        "line": "Code 7! Bring in the firemen!"
    },
    {
        "character": "Stan",
        "line": "[walks up to the crumples sheet] Woo, woo, woo, woo. Clang, clang, clang, clang, clang! [drops his pants and begins pissing on the paper] Come on, firemen! Put out the fire! [the other boys come and imitate the fire truck noises while pissing on the paper. Trent looks on.]"
    },
    {
        "character": "Stan",
        "line": "We're heroes!"
    },
    {
        "character": "Kyle",
        "line": "[smiles] We saved the school!"
    },
    {
        "character": "Trent",
        "line": "[sees that the fire is spreading] Put it out!"
    },
    {
        "character": "Ms. Claridge",
        "line": "[a female, notices the fire and arrives] Trent Boyett, what have you done now?!"
    },
    {
        "character": "Trent",
        "line": "They said they could put it out!"
    },
    {
        "character": "Ms. Claridge",
        "line": "Children, get back away, now! [shoos the boys away, then tries to smother the fire out with a blanket. The blanket catches fire, and so does she.] AAAAAAAAAAAAAAAAH!!!  [runs from the blanket, then twirls in her own flames as the alarm goes off] I'M BUUURNIIIING!!!"
    },
    {
        "character": "Stan",
        "line": "Put it out, put it out! [Cartman runs up to their teacher and starts pissing on her. Stan, Kyle, and Kenny follow suit]"
    },
    {
        "character": "",
        "line": "South Park Elementary, moments later, still in the flashback. The teacher is being put in an ambulance."
    },
    {
        "character": "Paramedic",
        "line": "Come on, hurry! We've gotta get her to the hospital! [the paramedics hop into the ambulance and drive off, siren blaring]"
    },
    {
        "character": "Stan",
        "line": "Dude, we are in so much trouble!"
    },
    {
        "character": "Kyle",
        "line": "My mom is gonna break my legs!"
    },
    {
        "character": "Cartman",
        "line": "Hey, we didn't start the fire, Trent Boyett did."
    },
    {
        "character": "Stan",
        "line": "That's true."
    },
    {
        "character": "Officer",
        "line": "You boys! Trent is trying to tell us the fire was your idea."
    },
    {
        "character": "Stan",
        "line": "No!"
    },
    {
        "character": "Kyle",
        "line": "Not us. We're good kids."
    },
    {
        "character": "Trent",
        "line": "Tell them it was an accident: you thought you could put it out."
    },
    {
        "character": "Cartman",
        "line": "Trent Boyett is a liar, sir."
    },
    {
        "character": "Officer",
        "line": "I thought so. All right, that's it, Trent. You're going to Juvenile Hall for a long time!"
    },
    {
        "character": "Trent",
        "line": "[pleading as he passes Butters] Butters, you saw! Tell them what happened!"
    },
    {
        "character": "Butters",
        "line": "U-Ah, gee-whiz, Trent. Ah, I don't wanna get involved. Or else my parents will ground me."
    },
    {
        "character": "Trent",
        "line": "You'd better pray I never get out of Juvenile Hall! You'd better all pray! [the officer wrestles him into the patrol car and closes the door]"
    },
    {
        "character": "Kyle",
        "line": "Dude, when he gets out of Juvenile Hall, he's gonna wanna kill us!"
    },
    {
        "character": "Cartman",
        "line": "Whatever. That's like five years from now."
    },
    {
        "character": "Stan",
        "line": "Yeah, who cares?"
    },
    {
        "character": "The boys",
        "line": "[cheering] All right, yeah, woohoo, we did it!"
    },
    {
        "character": "",
        "line": "The flashback ends and the boys are shown in the hall again."
    },
    {
        "character": "Stan",
        "line": "Now it's five years later. And Trent Boyett is being released."
    },
    {
        "character": "Cartman",
        "line": "Oh Jesus, he's gonna kill us. We-we've gotta tell our parents!"
    },
    {
        "character": "Kyle",
        "line": "We can't tell our parents, dude! We lied to everybody! Nobody knows we're responsible for Ms. Claridge's accident!"
    },
    {
        "character": "Stan",
        "line": "Shhh, here comes Ms. Claridge now. [a soft noise is heard, and in rolls a futuristic wheelchair, encasing Ms. Claridge]"
    },
    {
        "character": "The boys",
        "line": "Hello, Ms. Claridge. [she turns to face them]"
    },
    {
        "character": "Stan",
        "line": "[nervously] Are you having a nice day, Ms. Claridge? [a yellow button on the machine lights up and beeps. She turns left and rolls away]"
    },
    {
        "character": "Cartman",
        "line": "You guys, what the fuck are we gonna do?! In case you've forgotten, Trent Boyett is the meanest kid we ever knew. He's gonna tear us apart!"
    },
    {
        "character": "Kyle",
        "line": "Look, that was a long time ago. Maybe Trent Boyett has forgotten all about it."
    },
    {
        "character": "",
        "line": "Juvenile Hall, outside, day, out in the desert. The sky looks smoggy."
    },
    {
        "character": "",
        "line": "Juvenile Hall, inside. The gates in the hall roll back and a mean Trent walks forward. On his right shoulder is written \"Vengeance is Mine, sayeth the Lord.\" Above the writing is a cross. On his left shoulder is a skull surrounded by the words \"Never Forget.\" He approaches the check-out desk."
    },
    {
        "character": "Warden",
        "line": "[holds up a manila envelope] Everything that you had when you were first brought in here will now be returned. [slices the envelope open and the goods pour out. He then gives each good to Trent after mentioning it] One Crayola eight-pack with crayon sharpener. One pair of plastic round-tipped scissors. One marble, blue. And one [snaps the blade open] switch-blade knife with \"Kill all betrayers\" written on the blade, black. [snaps the blade closed again and hands it to Trent. Trent makes his way past the desk and heads for the exit.] Trent! Where are you gonna do? [Trent stops]"
    },
    {
        "character": "Trent",
        "line": "I gots some business to take care of. [leaves]"
    },
    {
        "character": "",
        "line": "Butters' house, day. In his darkened room, Butters trembles in fear on the floor next to his bookcase. A knock is heard at his door."
    },
    {
        "character": "Butters",
        "line": "Hah! [the door opens and his parents enter.]"
    },
    {
        "character": "Stephen",
        "line": "Butters? [a view of the room from their position doesn't show Butters anywhere. Butters peeks out from behind the bookcase]"
    },
    {
        "character": "Butters",
        "line": "Hwell. Oh, uh, hi Dad."
    },
    {
        "character": "Stephen",
        "line": "Butters, what is wrong with you??"
    },
    {
        "character": "Butters",
        "line": "Nothins' wrong, sir. Eh, nothin' at all."
    },
    {
        "character": "Linda",
        "line": "You've been shut up in your room for days, Butters. You need to go outside, go play."
    },
    {
        "character": "Butters",
        "line": "Uh... outside? No way! [hides again]"
    },
    {
        "character": "Linda",
        "line": "Why not?"
    },
    {
        "character": "Butters",
        "line": "[pops up] N-no reason! [hides again]"
    },
    {
        "character": "Stephen",
        "line": "Butters, we have had it with your moping around! You're gonna go outside and you're gonna play, right now!"
    },
    {
        "character": "Butters",
        "line": "But Dad, I just wanna stay in my room-"
    },
    {
        "character": "",
        "line": "Butters' house, front porch. He's kicked out of the house and the door shuts closed on him. He fiddles his fingers around nervously."
    },
    {
        "character": "Stephen",
        "line": "Butters, play! [Butters is frozen by something he sees across the street] Start playing right now, young man! [Butters begins to move around, and his father leaves the window. Butters does the Hokey Pokey, but notices the street again and freezes. Across the street, Trent looks right at him]"
    },
    {
        "character": "Butters",
        "line": "Tru... Tr-Trent Boyett! Haaaa! [grabs the door handle and tries to go inside again, only to find it locked. He pounds on the door] Dad! Mom! I'm don- I'm done playin' now! [Trent marches across the street and approaches Butters.] Aaaaah! Let me in, Dad! [Butters pounds on the door again] Mom, Dad, you gotta open the door! [Inside, on the sofa, Chris reads the newspaper, Linda reads a book]"
    },
    {
        "character": "Linda",
        "line": "What on earth is the matter with him?"
    },
    {
        "character": "Stephen",
        "line": "Just keep the door locked, honey. Butters can't be a house hermit his whole life."
    },
    {
        "character": "Butters",
        "line": "Oh my God, he's coming! Oh hamburgers he's gonna kill me!"
    },
    {
        "character": "Linda",
        "line": "I just can't stand to hear him scream like that. I'm gonna go upstairs. [rises from the sofa and heads upstairs]"
    },
    {
        "character": "Butters",
        "line": "Mom, Dad, you gotta open the door right now! You've gotta open it- [stops and turns around. He's face to face with Trent. Butters begins talking nervously] Oh, hey! Trent Boyett Gosh I... haven't seen you in a while."
    },
    {
        "character": "Trent",
        "line": "[beat] Five years. It's been five long, miserable years."
    },
    {
        "character": "Butters",
        "line": "Look, Trent, I know- I know you're awful sore about... pre- muh- pr-preschool and all, but... well that was a long time ago. I mean, we were just kids. [Trent is unmoved] Uhhh... p-lease don't hurt me, Trent. I-I'll give you anything you want. You name it!"
    },
    {
        "character": "Trent",
        "line": "Can you give me back my time?! Huh?! Can you do that?! Kindergarten, first grade, second?! Can you give me that?!"
    },
    {
        "character": "Butters",
        "line": "Well, no, Trent, I-I'm not like a time-traveler or nothin'."
    },
    {
        "character": "Trent",
        "line": "I'm gonna give you something you didn't give me: a five-second head-start."
    },
    {
        "character": "Butters",
        "line": "No, Trent, I-I ain't gonna run. We can talk this through."
    },
    {
        "character": "Trent",
        "line": "Four seconds!"
    },
    {
        "character": "Butters",
        "line": "Uh, Trent, now, listen to me. I'm sorry for the color-"
    },
    {
        "character": "Trent",
        "line": "Three seconds!"
    },
    {
        "character": "Butters",
        "line": "Ohhh hamburgers! [runs away]"
    },
    {
        "character": "",
        "line": "Hell's Pass hospital, day. Butters wasn't fast enough. In a recovery room, his parents stand at his bedside."
    },
    {
        "character": "Linda",
        "line": "Thanks so much for coming to visit Butters in the hospital, boys. It means a lot to him. [the boys just stand there with their jaws dropped, awed at what they see before them. Dr. Doctor comes in with a clipboard]"
    },
    {
        "character": "Stephen",
        "line": "What happened to him, Doctor?"
    },
    {
        "character": "Dr. Doctor",
        "line": "From the test results, it would appear your child was tortured by a bully. He received a massive snuggie, his underwear pulled up so high it nearly killed him. He also received two Indian sunburns on his forearms, a charlie horse on the thigh, and a second-degree titty twister. And from the damage to his head area, it appears he was also given a swirly, a colossal one. [the boys are more frightened after hearing this] It also looks like he received a noogie, and, a Polish bike ride."
    },
    {
        "character": "Linda",
        "line": "What's that?"
    },
    {
        "character": "Dr. Doctor",
        "line": "We aren't sure. We only know that... there is no cure."
    },
    {
        "character": "Linda",
        "line": "If only we had let him in! [faces Stephen] Why didn't we let him inside the house when he was screaming for help?? [begins to sob]"
    },
    {
        "character": "Stephen",
        "line": "Now, honey, we were trying to read. [the boys walk over to an adjacent room]"
    },
    {
        "character": "Cartman",
        "line": "We've got to tell them who did this, you guys. We're gonna get it as bad as Butters!"
    },
    {
        "character": "Kyle",
        "line": "That's nothing compared to what my mom will do to me if she finds out I've been lying for five years!"
    },
    {
        "character": "Cartman",
        "line": "Maybe you didn't hear so good in there, Kyle! Second-degree titty-twister!"
    },
    {
        "character": "Stan",
        "line": "Calm down guys, we don't have to go tell our parents. We just need to go out and get some protection."
    },
    {
        "character": "Cartman",
        "line": "[now yelling] How the hell are condoms gonna help us?! [the adults in the recovery room look at Cartman] Sorry, heh. Never mind, hehe. [the adults turn their attention back to Butters]"
    },
    {
        "character": "Stan",
        "line": "I'm talking about hiring somebody bigger than Trent to protect us from him. Come on! [the boys run off]"
    },
    {
        "character": "",
        "line": "A riverbed. There's graffiti along the banks and sixth graders ride their bikes all around the riverbed."
    },
    {
        "character": "Sixth grader 1",
        "line": "I'm gonna jump the wall of fire. [makes motorcycle noises and jumps a low ramp and a small fire, landing safely] Yeah, that was sweet!"
    },
    {
        "character": "Sixth grade leader",
        "line": "Hey, look! [before him, Stan and friend approach]"
    },
    {
        "character": "Kyle",
        "line": "Dude, we shouldn't be here!"
    },
    {
        "character": "Stan",
        "line": "Stay cool, guys. If anybody can protect us from Trent Boyett, it's the sixth graders."
    },
    {
        "character": "Sixth grade leader",
        "line": "Stupid little Fourthies! [leads the other sixth-grade boys towards the fourth-graders and circles them, then stops in front of them] What are you little Fourthies doin' in our hangout?!"
    },
    {
        "character": "Stan",
        "line": "We've come to... ask you for help."
    },
    {
        "character": "Sixth grade leader",
        "line": "Help?! [he and the other sixth graders laugh heartily]"
    },
    {
        "character": "Kyle",
        "line": "We need you to protect us... from a bully."
    },
    {
        "character": "Sixth grade leader",
        "line": "Yeah? And what do we get for it? [Stan nudges Cartman forward]"
    },
    {
        "character": "Cartman",
        "line": "[pulls each item from his backpack and presents it as he mentions it] A twelve-pack of Dr. Pepper, A Shoots & Ladders game used only three times, DVD of Harry Potter 2, and a coupon for a free side of fries with a purchase of any deluxe hamburger at Red Robin. [places it at the top of the small tower he's built] All this can be yours. [the Sixth Grade Leader steps off his bike, approaches Cartman, and throws the tower aside]"
    },
    {
        "character": "Sixth grade leader",
        "line": "You're gonna have to do better than that, Fourthies!"
    },
    {
        "character": "Kyle",
        "line": "Well... [the fourth-graders take a step back] Well, what do you want?"
    },
    {
        "character": "Sixth grade leader",
        "line": "You're Stan Marsh, right?"
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Sixth graders",
        "line": "OOOOOoooOoOooo! [Stan develops a worried face]"
    },
    {
        "character": "Sixth grade leader",
        "line": "We want a picture of your mom's boobs! [cups his hands over his chest]"
    },
    {
        "character": "Sixth graders",
        "line": "Yeah. Awesome."
    },
    {
        "character": "Stan",
        "line": "What?!"
    },
    {
        "character": "Sixth grader 2",
        "line": "Your mom has the sweetest bewbs ever."
    },
    {
        "character": "Sixth grader 3",
        "line": "Yeah! I totally wanna suck your mom's tits."
    },
    {
        "character": "Stan",
        "line": "Dude, weak!"
    },
    {
        "character": "Sixth grade leader",
        "line": "Come back with a naked picture of your mom!"
    },
    {
        "character": "Stan",
        "line": "[after some thought] No!"
    },
    {
        "character": "Sixth grade leader",
        "line": "Then we aren't helpin' you!"
    },
    {
        "character": "Kyle",
        "line": "Wait! We'll do it."
    },
    {
        "character": "Sixth grade leader",
        "line": "It'd have to be a good picture, too! [the sixth-graders make motorcycle noises and ride off. This sixth grader does a wheelie] So long, Fourthies!"
    },
    {
        "character": "Cartman",
        "line": "Okay, so now we just need to get a picture of Stan's mom naked. Cool."
    },
    {
        "character": "",
        "line": "Trent makes makeshift barbells out of rods and solid disks and begins pumping iron."
    },
    {
        "character": "",
        "line": "South Park, Main Street. A couple and Ms. Claridge pass each other."
    },
    {
        "character": "Woman 1",
        "line": "That's the preschool teacher, Ms. Claridge. Poor woman suffered such horrible burns she can only communicate by... beeping once for yes and twice for no. [Ms. Claridge stops at a corner waiting to cross the street. Another couple approaches her and flanks her on either side]"
    },
    {
        "character": "Woman 2",
        "line": "Oh hello, Ms. Claridge. Nice day, isn't it? [Ms. Claridge's machine blinks once, so yes]"
    },
    {
        "character": "Man 2",
        "line": "Need help across the street, Ms. Claridge? [Ms. Claridge's machine blinks two, so no] Well all right then. [the light turns green and the couple crosses the street. Ms. Claridge does as well, but it's slow going for her. Her wheelchair slows down and her power indicator drops to zero. She stuck in the middle of the street in the crosswalk]"
    },
    {
        "character": "Man 3",
        "line": "[walks over to help her] Ms. Claridge, you all right? [silence, as there's no power for her light to blink] You can talk to me, Ms. Claridge. I understand: one beep for yes and two for no. Don't you think you should get out of the street? [again, no response] Look you, you don't have to be so cold. I'm just trying to help. [no response. The man gets annoyed] Oooo, sorry! [the man walks on to the other side of the street, quite annoyed at Ms. Claridge. Cross traffic begins, and the cars beep at Ms. Claridge to move out of the way. She's stuck]"
    },
    {
        "character": "",
        "line": "A doorbell rings. Mrs. Broflovski approaches and opens the door. Trent faces her with his knife in hand."
    },
    {
        "character": "Trent",
        "line": "Can Kyle come out and play?"
    },
    {
        "character": "Sheila",
        "line": "Oh, Kyle isn't home right now, hon."
    },
    {
        "character": "Trent",
        "line": "Thank you, ma'am. [turns and walks away]"
    },
    {
        "character": "",
        "line": "Stan's house. Stan, Kyle, Cartman, and Kenny sit at the dining table. Cartman is dressed as a woman."
    },
    {
        "character": "Stan",
        "line": "You see, Mom, all the kids at school were told to bring a picture of their moms' breasts for anatomy class."
    },
    {
        "character": "Cartman",
        "line": "I don't know, son. That sounds awfully strange. [crosses his arms] You cannot have a picture of my hot breasts."
    },
    {
        "character": "Stan",
        "line": "But mom, my teacher will-"
    },
    {
        "character": "Cartman",
        "line": "Nononono, you gotta go [softly, sweetly] \"But Mo-o-o-om.\""
    },
    {
        "character": "Stan",
        "line": "[normal] But Mo-o-o-"
    },
    {
        "character": "Cartman",
        "line": "[with more feeling] \"But Mo-o-o-om.\""
    },
    {
        "character": "Stan",
        "line": "This is hopeless!"
    },
    {
        "character": "Kyle",
        "line": "Why don't you just sneak in your mom's closet and get a picture when she's changing clothes?"
    },
    {
        "character": "Stan",
        "line": "That's sick, dude! I'm not taking a picture of my mom's boobs!"
    },
    {
        "character": "Kenny",
        "line": "[volunteers] (I'll do it!)"
    },
    {
        "character": "Stan",
        "line": "No, you're not doing it either! We just need to find something that looks like boobs to take a picture of."
    },
    {
        "character": "Kyle",
        "line": "What else has big round squishy globes? [they look at Cartman, who looks up into space]"
    },
    {
        "character": "",
        "line": "Living room, moments later. Cartman stands on a stool and squats down. Kyle has a set of instructions and Stan has a marker. Kenny stands as a witness."
    },
    {
        "character": "Cartman",
        "line": "Draw the um- You guys draw the nipples like on the bottom of my ass cheeks."
    },
    {
        "character": "Kyle",
        "line": "[checks the book] No, the nipples are more in the middle, see? [holds the book out for the others to see.]"
    },
    {
        "character": "Cartman",
        "line": "Yeah, but Stan's mom is old; that means her nipples... sag more to the bottom now."
    },
    {
        "character": "Stan",
        "line": "How do you know?!"
    },
    {
        "character": "Cartman",
        "line": "Will you guys trust me? I know this stuff!"
    },
    {
        "character": "Stan",
        "line": "All right, fine. [draws some nipples on Cartman's ass, checking the book to be sure. He then steps back]"
    },
    {
        "character": "Kyle",
        "line": "Oh wait! We forgot the necklace."
    },
    {
        "character": "Kenny",
        "line": "(Oh yeah!) [walks up and puts a necklace above the new nipples, then steps back. Stan frames the image with his hands, then has Kyle step into his spot to take a couple of pictures.]"
    },
    {
        "character": "Kyle",
        "line": "[lowers the camera] God, I hope this works."
    },
    {
        "character": "",
        "line": "The ravine, day. The sixth graders are there again, riding up and down the concrete slopes. Stan and his friends approach."
    },
    {
        "character": "Stan",
        "line": "Excuse me!"
    },
    {
        "character": "Sixth grade leader",
        "line": "What do you want now?!"
    },
    {
        "character": "Stan",
        "line": "[steps forward] We, we got it. [pulls out the photo. The sixth graders ride up to the boys]"
    },
    {
        "character": "Sixth grader 4",
        "line": "You got a picture of your mom's bewbs?"
    },
    {
        "character": "Sixth grader 5",
        "line": "No way!"
    },
    {
        "character": "Sixth grader 2",
        "line": "[walks up and takes the photo, then walks back to the group, looking at it] Hey, hold on a second! [the boys are scared] These are like the hottest tits I've ever seen!"
    },
    {
        "character": "Sixth grader 8",
        "line": "Whoa!"
    },
    {
        "character": "Sixth grader 4",
        "line": "Check them out!"
    },
    {
        "character": "Sixth grade leader",
        "line": "[walks up and grabs is from #6] Give me that! [looks] Whoa! I knew she had a hot rack!"
    },
    {
        "character": "Sixth graders",
        "line": "Yeah. Sure does. Uh-huh! Uh-huh!"
    },
    {
        "character": "Sixth grader 3",
        "line": "Oh yeah, those are so hot. [fondles his groin] Oooohhh"
    },
    {
        "character": "Kyle",
        "line": "[the boys look at each other] Okay, so now you'll help us take care of Trent Boyett?"
    },
    {
        "character": "Sixth grade leader",
        "line": "[someone else has the picture now] Oh all right, we'll let this Trent Boyett know that if he messes with you, he's messin' with us!"
    },
    {
        "character": "Cartman",
        "line": "All right!"
    },
    {
        "character": "Kenny",
        "line": "(Woohoo!)"
    },
    {
        "character": "Cartman",
        "line": "You guys, we're free! We haven't a care in the world!"
    },
    {
        "character": "Kenny",
        "line": "(All right!)"
    },
    {
        "character": "Sixth grader 9",
        "line": "I need three minutes alone with the picture behind the bushes."
    },
    {
        "character": "Sixth grader 2",
        "line": "I get to take the picture behind the bushes after you."
    },
    {
        "character": "Sixth grade leader",
        "line": "[grabs the picture] I'm takin' it to the bushes first! [the others follow]"
    },
    {
        "character": "Stan",
        "line": "Dude, are we gonna be like that someday?"
    },
    {
        "character": "Kyle",
        "line": "[after some thought] Naw."
    },
    {
        "character": "",
        "line": "The intersection. Ms. Claridge is still there. The boys exit an ice cream parlor with ice cream cones and walk down the street."
    },
    {
        "character": "Kyle",
        "line": "Man, I would have loved to seen to seen the look on Trent Boyett's face when all the sixth graders showed up!"
    },
    {
        "character": "Cartman",
        "line": "Yeah. Trent's just lucky he didn't mess with us. I woulda kicked his ass."
    },
    {
        "character": "Stan",
        "line": "Hey, look. What is Ms. Claridge doing? [she's still in the crosswalk] Ms. Claridge?"
    },
    {
        "character": "Man 4",
        "line": "[stops and walks up to the boys] She won't talk to anybody, boys. Some say... she's just given up hope. [walks on. The boys move on as well and round a corner]"
    },
    {
        "character": "Cartman",
        "line": "Hey guys, you know what we should do? We should go get a- [drops his cone in fright] Huh?! [before them is a pile of mangled bikes]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, later. The boys enter the emergency room and see it full of cots. The sixth graders are there, some injured more than others. The emergency room personnel have their hands full."
    },
    {
        "character": "Dr. Doctor",
        "line": "Jesus Christ, I've never seen so many Indian sunburns and titty twisters in my life! [sees a nurse and motions to her] Get a cold towel on that pink belly!"
    },
    {
        "character": "Nurse 1",
        "line": "Doctor, we have another snuggie here!"
    },
    {
        "character": "Dr. Doctor",
        "line": "Over there! [points to a clear area, then goes to another cot on which a sixth grader grabs his left ear in pain. A nurse is there as well] Another wet willie?"
    },
    {
        "character": "Nurse 2",
        "line": "Worst one yet."
    },
    {
        "character": "Sixth grader",
        "line": "It's all slimy and spitty! [becomes incomprehensible and cries out in pain]"
    },
    {
        "character": "Dr. Doctor",
        "line": "Give the poor kid some morphine. [the nurse reaches for a syringe and does as told. The boys approach the cot on which the leader of the sixth graders lies]"
    },
    {
        "character": "Stan",
        "line": "Dude, what happened?"
    },
    {
        "character": "Sixth grade leader",
        "line": "We... told him not to mess with you guys... We told him... you paid us."
    },
    {
        "character": "Kyle",
        "line": "Oh, Jesus. You told him that?! [the leader suffers a cramp and groans]"
    },
    {
        "character": "Dr. Doctor",
        "line": "Boys, you have to let him rest. Some mean kid gave him a Texas Chili Bowl."
    },
    {
        "character": "Stan",
        "line": "What's that?"
    },
    {
        "character": "Dr. Doctor",
        "line": "It involves Tabasco sauce, a telephone, and the anus. [the boys are flabbergasted] I don't know what kind of kid would do this to other people; I only know that I wouldn't ever want to be on that kid's bad side. [walks away. The boys leave the hospital]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, outside."
    },
    {
        "character": "Stan",
        "line": "We're dead. Trent knows we sent the sixth-graders after him."
    },
    {
        "character": "Cartman",
        "line": "He's gonna give us all Texas chili bowls. [breathes a silent sigh]"
    },
    {
        "character": "Kyle",
        "line": "We've gotta move away. We've gotta get as far away from this town as possible!"
    },
    {
        "character": "Stan",
        "line": "No, no, we've just gotta find better help."
    },
    {
        "character": "Kyle",
        "line": "From who? We can't ask adults for help and there's nobody tougher than sixth graders."
    },
    {
        "character": "Stan",
        "line": "[looks down] There is... one person."
    },
    {
        "character": "",
        "line": "Stan's house, living room. Shelly is watching TV with a bowl of soup on her lap. Stan and friends enter and approach."
    },
    {
        "character": "Stan",
        "line": "Shelly?"
    },
    {
        "character": "Shelly",
        "line": "Shut up, turd! I'm watching television!"
    },
    {
        "character": "Stan",
        "line": "Shelly, you're my sister, right? And families... depend on each other."
    },
    {
        "character": "Shelly",
        "line": "I said shut up, or I will destroy you, tur-r-rd!"
    },
    {
        "character": "Stan",
        "line": "Shelly [hesitates, begins to tear up] Somebody is going to kill me, and I can't go to Mom or Dad for help, so, you're kind of the only person I have... left. [begins to cry. Shelly notices, puts her bowl aside, hops off the sofa, and walks up to Stan]"
    },
    {
        "character": "Shelly",
        "line": "[in Stan's face] Stop crying, turd! Now, who's gonna kill you?"
    },
    {
        "character": "Stan",
        "line": "Trent Boyett. He just got released from Juvenile Hall. He was sent there for burning Ms. Claridge, but actually, it was our fault."
    },
    {
        "character": "Shelly",
        "line": "Oh, you are such stupid turds."
    },
    {
        "character": "Stan",
        "line": "We were only four years old at the time, uh. We du-we didn't think about the past coming back to haunt us then. We didn't think and now he's gonna kill us!"
    },
    {
        "character": "Shelly",
        "line": "Calm down, turd! No Juvenile Hall turd is going to kill you. That's my job."
    },
    {
        "character": "Kyle",
        "line": "So you're gonna help us?"
    },
    {
        "character": "Shelly",
        "line": "Yes, but I'm gonna want something in return."
    },
    {
        "character": "Cartman",
        "line": "A picture of your mom's boobs?"
    },
    {
        "character": "Shelly",
        "line": "Shut up, turd! [all four of the boys stand back in fear] You're going to admit to Ms. Claridge what you did!"
    },
    {
        "character": "Stan",
        "line": "Admit it was our fault?"
    },
    {
        "character": "Shelly",
        "line": "You can't run from your past, turds. Apologize and make amends. Then I'll protect you from this Trent turd. [the boys aren't so sure apologizing will do any good]"
    },
    {
        "character": "",
        "line": "The intersection. Ms. Claridge is still there. No one has moved her. Cars move past her, honking at her, and two men and a woman approach the corner facing her."
    },
    {
        "character": "Man 5",
        "line": "Ms. Claridge, the people in town are really worried about you. [no reply]"
    },
    {
        "character": "Woman 3",
        "line": "Look, if you're having some kind of problem, you have to be able to talk to people. [no reply]"
    },
    {
        "character": "Man 6",
        "line": "Just tell us this: do you trust that we want what's best for you, yes or no? [no reply]"
    },
    {
        "character": "Man 5",
        "line": "All right, fine! But someday you're gonna have to learn to let people in! [the three walk away] Bitch. [Stan and his friends approach the corner and walk up to Ms. Claridge.]"
    },
    {
        "character": "Stan",
        "line": "Hi, Ms. Claridge. Uh, we have s-something to tell you. [no reply]"
    },
    {
        "character": "Kyle",
        "line": "The thing is, Ms. Claridge, we did a lot of stupid things when we were kids."
    },
    {
        "character": "Cartman",
        "line": "A lot of stupid things that we regret."
    },
    {
        "character": "Kenny",
        "line": "(And it's time for us to come clean.) [no reply]"
    },
    {
        "character": "Stan",
        "line": "See, Ms. Claridge, when we were little, we used to play with our wieners a lot, and one game we played was \"Fireman.\""
    },
    {
        "character": "Trent",
        "line": "[appearing behind them] I've been lookin' for you! [the boys turn and jump upon seeing him. Kenny tightens his hood.] Five years I've been waitin' for this day."
    },
    {
        "character": "Cartman",
        "line": "Aaaaaaaah!"
    },
    {
        "character": "Stan",
        "line": "Trent, look, we've realized our mistake! [Trent advances, the boys back up]"
    },
    {
        "character": "Cartman",
        "line": "Yes, our conscience got the best of us and, and we were just about to tell everyone the truth. [the boys hide behind Ms. Claridge's wheelchair, Trent goes around the other side and faces them behind the chair]"
    },
    {
        "character": "Trent",
        "line": "You had five years to do that. And while I wasted away my time in prison you've been enjoying nice, normal lives!"
    },
    {
        "character": "Kyle",
        "line": "Our lives have not been enjoyable, Trent! I promise you! [the boys back up some more, away from the intersection]"
    },
    {
        "character": "Trent",
        "line": "Don't tell me that! I heard about the things you've done! But there were no magical Christmas adventures or talking poo for me! I DIDN'T GET TO FIGHT A HUGE MECHANIC BARBRA STREISAND!! NO ACCIDENTAL TRIPS TO AFGANISTAN FOR TRENT BOYETT!! [advances. Cartman pulls out a taser gun as the other boys fall in behind him]"
    },
    {
        "character": "Cartman",
        "line": "Stay away from us, Trent!"
    },
    {
        "character": "Stan",
        "line": "What is that?"
    },
    {
        "character": "Cartman",
        "line": "It's my mom's taser. I took it from her purse. [steps forward] Just back off, man!"
    },
    {
        "character": "Trent",
        "line": "Look, just take your punishment! You deserve it! Let me have my retribution and it can be over with."
    },
    {
        "character": "Cartman",
        "line": "I am not going to have a titty twister! I hate titty twisters!"
    },
    {
        "character": "Trent",
        "line": "You don't even know how to use that! [advances on Cartman, who fires the taser but misses.]"
    },
    {
        "character": "",
        "line": "The taser tips hit Ms. Claridge's wheelchair and begin charging her battery up. Excess power causes the wheelchair to spin twice around and go off to the corner she was facing. She hits Little Gas Shack and blows up three propane tanks just outside the store. Those tanks in turn blow up the store. Ms. Claridge catches fire and spins around a few more times. Her button blinks twice for no and she crosses back across the street, crashing into a Pets-U-Luv store. A bunch of cats attack her and she pulls back out of the store. She spins again a few more times and a policeman pulls up in his cruiser. Ms. Claridge rolls down the street and shears off a fire hydrant. She gets stuck atop the pipe and water shoots up and engulfs her. Moments later the ambulance pulls up and the paramedics prepare to put Ms. Claridge into the cargo area of the vehicle."
    },
    {
        "character": "Officer 2",
        "line": "So, Trent, you just had to finish off your old preschool teacher, eh?"
    },
    {
        "character": "Trent",
        "line": "No! They did it! [silence for a few seconds]"
    },
    {
        "character": "Cartman",
        "line": "Trent Boyett is a liar, sir."
    },
    {
        "character": "Officer 2",
        "line": "Ms. Claridge, did Trent Boyett do this to you? [two beeps, so no] Yes, yes. Take him away!"
    },
    {
        "character": "Trent",
        "line": "[a blond officer arrests him] No! You've gotta listen to me! [nope. He's hauled away and the gathered crowd disperses]"
    },
    {
        "character": "Kyle",
        "line": "Dude, when he gets out he's gonna be really mad!"
    },
    {
        "character": "Cartman",
        "line": "Whatever, that's like five years from now."
    },
    {
        "character": "Stan",
        "line": "Yeah, who cares?"
    },
    {
        "character": "The boys",
        "line": "Yeah, woohoo!"
    },
    {
        "character": "Cartman",
        "line": "We did it! [walks over to the side of the cruiser Trent is sitting in] So long, Trent! Have a nice time! [Trent grits his teeth in anger as Cartman dances] Nyanyanyanyanyaaanyaaa! [turns around and lowers his pants, then shakes his bare at him] Hahahahahaaahaaa! [he forgot to remove the nipple markings from it. Trent grows livid. The six-graders arrive and notice Cartman's buttcheeks.]"
    },
    {
        "character": "Sixth grader 2",
        "line": "Hey, hold on a second!"
    },
    {
        "character": "Cartman",
        "line": "Uh oh."
    },
    {
        "character": "Sixth grader 2",
        "line": "Bewbs!"
    },
    {
        "character": "Sixth grader 1",
        "line": "Omigod!"
    },
    {
        "character": "Sixth graders",
        "line": "Boobs!"
    },
    {
        "character": "Sixth grader 1",
        "line": "[as the others argue over them and carry Cartman away] I'm taking them to the bushes!"
    },
    {
        "character": "Sixth grader 2",
        "line": "I'm taking them to the bushes first!"
    },
    {
        "character": "Cartman",
        "line": "Hah! Hey!"
    }
]