[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Mall, day. Inside, a crowd awaits a special event. A small stage with \"PARIS\" written on it in large letters is set up before a red curtain. Wendy and Bebe arrive and make their way to the front."
    },
    {
        "character": "Bebe",
        "line": "Come on, Wendy, we're gonna miss it!"
    },
    {
        "character": "Wendy",
        "line": "We're gonna miss what?"
    },
    {
        "character": "Bebe",
        "line": "Paris Hilton is making an appearance at the mall!"
    },
    {
        "character": "Wendy",
        "line": "Who's Paris Hilton?"
    },
    {
        "character": "Red",
        "line": "\"Who's Paris Hilton?\""
    },
    {
        "character": "Annie",
        "line": "You don't know?"
    },
    {
        "character": "Store owner",
        "line": "[someone takes a picture as he approaches the mic.] Hello, everyone! The Guess Clothing Company is pleased to have as its new spokesperson model, a woman all you young ones can look up to, Ms. Paris Hilton. [she appears and flashbulbs go off amid squeals from females in the crowd. She then lifts her bra and shows off her breasts]"
    },
    {
        "character": "Bebe",
        "line": "Wow, that's really her! Paris! Over here!"
    },
    {
        "character": "Wendy",
        "line": "I don't get it. What's she do?"
    },
    {
        "character": "Annie",
        "line": "She's super-rich!"
    },
    {
        "character": "Wendy",
        "line": "...But what does she do?"
    },
    {
        "character": "Red",
        "line": "She's totally spoiled and snobby."
    },
    {
        "character": "Wendy",
        "line": "[annoyed] What does she do?!"
    },
    {
        "character": "Man",
        "line": "[walks by and overhears] She's a whore. [takes his camera and snaps a few pictures]"
    },
    {
        "character": "Paris",
        "line": "[her left eyelid hangs heavy] Hey everyone. Sorry if I'm a little spent. I did a whole lot of partying last night with a LOT of different guys. [coughs semen onto her left fist] Anyway, I'm pleased to be here in Gouth Dark to announce the opening of my brand new store! A store where girls can buy everything they need to be just like me! Stupid Spoiled Whore! [the red curtain drops to reveal the store. The crowd cheers] Have fun, girls. And remember to party, and be super-lame to everybody. G'Bye! [steps aside and off-stage. An assistant awaits with water and a tote bag, which has a Chihuahua in it. She holds out a bottle of water] Give me that! Fucking Christ I need a drink! [vomits out feces, then drinks from the bottle. The assistant arms her with the tote bag] Where's my dog?! [walks off]"
    },
    {
        "character": "",
        "line": "Stupid Spoiled Whore, inside. The girls rush in as the doors open and begin to mill around. Bebe leads Red, Annie, and Wendy around. Wendy's still stunned."
    },
    {
        "character": "Bebe",
        "line": "Wow, look at all this great stuff. Stupid Spoiled Whore clothes, Stupid Spoiled Whore dolls."
    },
    {
        "character": "Red",
        "line": "[walks up to a display case] Hey, check it out: the new Paris Hilton perfume, Skanque. [grins and holds a heart-shaped bottle with the name on it]"
    },
    {
        "character": "Announcer",
        "line": "Skanque."
    },
    {
        "character": "Annie",
        "line": "[carrying some clothes] Oh yeah, let's get lots of that!"
    },
    {
        "character": "Wendy",
        "line": "You guys, don't buy this stuff! Why do you want to be like Paris Hilton?"
    },
    {
        "character": "Red",
        "line": "It's not just Paris: Britney Spears, Christina Aguilera, Tara Reid, they're all stupid spoiled whores!"
    },
    {
        "character": "Wendy",
        "line": "But the idea that we'll be whorish for money is belittling to our gender!"
    },
    {
        "character": "Bebe",
        "line": "[now with two armloads of clothes] Wendy, get a clue. The only thing more important than being rich is being famous!"
    },
    {
        "character": "Annie",
        "line": "Wow, you really sound like a dumb brat, Bebe."
    },
    {
        "character": "Bebe",
        "line": "Thanks, Annie! [She, Annie, and Red walk away, and Wendy remains stunned]"
    },
    {
        "character": "",
        "line": "South Park Mall, parking lot. Paris's chauffeur holds the limousine door open for her."
    },
    {
        "character": "Paris",
        "line": "[quickly arrives and enters the limo] God, get me out of this hick town! What a bunch of rednecks! [the driver closes the door, starts up the limo, and drives off. Inside, she picks up her Chihuahua and starts talking to it, caressing it] Everybody's so fucking lame. Except for you, my little Tinkerbell. You love my vewy much, don't you? How much you wuv me? I'm gonna dress you up like a bunny, and then I'm gonna dress you up like a little princess. You're mine forever! [her cellphone rings and she answers it, releasing Tinkerbell.] Whatever! Oh, hey, Kasey. Oh, another stupid store opening at some lame cowboy town. [Tinkerbell jumps down from the seat and walks away dejected] Oh, it's so fucking stupid, this whole town stinks like cows. [Tinkerbell is up on the divider and looks down] I can't wait to get out of here! Grody!"
    },
    {
        "character": "",
        "line": "Tinkerbell drops down onto the front seat"
    },
    {
        "character": "Paris",
        "line": "They have the lamest stores, too. [... walks over to the driver and digs around his right coat pocket ...] I'm gonna go to Rome for the weekend, I think. I dunno, Rome or Tokyo, either way it'll be totally boring. [... and digs out a small gun from the pocket.] Stupid. [coughs some semen onto her left hand] Hagh. [Tinkerbell carries the gun back to the back seat...] I need to get wasted. I haven't had a drink in like fourteen minutes. Why is everybody so stupid anyway? [... and sets the gun down long enough to put the barrel against its chin. Tinkerbell then tries to set the gun off with her right hind leg. That doesn't work, so she stands the gun up on its butt and tries again] I flashed all these hicks on my boobs; you should've seen the look on their faces! Stupid redneck idiots!"
    },
    {
        "character": "",
        "line": "The gun goes off and Tinkerbell falls over, her brain and blood splattering on the seat's back and rear window."
    },
    {
        "character": "Paris",
        "line": " Aaaaaaaaaaaaaaaaaaaaaaaaaaaah!"
    },
    {
        "character": "Chauffeur",
        "line": "Oh dear..."
    },
    {
        "character": "Paris",
        "line": "Another dog killed itself!"
    },
    {
        "character": "",
        "line": "A house. Two girls sit at a dining table doing nothing. Wendy enters and addresses them."
    },
    {
        "character": "Wendy",
        "line": "Hey, Jessie [the blonde], Hey, Kal. Do you guys mind if I hang out with you? The other girls are acting really strange."
    },
    {
        "character": "Jessie",
        "line": "Sure, Wendy. We were just trying to think of something to do."
    },
    {
        "character": "Wendy",
        "line": "Oh, well, you wanna maybe go to the art museum?"
    },
    {
        "character": "Jessie",
        "line": "Nah, that sounds really dull."
    },
    {
        "character": "Kal",
        "line": "Hey, I know! Let's make a videotape of us having sex with boys! [Jessie likes the idea]"
    },
    {
        "character": "Wendy",
        "line": "What?!"
    },
    {
        "character": "Kal",
        "line": "I just got [brings out a box] the Stupid Spoiled Whore video playset! [the set comes from Letcher Price and \"Makes you a whore and so much more!\"]"
    },
    {
        "character": "Singers",
        "line": "Stupid Spoiled Whore Video Playset!\n\n\n"
    },
    {
        "character": "Kal",
        "line": "You can make videos that get out on the Internet!"
    },
    {
        "character": "Jessie",
        "line": "Yeah! [Kal puts on some makeup as Jessie looks on]"
    },
    {
        "character": "Singers",
        "line": "Stupid Spoiled Whore Video Playset! Show the whole world what a slut you are!\n\n\n"
    },
    {
        "character": "Announcer",
        "line": "Stupid Spoiled Whore Video Playset comes with video camera, night-vision filter, play money, cellphone, and sixteen hits of ecstasy. [nine hits are shown] [The playset box is shown again, then Kal is shown on the cellphone]"
    },
    {
        "character": "Singers",
        "line": "Stupid Spoiled Whore Video Playset! Let everyone see your coo-ooch!\n\n[The playset box is shown again, then Kal is shown on the cellphone]\n"
    },
    {
        "character": "Kal",
        "line": "I'm pretending to be calling my friends on the cellphone while my man waits for more sex!"
    },
    {
        "character": "Jessie",
        "line": "You're a Stupid Spoiled Whore. [Wendy just turns right and walks away.] Where are you goin', Wendy?"
    },
    {
        "character": "",
        "line": "The limousine. Paris is crying over the loss of Tinkerbell."
    },
    {
        "character": "Paris",
        "line": "Bwaaaaaaa! Waaaaaaaaaaa!"
    },
    {
        "character": "Chauffeur",
        "line": "All right, Ms. Hilton, we'll find you another dog."
    },
    {
        "character": "Paris",
        "line": "[throws a tantrum] Waaaaaaaaaaaaaaaaaaaaaaaaaaaaa!"
    },
    {
        "character": "Chauffeur",
        "line": "There there now, let's just get you back home, shall we?"
    },
    {
        "character": "Paris",
        "line": "Woooooooooohooooooooooooooohoooooooooooooooo... [notices something outside] Wait! Wait, stop the car! [the limo proceeds] Stop the car, you fucking moron! [the limo stops] Look at how cuuute. I want that! I want that!"
    },
    {
        "character": "Butters",
        "line": "[playing with some apples on a checkerboard blanket on the front lawn] Loo loo loo, I've got some apples, Loo loo loo, you've got some too.\n\n\n"
    },
    {
        "character": "Paris",
        "line": "It's adorable! [exits the limo and closes the door]"
    },
    {
        "character": "Butters",
        "line": "Loo loo loo, let's make some applesauce, take off our clothes and loo loo loo!\n\n [Paris approaches him]\n"
    },
    {
        "character": "Paris",
        "line": "Look at his wittle puff ball! [Butters is surprised] I'm gonna feed you, and take care of you, and call you Mr. Biggles! [kneels down and hugs him]"
    },
    {
        "character": "Butters",
        "line": "My name's Butters."
    },
    {
        "character": "Paris",
        "line": "Driver, put Mr. Biggles in the car. [the driver appears] I want to find a bear costume for him. Won't he be soo cute dressed up as a bear?"
    },
    {
        "character": "Chauffeur",
        "line": "Paris, I believe this is somebody's child."
    },
    {
        "character": "Paris",
        "line": "I want it!"
    },
    {
        "character": "Chauffeur",
        "line": "I don't think you can actually-"
    },
    {
        "character": "Paris",
        "line": "I want it! I want it! [rocks back and forth]"
    },
    {
        "character": "Chauffeur",
        "line": "All right, all right, come on- come on, young man."
    },
    {
        "character": "Butters",
        "line": "Wa-I'm sorry, ma'am. I'd like to be your boyfriend and all, uh, even though you have kind of a big nose, but my parents told me, \"never get into a car with a stranger.\""
    },
    {
        "character": "Paris",
        "line": "Well, did they say anything about limousines? [Butters thinks about it. An image of his parents appears]"
    },
    {
        "character": "Chris",
        "line": "Butters, never get into a car with a stranger. Unless it's a limousine."
    },
    {
        "character": "Butters",
        "line": "Yeah, actually, they did say that'd be all right."
    },
    {
        "character": "Paris",
        "line": "[happily] Get in the limo, Mr. Biggles! We're gonna have a bear costume made for you!"
    },
    {
        "character": "",
        "line": "Wendy's house, night. Her parents are watching TV and munching on chips on the sofa. She enters with her head down."
    },
    {
        "character": "Announcer",
        "line": "And now, back to The Price is Right! [Wendy sighs]"
    },
    {
        "character": "Mr. Testaburger",
        "line": "Hi, sweetie. What's the matter?"
    },
    {
        "character": "Wendy",
        "line": "Mom, Dad, I'm growing concerned about the role models young women have in today's society."
    },
    {
        "character": "Mr. Testaburger",
        "line": "Oh?"
    },
    {
        "character": "Wendy",
        "line": "It seems that lewdness and shallowness are being exalted, while intellectualism is looked down upon."
    },
    {
        "character": "Mr. Testaburger",
        "line": "...Gosh."
    },
    {
        "character": "Wendy",
        "line": "I think young women are being marketed to by corrupt, moral-less corporations."
    },
    {
        "character": "Mr. Testaburger",
        "line": "Well, get right on fixing that, sweetie. Wanna watch The Price is Right? [Wendy doesn't answer. Instead, she turns away and walks off slowly, and her parents go back to eating chips]"
    },
    {
        "character": "Wendy",
        "line": "[spins around and walks back] Dad, there's a new store at the mall called \"Stupid Spoiled Whore\" and I'm gonna go there and buy a thong!"
    },
    {
        "character": "Mr. Testaburger",
        "line": "[suddenly angered] What?! No daughter of mine is going to dress like a whore! We're marching down to that store right now, young lady!"
    },
    {
        "character": "",
        "line": "Stupid Spoiled Whore, moments later. Wendy and her dad enter the store. He looks around."
    },
    {
        "character": "Mr. Testaburger",
        "line": "Oh my God! Well, this place is-! Oh my God! [approaches a line of girls and their mothers.] Mrs. Faulk, you're buying this stuff for your daughter?!"
    },
    {
        "character": "Mrs. Faulk",
        "line": "[giggles] It's what's in right now. I, I can't have my little girl be the only one not in a trend; she'll be unpopular."
    },
    {
        "character": "Mr. Testaburger",
        "line": "Unpopular?! If she's not a whore?! [Bebe and her mom now pay attention] But these are our girls!"
    },
    {
        "character": "Mrs. Stevens",
        "line": "I think it's empowering for them. I mean, sure, if a man wants to be a whore, it's normal, but if a woman wants to be one, it's wrong. [the other females murmur in agreement]"
    },
    {
        "character": "Woman 1",
        "line": "Yeah, when a man pees standing up, it's normal, but when a woman does it, it's weird."
    },
    {
        "character": "Females",
        "line": "Yeah! Right!"
    },
    {
        "character": "Woman 2",
        "line": "Yeah, like, when men shave their balls it's fine, but when a woman does it she's straaange."
    },
    {
        "character": "Females",
        "line": "Yeah! Right! It isn't fair!"
    },
    {
        "character": "Teen girl 1",
        "line": "All the girls in South Park are gonna be total sluts from now on, so you can just get used to it."
    },
    {
        "character": "Teen girl 2",
        "line": "[rubs her ass up against Mr. Testaburger] Yeah. Will you buy me that purse I want over there? I'll do anything, 'cause I'm a whore."
    },
    {
        "character": "Mr. Testaburger",
        "line": "[more amenable now] Oh, uh, sure I can buy a purse."
    },
    {
        "character": "Wendy",
        "line": "Dad!"
    },
    {
        "character": "Mr. Testaburger",
        "line": "Nope. Wendy, I think they're right. You see, you have to believe in the rights of women. For too long they've had to live a double standard. [enjoying the affection] Oh yeah. I'm sorry I've been so chauvinistic, Wendy. From now on, you can have whatever you want from this store, I'll help make you the stupidest, most spoiled whore of them all!"
    },
    {
        "character": "Females",
        "line": "Hooray!"
    },
    {
        "character": "",
        "line": "The Stotch house, day."
    },
    {
        "character": "Chris",
        "line": "Butters, will you mind telling us why you're dressed up like a bear?"
    },
    {
        "character": "Butters",
        "line": "[dressed in a bear cub outfit] Oh, well, uh, my sort-of-girlfriend dressed me up like this."
    },
    {
        "character": "Chris",
        "line": "Your girlfriend?"
    },
    {
        "character": "Paris",
        "line": "[enters the scene] There you are, Mr. Biggles! [picks Butters up and hugs him] Aw, I thought I'd lost you! [caresses him] Promise you'll never leave me. [his parents are stunned]"
    },
    {
        "character": "Linda",
        "line": "Butters? You're dating Paris Hilton? You are grounded, mister!"
    },
    {
        "character": "Butters",
        "line": " I'm sorry."
    },
    {
        "character": "Chris",
        "line": "[turns his wife around] Uh, sweetheart, isn't Paris Hilton worth a lot of money?"
    },
    {
        "character": "Linda",
        "line": "Chris, she's more than twice Butters' age."
    },
    {
        "character": "Chris",
        "line": "Yes, and more than three billion times his net worth. Everybody adores that girl, darling. We should be nice to her too, especially if she's in love with our son! [they turn around]"
    },
    {
        "character": "Linda",
        "line": "Uh, Paris, would you like to have some cocoa with us? [Paris coughs some semen onto her left hand and rubs it against the rug]"
    },
    {
        "character": "Paris",
        "line": "With schnapps and Scotch. [coughs some more semen onto her hand]"
    },
    {
        "character": "",
        "line": "The dining table. The four persons are seated around it drinking cocoa, with Paris having a bottle of Scotch alongside the cocoa."
    },
    {
        "character": "Chris",
        "line": "So, Paris, I understand you're from the prestigious Hilton family. Very nice hotels."
    },
    {
        "character": "Paris",
        "line": "I've gotta get outta here. This place is stupid. Where am I? Oh, I wanna take Mr. Biggles with me."
    },
    {
        "character": "Linda",
        "line": "[stunned again] With you where?"
    },
    {
        "character": "Paris",
        "line": "To live with me forever and ever, you dumb broad. How much?"
    },
    {
        "character": "Linda",
        "line": "How much? For Butters?"
    },
    {
        "character": "Chris",
        "line": "Butters is our son. He's not for sale."
    },
    {
        "character": "Paris",
        "line": "I'll give you two hundred million dollars for it. [Butters is afraid. Chris spits out his cocoa and puts down his cup]"
    },
    {
        "character": "Chris",
        "line": "Excuse me?!"
    },
    {
        "character": "Paris",
        "line": "I said I'll give you two hundred million dollars for it! [Chris spits out his cocoa. Linda does so as well. Paris whips out a checkbook and pen] I'll write you a check for Mr. Biggles right now."
    },
    {
        "character": "Linda",
        "line": "Chris, is she serious?"
    },
    {
        "character": "Chris",
        "line": "Ah, Butters, why don't you take Paris up to your room for a little while, uh, Mommy and Daddy have to talk."
    },
    {
        "character": "Butters",
        "line": "[while Paris writes out a check] Mom, Dad, I-I love you. Please don't sell me to Paris Hilton."
    },
    {
        "character": "Chris",
        "line": "Butters, right now!"
    },
    {
        "character": "",
        "line": "The living room, moments later. Chris paces the floor as Linda watches on."
    },
    {
        "character": "Linda",
        "line": "We aren't honestly considering this?"
    },
    {
        "character": "Chris",
        "line": "Darling, Paris is a billionaire. She can give Butters everything he wants. We'd be terrible parents not to consider it."
    },
    {
        "character": "Linda",
        "line": "But he's our son!"
    },
    {
        "character": "Chris",
        "line": "I know, darling, but look: we have to think about the rest of the family."
    },
    {
        "character": "Linda",
        "line": "The rest of the f- you do mean us?"
    },
    {
        "character": "Chris",
        "line": "Yes, us, the rest of the family."
    },
    {
        "character": "",
        "line": "Upstairs, in Butters' room. The bed looks nice. Paris is now drunk from the Scotch she added to her cocoa."
    },
    {
        "character": "Paris",
        "line": "What should we do, Mr. Biggles? I drank too much. [falls backward upon the bad] Oh my God, I'm so wasted! [her genitals are exposed] The room's all spinny. I'm... totally passing out. [she falls silent. Butters looks around, then reaches over with his left hand and touches her vagina a few times]"
    },
    {
        "character": "",
        "line": "South Park Elementary. The class bell rings and kids clear the hall. Cartman is at his locker, and near him stand five girls. Wendy walks up to them."
    },
    {
        "character": "Wendy",
        "line": "Hey, Bebe. I heard you were having a party tonight."
    },
    {
        "character": "Bebe",
        "line": "You wouldn't be interested, Wendy. My parents are out of town, so it's a Stupid Spoiled Whore party."
    },
    {
        "character": "Wendy",
        "line": "I'm a stupid spoiled whore. [her dress is relaxed: blue jeans and turquoise tank top with one strap over the right shoulder. The girls laugh at her reply]"
    },
    {
        "character": "Annie",
        "line": "Right. Please, Wendy, you're like Class President and stuff!"
    },
    {
        "character": "Red",
        "line": "Yeah, and you get straight A's in school!"
    },
    {
        "character": "Bebe",
        "line": "You're not even spoiled, because your parents give money to charity!"
    },
    {
        "character": "Red",
        "line": "You don't want to go to this party, Wendy! We're inviting all the boys, and we're gonna play Spin the Bottle, and Two Minutes In The Closet, and do ketamine."
    },
    {
        "character": "Wendy",
        "line": "That's okay."
    },
    {
        "character": "Annie",
        "line": "Oh, please, do you even know what ketamine is?"
    },
    {
        "character": "Wendy",
        "line": "Yes."
    },
    {
        "character": "Annie",
        "line": "See? You are too smart."
    },
    {
        "character": "Red",
        "line": "Yeah. We have no idea what ketamine is."
    },
    {
        "character": "Bebe",
        "line": "Sorry Wendy. You're just not a whore. Get lost!"
    },
    {
        "character": "Girls",
        "line": "Yeah. [Wendy turns around and walks off sadly. The others laugh at her, then move on to other topics]"
    },
    {
        "character": "Red",
        "line": "Hey, we'd better start inviting boys to the party."
    },
    {
        "character": "Sally Turner",
        "line": "Oooo, look, here comes Clyde."
    },
    {
        "character": "Bebe",
        "line": "Party at my house tonight, Clyde. You're invited. [Clyde walks by, wondering what these girls are on about]"
    },
    {
        "character": "Millie",
        "line": "Mmm, I'd like a piece of that!"
    },
    {
        "character": "Red",
        "line": "I wanna do him."
    },
    {
        "character": "Annie",
        "line": "Oh, yeah. Here comes Kyle. [Cartman, still at his locker, looks over. Kyle passes by]"
    },
    {
        "character": "Sally",
        "line": "Mmm, talk to me, kosher boy. [Cartman turns around to see what the girls see]"
    },
    {
        "character": "Millie",
        "line": "I'd like to twizel his pixie stick."
    },
    {
        "character": "Bebe",
        "line": "Party at my house tonight, Kyle."
    },
    {
        "character": "Annie",
        "line": "Tweek and Jason - that'd be a great three-way. [Tweek and Jason walk by]"
    },
    {
        "character": "Red",
        "line": "Yeah, they're invited too."
    },
    {
        "character": "Sally",
        "line": "Jason has a huge bulge. You're gonna get it, boys."
    },
    {
        "character": "Bebe",
        "line": "Now here's what I'm talking about. [Tolkien appears and walks by] A little midnight blue!"
    },
    {
        "character": "Millie",
        "line": "Yeah, I'd like to wax his crankshaft!"
    },
    {
        "character": "Annie",
        "line": "Be at Bebe's house, tonight, at seven! [Cartman clears his throat, closes his locker, and walks past the girls. Not one of them says a thing.]"
    },
    {
        "character": "Sally",
        "line": "Look, here comes Kevin. [Kevin appears and walks by]"
    },
    {
        "character": "Bebe",
        "line": "Hey Kevin, party at my house."
    },
    {
        "character": "Millie",
        "line": "I'd like to gargle his marbles."
    },
    {
        "character": "Red",
        "line": "Yeah, you said it. [Cartman runs back along the hall in such a way that the girls don't notice]"
    },
    {
        "character": "Sally",
        "line": "See you there, Kev. [Cartman tries again, and the girls notice.]"
    },
    {
        "character": "Cartman",
        "line": "\"Dude, there's Cartman. We should invite him to the party for sure.\" [the girls say nothing. Cartman stops, gets angry, and walks back to the first girl he saw, then flips each one of them off. He flips Red off with both hands.] Fuck you Millie, fuck you Annie, fuck you Bebe, fuck you whatever your name is, and fuck you, bitch! [leaves.]"
    },
    {
        "character": "",
        "line": "Butters' room. He's gotten interested in Paris' genitals, poking at them."
    },
    {
        "character": "Butters",
        "line": "Huh. Didn't I... Whoa, that's the darnedest thing I ever saw. [upon hearing a knock on the door, he gasps and stops probing Paris]"
    },
    {
        "character": "Chris",
        "line": "Ms. Hilton? Uh, Ms. Hilton."
    },
    {
        "character": "Paris",
        "line": "[awakens and sits up] Eugh. Where am I? Ew! This room's all middle-class and small!"
    },
    {
        "character": "Chris",
        "line": "Ms. Hilton, we've talked it over all night and... while your offer is enticing, I'm afraid we just can't sell you our son for two hundred million dollars. [Butters smiles] It'll have to be two hundred and fifty million, cash, up front."
    },
    {
        "character": "Butters",
        "line": "Oh hamburgers!"
    },
    {
        "character": "Paris",
        "line": "Yay! Mr. Biggles, you're mine forever!"
    },
    {
        "character": "Butters",
        "line": "[jumps off the bed and runs to Linda] Please! Ah I don't want to live with her! She snores real bad, and she has a huge nose, and a squishy thing that lives in her pants! Please! Please don't sell me to her! [the parents look at each other]"
    },
    {
        "character": "Chris",
        "line": "All right, Butters, tell you what: if you can raise the two hundred and fifty million dollars yourself, you can stay."
    },
    {
        "character": "Butters",
        "line": "Uh, well huh, how am I supposed to make that kind of money??"
    },
    {
        "character": "Chris",
        "line": "It's called \"working\" young man! Your grandfather was a coal miner for fifty years; he never complained! Get out there and start digging!"
    },
    {
        "character": "Butters",
        "line": "Y-yes sir! [rushes out of the room] I-I gotta... mine some coal... really fast!"
    },
    {
        "character": "Chris",
        "line": "[to Linda] That should keep him busy for a while while we get this transaction finished. Now, Ms. Hilton, how should we start? [they both grin]"
    },
    {
        "character": "",
        "line": "Bebe's house, night. The living room is all decked out in disco furnishings. A disco ball hangs from the ceiling and harmless laser beams shoot here and there. The girls are enjoying themselves while the boys have mixed expressions."
    },
    {
        "character": "Millie",
        "line": "[stands next to the closet while a crowd of girls looks on] Okay, that's two minutes. You can come out, Clyde, Bab. [the door opens and Bab comes out grinning] How was he, Bab?"
    },
    {
        "character": "Bab",
        "line": "[winks at Clyde] We had a great time, didn't we Clyde?"
    },
    {
        "character": "Clyde",
        "line": "[walks out crying with his hands rubbing his butt] Aaaaah, owieeee, owieeee. [a knock is heard at the front door and Red goes to answer it.]"
    },
    {
        "character": "Cartman",
        "line": "[dressed very casually, with hair slightly unkempt] Oh, hey, What's goin' on? I'm uh, here for the party."
    },
    {
        "character": "Red",
        "line": "[not fooled] Yeah? Who invited you?"
    },
    {
        "character": "Cartman",
        "line": "Oh, uh-uh Kelly. Kelly invited me."
    },
    {
        "character": "Red",
        "line": "Kelly who?"
    },
    {
        "character": "Cartman",
        "line": "Kelly Rutherford-Menskin."
    },
    {
        "character": "Red",
        "line": "[looks over her shoulder and calls out] Kelly Rutherford-Menskin?"
    },
    {
        "character": "Kelly Rutherford-Menskin",
        "line": "[approaches the door] Yeah?"
    },
    {
        "character": "Red",
        "line": "Did you invite him?"
    },
    {
        "character": "Kelly Rutherford-Menskin",
        "line": "No! [goes back inside. Red closes the door on Cartman]"
    },
    {
        "character": "Cartman",
        "line": "Oh wait, wait, wait, aah it wasn't her. That's right, I forgot, it was uh... Kelly Pinkertonstinfurter?"
    },
    {
        "character": "Red",
        "line": "[turns around and calls out] Kelly Pinkertonstinfurter?"
    },
    {
        "character": "Kelly Pinkertonstinfurter",
        "line": "[sharing a wading pool with Tolkien and Heidi] What? [Red glares at Cartman]"
    },
    {
        "character": "Cartman",
        "line": "[under his breath] Oh, Goddammit!"
    },
    {
        "character": "",
        "line": "Herbert Garrison's house, night. The doorbell rings and he goes to answer it. It's raining outside and thunderclaps roll soft and deep."
    },
    {
        "character": "Herbert Garrison",
        "line": "Oh, hello Wendy. Are you all right?"
    },
    {
        "character": "Wendy",
        "line": "No, I need help."
    },
    {
        "character": "Herbert Garrison",
        "line": "F-from from me?"
    },
    {
        "character": "Wendy",
        "line": "Actually, I was hoping to see your boyfriend."
    },
    {
        "character": "Herbert Garrison",
        "line": "Well sure, come on in. Mr. Slave is right over here. [the camera follows them over to Mr. Slave, who's dangling from the ceiling like a marionette. He's moaning in pleasure]"
    },
    {
        "character": "Mr. Slave",
        "line": "Oooooooooooh! Oh Jesus, Jesus Christ!"
    },
    {
        "character": "Herbert Garrison",
        "line": "Mr. Slave, little Wendy from class wants to see you."
    },
    {
        "character": "Mr. Slave",
        "line": "Oh, Hi Wendy. You need a little help with your math homework?"
    },
    {
        "character": "Wendy",
        "line": "No, I need help becoming a dirty whore like you"
    },
    {
        "character": "Herbert Garrison",
        "line": "...Oh dear. Mr. Slave, I think you and Wendy better have a little talk. I'll make some cocoa."
    },
    {
        "character": "",
        "line": "The sofa, moments later. Wendy and Mr. Slave sit side by side."
    },
    {
        "character": "Wendy",
        "line": "Mr. Slave, you're the most perverted, lewd, depraved slut I know."
    },
    {
        "character": "Mr. Slave",
        "line": "Thank you sweetie."
    },
    {
        "character": "Wendy",
        "line": "Can you teach me your secret fast?"
    },
    {
        "character": "Mr. Slave",
        "line": "Honey, I didn't work to become a whore, I was born a whore. I've been one... ever since I can remember. [a shot of the toddler Slave crawling around on a bed] Ever since I was a little boy I seemed to enjoy... different things."
    },
    {
        "character": "Little Slave",
        "line": "Mommy, I think I have a fever. Can you take my temperature? [his mom approaches and sticks a thermometer up his butt] Oooo, Jesus Christ. [grins]"
    },
    {
        "character": "Mr. Slave",
        "line": "As I got older, I felt that one boy was never enough."
    },
    {
        "character": "Boy slave",
        "line": "[sees a football practice and fakes a call] Hey, there's that queer kid. Let's tackle him! [holds out his arms and waits for the tackle]"
    },
    {
        "character": "Kid",
        "line": "Hey yeah, tackle the queer kid! [the players gang up on him. He seems to love the punishment] We'll show you, queer!"
    },
    {
        "character": "Boy slave",
        "line": "Oooooooooooh! Oooooooooooh! Jesus Christ!"
    },
    {
        "character": "Mr. Slave",
        "line": "So you see, I can't make you into a whore, Wendy. But why would you want to be one anyway?"
    },
    {
        "character": "Wendy",
        "line": "Because all the other girls are. They're having a huge sex party right now and I'm not invited."
    },
    {
        "character": "Mr. Slave",
        "line": "A what?! For God's sake, where?!"
    },
    {
        "character": "",
        "line": "Butters' house, outside. Butters is at the side of the house shoveling dirt from a mound."
    },
    {
        "character": "Butters",
        "line": "You work eighteen hours and what do you get? Parents sell ya to Paris Hilton.\n\n [a blue car pulls up alongside and stops]\n"
    },
    {
        "character": "Man",
        "line": "Look at that. A bear, mining for coal."
    },
    {
        "character": "Woman",
        "line": "Huh, I never. [the car moves on. Butters' parents, Paris, and her driver approach him]"
    },
    {
        "character": "Chris",
        "line": "Well, Butters, how'd it go? Did you dig up two hundred million dollars' worth of coal?"
    },
    {
        "character": "Butters",
        "line": "Well, no, not quite."
    },
    {
        "character": "Chris",
        "line": "Oh, well, too bad. [shows off the check] Ms. Hilton did raise the money, so you'll be going off with her."
    },
    {
        "character": "Butters",
        "line": "[throws away his shovel] Ah, shucks! [moments later he follows Paris into the limo]"
    },
    {
        "character": "Linda",
        "line": "Bye, sweetie, we love you!"
    },
    {
        "character": "",
        "line": "Inside the limo, Paris gets her camera and aims"
    },
    {
        "character": "Paris",
        "line": "Smile Mr. Biggles! This time I have to get a picture of my new pet before anything happens. [snaps a picture]"
    },
    {
        "character": "Butters",
        "line": "Before what happens? [gets no answer, so looks around and sees her \"MY PETS\" photo album. He picks it up and leafs through it]"
    },
    {
        "character": "",
        "line": "The shots are gruesome. First up is Tinkerbell, with the gun and blood splattered all over the place; then Patches, a French poodle that hung itself, shown dangling from the noose; then Scrambles, a cat that somehow managed to slit its front paws, lying in a bathtub full of water and blood; then Cuddles, a dog that committed harakiri."
    },
    {
        "character": "Butters",
        "line": "Aaaaaaaaaaaaaah! [throws the book away, gets out of the limo as fast as he can and runs away.]"
    },
    {
        "character": "Paris",
        "line": "[exits the limo] Mr. Biggles! Mr. Biggles, come back! [Butters' parents approach] You'd better help me find him! No Mr. Biggles, no money! [takes away the check]"
    },
    {
        "character": "Chris",
        "line": "Oh that trouble making son of ours! Butters! Butters, you get back here or you are grounded, mister!"
    },
    {
        "character": "",
        "line": "Bebe's house, night. The party is still going strong. One Kelly, who had earlier been with Tolkien, is chasing Kyle. Another Kelly chases Kevin. Red is coming on to Stan. Annie chases Kenny down and catches him. In general, the guys are being chased down by the girls. A girl with dark hair chases Craig, and is about to catch him. Annie talks to Kenny. Millie chases Tweek. Bebe chases Blue Cap. Mr. Slave kicks the front door open and enters with Wendy. Cartman appears behind then and enters."
    },
    {
        "character": "Mr. Slave",
        "line": "Oh Jesus! [turns on the light] Kids, kids!"
    },
    {
        "character": "Annie",
        "line": "Ew, party foul!"
    },
    {
        "character": "Red",
        "line": "Shut off the light."
    },
    {
        "character": "Stan",
        "line": "Oh, thank God."
    },
    {
        "character": "Mr. Slave",
        "line": "Girls, what on earth are you doing?"
    },
    {
        "character": "Bebe",
        "line": "We're being stupid spoiled whores. [grins]"
    },
    {
        "character": "Butters",
        "line": "[rushes in] H-help! You've gotta hide me! [opens the closet door and enters] Don't tell her I'm in here! [closes the door]"
    },
    {
        "character": "Bebe",
        "line": "What did you do, Wendy?! Go rat on us because you're not invited to our Paris Hilton party?!"
    },
    {
        "character": "Mr. Slave",
        "line": "Okay, I think this has all gone far enough! Now look, the last person you want to be like is Paris Hilton!"
    },
    {
        "character": "Paris",
        "line": "[approaches the house and enters] Mr. Biggles!"
    },
    {
        "character": "Mr. Slave",
        "line": "[unaware] Paris Hilton is a nobody! She may have money, but she's a thoughtless, talentless lowlife!"
    },
    {
        "character": "Paris",
        "line": "Who the fuck are you calling a lowlife?!"
    },
    {
        "character": "Bebe",
        "line": "Wow, Paris Hilton is at my party! I rule!"
    },
    {
        "character": "Butters",
        "line": "[bolts out of the closet] HAAAAH! [Bab looks out from the closet, grinning]"
    },
    {
        "character": "Mr. Slave",
        "line": "Hon, will you just tell these girls that being a whore isn't such a great thing."
    },
    {
        "character": "Paris",
        "line": "What isn't great about it? What's more to life than partying?"
    },
    {
        "character": "Mr. Slave",
        "line": "Look girls, I've partied a lot. Okay? And I'm telling you, there's more to life."
    },
    {
        "character": "Paris",
        "line": "You don't even know what partying is, loser. [brushes him off]"
    },
    {
        "character": "Mr. Slave",
        "line": "Sweetie, really, don't go there, okay?"
    },
    {
        "character": "Paris",
        "line": "Oh I went there. I went there, took some pictures, and flew back already."
    },
    {
        "character": "Girls",
        "line": "Ooooo!"
    },
    {
        "character": "Annie",
        "line": "Wow, what a bitch. [smiles]"
    },
    {
        "character": "Mr. Slave",
        "line": "Sweetie, listen, I know you've done some \"partying\" in your private little rich life, but you don't even wanna know the kind of stuff I've done. I'm the real whore, and I'm telling you, it isn't great."
    },
    {
        "character": "Paris",
        "line": "Oh yeah?! I challenge you to a whore-off!"
    },
    {
        "character": "Girls",
        "line": "Ooooo!"
    },
    {
        "character": "Men",
        "line": "[popping up out of nowhere] Whore-off! Whore-off!"
    },
    {
        "character": "",
        "line": "South Park's Whore-off. A gazebo is set up for the event in South Park Square. A crowd gathers."
    },
    {
        "character": "Official",
        "line": "Ah, testing? Hello? [taps the mic a few times] Okay uh, welcome everyone. Uh, the South Park Chamber of Commerce is pleased to bring you the first annual \"Who Is The Biggest Whore\" showdown. [the crowd cheers]"
    },
    {
        "character": "Bebe",
        "line": "Mr. Slave has no idea what he's in for."
    },
    {
        "character": "Red",
        "line": "Paris is gonna rock his world."
    },
    {
        "character": "Official",
        "line": "Ah, I'm... not quite sure how we... start this competition off, but uh-"
    },
    {
        "character": "Paris",
        "line": "[gets off her chair and walks over to the mic] I'll show ya how we start it off. [the music starts and she kisses him hard and grabbing his crotch]"
    },
    {
        "character": "Crowd",
        "line": "Ohhh! [the girls are grinning, Wendy looks at the girls' reactions. Paris then has five men on stage with her, and one of them is licking her leg. Mr. Slave simply observes]"
    },
    {
        "character": "Wendy",
        "line": "[approaches Stan and friends, and Mr. Garrison] What is Mr. Slave doing? He-he's just sitting there."
    },
    {
        "character": "Herbert Garrison",
        "line": "Give him time, Wendy. Give him time. [cheers him on softly] Come on, Mr. Slave."
    },
    {
        "character": "Paris",
        "line": "[throws the men off] Back off! None of you losers are enough for me! [whips out a pineapple from behind her back and stuffs it up her vagina] Eeeaaagh. Oh yeah. Aaaargh. [some gasps] Tada! [the crowd cheers and fireworks go off]"
    },
    {
        "character": "Randy",
        "line": "Oh, no she di'int. [the crowd continues cheering]"
    },
    {
        "character": "",
        "line": "Mr. Slave makes his move: he gets off his chair and walks over to Paris, then moves her around till he's satisfied she's where he wants her to be. The crowd falls silent and Mr. Slave walks back to his chair."
    },
    {
        "character": "Mr. Slave",
        "line": "[dusts himself off and coughs] Jesus. [takes off his pants and takes a running leap towards Paris. He lands on her head and proceeds to swallow her up through his ass, with each swallow accompanied by a grunt. The first swallow takes her head; the second, her chest; the third, her abdomen and lower back; and the fourth takes the rest of her body.] Ohoho, Jesus. [the girls are stunned at what they just saw. The adults, the boys, and Wendy all cheer]"
    },
    {
        "character": "Herbert Garrison",
        "line": "Now, that's a whore! [Stan and friends are still stunned. Mr. Slave goes back to his chair and puts on his pants]"
    },
    {
        "character": "Bebe",
        "line": "Wow, I guess Paris isn't such hot shit after all."
    },
    {
        "character": "Mr. Slave",
        "line": "People, don't applaud me. I'm a dirty whore. [the crowd falls silent] Being spoiled and stupid and whorish is supposed to be a bad thing, remember? Parents, if you don't teach your children that people like Paris Hilton are supposed to be despised, where are they gonna learn it?! You have to be the- [feels something in his stomach] ooohooho, Jesus Christ. You have to be the ones to make sure your daughters aren't looking up to the wrong people."
    },
    {
        "character": "Mr. Stevens",
        "line": "The homosexual is right. From now on, Bebe, you're going to dress like a little girl. [the crowd disperses and the girls walk up to Wendy]"
    },
    {
        "character": "Bebe",
        "line": "Wendy, we're sorry we called you names. Like not-stupid and not-spoiled."
    },
    {
        "character": "Red",
        "line": "Yeah, and I didn't mean to say you weren't a whore."
    },
    {
        "character": "Wendy",
        "line": "That's okay, you guys. [Butters and his family are shown next]"
    },
    {
        "character": "Chris",
        "line": "So-so that's it? No two hundred million dollars? Well, Butters, I hope you're happy!"
    },
    {
        "character": "Butters",
        "line": "[turns right and walks away] I'm a bad bear. I'm a very bad old bear."
    },
    {
        "character": "Chris",
        "line": "You're a grounded old bear."
    },
    {
        "character": "",
        "line": "Deep within Mr. Slave's intestine, Paris is trying to claw her way out."
    },
    {
        "character": "Paris",
        "line": "Oh my God, it's so gross! Let me out of here! [a light comes on in front of her - it's the Frog King] What the fuck is that?"
    },
    {
        "character": "Frog King",
        "line": "Paris, you must find the way out of this place or you'll surely die."
    },
    {
        "character": "Paris",
        "line": "What?"
    },
    {
        "character": "Frog King",
        "line": "Make your way to the small intestine. There you will meet the Sparrow Prince, who can guide you to Catatafish. Now go, Paris Hilton. Make haste! [disappears]"
    },
    {
        "character": "Singers",
        "line": "[End of Stupid Spoiled Whore Video Playset. Some singers sing the following song as Paris begins her journey]\nA great adventure is waiting for you ahead.\nHurry onward Paris Hilton or you will soon be dead.\nThe road ahead is filled with danger and fright\nBut push onward, Paris Hilton, with all of your might.\nParis Hilton... Paris Hilton, Paris Hilton\nParis Hilton... Paris Hilton, Paris Hilton\nParis Hilton... Paris Hilton, Paris Hilton\nStupid whore!\n\n\n"
    }
]