[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Cartman's yard, side of the house, day. The fourth grade boys are gathered there for some reason."
    },
    {
        "character": "Clyde",
        "line": "I don't know, that looks pretty high up."
    },
    {
        "character": "Butters",
        "line": "Yeah. I think it'd be better to start lower."
    },
    {
        "character": "Stan",
        "line": "Dude, I really don't think it's smart, Cartman. [Cartman is shown at the edge of the roof wearing wings made from cardboard]"
    },
    {
        "character": "Cartman",
        "line": "This is gonna be totally cool, you guys."
    },
    {
        "character": "Stan",
        "line": "It's not gonna work; just come down from there."
    },
    {
        "character": "Cartman",
        "line": "[assessing the situation] ...Jeez, this looks a lot higher from up here."
    },
    {
        "character": "Kyle",
        "line": "[arrives in time to see Cartman's attempt] What's going on?"
    },
    {
        "character": "Stan",
        "line": "Cartman thinks he can fly off of his roof. [Kyle looks up to see what the others see. Cartman looks down]"
    },
    {
        "character": "Kyle",
        "line": "Do it! Do it!"
    },
    {
        "character": "Cartman",
        "line": "I'm gonna!"
    },
    {
        "character": "Craig",
        "line": "I wouldn't if I were you."
    },
    {
        "character": "Tolkien",
        "line": "Those wings don't look very strong."
    },
    {
        "character": "Kyle",
        "line": "Don't listen to 'em, Cartman! I'm sure it'll work. Go for it. Yaaay, Cartman! Fly, fly, fly!"
    },
    {
        "character": "Cartman",
        "line": "Okay, here we go. [steps forward and gets ready to launch himself] Since the days of Copernicus, man has dreamed of flight. On this historic day, let us go on to-"
    },
    {
        "character": "Kyle",
        "line": "Awww, go on and do it already!"
    },
    {
        "character": "Cartman",
        "line": "Hold on, I'm givin' my speech! On this historic day, we remember the Wright Brothers: Orville and Redenbacher, whose dreams and visions inspired generations."
    },
    {
        "character": "Stan",
        "line": "[to Kenny] He's not gonna do it."
    },
    {
        "character": "Cartman",
        "line": "And now, again, one man's vision ushers in a new era of aerial travel, proving the power of imagination and intellect. The magic... of flight! [he flaps his cardboard wings a few times to get some lift, then jumps off the roof. He heads straight for the ground and lands on his face with a grunt. All the boys are shocked and stand there frozen for several seconds. Stan is the first to leave, then Kyle, then the rest of them. Only Butters remains, and he turns to watch the others leave. After a few seconds of uncertainty, he leaves too.]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, day. Cartman is in a recovery room with bruises on his face and a black left eye. The medical staff attends him. Outside, Ms. Cartman appears and rushes in to see Cartman."
    },
    {
        "character": "Liane",
        "line": "Oh my God! Eric! Eric, [caresses him] Mommy's here. Sweetie? [notices Dr. Doctor] Oh, what's wrong with him?"
    },
    {
        "character": "Dr. Doctor",
        "line": "I'm afraid that your son is... incredibly stupid. He thought he could fly with cardboard wings. The stupidity is so severe that it caused a fall, which has... put him into a deep coma."
    },
    {
        "character": "Liane",
        "line": "Coma... My God, fo- for how long?"
    },
    {
        "character": "Dr. Doctor",
        "line": "There's no telling. He may never recover. We'll just have to wait. And see. [the camera looks at Cartman, then pans up and fades out]"
    },
    {
        "character": "",
        "line": "Hell's Pass, some time later. The camera pans down back onto Cartman, who is now covered in facial hair and a bandage around his head."
    },
    {
        "character": "Singers",
        "line": "Seasons change, time passes by.\nAs the weeks become the months become the years.\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Eugh... [sits up, his eyes still closed.]"
    },
    {
        "character": "Liane",
        "line": "[stands up and drops her book] Oh my- Doctor! [Cartman blinks] He's awake! [the doctor and nurse return]"
    },
    {
        "character": "Cartman",
        "line": "Wheh? Where am I?"
    },
    {
        "character": "Liane",
        "line": "Oh, you've finally come back! It's a miracle!"
    },
    {
        "character": "Dr. Doctor",
        "line": "You're at the hospital, Eric. You've been in a coma for some time."
    },
    {
        "character": "Cartman",
        "line": "Coma... How long?"
    },
    {
        "character": "Dr. Doctor",
        "line": "It's been two... days. Nurse, you can remove his face-warmer now."
    },
    {
        "character": "Nurse",
        "line": "Yes, Doctor. [tugs at the facial hair and it comes off.]"
    },
    {
        "character": "Dr. Doctor",
        "line": "Now, Eric, you've suffered massive head trauma. Your road to recovery will be long and arduous. At least another two days. [a shot of the hospital's exterior, then back to the recovery room, where Liane is giving Cartman a glass of chocolate milk]"
    },
    {
        "character": "Singers",
        "line": "Seasons change, time passes by.\nAs the weeks become the months become the years.\n\n\n"
    },
    {
        "character": "Liane",
        "line": "You're doing so much better, muffin."
    },
    {
        "character": "Cartman",
        "line": "Why the hell do I have to share my room with other patients?! This is bullcrap!"
    },
    {
        "character": "Liane",
        "line": "Oh, you're sounding just like your old self again."
    },
    {
        "character": "Dr. Doctor",
        "line": "[at another patient's bed] I'm sorry, detectives, there was nothing we could do."
    },
    {
        "character": "Yates",
        "line": "Damnit! Another murder victim! For three years the Left-Hand killer has been at large and I've exhausted every lead! Maybe... I just don't have what it takes to be a cop anymore."
    },
    {
        "character": "Murphy",
        "line": "We'd better get back to the station, sir."
    },
    {
        "character": "Cartman",
        "line": "Good, because you assholes have kept me up for three hours!"
    },
    {
        "character": "Yates",
        "line": "All right, let's go, Murphy. Hang on a second, where are, where are my car keys?"
    },
    {
        "character": "Cartman",
        "line": "Probably in your front pocket, dumbass!"
    },
    {
        "character": "Yates",
        "line": "[fishes around in the front shirt pocket and is surprised to find them there, then turns to the doctor] Doctor, didn't you say that kid suffered head trauma?"
    },
    {
        "character": "Dr. Doctor",
        "line": "Yes, it was pretty severe."
    },
    {
        "character": "Murphy",
        "line": "What is it, Lou?"
    },
    {
        "character": "Yates",
        "line": "I've... heard cases where people suffering head trauma awaken to some psychic abilities."
    },
    {
        "character": "Murphy",
        "line": "Aw, come on, sir."
    },
    {
        "character": "Yates",
        "line": "I know it's ridiculous, [turns right and walks off] but I'm gonna explore every possibility I can! [Murphy follows. They arrive at Cartman's bed] Hello, young man, could we have a quick word with you?"
    },
    {
        "character": "Cartman",
        "line": "Not now! The nurse is gonna walk in any minute with my lunch."
    },
    {
        "character": "Nurse 2",
        "line": "Twelve-thirty, Eric. Lunch time. [the officers are amazed at how timely the nurse came with the lunch]"
    },
    {
        "character": "Yates",
        "line": "Young man, how did you know the nurse was gonna walk in just now?"
    },
    {
        "character": "Cartman",
        "line": "I don't know, I just knew it. [receives the tray from the nurse and sniffs] Aww man, this smells like meatloaf. Again?!"
    },
    {
        "character": "Nurse 2",
        "line": "Yep, meatloaf again. [the officers get a little frightened]"
    },
    {
        "character": "Murphy",
        "line": "Jesus, how did he...?"
    },
    {
        "character": "Yates",
        "line": "Little boy... [whispers to himself] Well it's a snowball's chance in hell but... [back to Cartman] we were wondering if you could come down and see if your... new powers could help us catch the killer."
    },
    {
        "character": "Liane",
        "line": "His new... powers?"
    },
    {
        "character": "",
        "line": "Stark's Pond, newly restored from the demolished Wall Mart, much bigger than it was before, night. A crime scene at the docks is shown, complete with boat floating around."
    },
    {
        "character": "Female Detective",
        "line": "All right, make sure you get pictures of everything in this crime scene. [one officer takes pictures, another handles evidence gingerly. Nearby, a police tape is lifted so Cartman could check out the scene]"
    },
    {
        "character": "Officer 1",
        "line": "Who's the kid?"
    },
    {
        "character": "Officer 2",
        "line": "He's supposed to be some kind of psychic."
    },
    {
        "character": "Officer 1",
        "line": "Aw, Christ!"
    },
    {
        "character": "Yates",
        "line": "[with Murphy, Liane, and Cartman] This is... where the body was found. [overhead shot] Multiple stab wounds, just like all the others."
    },
    {
        "character": "Cartman",
        "line": "How come the outline is missing its hand?"
    },
    {
        "character": "Murphy",
        "line": "The killer always cuts off the left hand of his victim, and keeps it as a trophy. [Cartman walks around the outline, inspecting it.]"
    },
    {
        "character": "Yates",
        "line": "Stand back, give him room! [moves to hold the crowd back] Come on, kid, concentrate! What do you see in your mind?"
    },
    {
        "character": "",
        "line": "Cartman begins to concentrate and his eyes begin to twitch. First he sees a cupcake with chocolate topping and sprinkles, then powdered doughnuts, then a cup of vanilla ice cream - with sprinkles being added."
    },
    {
        "character": "Cartman",
        "line": "Ice cream. Covered with... chocolate sprinkles... [he sees a hand holding Double-Stuff Oreo] Double-Stuff Oreos... [a second hand comes up and twists off the lower cookie] He ... He's taking the top of one and... [squeezes his eyes closed and sees another Oreo attached to the first one so there are two fillings between the cookies] ...and he puts it together to make Quadruple-Stuffs! [the detective writes down what Cartman is seeing] I see...ice cream, and sprinkles, and Quadruple-Stuffs!"
    },
    {
        "character": "Yates",
        "line": "Jesus Christ!"
    },
    {
        "character": "Murphy",
        "line": "Sir?"
    },
    {
        "character": "Yates",
        "line": "Tom Johansen, the owner of the ice cream shop!"
    },
    {
        "character": "",
        "line": "Tom Johansen's house, night. The detectives ring his doorbell and he answers."
    },
    {
        "character": "Tom Johansen",
        "line": "Yes? Oh, hello, detectives."
    },
    {
        "character": "Yates",
        "line": "Mr. Johansen, could we have a quick word with you?"
    },
    {
        "character": "Tom Johansen",
        "line": "Sure, come on in! [he backs up and leads them in. The lead detectives calls in some officers hidden nearby, and they come in] I'm afraid the house is a little bit of a disaster area since I have-"
    },
    {
        "character": "Yates",
        "line": "Get him! [the officers tackle Tom Johansen and beat him harshly with their batons] Code 6! Code 6!"
    },
    {
        "character": "Officer 3",
        "line": "Use the taser! Use the taser! [another officer fires a taser into Tom Johansen, who then convulses and falls to the floor]"
    },
    {
        "character": "Officer 4",
        "line": "Do it again! [the officer shocks Tom Johansen again, causing more convulsions]"
    },
    {
        "character": "",
        "line": "Tom Johansen's house outside, front. Police cars and vans have gathered outside and the siren lights are still rotating."
    },
    {
        "character": "Officer 3",
        "line": "He put up a hell of a fight, but we got him!"
    },
    {
        "character": "Tom Johansen",
        "line": "Why?! Why?! [the officers haul him away]"
    },
    {
        "character": "Yates",
        "line": "Congratulations, Eric. You just stopped the biggest killer in South Park history."
    },
    {
        "character": "Murphy",
        "line": "We would give you a reward, but I guess that knowing the people of South Park are safe again is reward enough."
    },
    {
        "character": "Cartman",
        "line": "Guess again."
    },
    {
        "character": "Murphy",
        "line": "[walks over and hands him some money] All right, here's a hundred dollars."
    },
    {
        "character": "Cartman",
        "line": "Wow!"
    },
    {
        "character": "Yates",
        "line": "[to Liane] His powers are uncanny. Take good care of him, Ms. Cartman. Make sure he uses his powers... for good."
    },
    {
        "character": "Liane",
        "line": "Oh, he will. My little poopsiekins is a very good little boy."
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The school bell rings. Cartman runs down the hall."
    },
    {
        "character": "Cartman",
        "line": "I'm a psychic and you are worse. I have super-awesome powers and you don't.\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "[walks up. Other kids gather behind him] Cartman, what did you do?!"
    },
    {
        "character": "Cartman",
        "line": "Oh, didn't you hear, Kyle? I used my new psychic abilities to catch the serial killer. And I made a hundred bucks! [shows off the money]"
    },
    {
        "character": "Kyle",
        "line": "Nice old Mr. Johansen runs a candy shop! He wasn't a killer and you know it!"
    },
    {
        "character": "Cartman",
        "line": "Then why did I see ice cream and cookies when I closed my eyes?"
    },
    {
        "character": "Kyle",
        "line": "Because you're a fucking fatass, that's why!"
    },
    {
        "character": "Cartman",
        "line": "Do not doubt my powers, Kyle!"
    },
    {
        "character": "Kyle",
        "line": "You don't have any powers!"
    },
    {
        "character": "Cartman",
        "line": "Don't make me do it, Kyle! I can make your head explode with a single thought!"
    },
    {
        "character": "Butters",
        "line": "Wuh be careful, Kyle."
    },
    {
        "character": "Kyle",
        "line": "He can't do crap!"
    },
    {
        "character": "Cartman",
        "line": "Fine, Kyle! You asked for it! Hee-at! [closes his eyes and starts making sound effects and hand motions. The boys behind Kyle except Stan and Kenny scatter, and the detectives spot him as they enter the school.]"
    },
    {
        "character": "Yates",
        "line": "There he is! Hey, Eric! Eric! [they approach him, he turns around] We've got a little problem."
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Yates",
        "line": "While the ice-cream store owner was in jail, another murder was committed."
    },
    {
        "character": "Murphy",
        "line": "This body also had a missing hand and a bowl of corn flakes next to it!"
    },
    {
        "character": "Yates",
        "line": "Which can only mean one thing!"
    },
    {
        "character": "Kyle",
        "line": "Ha! You see?!"
    },
    {
        "character": "Yates",
        "line": "That a copycat killer is on the loose! We need your psychic abilities to catch this new guy right away!"
    },
    {
        "character": "Kyle",
        "line": "What?!"
    },
    {
        "character": "Murphy",
        "line": "We'll pay you up front this time! We've gotta catch this new guy before he kills again."
    },
    {
        "character": "Cartman",
        "line": "I'm afraid that my powers... are not for sale. ...And by that I mean they absolutely are for sale. Let's go!"
    },
    {
        "character": "",
        "line": "Field report."
    },
    {
        "character": "Chris Swollenballs",
        "line": "Tom, I'm standing in a meadow just outside of town, where police have discovered the first victim of the serial copycat killer. Child wunderkind Eric Cartman is now arriving on the scene. [Cartman approaches the body, which is covered with a red blanket]"
    },
    {
        "character": "",
        "line": "The crime scene."
    },
    {
        "character": "Kyle",
        "line": "This is fuckin' ridiculous!"
    },
    {
        "character": "Lou",
        "line": "Whattaya got, wunderkind? Are ya seeing anything?"
    },
    {
        "character": "Cartman",
        "line": "No. Nothing."
    },
    {
        "character": "Officer 5",
        "line": "Maybe his powers have left him."
    },
    {
        "character": "Officer 6",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "Wait a minute. [his right arm twitches and he sees a bucket of chicken, then sees some chicken served next to the powdered doughnuts he saw earlier. His eyes are squeezed tight.] Fried chicken! It's tender and it's fresh! [sees some syrup poured onto the chicken] There's maple syrup... Maple syrup's being put on the chicken!"
    },
    {
        "character": "Kyle",
        "line": "What the hell is wrong with these people?!"
    },
    {
        "character": "Michael Deets",
        "line": "[in robe and cap] They're never gonna catch the serial killer. He's too smart. Do you want to see my cotton panties? [whips open his robe to reveal himself dressed in a yellow bikini. The boys look on, a little afraid]"
    },
    {
        "character": "Kyle",
        "line": "Hey! What about this guy?!"
    },
    {
        "character": "Murphy",
        "line": "Quiet! He's havin' a vision!"
    },
    {
        "character": "Cartman",
        "line": "It is fried chicken! [first he sees a plate of fried chicken, then the maple syrup, then some whipped cream, then some chocolate syrup, then a cherry on top...] Oh my God. It's a fried chicken sundae."
    },
    {
        "character": "Weird Man",
        "line": "[brings out a mannequin torso and head and strikes up a conversation with it] \"Junior, what are you doing out?\" I'm sorry, Mother. \"You come home right now and have sex with me!\" No, Mommy! [goes away]"
    },
    {
        "character": "Kyle",
        "line": "Hey, uh, does anyone know who that guy is?!"
    },
    {
        "character": "Lou",
        "line": "I said quiet, you little brat, or I'll have you arrested for interfering with the law!"
    },
    {
        "character": "",
        "line": "The News 4 logo and screen come up on a TV."
    },
    {
        "character": "Announcer",
        "line": "This is Park County News 4, with your host, Jim Brown-ish"
    },
    {
        "character": "Jim Brown-ish",
        "line": "The copycat killer of the cut-off-the-left-hand killer has been arrested. Police used the help of Eric Cartman, a wunderkind psychic detective. At the crime scene, the young psychic had visions flash before his mind, and the police immediately arrested the owner of Kentucky Fried Chicken. The young man's visions were so astounding that other police departments have sought out his help."
    },
    {
        "character": "",
        "line": "Cartman's house, day. He's in his room counting the money he's made from his psychic work."
    },
    {
        "character": "Cartman",
        "line": "If I'm happy and I know it, clap my hands.\nIf I'm happy and I know it, clap my hands.\n\n\n[someone knocks on his door, then the door opens]\n\n"
    },
    {
        "character": "Liane",
        "line": "Eric, sweetie, there's um, some people here to see you."
    },
    {
        "character": "Cartman",
        "line": "More people need to make use of my phenomenal gifts, huh? Ahhh, it's so very tiring."
    },
    {
        "character": "Liane",
        "line": "Ah, no, these people claim that they are the \"real\" psychic detectives. [Cartman stops counting money and freezes]"
    },
    {
        "character": "",
        "line": "Living room, moments later. Liane and Cartman enter."
    },
    {
        "character": "Female psychic",
        "line": "So, you are the little boy who's been taking all our work?!"
    },
    {
        "character": "Liane",
        "line": "Oooh, I'll go make some tea."
    },
    {
        "character": "Male Psychic 1",
        "line": "Kid, we have a problem. You didn't go through the proper channels to become a psychic detective like we all did."
    },
    {
        "character": "Other psychics",
        "line": "Yeah!"
    },
    {
        "character": "Cartman",
        "line": "Proper channels?"
    },
    {
        "character": "Male Psychic 2",
        "line": "You were supposed to fill out the form on the back of the comic book and pay the twenty five dollar fee for the degree from the Psychic Detective School. [shows the ad in question. Looks nice]"
    },
    {
        "character": "Cartman",
        "line": "I was given my gift from a tragic accident. I didn't need to go to Psychic Detective School."
    },
    {
        "character": "Male Psychic 1",
        "line": "Well you just can't say you're a psychic detective, you have to use the ad in the comic book!"
    },
    {
        "character": "Female psychic",
        "line": "You must pay the twenty five dollar fee and give us ten percent of your earnings!"
    },
    {
        "character": "Cartman",
        "line": "[laughs at them] Ten percent, my balls, get lost!"
    },
    {
        "character": "Female psychic",
        "line": "Very well, then you give us no choice. Roger?"
    },
    {
        "character": "",
        "line": "Roger steps out from behind the sofa and prepares to battle Cartman psychically. Cartman simply observes, then responds. He and Roger \"battle\" with sound effects and hand gestures."
    },
    {
        "character": "Female psychic",
        "line": "All right, everyone! [the rest of the psychics join in the battle against Cartman.  Liane returns with the tea.]"
    },
    {
        "character": "Liane",
        "line": "Oh, goodness! What's going on?"
    },
    {
        "character": "Cartman",
        "line": "Stand back, mother! We're having a telekinetic battle of minds!"
    },
    {
        "character": "Liane",
        "line": "O-o-o-o-oh! [prostrates herself]"
    },
    {
        "character": "Female psychic",
        "line": "Enough! [one male psychic is slow to respond] We are ...obviously quite evenly matched. I guess this will have to be settled in court."
    },
    {
        "character": "Cartman",
        "line": "In court?"
    },
    {
        "character": "Female psychic",
        "line": "We brought a class-action lawsuit against you! We'll see you before the judge tomorrow! [the psychics turn and walk out]"
    },
    {
        "character": "Liane",
        "line": "Is it over? [the front door closes after the last psychic leaves]"
    },
    {
        "character": "",
        "line": "A camera shutter is heard and a picture of Ms. Crabtree appears, with blood next to her left cheek. Her left hand is missing. A detective continues taking pictures."
    },
    {
        "character": "Murphy",
        "line": "[reading from a fact sheet] Her name is... Veronica Crabtree, bus driver for the elementary school. She was considered an ancillary character, one the fans wouldn't miss much."
    },
    {
        "character": "Yates",
        "line": "Jesus Christ! Cause of death?"
    },
    {
        "character": "Murphy",
        "line": "Same M.O., sir. Multiple stab wounds, left hand cut off and missing."
    },
    {
        "character": "Yates",
        "line": "So you're telling me somebody new is now copying the crimes of the copycat killer?! Jesus! Where will it end?! [goes to a nearby tree to think] Every time I put a killer behind bars, another guy just steps in and takes his place! What am I doing wrong?!"
    },
    {
        "character": "Kyle",
        "line": "[arriving with Stan and Kenny] Excuse me, sir? I think I know who did this. We saw this guy at the last crime scene, and, and you know how serial killers sometimes return to the scene of the crime? Well, I followed this guy to his house, and when he left again, I collected some fingerprints and did a blood-sample analysis. [holds out his findings] I'm pretty sure he's your man."
    },
    {
        "character": "Lou",
        "line": "[coolly] How do you know?! Are you psychic?!"
    },
    {
        "character": "Kyle",
        "line": "No."
    },
    {
        "character": "Lou",
        "line": "Look, kid, don't waste my time with your blood-sampling fingerprinty hocus-pocus! I have to find this new killer now! I owe it to that victim over there! I know she hadn't been in any recent episodes, but dammit she deserved better than this! Come on, Murph, we've gotta talk to Eric Cartman again! [leaves with Murphy]"
    },
    {
        "character": "Kyle",
        "line": "Why won't anybody listen to me?!"
    },
    {
        "character": "Kenny",
        "line": "[pats Kyle on the shoulder] (Don't take it personally, Kyle.)"
    },
    {
        "character": "Kyle",
        "line": "[shrugs Kenny off] I am taking it personally because Cartman is a retard! Just because he hit his head and went into a coma doesn't mean he's a- Wait, that's it. If I want people to listen to me, I just have to be as stupid as Cartman."
    },
    {
        "character": "",
        "line": "Kyle's house, later. Kyle is standing at the edge of the roof at the side of his house, sporting his own cardboard wings."
    },
    {
        "character": "Stan",
        "line": "Dude, I really don't think that's a good idea!"
    },
    {
        "character": "Tolkien",
        "line": "There has to be another way!"
    },
    {
        "character": "Kyle",
        "line": "Be sure to take me to the same hospital!"
    },
    {
        "character": "Butters",
        "line": "Now Kyle, don't fly too close to the sun, or it'll burn your wings, an- and you'll crash into the ocean."
    },
    {
        "character": "Stan",
        "line": "[under his breath] Butters, Goddammit."
    },
    {
        "character": "Kyle",
        "line": "All right, here we go. [spreads his wings] Since the days of Copernicus, man has dreamed of flight. On this historic day we remem- aw, screw it! [jumps off and lands on the ground below]"
    },
    {
        "character": "Stan",
        "line": "[a few moments later, sighs] Call an ambulance."
    },
    {
        "character": "",
        "line": "Channel 4 News. A picture of handcuffs is shown, with \"ARRESTS MADE\" above it."
    },
    {
        "character": "Jim Brown-ish",
        "line": "Multiple arrests were made today for the murder of Hillary Neals. Police raided the South Park Motel 6 at 4 a.m., where seven psychic detectives were staying. [footage of the arrests is shown. Two of them are beaten, a third is slammed against a squad car until the side of her head begins to bleed, and a fourth holds police at bay. He tries to fight them with his powers, but they simply open fire and kill him where he stands] The psychic detectives' horrible crime was found out by psychic detective Eric Cartman, [shown in dramatic pose with psychic waves emanating from his forehead] who is now the only psychic not behind bars. What an amazing coincidence."
    },
    {
        "character": "",
        "line": "Cartman watches the news from the sofa in the living room at his house."
    },
    {
        "character": "Cartman",
        "line": "Cool. [the doorbell rings and Cartman concentrates] Ah, Kyle is at the door. Come in, Kyle! [the door opens and the weird man from the crime scenes enters and approaches Cartman] Who are you?"
    },
    {
        "character": "Michael Deets",
        "line": "You. You give everyone else credit for my work, because you fail to see my greatness."
    },
    {
        "character": "Cartman",
        "line": "... 'Kay. Sweet."
    },
    {
        "character": "Michael Deets",
        "line": "Because of you, nobody knows the extent of my deeds."
    },
    {
        "character": "Cartman",
        "line": "Oh yeah. Awesome. Hold on, just a second. [hops off the sofa, walks away a bit, and calls out] Mom, there's some homeless guy here. Make him go away. [the weird man quickly advances and smothers Cartman's face with a cloth, making Cartman inhale chloroform. Cartman passes out.]"
    },
    {
        "character": "",
        "line": "Next scene is an unknown place. Cartman is strapped down to a wheelchair. He awakens and struggles a bit."
    },
    {
        "character": "Cartman",
        "line": "Hey. Hey, what's goin' on?!"
    },
    {
        "character": "Michael Deets",
        "line": "You are obviously a big fan of my work."
    },
    {
        "character": "Cartman",
        "line": "I don't even know you dude!"
    },
    {
        "character": "Michael Deets",
        "line": "But I am the serial killer! The one whose rightful place in history you have smirched!"
    },
    {
        "character": "Cartman",
        "line": "Oh, Jesus."
    },
    {
        "character": "Michael Deets",
        "line": "And now you will have a place of honor, as my nineteenth victim."
    },
    {
        "character": "Cartman",
        "line": "No! No, you don't wanna kill me. Please, I'll give you anything you want!"
    },
    {
        "character": "Michael Deets",
        "line": "Before you die, let me show you the things that I've done, so you will understand the breadth of my transformation! [starts up a slideshow projector] This... is me at the grand canyon. [shows a shot of him there] Do you see? This is me at Mount Rushmore [the next picture is shown, with him looking lovingly at the faces there] Do you see?"
    },
    {
        "character": "Cartman",
        "line": "[nervously] Heheh."
    },
    {
        "character": "Michael Deets",
        "line": "Do you see?!"
    },
    {
        "character": "Cartman",
        "line": "Yes yes, I see! [another Mount Rushmore picture is shown, with the man looking at the camera this time]"
    },
    {
        "character": "Michael Deets",
        "line": "Here I am at the Alamo in San Antonio. [this time he looks psychotic, with his hands ready to grab something] This was just outside of the gift shop. Do you see?!"
    },
    {
        "character": "Cartman",
        "line": "AAAAAAAH!"
    },
    {
        "character": "",
        "line": "Park County Police Station, night."
    },
    {
        "character": "Yates",
        "line": "[hangs up the phone] Dammit! Dammit all to hell! They just found another body! That means a fifth copycat killer is on the loose! Where's my psychic?!"
    },
    {
        "character": "Female Detective",
        "line": "Sorry, Sarge, the psychic's mom says her son hasn't been home for a couple of hours."
    },
    {
        "character": "Officer 7",
        "line": "Sir! Dr. Kels just called from the hospital! He says another little boy just awoke from a coma, and is having psychic visions!"
    },
    {
        "character": "Yates",
        "line": "[grabs his hat] Let's go! [other officers follow]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, later. Dr. Doctor leads them into the recovery room."
    },
    {
        "character": "Dr. Doctor",
        "line": "This is the young man here. He was in a coma for over sixteen hours. [a shot of Kyle with a bandage around his head. He too has a face warmer on, but no black eye like Cartman had]"
    },
    {
        "character": "Yates",
        "line": "Doctor, could you remove his face warmer? We'd like to speak with him."
    },
    {
        "character": "Dr. Doctor",
        "line": "Of course. Nurse? [a brunette approaches and removes the warmer. Sgt. Lou and Det. Murphy approach the bed]"
    },
    {
        "character": "Yates",
        "line": "Young man, the doctor said you've had some... visions about our newest murder?"
    },
    {
        "character": "Kyle",
        "line": "I see... a man... with a baseball cap. [Sgt. Lou snaps his fingers and Det. Murphy whips out a notepad and pen and starts taking notes. Kyle concentrates] He's killing now... Oh! I'm seeing it all flash before my eyes! The guy's name is Michael Deets, and he lives at 621 Castillo Street. He's usually there between seven and eleven p.m."
    },
    {
        "character": "Yates",
        "line": "What do you think, Mitch?"
    },
    {
        "character": "Murphy",
        "line": "I don't know. How do we know this kid is really psychic? I mean, this boy is certainly no Eric Cartman. [Kyle clenches his teeth in rage]"
    },
    {
        "character": "Yates",
        "line": "All right, we'll check this Deets guy out. But let's use that one thing that we never use."
    },
    {
        "character": "Murphy",
        "line": "...Sir?"
    },
    {
        "character": "Yates",
        "line": "You know, what's that one thing that starts with an R that we never use?"
    },
    {
        "character": "Murphy",
        "line": "...Restraint?"
    },
    {
        "character": "Yates",
        "line": "Yeah, yeah, restraint. We'll check this guy out, but let's use some restraint. [they leave]"
    },
    {
        "character": "",
        "line": "Michael Deets' basement. He's still showing Cartman his slides."
    },
    {
        "character": "Michael Deets",
        "line": "Look! Look at the things I've done! Here I am at Yellowstone National Park! [shows off the picture] Do you see?! Here are pictures of my trip to Cheyenne for Frontier Days. Do you see?!"
    },
    {
        "character": "Cartman",
        "line": "Oh, God! I'm so bored! Somebody help me! [the doorbell is heard. The two detectives are outside, Yates ringing the doorbell. Michael Deets opens the door]"
    },
    {
        "character": "Yates",
        "line": "Good evening, sir. We're Park County detectives. We were just wondering if we could take a quick look around your house, Misterrr..."
    },
    {
        "character": "Michael Deets",
        "line": "God."
    },
    {
        "character": "Yates",
        "line": "Well, Mr. God, it won't take but a second; it might help us with an investigation. [he shows them in. The house is dark, with stacks of paper everywhere. Pictures of his victims line the walls. Downstairs, Cartman tries to get attention.]"
    },
    {
        "character": "Cartman",
        "line": "(Hey! Come over here!)"
    },
    {
        "character": "Yates",
        "line": "I see you like cutting the eyes out of photos of women. My son is a big fan of that, too."
    },
    {
        "character": "Murphy",
        "line": "Sarge! In here! [Lou runs into the next room. They both face a wall of left hands nailed in place]"
    },
    {
        "character": "Yates",
        "line": "Jesus H.... That boy was right! Arrest that guy! [Murphy gets right on it. Yates thinks about the hands] Whoa-whoa-wait-wait-hey-wait-wait-yo! Oh, wait a minute, no ah, I'm wrong."
    },
    {
        "character": "Murphy",
        "line": "Sir?"
    },
    {
        "character": "Yates",
        "line": "This isn't the guy. The serial killer always cuts off the victims' left hands."
    },
    {
        "character": "Murphy",
        "line": "Right."
    },
    {
        "character": "Yates",
        "line": "Well those aren't left hands. [holds up his own left hand, palm in] See, on your left hand, the thumb faces to the left. Those are all right hands."
    },
    {
        "character": "Murphy",
        "line": "Ohhh. [they return to the living room]"
    },
    {
        "character": "Yates",
        "line": "Nope, this isn't our man. [they turn to leave the house and see Michael Deets in the shadows] We're sorry, Mr. God. It appears we've wasted your time. [they head out]"
    },
    {
        "character": "Cartman",
        "line": "[in the basement] (Hey! Help!) [upstairs, Mr. Deets closes the front door]"
    },
    {
        "character": "Murphy",
        "line": "Heh, pretty amazing coincidence that guy had a bunch of hands on his wall. Heh, no wonder that boy thought he was a killer."
    },
    {
        "character": "Yates",
        "line": "[stops and thinks] Yeah... Amazing coincidence..."
    },
    {
        "character": "Murphy",
        "line": "[backs up] Heh- sir?"
    },
    {
        "character": "Yates",
        "line": "Call it police intuition, but somethin' in there just didn't feel right. [thinks for several seconds] Wait a minute."
    },
    {
        "character": "Murphy",
        "line": "Sarge... [Lou slowly raises his hand palm in and analyzes it. Then he turns his hand over slowly until the palm is out and is jolted with recognition] What is it?"
    },
    {
        "character": "Yates",
        "line": "I'm not sure. I'm gonna have to run some tests. [runs off to do just that]"
    },
    {
        "character": "",
        "line": "Park County Police Station, night. Montage. Yates types away at his computer, then analyzes his left hand again, then returns to the keyboard. He then goes to the lab and looks over his notes. Next to him are two hands, one right and one left. He rotates the right hand so both thumbs point to the left, from his POV, then takes more notes. He develops some pictures in the darkroom and finds matching hands. He works with a 3D model drawing with another computer, then traces his left hand on a wall and takes measurements. He returns to the lab and works with some chemicals. Next he chops some firewood into smaller chunks. Next he's at a gym jumping rope. Next he's at a beach far from South Park playing volleyball with some women. Next he's repairing the body of a car with a welding torch..."
    },
    {
        "character": "Yates",
        "line": "[back at the station, looks in on Murphy] Murphy, do you remember what I was supposed to be doing?"
    },
    {
        "character": "Murphy",
        "line": "Oh. Uhhh... Oh. Something about hands, sir? Uh, for the serial killer?"
    },
    {
        "character": "Yates",
        "line": "[snaps his fingers] Oh right! The hands! Right! [the montage resumes]"
    },
    {
        "character": "",
        "line": "Again he goes to his computer and types away then he's back at the lab taking pictures of the two fake hands there, then makes silhouettes of a dog, then models another hand in the computer and gets a match."
    },
    {
        "character": "Yates",
        "line": "Oh my God. Murphy! [Murphy appears quickly.] You're not gonna believe this."
    },
    {
        "character": "",
        "line": "Michael Deets house, basement. Michael Deets has resumed showing his pictures to Cartman. A picture of him at Ocean World's Splash Zone is shown, then a blank. He turns the projector off."
    },
    {
        "character": "Michael Deets",
        "line": "That's it, no more pictures. [walks in front of Cartman and faces him, then pulls out a sharp knife] Time to die."
    },
    {
        "character": "Cartman",
        "line": "No, please! I'm sorry I gave other people credit for your killings. Ahah, it was, it was very wrong for me to lie about the other psychics and get them arrested."
    },
    {
        "character": "Michael Deets",
        "line": "Your hand will be one with the others."
    },
    {
        "character": "Cartman",
        "line": "Please just let me go! Ah, I'm gonna tell everyone I'm not really psychic! I've learned my lesson! Please, I don't wanna- [spots the detectives descend the stairs and approach the room] I don't wanna have to use my psychic mind missile on you! [begins to concentrate and make noises]"
    },
    {
        "character": "Yates",
        "line": "Hold it right there, killer! [Michael Deets turns and rushes at them with the knife. Yates fires three shots into him, killing him. The detectives advance, and Yates fires a forth shot into the body, looks around, and fires a fifth shot, getting blood splattered on himself]"
    },
    {
        "character": "Cartman",
        "line": "You got here just in time. He was gonna kill me because he was insanely jealous of my incredible psychic ability."
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, day. The detectives, the psychics, Mr. Johansen, Dr. Docter, Cartman, Stan, and Kenny are present."
    },
    {
        "character": "Yates",
        "line": "Well young man, you did an amazing thing. Not only did your psychic visions help us catch the killer, but a lot of innocent people are out of jail."
    },
    {
        "character": "Tom Johansen",
        "line": "Yes, thank you very much, Kyle."
    },
    {
        "character": "Female psychic",
        "line": "Yes, thanks."
    },
    {
        "character": "Murphy",
        "line": "You're certainly a better psychic then Eric."
    },
    {
        "character": "Kyle",
        "line": "No, don't you see? Cartman never had psychic visions. And neither do these people. The plain simple truth is that nobody is psychic. There's a logical explanation for every psychic story you've ever heard."
    },
    {
        "character": "Murphy",
        "line": "Do you think that's true?"
    },
    {
        "character": "Yates",
        "line": "It must be true. The kid is psychic. [thinks a moment] But I don't suppose it really matters much. Because in the end, the way I caught the killer was with... good old-fashioned police work. Come on, Murphy. [they leave the room and then the hospital]"
    },
    {
        "character": "Female psychic",
        "line": "[addressing Cartman] Well young man, I guess that just leaves one score to settle."
    },
    {
        "character": "Cartman",
        "line": "You can't hurt me."
    },
    {
        "character": "Male psychic",
        "line": "Then let this be our final battle! [the psychics face Cartman once again and battle him with their power. Nothing happens, but there's a lot of noise.]"
    },
    {
        "character": "Kyle",
        "line": "[irritated] Just stop it! [at the top of his lungs] Stoop iiit!! [the lights go out as the bulbs shatter, then the shelf above his bed falls and everything on it hits the floor. The psychics and Cartman stop their battle and witness all this] There's a logical explanation for that."
    }
]