[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Early dawn over Cartman's house. Liane is still sleeping. Cartman runs into his mother's bedroom"
    },
    {
        "character": "Cartman",
        "line": "Mom! Mom! Get up, we have to go! [moves to the foot of the bed] MOM, GET UP!"
    },
    {
        "character": "Liane",
        "line": "[sits up, feeling sleepy] Oh, Poopie-kins, it's very early."
    },
    {
        "character": "Cartman",
        "line": "[goes to the other side of the bed and draws close to her face] Mom, I told you! The new Sony PSP game machines go on sale at seven a.m. today. I have to be the first to get one! [turns on her light] Come on! [goes back to the door]"
    },
    {
        "character": "Liane",
        "line": "[still sleepy] Sweetie, can't we go after school?"
    },
    {
        "character": "Cartman",
        "line": "Everyone's moms are taking their kids after school! We're outsmarting everyone by getting to the store right when it opens! Let's go!"
    },
    {
        "character": "",
        "line": "Liane's car, some time later. She and Cartman drive along, Cartman bouncing happily in his seat"
    },
    {
        "character": "Cartman",
        "line": "I can't wait to see the look on everyone's faces when I show up to school with a PSP! I wonder if Kyle will cry? Oh PLEASE let Kyle cry! [they pull up to the curb and stop. Cartman gets out of the car] WHAT THE HELL?!"
    },
    {
        "character": "",
        "line": "Before them is a long line of people in front of Luau's Toys waiting for the PSP. The camera reaches the front of the line only to find Kenny right at the front door. He's the first one in line. Cartman approaches Kenny"
    },
    {
        "character": "Cartman",
        "line": "Kenny, when did you get here?"
    },
    {
        "character": "Kenny",
        "line": "[looks at his watch](Friday)"
    },
    {
        "character": "Cartman",
        "line": "Friday?! Aw, Jesus! [he switches tactics] I'll just... sort of get in here- in here. [gets in line between Kenny and the Goth Kids]"
    },
    {
        "character": "Tall goth",
        "line": "Hey dickhole! What do you think you're doing?"
    },
    {
        "character": "Cartman",
        "line": "Uh, my friend Kenny was saving my place in line."
    },
    {
        "character": "Sixth grader",
        "line": "There's no saving place, fourthie! Get to the back or we'll beat your face in!"
    },
    {
        "character": "Cartman",
        "line": "Oh, Goddammit! [moves to the back of the line] They'd better not sell out!"
    },
    {
        "character": "",
        "line": "The bus stop, later in the day. Kenny is playing with his PSP as Stan and Kyle look on. Stan and Kyle weren't in line"
    },
    {
        "character": "Kyle",
        "line": "That thing is pretty cool. What games did you get with it?"
    },
    {
        "character": "Stan",
        "line": "[answering for Kenny] It's a game called \"Heaven versus Hell.\" Kenny commands the armies of heaven against the forces of Satan. [Cartman walks up to the other boys, but he's quite upset. He crosses his arms] Dude, you see what Kenny got?"
    },
    {
        "character": "Cartman",
        "line": "YES YES, I KNOW! UP YOURS, KYLE! [Cartman folds his arms]"
    },
    {
        "character": "Kyle",
        "line": "Wuh what'd I do?"
    },
    {
        "character": "Cartman",
        "line": "JUST SHUT YOUR JEW MOUTH!!!"
    },
    {
        "character": "Game voice",
        "line": "\"Congratulations! You have reached ...level nine!\""
    },
    {
        "character": "Kyle",
        "line": "Wow, level nine already? Dude, you kick ass in \"Heaven versus Hell.\""
    },
    {
        "character": "Stan",
        "line": "Yeah, Kenny finally found something he's really good at."
    },
    {
        "character": "",
        "line": "A montage follows. Kenny is seen in class playing on his PSP, then in the cafeteria, then in the playground, then in his bedroom at night. He reaches level 24. He's then seen at the amusement park with his family, still playing with his PSP, then in \"The Mine Shaft\" roller coaster, where he reaches level 45. He's seen on the bus playing on his PSP while the other students are having fun, then in Le Bijou playing while Stan and Kyle watch a movie, then on the sidewalk passing some hot babes - he doesn't look up to acknowledge them, then in his bed again at night. He reaches level 54."
    },
    {
        "character": "",
        "line": "Kenny's house, day, the kitchen. He's still playing on his PSP"
    },
    {
        "character": "Carol",
        "line": "Kenny? Kenny, are you still playin' with that thing? [Yep] Kenny, it's been two weeks and you've done nothin' else!"
    },
    {
        "character": "Kenny",
        "line": "(I could get to level sixty!)"
    },
    {
        "character": "Carol",
        "line": "Who cares if you almost made it to level sixty?! You're wastin' your life, Kenny! If you died tomorrow, what would you have to show for it?! You're gonna end up wishin' you'd done more with your life, just like your dead-beat father!"
    },
    {
        "character": "Stuart",
        "line": "[offscreen] Hey, I heard that, bitch!"
    },
    {
        "character": "Carol",
        "line": "I wasn't talkin' to you, asshole!! [Kenny leaves, having tuned her out all the while]"
    },
    {
        "character": "Stuart",
        "line": "[offscreen] How about I come in there and kick your teeth in!"
    },
    {
        "character": "Carol",
        "line": "I'd like to see you try!"
    },
    {
        "character": "",
        "line": "Kenny leaves the house and goes to the sidewalk. His parents continue arguing inside."
    },
    {
        "character": "Stuart",
        "line": "Goddamnit, do you have to smart off at me in my own house?!"
    },
    {
        "character": "Carol",
        "line": "It's my house too, you no-good loser!"
    },
    {
        "character": "Game voice",
        "line": "You have reached level sixty!"
    },
    {
        "character": "Kenny",
        "line": "[starts jumping around excited] (Yes! Woohoo! I did it! I reached level s-!) [an ice-cream truck runs over him. The driver misses this, as he's playing on his own PSP]"
    },
    {
        "character": "Driver",
        "line": "Oh yeah, level four, sweet!"
    },
    {
        "character": "",
        "line": "The street. Kenny's body lies on the road. Eventually his ghost rises out of his body"
    },
    {
        "character": "Kenny",
        "line": "(Hey, that's odd.) [He rises up in the air.] (Hey, I'm floating. That can't be! Hey wait!) [he then speaks too fast to decipher, but he toes towards heaven.]"
    },
    {
        "character": "",
        "line": "He reaches heaven, right side up, and bounces once before landing. He walks towards a giant golden gate"
    },
    {
        "character": "Angel 1",
        "line": "Open the gate!"
    },
    {
        "character": "Angel 2",
        "line": "Open the gate! [the gates open and an elderly man walks towards Kenny. Kenny shields his eyes from the bright rays.]"
    },
    {
        "character": "Peter",
        "line": "Welcome to the Kingdom of Heaven, Kenny. I am Peter."
    },
    {
        "character": "Kenny",
        "line": "(What the fuck is going on?)"
    },
    {
        "character": "Peter",
        "line": "There isn't much time, Kenny. You're dead, but, your death was no accident. Heaven needs you."
    },
    {
        "character": "Kenny",
        "line": "(Me?)"
    },
    {
        "character": "Peter",
        "line": "Come! There is much to discuss. [they both enter and behold a gleaming city on a hill. Inside, the city has all the appearance of a super-basilica, built with gold and marble. Angels flit around doing stuff] Things are not good in Heaven, Kenny. Satan is planning a massive attack and he knows we are too few in number to stop him! God has changed the rules here. For ages, only Mormons were allowed into Heaven. [they pass the Mormons, who greet them] But knowing that Hell was becoming much larger, God decided to let more people cross over so that he could build an army as well, an army that YOU must command."
    },
    {
        "character": "Kenny",
        "line": "(That I what?)"
    },
    {
        "character": "Peter",
        "line": "The Sony PSP was built by God, to determine who on Earth had the best skills to defeat the armies of Satan. You... are the best. YOU, are the only hope for the universe."
    },
    {
        "character": "",
        "line": "In a great courtyard outside the super-basilica. An angel addresses the others"
    },
    {
        "character": "Angel 3",
        "line": "Satan's army grows as we speak. The Dark Lord knows that our armies are few in number, and unorganized. So our only hope... is perfect strategy. [steps aside to show Kenny off]"
    },
    {
        "character": "Angel 4",
        "line": "A child? This is God's solution?"
    },
    {
        "character": "Peter",
        "line": "He beat Satan's army in over three thousand separate simulations."
    },
    {
        "character": "Angel 4",
        "line": "Archangel Michael, what say you?"
    },
    {
        "character": "Michael",
        "line": "[looks out into space, then turns around] The child did something none of us could: Reach level sixty on the PSP. Now I don't know if that's luck or perseverance, but it's Goddamned impressive. All right, Kenny, let me show you what we're up against. [two other angels roll a chalkboard to him, and he begins drawing up strategies.] This is the Kingdom of Heaven. Satan's armies will attack the gate ...here. They are... ten billion in number. Maybe more. [sniffs the fumes from the Sharpie] Our armies are here, here, and here. Just under... ten thousand strong. [sniffs again] We are outnumbered and in need of someone who can single handedly bring the whole Dark Empire down. Basically, Kenny, you... are Keanu Reeves. [Kenny just sits there.]"
    },
    {
        "character": "",
        "line": "Hell. Satan's armies mill about, the troops arm each other. Satan addresses them"
    },
    {
        "character": "Satan",
        "line": "My fellow damned souls! Now is the time for our assault! [with him is a small hooded figure] You know no fear! You will drink the blood of angels! We go now! Nothing can stop us!"
    },
    {
        "character": "Angel 5",
        "line": "Step aside! Step aside, I say! [stops when he sees Satan] Satan! God has mocked thee once again!"
    },
    {
        "character": "Satan",
        "line": "My spy!"
    },
    {
        "character": "Angel 5",
        "line": "God has found a way to defeat your army."
    },
    {
        "character": "Satan",
        "line": "Impossible! How?!"
    },
    {
        "character": "Angel 5",
        "line": "A young man. Basically, he-he's like Keanu Reeves."
    },
    {
        "character": "Satan",
        "line": "[slumps down in his throne] Oh Jesus Christ."
    },
    {
        "character": "Hooded figure",
        "line": "My Lord. My Lord, we must attack, now!"
    },
    {
        "character": "Satan",
        "line": "What's the point?! They have a Keanu Reeves now."
    },
    {
        "character": "Hooded figure",
        "line": "Do not fear, my Lord. Your army is great!"
    },
    {
        "character": "Satan",
        "line": "Very well. [rises and addresses his army] Demon Army, begin your march on Heaven! [a loud roar comes up from the army]"
    },
    {
        "character": "",
        "line": "Michael and Kenny walk to one of the ramparts and look out over Heaven"
    },
    {
        "character": "Michael",
        "line": "Up here, you get the best tactical view to protect the fortress. It is from here, Kenny, that you shall command the armies of heaven."
    },
    {
        "character": "Kenny",
        "line": "(All right. How am I supposed to do that?)"
    },
    {
        "character": "Angel 6",
        "line": "Simple. You will use... this. [bows towards a chair and backs off. A golden PSP descends onto the chair]"
    },
    {
        "character": "Michael",
        "line": "[gets the PSP and shows it to Kenny] This golden PSP is king of all PSPs."
    },
    {
        "character": "Angels",
        "line": "Hail the holy PSP."
    },
    {
        "character": "Michael",
        "line": "It works just like the ones we sent to Earth. All the commands you make will be sent to the troops down on the battlefield. All you have to do is play the game, Kenny. Only this time, It's for reals."
    },
    {
        "character": "Angel 7",
        "line": "Gabriel returns with news!"
    },
    {
        "character": "Gabriel",
        "line": "Hell's army is departing! They head now for the Gates of Heaven."
    },
    {
        "character": "Michael",
        "line": "Prepare the troops! [the angels take off] We must be ready for them! [walks up to Kenny] The time is at hand, Kenny. The stage is set and the final battle between Heaven and Hell is about to begin! The fate of the outcome is in your hands. [Kenny vanishes. The angels notice] Where'd he go?"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital. The paddles have been taken to Kenny and fired away."
    },
    {
        "character": "Female nurse",
        "line": "Doctor! Doctor, we have a pulse!"
    },
    {
        "character": "Doctor",
        "line": "Then that's it! We brought him back."
    },
    {
        "character": "Male nurse",
        "line": "Amazing, doctor! You've revived somebody who's been legally dead for almost a day!"
    },
    {
        "character": "Doctor",
        "line": "Call the parents. They're going to be shocked to find out... their son is alive."
    },
    {
        "character": "",
        "line": "Hell's Pass, later"
    },
    {
        "character": "Doctor",
        "line": "It's the latest in electro-plastilical science. Your son's organs are all functioning again."
    },
    {
        "character": "Stuart",
        "line": "It's a miracle... Kenny, you're alive."
    },
    {
        "character": "Doctor",
        "line": "I'm afraid he can't respond to you. You see, being dead for that long, most of Kenny's brain cells died from lack of oxygen. Your son is alive, but, in what we call a \"persistent vegetative state.\""
    },
    {
        "character": "Carol",
        "line": "Will he ever recover?"
    },
    {
        "character": "Doctor",
        "line": "I'm afraid no. Brain cells cannot be repaired once dead. But his soul is still in here. [places his hand on Kenny's chest] Almost... trapped in here, if you will. Kenny is the same as he ever was. It's just that, now, he's more like ...a tomato."
    },
    {
        "character": "Stuart",
        "line": "He can't more on his own-ah how will he eat?"
    },
    {
        "character": "Doctor",
        "line": "A feeding tube. It pumps a nutrient paste directly into Kenny's stomach. With it we can actually keep Kenny the tomato alive for years."
    },
    {
        "character": "",
        "line": "Back in Heaven, business goes on as usual"
    },
    {
        "character": "Michael",
        "line": "[reading a scroll] A feeding tube?!"
    },
    {
        "character": "Gabriel",
        "line": "Yes. Apparently they're using machines to keep them alive."
    },
    {
        "character": "Michael",
        "line": "But... that's not natural. God intended Kenny to die! What are these people doing?!"
    },
    {
        "character": "Angel 3",
        "line": "The child's soul is now trapped inside his vegetative body. We have no one to command the troops with the PSP."
    },
    {
        "character": "Gabriel",
        "line": "And Satan's armies are approaching."
    },
    {
        "character": "Michael",
        "line": "Oh, Goddammit."
    },
    {
        "character": "",
        "line": "A brick building. Inside, a lawyer sees the four boys."
    },
    {
        "character": "Lawyer",
        "line": "Boys I want to thank you for coming down to my office on such short notice. [the boys are shocked]"
    },
    {
        "character": "Stan",
        "line": "Are we in trouble or something?"
    },
    {
        "character": "Lawyer",
        "line": "No. Boys, I'm a lawyer. Your friend Kenny has passed away and I've called you here to read his will."
    },
    {
        "character": "Kyle",
        "line": "Kenny had a will?"
    },
    {
        "character": "Lawyer",
        "line": "[clears his throat] \"In the highly likely event of my death, I, Kenny McCormick, wish to leave all my belongings to my good friends, Stan and Kyle. Dudes, you were the friends a guy could have.\""
    },
    {
        "character": "Stan",
        "line": "Oh wow..."
    },
    {
        "character": "Kyle",
        "line": "That's... really touching."
    },
    {
        "character": "Cartman",
        "line": "(looking bored) Fags!"
    },
    {
        "character": "Lawyer",
        "line": "To Eric Cartman: \"Eric, I never really liked you. But then, nobody does. You have no ability to feel, and you are going to die alone and miserable. It is only because I feel so sorry for you that I leave you my Sony PSP.\""
    },
    {
        "character": "Cartman",
        "line": "[suddenly excited and cocky] Oh yeah! Oh yeah, baby! Who the man? Who the man?"
    },
    {
        "character": "Lawyer",
        "line": "There is one more thing I would like to ask you all, as my friends. If I should ever be in a vegetative state and kept alive on life-support, please,... [Cartman is still dancing. The lawyer reaches the last page and... can't fine it]"
    },
    {
        "character": "Stan",
        "line": "Please what?"
    },
    {
        "character": "Lawyer",
        "line": "I don't know. I lost the last page."
    },
    {
        "character": "Cartman",
        "line": "Who cares? Kenny's dead! [rushes up to the lawyer's desk] When do I take possession of my PSP, sir?"
    },
    {
        "character": "Lawyer",
        "line": "[pulls up a box from nowhere and puts it on his desk] It's right here, along with Kenny's other belongings. They're all yours."
    },
    {
        "character": "Cartman",
        "line": "[salivating] Yes!"
    },
    {
        "character": "Man",
        "line": "[enters the office] He's alive!"
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Man",
        "line": "Kenny McCormick! He's alive at the hospital! [leaves]"
    },
    {
        "character": "Kyle",
        "line": "Oh my God! [he and Stan rush out of there, leaving Cartman incredulous]"
    },
    {
        "character": "",
        "line": "Satan's armies continue their march to Heaven. Satan looks on through his crystal ball"
    },
    {
        "character": "Hooded figure",
        "line": "Your army nears the Kingdom of Heaven, my Lord."
    },
    {
        "character": "Satan",
        "line": "I don't know if we should continue without knowing more about this Keanu Reeves God has."
    },
    {
        "character": "Spy angel",
        "line": "Satan! I come bearing good news! The Keanu Reeves boy has been revived on Earth! His soul is no longer in Heaven."
    },
    {
        "character": "Satan",
        "line": "[whispers] Then God is helpless. [aloud] Full march, to the Gates of Heaven! Victory is ours!"
    },
    {
        "character": "",
        "line": "The boys reached Hell's Pass and enter Kenny's recovery room"
    },
    {
        "character": "Stan",
        "line": "Kenny?"
    },
    {
        "character": "Kyle",
        "line": "Kenny! You're alive!"
    },
    {
        "character": "Stan",
        "line": "Dude, how'd you do that?"
    },
    {
        "character": "Doctor",
        "line": "He can't respond to you, boys. Being dead for that long caused severe damage to his brain."
    },
    {
        "character": "Cartman",
        "line": "Well... well then he's NOT alive."
    },
    {
        "character": "Carol",
        "line": "He's alive. He-ee smiles when I talk to him. I think..."
    },
    {
        "character": "Cartman",
        "line": "That's not Kenny. Kenny sniffs paint and sets things on fire! Here, look. [climbs onto Kenny's bed and holds out a $1 bill] Kenny, Kenny look. Want a dollar?"
    },
    {
        "character": "Stuart",
        "line": "I-I don't know if it's right to keep Kenny alive on that machine. I-I just... I don't know what he would want."
    },
    {
        "character": "Stan",
        "line": "Yeah, the lawyer lost that page."
    },
    {
        "character": "Cartman",
        "line": "Oh, I just remembered! Kenny told me this one time, that he wouldn't wanna be kept alive via feeding tube."
    },
    {
        "character": "Carol",
        "line": "He did? When?"
    },
    {
        "character": "Cartman",
        "line": "Um, it was um, this one time..."
    },
    {
        "character": "Kyle",
        "line": "He did not say that! You just want him dead so you can have his stupid PSP!"
    },
    {
        "character": "Cartman",
        "line": "Stupid? PSP is stupid?! [steps forth] Did you all hear that? [steps back to his little group] Uh I mean, I mean this isn't about PSP, Kyle! This is about my friend, and his wishes. And Kenny said he didn't want to live like this!"
    },
    {
        "character": "Kyle",
        "line": "He did not!"
    },
    {
        "character": "Cartman",
        "line": "Did so!"
    },
    {
        "character": "Kyle",
        "line": "Did not!"
    },
    {
        "character": "Cartman",
        "line": "Fine! We'll see about this, you freakin' Jew! [moves towards the door] I'm gonna get that feeding tube removed if I have to go all the way to the Supreme Court! [runs out]"
    },
    {
        "character": "",
        "line": "Heaven. The angels mill around inside the fortress"
    },
    {
        "character": "Peter",
        "line": "Satan's army has crossed over the Plains of Limbo!"
    },
    {
        "character": "Gabriel",
        "line": "Then they will be here on the morrow. Without Kenny's soul here there will be nobody who can use the holy PSP."
    },
    {
        "character": "Uriel",
        "line": "No! There is another. A Japanese boy did make it to level fifty-nine."
    },
    {
        "character": "Michael",
        "line": "[thinks for a moment] Are you stupid, Uriel? Japanese people don't have souls!"
    },
    {
        "character": "Angel 9",
        "line": "Yeah"
    },
    {
        "character": "Angel 10",
        "line": "Yeah"
    },
    {
        "character": "Angel 11",
        "line": "Yeah"
    },
    {
        "character": "Angel 12",
        "line": "Yeah, Uriel!"
    },
    {
        "character": "Uriel",
        "line": "Oh, right right, I'm sorry"
    },
    {
        "character": "Michael",
        "line": "Kenny remains our only hope! Here is what we must do. [walks up to the chalkboard and starts writing] Gabriel and Uriel, you go down to Earth and try to get that feeding tube removed. In the meantime [sniffs those Sharpie fumes] we will put all our troops at Heaven's Gate. We will try to keep Hell's Army from breaking through as long as possible. [sniffs those Sharpie fumes] Hopefully, it will be long enough to get our Keanu Reeves back."
    },
    {
        "character": "",
        "line": "The Colorado Supreme Court, day."
    },
    {
        "character": "Cartman",
        "line": "You see your honor, I was the only one that Kenny McCormick told his wishes to. And Kenny told me specifically that he would never want to be kept alive on a machine. What they're doing to him ...is not right."
    },
    {
        "character": "Chief Justice",
        "line": "Well I'm sorry, young man, but the parents want their child kept alive. I don't believe you have any legal authority here."
    },
    {
        "character": "Cartman",
        "line": "I do have legal authority, your honor. You see, I was Kenny's... BFF."
    },
    {
        "character": "Judge 2",
        "line": "Best friends forever?"
    },
    {
        "character": "Cartman",
        "line": "That's right. Kenny and I have been BFFs since first grade. Here, look. [brings forth a necklace with the left half of a BFF heart medallion] Kenny has the other half of this BFF necklace. I believe you all know what that means, and how serious this is."
    },
    {
        "character": "",
        "line": "Hell's Pass hospital, Kenny's room. Kenny's parents keep vigil with Stan and Kyle."
    },
    {
        "character": "Carol",
        "line": "Look, Kenny, your friends are here to visit you again."
    },
    {
        "character": "Doctor",
        "line": "[entering with a policeman] But this just doesn't seem right."
    },
    {
        "character": "Stuart",
        "line": "Wha, what's the matter, doctor?"
    },
    {
        "character": "Doctor",
        "line": "I'm afraid I've been given a court order to remove Kenny's feeding tube."
    },
    {
        "character": "Carol",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "[comes in with the Chief Justice] He's right in here."
    },
    {
        "character": "Kyle",
        "line": "Cartman!"
    },
    {
        "character": "Chief Justice",
        "line": "Kenny's BFF says that Kenny didn't want to be kept alive artificially. The courts have determined we must obey his wish."
    },
    {
        "character": "Kyle",
        "line": "Cartman is NOT Kenny's BFF!"
    },
    {
        "character": "Police officer",
        "line": "Sir, take a look at this. [has Kenny's necklace in hand and points to the other half of the BFF medallion. the justice walks over the officer puts the two halves together]"
    },
    {
        "character": "Chief Justice",
        "line": "[steps back] That's all the verification we need. Pull the feeding tube, doctor."
    },
    {
        "character": "Carol",
        "line": "No doctor! You can't!"
    },
    {
        "character": "Doctor",
        "line": "I'm sorry. I have no choice. [pulls the tube and drops it on the floor]"
    },
    {
        "character": "",
        "line": "Hell's Pass hospital, outside. Uriel and Gabriel arrive"
    },
    {
        "character": "Gabriel",
        "line": "Here is the hospital"
    },
    {
        "character": "Uriel",
        "line": "[the blonde angel without a shirt] This is hopeless, Gabriel. We cannot interact with anything on Earth, how could we possibly get a feeding tube removed?"
    },
    {
        "character": "Kyle",
        "line": "[exiting the hospital with Stan] That dirty no-good sonofabitch!"
    },
    {
        "character": "Stan",
        "line": "Now that Cartman got Kenny's feeding tube out, he's gonna die for sure! [they walk through the angels, then the angels turn around]"
    },
    {
        "character": "Gabriel",
        "line": "The tube has been removed?"
    },
    {
        "character": "Kyle",
        "line": "How can they let an eight-year-old decide Kenny's fate?"
    },
    {
        "character": "Uriel",
        "line": "Apparently, some blessed child has done our work for us."
    },
    {
        "character": "Gabriel",
        "line": "Good. Now all we must do is pray nobody interferes with the child's death a second time."
    },
    {
        "character": "Kyle",
        "line": "Dude, we have to do whatever we can to get that feeding tube put back in!"
    },
    {
        "character": "Stan",
        "line": "Yeah!"
    },
    {
        "character": "Gabriel",
        "line": "No!"
    },
    {
        "character": "Stan",
        "line": "Let's go to the, uh, media. We'll make everyone in the country know that they're killing Kenny."
    },
    {
        "character": "Kyle",
        "line": "Yeah, come on! [grabs Kyle and they go away]"
    },
    {
        "character": "Uriel",
        "line": "No! No, no boys! Aw Goddammit! [the angels follow]"
    },
    {
        "character": "",
        "line": "HBC World News. Splashy graphics."
    },
    {
        "character": "Anchor",
        "line": "This is HBC News. A right-to-die case debate is heating up in Colorado, [Kenny is shown] where Kenny McCormick's feeding tube has been removed by his BFF. [a choked-up Cartman shows his half of the BFF medallion] Two boys are bringing national attention to this story by protesting outside the hospital."
    },
    {
        "character": "",
        "line": "Hell's Pass hospital, outside. The protest has begun"
    },
    {
        "character": "Stan",
        "line": "Don't kill Kenny!"
    },
    {
        "character": "All",
        "line": "You bastards!"
    },
    {
        "character": "Stan",
        "line": "Don't kill Kenny!"
    },
    {
        "character": "All",
        "line": "You bastards!"
    },
    {
        "character": "Uriel",
        "line": "[drifting through the crowd] No! No, they're not killing him, they're letting him die!"
    },
    {
        "character": "Skeeter",
        "line": "You bureaucrats have no right to play God and take that tube out!"
    },
    {
        "character": "Gabriel",
        "line": "Nono, see, they were playing God when they put the feeding tube IN!"
    },
    {
        "character": "Anchor",
        "line": "A woman was arrested for trying to bring food to the patient. [Two officers haul Mrs. Garrison out of the emergency room]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Get your man-hands off of me!"
    },
    {
        "character": "Anchor",
        "line": "However, a growing number of people are also standing behind Kenny's BFF, Eric Cartman."
    },
    {
        "character": "Man 1",
        "line": "[in a crowd of people wearing BFF chains] We must respect the wishes of people's BFFs. Otherwise, all our BFF necklaces would become meaningless"
    },
    {
        "character": "Man 2",
        "line": "We all have BFFs, and we believe that a BFF is the highest legal authority."
    },
    {
        "character": "Cartman",
        "line": "That's right. Respect our authoritah."
    },
    {
        "character": "",
        "line": "Satan watches on his TV, which is much nicer than the one in his bedroom. The hooded figure stands nearby"
    },
    {
        "character": "Satan",
        "line": "What mockery is this?!"
    },
    {
        "character": "Hooded figure",
        "line": "My Lord..."
    },
    {
        "character": "Satan",
        "line": "The feeding tube has been pulled! If the child dies and his soul returns to Heaven, God will have his Keanu Reeves!"
    },
    {
        "character": "Hooded figure",
        "line": "Perhaps the child won't die in time."
    },
    {
        "character": "Satan",
        "line": "Forget it! I'm calling the attack off!"
    },
    {
        "character": "Hooded figure",
        "line": "No! Keep your army marching, my Lord. I will get that feeding tube put back in. [turns and walks off]"
    },
    {
        "character": "Satan",
        "line": "How?"
    },
    {
        "character": "Hooded figure",
        "line": "I will do what we always do: Use the Republicans."
    },
    {
        "character": "",
        "line": "The White House, a press conference on the lawn. People carry signs saying \"Kenny Is Alive\" \"Murder Is Not A Choice\" and \"Don't Kill Kenny\""
    },
    {
        "character": "George Bush",
        "line": "We Republicans are deeply saddened by the tragic events in Colorado. [the crowd cheers]"
    },
    {
        "character": "Hooded figure",
        "line": "[appears and whispers into Bush's right ear] Removing the feeding tube is murder, hughughughughughugh..."
    },
    {
        "character": "George Bush",
        "line": "Removing the feeding tube is murder!"
    },
    {
        "character": "Hooded figure",
        "line": "[whispers into Bush's left ear] Who are we to decide if Kenny should live or die?"
    },
    {
        "character": "George Bush",
        "line": "Who are we to decide if Kenny should live or die?"
    },
    {
        "character": "Hooded figure",
        "line": "[whispers into Bush's right ear] It is God's will that he live!"
    },
    {
        "character": "George Bush",
        "line": "It is God's will that he LIVE! [the hooded figure hisses into Bush's left ear] Haaghaghaghaghaghagha..."
    },
    {
        "character": "Hooded figure",
        "line": "No no, you don't say that part. [hisses into Bush's right ear]"
    },
    {
        "character": "George Bush",
        "line": "No no, you don't say that part, haghaghaghagha. [the crowd looks at him in stunned silence]"
    },
    {
        "character": "",
        "line": "Heaven's Gate. The armies of Hell converge in front of it"
    },
    {
        "character": "Angel 9",
        "line": "Jesus, their army is massive."
    },
    {
        "character": "Angel 10",
        "line": "Heaven help us."
    },
    {
        "character": "",
        "line": "HBC World News."
    },
    {
        "character": "Anchor",
        "line": "The biggest battle of all time is about to begin: the battle of the feeding tube! As people on both sides of the argument vie for media attention."
    },
    {
        "character": "",
        "line": "Kenny's hospital room. Both sides of the controversy chatter away"
    },
    {
        "character": "Kyle",
        "line": "We want all the country to see that Kenny is alive, and in pain!"
    },
    {
        "character": "Cartman",
        "line": "I believe the people at home see he's NOT in pain because he's a tomato!"
    },
    {
        "character": "Kyle",
        "line": "You say tomato, but I say Kenny!"
    },
    {
        "character": "Cartman",
        "line": "You say Kenny, but I say tomato! [both sides yell at each other]"
    },
    {
        "character": "Cartman's Side",
        "line": "Tomato!"
    },
    {
        "character": "Kyle's Side",
        "line": "Kenny! Kenny!"
    },
    {
        "character": "Cartman's Side",
        "line": "Tomato!"
    },
    {
        "character": "Judge",
        "line": "[The executioner of Kenny's will] Uuhh, excuse me. I uh, just found the last page of Kenny's will. [Everyone quiets down]"
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Judge",
        "line": "I found the page where Kenny specified his wishes about being on life support."
    },
    {
        "character": "Stan",
        "line": "Well, what does it say?"
    },
    {
        "character": "Judge",
        "line": "[clears his throat] If I should ever be in a vegetative state and kept alive on life support, please... [flips to the last page] for the love of God, don't ever show me in that condition on national television. [not a word is uttered for a few seconds]"
    },
    {
        "character": "Stan",
        "line": "Oooo."
    },
    {
        "character": "Man",
        "line": "Oowhoops"
    },
    {
        "character": "Kyle",
        "line": "Oh geez. Maybe we let this thing get out of hand. This issue is so complicated, but... m-maybe we sh-should just let Kenny go in peace."
    },
    {
        "character": "Stan",
        "line": "You mean, Cartman's side is right?"
    },
    {
        "character": "Kyle",
        "line": "Cartman's side is right, for the wrong reasons. But we're wrong, for the right reasons."
    },
    {
        "character": "Both sides",
        "line": "Yeah."
    },
    {
        "character": "Kyle",
        "line": "Come on, everybody. I think Kenny wants to be left alone. [everyone walks out.]"
    },
    {
        "character": "",
        "line": "HBC World News."
    },
    {
        "character": "Anchor",
        "line": "We've just received word that Kenny McCormick... has passed away. The debate still rages on in America, but at least now, Kenny... is in a much more peaceful place."
    },
    {
        "character": "",
        "line": "Heaven, inside the fortress. Angels scurry around in a panic"
    },
    {
        "character": "Angel 11",
        "line": "The armies of Satan have already broken through the gate!"
    },
    {
        "character": "Angel 12",
        "line": "We're gonna die!!!"
    },
    {
        "character": "Michael",
        "line": "Send our troops to the battlefield! I'll command as best I can!"
    },
    {
        "character": "Gabriel",
        "line": "Michael! Michael! [he and Uriel bring Kenny to Michael] The humans finally did the right thing!"
    },
    {
        "character": "Michael",
        "line": "Oh my God, they killed Kenny! Get him into the command station! Hurry! [Uriel and Gabriel sit Kenny down and strap him in] Satan's army charges! Tell our troops what to do, Kenny! [Kenny sets to work on the Golden PSP, manning the controls like a pro] So it begins. [Gabriel and Uriel leave Kenny to his task and fly off. The camera focuses on Michael] Now we shall see the final battle between Heaven and Hell play out! [Kenny continues playing, and Michael provides commentary] Yesss, good, Kenny! The angel spearmen are taking out their demon soul rippers! Oh, the cavalry angels are clashing with their Black Knights! Oh my God! My God, this battle is epic! Ohh, they're bringing in their demon dragons! Look at the size of them! My God, this is even bigger than the final battle in the Lord of the Rings movie! It's like, it's like TEN times bigger than that battle!"
    },
    {
        "character": "",
        "line": "Hell. Satan is watching the battle through his crystal ball"
    },
    {
        "character": "Satan",
        "line": "No! NO! How are we losing?! [the spy angel returns]"
    },
    {
        "character": "Spy angel",
        "line": "The child's soul is in Heaven! God has his secret weapon!"
    },
    {
        "character": "Satan",
        "line": "Full retreat!"
    },
    {
        "character": "Hooded figure",
        "line": "Patience, my Lord!"
    },
    {
        "character": "Satan",
        "line": "No, Kevin! [turns and glares at him] That's it! I'm breaking up with you! [one blast from his eyes and Kevin is dead]"
    },
    {
        "character": "",
        "line": "Heaven. Kenny's still at it"
    },
    {
        "character": "Michael",
        "line": "Yesss. Yes, Kenny! Satan's forces are retreating! This is TRULY a sight to behold! OH I wish I had a camcorder! [Kenny continues to play] We have done it! We have defeated the armies of Satan! [the angels in the battlefield look around and celebrate weakly. The angels then gather around Kenny, and Peter joins them.]"
    },
    {
        "character": "Peter",
        "line": "Kenny! Bless your soul! You've saved all of Heaven!"
    },
    {
        "character": "Michael",
        "line": "Yes, Kenny! And to thank you for all you've done, we are going to give you a very special gift. For saving the entire universe from the forces of evil, we give you this. [two angels haul something into view] Keanu Reeves' statue. [a ten-foot statue of Keanu Reeves on a three-foot base] Congratulations. [everyone claps for him]"
    }
]