[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The school bell rings."
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay, kids, as your counselor, I know it can sometimes be difficult to talk about subjects like drugs and sex and alcohol, m'kay? So, as you remember, last week I told you to write down any difficult questions you had and put them in this box anonymously so we could discuss those questions in class, m'kay? I got a lot o' responses, so let's read some aloud. [pulls out the first letter and reads] \"Mr. Mackey is gay.\" [some of the kids laugh] Okay kids, that is not funny! M'kay?! This box is supposed to be used for serious questions! About, about serious issues! M'kay, let's, let's stop the tomfoolery. [puts it aside and reaches into the box for the next letter] M'kay, this looks like a real one here. [reads] \"Dear Mr. Mackey, you are gay.\" [the class laughs] All right, all right. That's enough, kids. Let's quiet down and try to be mature, 'kay? [reaches in to read the next one] Uh here we go. Okay, \"Mr. Mackey, sometimes my parents hit me, and you are gay.\" [the class laughs harder] Dammit, is there not one serious question in here?! [reads the next two letters] \"Mr. Mackey is gay.\" \"Mr. Mackey is gay.\" [gets the next letter] Okay, here. [reads] \"I am a boy at South Park Elementary. Sometimes, when I'm sitting in class, my penis becomes hard for no reason. What should I do?\" [Jimmy looks around nervously. Cartman cracks up, and the rest of the class, except Jimmy, follows] All right kids, all right kids, that's enough! [a small bell is heard and Jimmy looks down] If you all can't be serious about the question box, [turns and writes \"drugs\" on the board] then we'll just do drug identification exercises, unkay?!"
    },
    {
        "character": "Class",
        "line": "Awwwww!"
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay, uhh, Jimmy, why don't you come up here and write down the names of two narcotics?"
    },
    {
        "character": "Jimmy",
        "line": "Uh no, that-that's okay, Mr. Mackey."
    },
    {
        "character": "Mr. Mackey",
        "line": "Jimmy, I'm not asking you, I'm telling you!"
    },
    {
        "character": "Jimmy",
        "line": "Uhhh, just uh ahh not right this second, Mr. Mackey."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well why the hell not?!"
    },
    {
        "character": "Jimmy",
        "line": "Uh... [waves him over. Mr. Mackey walks over and bends down to listen to Jimmy whisper in his ear]"
    },
    {
        "character": "Mr. Mackey",
        "line": "It's what... Oh, you do? R-right now, right now it is? M'kay, m'kay. Don't worry, Jimmy. [returns to the board] N'kay, uhhh, let's pick someone else. Um, Eric, why don't you come up here?"
    },
    {
        "character": "Cartman",
        "line": "Hey, that's bullcrap! How come Jimmy doesn't have to do it?!"
    },
    {
        "character": "Mr. Mackey",
        "line": "Well, because uh, Jimmy is pitching a tent right now. [Jimmy shows some alarm]"
    },
    {
        "character": "Stan",
        "line": "He's what?? [Kyle shrugs]"
    },
    {
        "character": "",
        "line": "South Park Elementary hallway. Kids milling around notice a poster on the pegboard among the lockers and talk amongst themselves."
    },
    {
        "character": "Stan",
        "line": "A hundred dollar gift certificate to South Park Mall? [the kids begin moving out of the way, leaving Stan, Kyle, and Kenny] Maybe we should do the talent show."
    },
    {
        "character": "Kyle",
        "line": "Well, what's the point? Jimmy always wins with his stand-up comedy."
    },
    {
        "character": "Jimmy",
        "line": "Hey fellas."
    },
    {
        "character": "Stan",
        "line": "Dude, didja see, Jimmy? They're giving away a hundred-dollar first prize for the talent show."
    },
    {
        "character": "Jimmy",
        "line": "Oh I sure have. I've been working on my ruh... ruh... routine all year long."
    },
    {
        "character": "Kyle",
        "line": "I don't know how you do it, dude. How do you get up in front of that many people?"
    },
    {
        "character": "Jimmy",
        "line": "Well fellas, entertainment is my life. I love being in front of everyone. [his penis gets aroused] Aaah!"
    },
    {
        "character": "Kyle",
        "line": "Huh wuh, what's the matter?"
    },
    {
        "character": "Jimmy",
        "line": "I gotta guh, I gotta go! See ya fellas. [rushes away and down the hall] Eh, excuse me! Evuh evuh - excuh, cuh, cuse me! Excuse me, puh-please. [he grunts as he heads for the boys' room and enters, looking for an empty stall. He tries the first toilet stall]"
    },
    {
        "character": "Clyde",
        "line": "It's occupied. [Jimmy tries the second stall]"
    },
    {
        "character": "Cartman",
        "line": "No room at the inn, Virgin Mary. [Jimmy heads back to the sinks and throws water on his face, then throws water on his pants' crotch]"
    },
    {
        "character": "Butters",
        "line": "[enters and heads for the urinal] Hehey Jimmy! [arrives at the urinal, drops his trousers and lifts his shirt, and starts pissing] M'boy, did you see that first prize for the talent show? Why you must be excited! You'll probably win like always."
    },
    {
        "character": "Jimmy",
        "line": "Yeah. Yeah, I'm real excited. REAL excited... for some reason... Oh, Jesus! What's wrong with me?"
    },
    {
        "character": "Butters",
        "line": "[notices some heavy drops in the stalls] Hey, who's droppin' bombs in there?! How about a courtesy flush?!"
    },
    {
        "character": "Cartman",
        "line": "Up yours, Butters."
    },
    {
        "character": "",
        "line": "Jimmy's house, afternoon. Jimmy walks through the door and sighs. His parents are on the sofa. His mom reads a book, his dad a newspaper."
    },
    {
        "character": "Sarah",
        "line": "Hey Jimmy, how was school?"
    },
    {
        "character": "Jimmy",
        "line": "Fine, Mom."
    },
    {
        "character": "Ryan",
        "line": "Jimmy, we understand you're getting erections in the classroom."
    },
    {
        "character": "Jimmy",
        "line": "[stops in his tracks for a few seconds, then looks over his shoulder] What? Uh who told you that?"
    },
    {
        "character": "Ryan",
        "line": "Mr. Mackey, your counselor."
    },
    {
        "character": "Jimmy",
        "line": "Aw J-j-j-j...j-Jesus!"
    },
    {
        "character": "Ryan",
        "line": "Now, Jimmy, it's nothing to be ashamed of. But we know it's something you might have a hard time talking about. Get it? A hard time. So, we took your counselor's advice 'nd called Doctor Pal to help us all talk about this."
    },
    {
        "character": "Jimmy",
        "line": "Dz-n-Doctor Pal?"
    },
    {
        "character": "Doctor Pal",
        "line": "[springs up from behind the sofa and quite eager to start. He talks quickly] Hey Jimmy, I'm Doctor Pal. That's because I'm a doctor, but I'm also your pal. Are we cool?"
    },
    {
        "character": "Jimmy",
        "line": "Uh, sure?"
    },
    {
        "character": "Doctor Pal",
        "line": "A lot of times parents call me in because I can relate to younger kids. I'm, I'm down, I'm dope, you dig? Now, I understand you have some concerns about erections. [affects a joking manner] \"Oops, can't say erection in front of the parents right. Oh God, I feel so weird\" huh?"
    },
    {
        "character": "Jimmy",
        "line": "Well, a little, yes."
    },
    {
        "character": "Doctor Pal",
        "line": "Jimmy, there's nothing weird about random erections. Almost every boy goes through a phase where his penis becomes hard... for no particular reason. It's just part of growing up. Growing up? Growing out is more like it. [laughs at his own cleverness]"
    },
    {
        "character": "Jimmy",
        "line": "But I have to make it stop! The talent show is this F-Friday."
    },
    {
        "character": "Doctor Pal",
        "line": "Tell you what, Mom and Dad, why don't you skedaddle for a tick and let us hipsters talk in privo."
    },
    {
        "character": "Ryan",
        "line": "A-all right, come on, honey. [they rise and leave the living room]"
    },
    {
        "character": "Doctor Pal",
        "line": "Jimmy, as you get older your body goes through a lot of changes. Certain hormones start to release as your whole reproductive system begins to awaken, and so, if you like, we can take off our shirts and kiss."
    },
    {
        "character": "Jimmy",
        "line": "Ke...c-come again?"
    },
    {
        "character": "Doctor Pal",
        "line": "Oh, hey, nothin', you see? See, that set you off on a different tangent, got you thinkin' a different way. That's what Doctor Pal is here to do. [leans forward a little] Unless, of course, you think we should take off our shirts and kiss."
    },
    {
        "character": "Jimmy",
        "line": "N-no, I do NOT want to take off my shirt and kiss!"
    },
    {
        "character": "Doctor Pal",
        "line": "Well then to hell with you, kid. You can just deal with your problems on your own. [walks out the door and closes it behind him]"
    },
    {
        "character": "",
        "line": "Jimmy's house, night. He's fast asleep, and we see his dream."
    },
    {
        "character": "Announcer",
        "line": "Next up for the talent show, put your hands together for the incredibly talented Jimmy Valmer! [he approaches the mic. On one side is a stool with a glass of water on it. The school audience is cheering]"
    },
    {
        "character": "Jimmy",
        "line": "Wow, what a what a great audience. So apparently Martha Stewart is out of jail. Have you have you heard about this, have you seen this? She's very excited to get started on her new show, \"Martha Stewart Living, with an electronic ankle bracelet.\" [the audience laughs heartily] So it looks like the Vatican has finally chosen a new Pope. Have you seen this, have you heard about this? [his penis is around and his erection begins to show] A-a-apparently they're going to call him New Pope, a-and refer to John Paul as P-Pope Classic. [the claps are few, his erection is bigger] Uh,.. so it so it looks like Michael Jackson is having back problem in court. [the kids begin to notice the erection and whisper to each other. Jimmy's beginning to falter] You know... huh... you uh you know what they say about b-b-b-b-back problems. [a girl screams and runs out of the gym. The other kids follow. Jimmy's penis has gotten so big it blocks his view of the audience. He moves it to his left so he can see everyone on his right] Uh, uh gee, what a terrific audience. [swings it to his right to see everyone on his left] What a fantastic audience."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Don't worry, Jimmy. We're not laughing with you, we're laughing AT you. [several shots of the audience laughing at Jimmy. Jimmy wakes up and sits up on his bed.]"
    },
    {
        "character": "Jimmy",
        "line": "Nuh uh! Wuh. Huh. Waaagh! Ungh! [punches his genitals with both his fists, then falls asleep hard]"
    },
    {
        "character": "",
        "line": "Butters' house, day. He's practicing his favorite song in the garage with some help from his boom box. Jimmy approaches."
    },
    {
        "character": "Butters",
        "line": "Lu Lu Lu, I've got some apples, Lu Lu Lu, you've got some too. Lu Lu Lu, let's get together, I know what we can do, Lu Lu."
    },
    {
        "character": "Jimmy",
        "line": "Butters!"
    },
    {
        "character": "Butters",
        "line": "Oh! Oh hey, Jimmy. [turns off the tape player] I'm just practicin' for the talent show."
    },
    {
        "character": "Jimmy",
        "line": "Butters, ah I really need to talk to somebody, and I think maybe you're the only person who won't make f-f-fun of me."
    },
    {
        "character": "Butters",
        "line": "Oh gosh, I'd never make fun of somebody with a problem."
    },
    {
        "character": "Jimmy",
        "line": "Butters, do you know what you're supposed to do when your penis gets hard?"
    },
    {
        "character": "Butters",
        "line": "[thinks a moment] Well sure I do."
    },
    {
        "character": "Jimmy",
        "line": "Really??"
    },
    {
        "character": "Butters",
        "line": "Yes, now sit down, Jimmy, we should have a little talk. [they sit next to the boom box] You see, Jimmy, when a man's penis becomes hard, the man puts it into a lady. Into her \"vagiiina.\" [fans his fingers out] Then, the hard penis sneezes milk inside the lady's tummy, and after it's all done sneezin' milk, the penis stops bein' hard, and the man loses interest in the lady."
    },
    {
        "character": "Jimmy",
        "line": "So, when your penis becomes hard, you're supposed to put it in a lady's vagina. And then it stops being hard?"
    },
    {
        "character": "Butters",
        "line": "That's right, Jimmy."
    },
    {
        "character": "Jimmy",
        "line": "But where am I going to find a lady to stick my penis in? The talent show is this Friday."
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The kids visit their lockers to change books."
    },
    {
        "character": "Girl",
        "line": "Talk to you, Bertha."
    },
    {
        "character": "Bertha",
        "line": "Okay, see you later, Jessie."
    },
    {
        "character": "Jimmy",
        "line": "Hey Bertha."
    },
    {
        "character": "Bertha",
        "line": "Oh, hey Jimmy. What's goin' on?"
    },
    {
        "character": "Jimmy",
        "line": "Well Bertha, I was wondering if I could stick my penis in your vagina?"
    },
    {
        "character": "Bertha",
        "line": "What?? No way! [Cartman walks into view, overhears, then stops to listen]"
    },
    {
        "character": "Jimmy",
        "line": "But the talent show is tomorrow! [Bertha slaps him] Ooo!"
    },
    {
        "character": "Bertha",
        "line": "Jerk! [walks away, Cartman comes forward]"
    },
    {
        "character": "Cartman",
        "line": "Jimmy, Jimmy, what the hell are you doing, man?"
    },
    {
        "character": "Jimmy",
        "line": "I'm trying to get laid. What's it look like?"
    },
    {
        "character": "Cartman",
        "line": "Dude, you don't just go up to a girl and ask her if you can stick your penis in her vagina. Ye-you have to ask her on a date, take her out for some Italian food."
    },
    {
        "character": "Jimmy",
        "line": "Wow, seems like you know a lot about this stuff, Eric. Have you gotten laid before?"
    },
    {
        "character": "Cartman",
        "line": "Sure, lots of times. I've been laid, like, five thousand times."
    },
    {
        "character": "Jimmy",
        "line": "Well, wha-what do I do?"
    },
    {
        "character": "Cartman",
        "line": "I told you: a date and then Italian food. And then you gotta make her think you're a good listener."
    },
    {
        "character": "Jimmy",
        "line": "Eric, I can't tell you why, but it's very important that I score to-night! Can you come on the date and help me? You're like a white... Hitch."
    },
    {
        "character": "Cartman",
        "line": "Why sure, they do this all the time in movies and TV shows. You go on the date and wear an earpiece, and I'll be nearby, secretly telling you all the right things to say."
    },
    {
        "character": "Jimmy",
        "line": "Wow! Thanks, Eric."
    },
    {
        "character": "",
        "line": "A house, night. A woman is reading a book on her sofa. The doorbell rings."
    },
    {
        "character": "Mom",
        "line": "Shawna honey, I think your little date is here."
    },
    {
        "character": "Shawna",
        "line": "[heads for the door] Okay, Mom. [opens it, and finds Jimmy waiting outside]"
    },
    {
        "character": "Jimmy",
        "line": "Hey Shawna."
    },
    {
        "character": "Shawna",
        "line": "Hi Jimmy."
    },
    {
        "character": "Cartman",
        "line": "[hiding in some bushes nearby] Okay Jimmy. First off, tell her how good she looks."
    },
    {
        "character": "Jimmy",
        "line": "Wow, Shawna, you look f-fantastic."
    },
    {
        "character": "Shawna",
        "line": "Thanks, Jimmy. Where are we going?"
    },
    {
        "character": "Jimmy",
        "line": "We're going to an authentic Italian restaurant, Buca de Fagghecini"
    },
    {
        "character": "",
        "line": "Buca de Fagghecini, dinnertime. Jimmy and Shawna wait for service at their table."
    },
    {
        "character": "Waiter",
        "line": "Welcome to Buca de Fagghecini for the authentico experience Italiano. My name is Roma. Can I start you out with some lotsa pasta macaroni minis?"
    },
    {
        "character": "Jimmy",
        "line": "Uh, I think we're gonna try your authentic pizzareli casserona poppers."
    },
    {
        "character": "Waiter",
        "line": "Right away. [walks away]"
    },
    {
        "character": "Shawna",
        "line": "You know that girl Sally Rauman at our school? I can't stand her."
    },
    {
        "character": "Cartman",
        "line": "[at a nearby booth] Jimmy! Jimmy! Jimmy, even though what she's saying now isn't interesting at all, you say, \"Wow, that is very interesting. Please tell me more.\""
    },
    {
        "character": "Jimmy",
        "line": "Wow, that is very interesting. Please tell me more."
    },
    {
        "character": "Shawna",
        "line": "Really? Well, Kelligan bought the same purse and I was like, \"No WAY do I want it now!\" because who wants a purse that both their best friends have, right? And so-"
    },
    {
        "character": "Cartman",
        "line": "[Roma sets some plates of food on his table] All right, when she stops yappin' again, say \"Wow, I've never thought of it that way before, but you're right.\""
    },
    {
        "character": "Shawna",
        "line": "I guess that's why I figured, \"Who needs friends like THAT?\""
    },
    {
        "character": "Jimmy",
        "line": "Wow, I've never thought of it that way before, but you're right."
    },
    {
        "character": "Shawna",
        "line": "It's like I told Debbie: \"If you're gonna go out with my friends-\""
    },
    {
        "character": "Cartman",
        "line": "All right Jimmy, when she finally shuts her trap again, I want you to repeat whatever she said, and then follow it with \"Wow, how insightful.\""
    },
    {
        "character": "Shawna",
        "line": "\"And so if you're gonna be that way, I don't need to be your friend.\""
    },
    {
        "character": "Jimmy",
        "line": "\"If you're gonna be that way, I don't need to be your friend.\" Wow, how insightful."
    },
    {
        "character": "Shawna",
        "line": "You know, Jimmy, you are a great listener."
    },
    {
        "character": "Jimmy",
        "line": "Really?"
    },
    {
        "character": "Shawna",
        "line": "Yeah. I mean, no other boys really communicate like you do."
    },
    {
        "character": "Jimmy",
        "line": "Oh, I'm so glad you think so, Shawna, because I really wanna stick my penis in your vagina."
    },
    {
        "character": "Cartman",
        "line": "Yes, nice, Jimmy, very nice."
    },
    {
        "character": "Shawna",
        "line": "[stunned] ...What??? [crosses her arms and glares] I'm not doing that!"
    },
    {
        "character": "Jimmy",
        "line": "But the talent show is tomorrow night!"
    },
    {
        "character": "Shawna",
        "line": "Creep! [throws her glass of water at him and walks out. The water shorts out his headphones and Cartman takes his off from the feedback]"
    },
    {
        "character": "Cartman",
        "line": "Aaagh!"
    },
    {
        "character": "",
        "line": "South Park Elementary, next evening. The gym is set up for the talent show and the whole school is there. Well, most of the school..."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Welcome students and parents to the annual South Park Elementary Talent Show! [some applause] We have a lot of little talented performers to get through, so the quicker you shut up, the quicker this will be over! [everyone quiets down] Okay, first up we have Billy Turner, from the third grade, who will be doing an alto sax solo. [out comes Billy with his alto sax and he begins to play Frиre Jacques. His notes are tentative and wobbly]"
    },
    {
        "character": "",
        "line": "South Park Elementary, out on the front curb. Jimmy sits there sobbing. Officer Barbrady's police car rolls gently towards him and stops. The driver's door opens and Officer Barbrady comes into view."
    },
    {
        "character": "Officer Barbrady",
        "line": "Jimmy? Jimmy Valmer?"
    },
    {
        "character": "Jimmy",
        "line": "[looks up] Oh... Hi, Officer B b-b-buh b-b-buh b-Barbrady."
    },
    {
        "character": "Officer Barbrady",
        "line": "Jimmy, what are you doing here? The talent show is inside."
    },
    {
        "character": "Jimmy",
        "line": "I'm... not gonna perform in the talent show. [sobs again]"
    },
    {
        "character": "Officer Barbrady",
        "line": "Not perform? [sits down next to him] But Jimmy, you love talent shows. Everyone in town knows that."
    },
    {
        "character": "Jimmy",
        "line": "I just c-can't risk getting up in front of everyone."
    },
    {
        "character": "Officer Barbrady",
        "line": "Why?"
    },
    {
        "character": "Jimmy",
        "line": "All right! I I keep getting an erection for no reason! Okay! But I can't get any of the girls here to let me... do it to them."
    },
    {
        "character": "Officer Barbrady",
        "line": "Well of course not, Jimmy. Little girls don't wanna have sex."
    },
    {
        "character": "Jimmy",
        "line": "Then why does God make it so that my penis gets hard if girls don't wanna have it in their vaginas? It's like a cruel joke."
    },
    {
        "character": "Officer Barbrady",
        "line": "Well, Jimmy, the girls here are young and pure. They're not like the ladies down at Colfax Point."
    },
    {
        "character": "Jimmy",
        "line": "...Colfax Point?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Well yeah, those women will have sex with anybody."
    },
    {
        "character": "Jimmy",
        "line": "Really? M-maybe I can catch the bus ...and get down there before the talent show ends. Th-thanks, Officer Barbrady! [heads off to the nearest bus station]"
    },
    {
        "character": "Officer Barbrady",
        "line": "You're welcome, Jim. [happy at first, he begins to think over that last conversation] Wait..."
    },
    {
        "character": "",
        "line": "Colfax Point, in the red-light district of town, night. Cars roll by as obese prostitutes try to get customers. Shapely prostitutes try as well when the obese ones are denied. A black woman wearing knee-high boots walks down the street towards the camera. She has brilliant red hair, black vest and boots, and cheetah-print shorts"
    },
    {
        "character": "Voice-over",
        "line": "Colfax Point. Pimps and hos and tricks in rows. Women walk the street with corns on their feets. Broken dreams and no ice creams."
    },
    {
        "character": "",
        "line": "A car stops in front of a woman built like a brick mansion"
    },
    {
        "character": "Ho",
        "line": "You lookin' for a date?"
    },
    {
        "character": "Jimmy",
        "line": "[entering this hellhole] Hello? Hello? I need to put my ...p-penis in a woman's vagina. Any takers? [before him, a ho dressed as a Red Cross nurse is left behind by a customer] Excuse me, ma'am. What's your name?"
    },
    {
        "character": "Prostitute",
        "line": "They call me Nut Gobbler."
    },
    {
        "character": "Jimmy",
        "line": "Well, Nut Gobbler, I need to get laid."
    },
    {
        "character": "Nut Gobbler",
        "line": "Huh??"
    },
    {
        "character": "Jimmy",
        "line": "I have a raging hard-on that just won't quit, and the talent show has already started."
    },
    {
        "character": "Nut Gobbler",
        "line": "You a cop?"
    },
    {
        "character": "Jimmy",
        "line": "No. Actually, I'm a stand-up comic."
    },
    {
        "character": "Nut Gobbler",
        "line": "You got money?"
    },
    {
        "character": "Jimmy",
        "line": "Sure do."
    },
    {
        "character": "Nut Gobbler",
        "line": "All right, you got a place to go?"
    },
    {
        "character": "Jimmy",
        "line": "Sure. I know the p-perfect place."
    },
    {
        "character": "",
        "line": "Buca de Fagghecini, moments later. The waiter arrives."
    },
    {
        "character": "Roma",
        "line": "Welcome to Buca de Fagghecini for the authentic experienso Italiano. My name is Roma, and uhhh [recognizes Jimmy] Oh, it's nice to see you again, Mr. Valmer."
    },
    {
        "character": "Jimmy",
        "line": "[grabs Roma by the collar and talks to him in hushes tones] Hey, can it, jackass! I don't want her to know I was just here with a different girl."
    },
    {
        "character": "Roma",
        "line": "Oh right, pardone, segnore. I'll come back with some garlic bread mediterraneane. [walks off]"
    },
    {
        "character": "Nut Gobbler",
        "line": "What are we doin' anyway?"
    },
    {
        "character": "Jimmy",
        "line": "This is authentic Italian food straight from S-Sicily. You should try the Lotsa Mozzarella Pizza Roll."
    },
    {
        "character": "Nut Gobbler",
        "line": "I can't eat too much, I've got an infected urinary tract. I've been pissin' blood for a week."
    },
    {
        "character": "Jimmy",
        "line": "Oh, uh, wow, that is very interesting. Please tell me more."
    },
    {
        "character": "Nut Gobbler",
        "line": "Huh? [takes out a lighter and cigarette and lights the cigarette] Well, that's it, I just piss blood! So I have to stick a tampon up my peehole."
    },
    {
        "character": "Jimmy",
        "line": "Wow. You know, I've never thought of it that way before, but you're right. If you're pissing blood, you can shove a tampon up your peehole. You are very insightful. Please tell me more."
    },
    {
        "character": "Nut Gobbler",
        "line": "Look, kid, what are you doin'?! You wanna get laid or not?"
    },
    {
        "character": "Jimmy",
        "line": "Well of course I wanna get laid. That's why I'm taking you to this ...fancy place and pretending to be interested in what you have to say."
    },
    {
        "character": "Nut Gobbler",
        "line": "Kid, I'm a hooker. You don't have to take me to dinner OR be nice to me."
    },
    {
        "character": "Jimmy",
        "line": "What? Fo-for real?"
    },
    {
        "character": "Nut Gobbler",
        "line": "You paid me, so you get to do me. It's that simple."
    },
    {
        "character": "Jimmy",
        "line": "Well jumpin' Jesus, what are we wasting our time here for then? The talent show is happening right now! Let's get to r-r-rammin'! [A black man angrily approaches the table]"
    },
    {
        "character": "Pimp",
        "line": "What are you doin', ho?! Havin' dinner?! You're supposed to be workin' for me!"
    },
    {
        "character": "Nut Gobbler",
        "line": "It's where the trick wanted to go, you bastard!"
    },
    {
        "character": "Pimp",
        "line": "Trick?! I ain't stupid! Ain't no trick gonna take you out to dinner! [Roma arrives with some food, but quickly leaves when he sees what's happening] This PIMP is tryin' to steal you away from me! [to Jimmy] This is MY ho!"
    },
    {
        "character": "Jimmy",
        "line": "I beg to differ with you, sir. I paid for her and took her out to dinner. She's my ho!"
    },
    {
        "character": "Nut Gobbler",
        "line": "Uh Jesus."
    },
    {
        "character": "Pimp",
        "line": "You got a problem, bitch?!"
    },
    {
        "character": "Jimmy",
        "line": "Yes, I do have a problem, as a matter of fact! I've spent all my money on this ho, and she's now my only shot at getting laid, and the talent show is only a couple of hours from being over."
    },
    {
        "character": "Pimp",
        "line": "[to Nut Gobbler] You're comin' home right now! [grabs her by the hair hard]"
    },
    {
        "character": "Nut Gobbler",
        "line": "Agh! Let go of my hair, you son of a bitch!"
    },
    {
        "character": "Jimmy",
        "line": "Sir, sir, that is my ho!"
    },
    {
        "character": "Pimp",
        "line": "I'm gonna kick your ass, ho! [hauls her off]"
    },
    {
        "character": "Jimmy",
        "line": "[watching the pimp pull Nut Gobbler away] Sir, sir!"
    },
    {
        "character": "",
        "line": "South Park Elementary Talent Show, now in progress. A student sings Journey's \"Open Arms\" badly."
    },
    {
        "character": "Blonde Haired Girl",
        "line": "Lying beside you, here in the dark. Feeling your heartbeat with mine..."
    },
    {
        "character": "Stan",
        "line": "[bored, exchanges looks with Kyle] Woof."
    },
    {
        "character": "",
        "line": "Buca de Fagghecini, outside. The pimp drives off with Nut Gobbler, and Jimmy just steps out the front doors"
    },
    {
        "character": "Jimmy",
        "line": "Son of a ...b-bitch! [a taxicab rolls by, and Jimmy hails it] Taxi! [the cab stops, and Jimmy gets in] Follow that pimp and ho! [the driver does as told and peels away]"
    },
    {
        "character": "",
        "line": "The pimp's car."
    },
    {
        "character": "Nut Gobbler",
        "line": "Where are you taking me?!"
    },
    {
        "character": "Pimp",
        "line": "I'm gonna kill you, ho!"
    },
    {
        "character": "Nut Gobbler",
        "line": "No! Please! Q Money! I'm sorry!"
    },
    {
        "character": "Q Money",
        "line": "You're already dead, ho! [outside the driver's window, the cab has pulled up alongside. Jimmy rolls down his window]"
    },
    {
        "character": "Jimmy",
        "line": "Sir! I paid for that lady, and by taking her, you are no better than a common th-thief!"
    },
    {
        "character": "Q Money",
        "line": "Fuck you, punk! [turns his steering wheel left so his car rams the cab. The cab spins away, but recovers and comes up along the passenger side this time.]"
    },
    {
        "character": "Jimmy",
        "line": "Nut Gobbler, grab onto my crutch! [sticks it out for her to grab. She fails at grabbing it a few times, but finally succeeds. She begins to climb out of Q Money's car and has one leg out of the car]"
    },
    {
        "character": "Q Money",
        "line": "[grabs onto Nut Gobbler's other leg] Get your ass back in here, ho!"
    },
    {
        "character": "Nut Gobbler",
        "line": "Aaaah! [she's basically doing the splits between the cars]"
    },
    {
        "character": "Jimmy",
        "line": "I got you, Nut Gobbler! [the two cars race down the streets with Nut Gobbler spread out between them like a Thanksgiving turkey]"
    },
    {
        "character": "",
        "line": "South Park Elementary Talent Show, now in progress. The Goth kids are now onstage. The Red Goth and Henrietta are on guitars, and the Kindergoth is on drums. The Tall Goth sings."
    },
    {
        "character": "Tall Goth",
        "line": "No no nono no, I'm not gonna be in the talent show. Oh no nono no. I'll never be in your faggy talent show. [the song ends and they walk offstage. Some applause for them comes up from the audience]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Okay, that was the Goth kids with \"Talent Shows Are For Fags\""
    },
    {
        "character": "Tall Goth",
        "line": "That was killer. We showed them."
    },
    {
        "character": "Red Goth",
        "line": "Yeah, I hope we win."
    },
    {
        "character": "",
        "line": "The streets of South Park, night. The two cars are still racing down the streets with Nut Gobbler splits between them. She's screaming from the pain"
    },
    {
        "character": "Jimmy",
        "line": "Come on, ho! [the cars bump each other and pull apart, each male, Jimmy and Q Money, wanting Nut Gobbler with him. A motorcycle driver is coming towards them]"
    },
    {
        "character": "Cabbie",
        "line": "Look out!"
    },
    {
        "character": "Motorcyclist",
        "line": "Daww?"
    },
    {
        "character": "Nut Gobbler",
        "line": "Aah?? [the motorcyclist smacks into Nut Gobbler's groin and gets stuck there as his motorcycle continues without him and falls away] NO! [the motorcyclist is screaming, but his screams are muffled. Q Money takes out his gun and takes a few shots at Jimmy. One shot gets him in the right shoulder and he has to let go of Nut Gobbler. Both she and the motorcyclist fall into Q Money's car] '"
    },
    {
        "character": "Jimmy",
        "line": "Eugh! Stay on him! I'm not giving up! [the chase continues]"
    },
    {
        "character": "",
        "line": "South Park Elementary Talent Show, now in progress. A magic act ends as the assistant steps out of a box."
    },
    {
        "character": "Kid Magician",
        "line": "Tada! [some applause comes up from the audience.]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Okay, very nice, Clark and Laura. Very nice. [they carry off the box Laura was in] Our next act is Butters, who will be singing a song"
    },
    {
        "character": "Stephen",
        "line": "[takes a picture] There's our boy. [Linda claps with the audience. The piano begins]"
    },
    {
        "character": "Butters",
        "line": "Lu lu lu, I've got some... [pauses as he forgets the words] Some... uh, some uh... some, uh... Uuuhhh... Oh no! [a puddle of urine forms under him] No no noho noo! [runs off the stage]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Okay, thank you Butters, very nice, short and sweet. [whips out a towel and wipes the stage clean of urine]"
    },
    {
        "character": "",
        "line": "The streets of South Park, night. The two cars are now bumping each other off."
    },
    {
        "character": "Q Money",
        "line": "Goddamn, this pimp just won't give up!"
    },
    {
        "character": "Jimmy",
        "line": "[to the cabbie] Get close to him! [the cabbie does so, and Jimmy jumps onto the roof of Q Money's car. Q Money does what he can to shake Jimmy off, but Jimmy stays on. When Q Money draws close to the cab, Jimmy looks at the cabbie] How much do I owe you?"
    },
    {
        "character": "Cabbie",
        "line": "[checks the meter] Six dollars and twenty-four cents."
    },
    {
        "character": "Jimmy",
        "line": "[reaches into his pockets and pulls out a ten dollar bill] C-can I just get two back, please?"
    },
    {
        "character": "Cabbie",
        "line": "Oh, thank you very much. [smiles and gives Jimmy the two dollars] There you go. Have a good 'n."
    },
    {
        "character": "Jimmy",
        "line": "Thank you. [the cabbie leaves the scene, his job complete. Q Money continues flying down the street and into Colfax Point. The other prostitutes watch in shock. Q Money slams the car into a light pole and Jimmy is catapulted through the air and lands in a trash heap. Q Money takes Nut Gobbler out of the car and pulls her away by the hair again]"
    },
    {
        "character": "Q Money",
        "line": "You're gonna pay for this, bitch!"
    },
    {
        "character": "Nut Gobbler",
        "line": "No! Heelllp!! [The motorcyclist looks up dazed from the back seat of the crashed car. Jimmy makes his way out of the trash heap. Q Money drags Nut Gobbler up the stairs of a nearby building] Haaaaaaaaaa!!"
    },
    {
        "character": "Jimmy",
        "line": "[in hot pursuit now] Don't worry, Nut Gobbler! I'm coming! [his penis gets hard again and he freezes] Oh Jesus, not now. [he gathers his legs tight so the erection doesn't show as much] Oh boy, this is embarrassing. [he walks off gingerly]"
    },
    {
        "character": "",
        "line": "South Park Elementary Talent Show, still in progress."
    },
    {
        "character": "Mrs. Garrison",
        "line": "And now we have Eric Cartman, who will be doing select readings from the movie, Scarface. [leaves as the curtains open]"
    },
    {
        "character": "Cartman",
        "line": "[starts off with his back to the audience, then turns around] D'you know what you are? You're all a bunch of fucking cock roaches! You need people like me! You need people like me so you can point your fucking finger and say \"That's the bad guy!\" Well say goodnight to the bad guy!!"
    },
    {
        "character": "Liane",
        "line": "That's my little boy. [smiles. Gerald and Sheila are stunned]"
    },
    {
        "character": "",
        "line": "Colfax Point, night. On the rooftop of the building, Q Money has Nut Gobbler on her knees and is ready to shoot her dead."
    },
    {
        "character": "Nut Gobbler",
        "line": "Please, Q Money! Don't do this!"
    },
    {
        "character": "Q Money",
        "line": "I told you never to turn on me, ho!"
    },
    {
        "character": "Jimmy",
        "line": "[catches up with the pair] Hey, j-j-jackass! [he and Q Money face each other] I'm sorry I resorted to calling you jackass just now, but I'm very upset!"
    },
    {
        "character": "Q Money",
        "line": "And what are you gonna do, huh?! I've got four feet on you AND a gun! What do you have?!"
    },
    {
        "character": "Jimmy",
        "line": "What do I have? The weapon of comedy. So apparently the Chinese and the Japanese aren't getting along lately. Have you seen this? Have you heard about this?"
    },
    {
        "character": "Q Money",
        "line": "What?!"
    },
    {
        "character": "Jimmy",
        "line": "I'll tell you one thing: their food hasn't been getting along with my stomach for years."
    },
    {
        "character": "Q Money",
        "line": "[laughs] That's pretty good."
    },
    {
        "character": "Jimmy",
        "line": "Martha Stewart is out of jail. Have you seen this? Have you heard about this?"
    },
    {
        "character": "Q Money",
        "line": "[laughs] Oh yeah. That's right, she is. [behind him, Nut Gobbler grabs a pipe and approaches him silently]"
    },
    {
        "character": "Jimmy",
        "line": "She's apparently gotten real good with baking cakes with keys in them. [Q Money laughs heartily as Nut Gobbler reaches him. She knocks him out with one blow to the back of the head.]"
    },
    {
        "character": "Nut Gobbler",
        "line": "Serves you right, you son of a bitch!"
    },
    {
        "character": "Jimmy",
        "line": "Nice teamwork, Nut Gobbler."
    },
    {
        "character": "Nut Gobbler",
        "line": "I can't believe you chased me all this way. You, you really care about me."
    },
    {
        "character": "Jimmy",
        "line": "Not really. You're just a hooker, and I need to get laid. The talent show could be over any minute."
    },
    {
        "character": "Nut Gobbler",
        "line": "That's good enough for me. [takes off her coat and poses enticingly] Take me to bed. [Jimmy approaches her, reaches out, and she falls back and lands with a thud on his arms and crutches. He then hoists her up and carries her down the stairs to the bottom floor of the building. He carries her out the door, through the group of hookers gathered to marvel at the sight, and towards a Ho-Tel. One admiring prostitute wipes away a tear. Jimmy carries Nut Gobbler through the door and onto a bed nearby. The door closes and the light goes out. All the other hookers keep applauding]"
    },
    {
        "character": "",
        "line": "South Park Elementary Talent Show, still in progress. Ike is onstage singing \"Yankee Doodle Boy\"."
    },
    {
        "character": "Ike",
        "line": "I have a Yankee Doodle sweetheart,She's my Yankee Doodle girl.[holds up some sparklers]'Ankee Doodle came to London,Just to ride the ponies,[throws them off and gets inside a small cannon next to him. The barrel rises until it's in launch position]I am da Yankee DoodleI am da Yankee DoodleI am da Yankee Doodle boy.[The cannon shoots him out and he lands clear across the stage. Some applause greets the performance. As the props are taken away, Ike takes off his hat and bows low to everyone, then puts on his top hat and walks off]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Okay, very nice, Ike, thank you. All right, children, it looks like we have no more contestants, which means, the Talent Show is over! [the children cheer and Principal Victoria nudges a sleeping Mr. Mackey]"
    },
    {
        "character": "Principal Victoria",
        "line": "Mr. Mackey, it's over."
    },
    {
        "character": "Mr. Mackey",
        "line": "Huh? [takes off his glasses and rubs his eyes] Oh oh oh, right."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Now we will tally up the judges' scores and find out which act they hated the least."
    },
    {
        "character": "Jimmy",
        "line": "Hold everything! [Mrs. Garrison looks up. Jimmy has entered the gym and walks towards the stage. The audience watches him head up the steps] Mrs. Garrison, if you don't mind, I'll be taking that microphone.."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Okay, let's put our hands together for Jimmy Valmer. [some applause heads his way]"
    },
    {
        "character": "Jimmy",
        "line": "Wow, what a terrific audience. So apparently it's been exactly two years since the fall of Baghdad. Have you seen this? Have you heard about this? Just as B-Bush predicted, Baghdad fell, Iraq fell, Saddam fell. The only thing that didn't fall was ...the price of gas. [everyone laughs] I just read in the paper that China's protesting Japan. Have you seen this? Have you heard about this? Yeah, I guess in China you don't get to- [his penis gets hard again and he's surprised] You've gotta be kidding me."
    }
]