[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Jefferson Lake Recreational Area, daytime. Stan and Cartman are in a very nice boat, playing around. Cartman stands up and shoots at imaginary opponents."
    },
    {
        "character": "Stan",
        "line": "Dude, you are right, Cartman. Your uncle Roy has a sweet boat."
    },
    {
        "character": "Cartman",
        "line": "Yeah. Isn't this fun? Just you and me hangin' out, Stan. No stupid Kyle around."
    },
    {
        "character": "Stan",
        "line": "Man, I wish I could really drive this thing."
    },
    {
        "character": "Cartman",
        "line": "You know how?"
    },
    {
        "character": "Stan",
        "line": "Sure I do!"
    },
    {
        "character": "Cartman",
        "line": "Well here. [reaches down to grab something] Roy keeps the keys in the glove box."
    },
    {
        "character": "Stan",
        "line": "Dude, I don't think your uncle'd want us driving it."
    },
    {
        "character": "Cartman",
        "line": "Nobody's gonna know. We just drive it around the marina real quick. Look, if anything happens, I'll take full responsibility."
    },
    {
        "character": "Stan",
        "line": "[reaches over and grabs the keys.] Okay, turn on the ignition,"
    },
    {
        "character": "Cartman",
        "line": "[puts on sunglasses as the engine purrs to life] Awesome."
    },
    {
        "character": "Stan",
        "line": "Okay... [pulls on a handle]"
    },
    {
        "character": "Cartman",
        "line": "We're not moving."
    },
    {
        "character": "Stan",
        "line": "[pulls harder. The motor creates a froth of water behind the boat, which is still in place]"
    },
    {
        "character": "Cartman",
        "line": "Maybe you have the parking brake on."
    },
    {
        "character": "Stan",
        "line": "Boats don't have parking brakes, dumbass! They only have the... oh wait wait. Neutral button! [presses that and the boat lunges out of its landing, spinning around a few times as it jumps another dock nearby. The boat goes forward in a haphazard manner. Both boys scream]"
    },
    {
        "character": "Cartman",
        "line": "Other way! Other way!"
    },
    {
        "character": "Stan",
        "line": "[pushes the handle forward again, but it breaks in his hand. He can no longer control the boat, so he and Cartman scream again, then] Jesus Christ!!!"
    },
    {
        "character": "Cartman",
        "line": "Stan... beaver dam! [the boat approaches the dam quuickly] Very large beaver dam, Stan!! [the boat runs aground on the dam and the boys quickly jump out. The boat begins to smoke as the boys swim to the nearest shore. Stan, being lighter and faster, reaches shore first, then turns to wait for Cartman. The boat blows up and Stan shields his eyes. Cartman reaches the shore and walks up to Stan]"
    },
    {
        "character": "Stan",
        "line": "Oh dude! Oh Jesus!"
    },
    {
        "character": "Cartman",
        "line": "[turns around and sees] Dude! Stan! You are in serious trouble!"
    },
    {
        "character": "Stan",
        "line": "You said you'd take responsibility to your uncle Roy!"
    },
    {
        "character": "Cartman",
        "line": "I don't even have an uncle Roy! That was just some guy's boat I knew about."
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "Look, it's okay. We weren't here. This didn't happen, okay. We were both at my house all afternoon long playing Tea Party. Okay? Now come on, we gotta bail! [hustles up the beach]"
    },
    {
        "character": "Stan",
        "line": "Oh God, I hope I didn't hurt any beavers."
    },
    {
        "character": "Cartman",
        "line": "[turns to look at Stan] Dude, come on! We've gotta get out of here! [Cartman turns back and continues up the beach. Stan turns and follows Cartman up]"
    },
    {
        "character": "",
        "line": "Splashy graphics appear as a program begins."
    },
    {
        "character": "Announcer",
        "line": "With an eye on America and all of today's events, it's South Park Evening News, with Tom Pusslicker"
    },
    {
        "character": "Tom",
        "line": "Herro, crisis and fear tonight, as what appears to be a massive flood has overtaken the town of Beaverton, Colorado, home of the world's largest beaver dam. [the Marshes are shown eating off small folding tables with dinners on them and looking at the TV] Earlier today, a break in the beaver dam which protected the town broke open, trapping people in their houses and destroying their lives. [a helicopter camera catches the flooding]"
    },
    {
        "character": "Sharon",
        "line": "Oh my gosh, those poor people."
    },
    {
        "character": "Field reporter",
        "line": "Tom, I'm currently ten miles outside of Beaverton, unable to get inside the town proper. We do not have any reports of fatalities yet, but we believe that the death toll may be in the hundreds of millions. Beaverton has only a population of about eight thousand, Tom, so this would be quite devastating."
    },
    {
        "character": "Tom",
        "line": "Any word on how the survivors in the town are doing, Mitch? [Stan has stopped eating. Sharon and Shelly continue.]"
    },
    {
        "character": "Mitch",
        "line": "W-we're not sure what exactly is going on inside the town of Beaverton, uh Tom, but we're reporting that there's looting, raping, and yes, even acts of cannibalism."
    },
    {
        "character": "Tom",
        "line": "My God, you've, you've actually seen people looting, raping and eating each other?"
    },
    {
        "character": "Mitch",
        "line": "No, no, we haven't actually seen it Tom, we're just reporting it."
    },
    {
        "character": "",
        "line": "The Marsh living room"
    },
    {
        "character": "Sharon",
        "line": "[rises and begins to pick up the spent trays] You all done with your fishsticks, Stan?"
    },
    {
        "character": "Randy",
        "line": "[rises and takes his own tray up] I'll help you, Sharon. [looks at the screen] Boy, that's just awful."
    },
    {
        "character": "Tom",
        "line": "In the nearby town of South Park, the cause of the Beaverton flood is being investigated."
    },
    {
        "character": "Man 1",
        "line": "That's right! We know whose fault this is!"
    },
    {
        "character": "Stan",
        "line": "Huh oh. [puts his hands to his cheeks. Shelly gives him a funny look]"
    },
    {
        "character": "Man 1",
        "line": "It's George Bush's fault!"
    },
    {
        "character": "Man 2",
        "line": "Yeah! George Bush doesn't care about beavers!"
    },
    {
        "character": "Chet",
        "line": "George Bush didn't break that beaver dam! It was terrorists and Al Qaeda!"
    },
    {
        "character": "Man 3",
        "line": "They've been secretly building beaver dam WMDs for years now! [a few other voices rise up to mention WMDs]"
    },
    {
        "character": "",
        "line": "The Marsh kitchen, later on. Randy is washing dishes, Sharon is drying them off. Stan appears at the kitchen entrance."
    },
    {
        "character": "Stan",
        "line": "Mom, Dad? [hesitating] The, they're gonna go help those people, right?"
    },
    {
        "character": "Sharon",
        "line": "I don't know. You know, to me, it seems like the mayor of Beaverton should've done something about that dam years ago."
    },
    {
        "character": "Randy",
        "line": "Don't blame the mayor, Sharon. What about FEMA? Think this whole thing is really their fault."
    },
    {
        "character": "Stan",
        "line": "Ye-but, uh, s-somebody's gonna help the people off their, their rooftops, right?"
    },
    {
        "character": "Randy",
        "line": "That's not important right now, son. What's important is figuring out whose fault this is. [nothing more is exchanged between Stan and his parents]"
    },
    {
        "character": "",
        "line": "South Park Elementary School, next day. The kids gather to enter the school."
    },
    {
        "character": "",
        "line": "The school hall. Cartman is putting a blue folder away in his locker. Stan approaches."
    },
    {
        "character": "Stan",
        "line": "Dude! Dude, did you see the news last night?"
    },
    {
        "character": "Cartman",
        "line": "Yeah."
    },
    {
        "character": "Stan",
        "line": "You saw all those people trapped on their roofs?"
    },
    {
        "character": "Cartman",
        "line": "Shyeah, that was pretty funny."
    },
    {
        "character": "Stan",
        "line": "Pretty funny?! Dude, we did that!! That was our fault!"
    },
    {
        "character": "Cartman",
        "line": "Hehey, no! We aren't the ones who built a town beneath a giant beaver dam, okay?! That's their fault!"
    },
    {
        "character": "Stan",
        "line": "But they're trapped now and nobody's helping them!"
    },
    {
        "character": "Cartman",
        "line": "Well they should've gotten out of there!"
    },
    {
        "character": "Stan",
        "line": "Maybe they couldn't get out!"
    },
    {
        "character": "Cartman",
        "line": "We did!"
    },
    {
        "character": "Stan",
        "line": "Dude, ah I just... [walks around in a fog of worry] ah I don't know what to do here."
    },
    {
        "character": "Cartman",
        "line": "Ah ah ah, ah, I know what you're thinking, Stan. You're thinking, you're gonna go tell Kyle. Look, I know you think he's your best friend, but Kyle is a Jew rat! He has his Jew ethics while he hoards his greedy Jew gold, and he will Jew you out if you tell him about this!"
    },
    {
        "character": "Kyle",
        "line": "[walks up behind Stan] Hey dudes. [Stan stands to one side so he can see Kyle clearly]"
    },
    {
        "character": "Cartman",
        "line": "Oh hey, Kyle."
    },
    {
        "character": "Kyle",
        "line": "Sorry I couldn't make it yesterday. What'd you guys do?"
    },
    {
        "character": "Stan",
        "line": "[looks at Cartman, then] Nothing."
    },
    {
        "character": "Cartman",
        "line": "[smiling proudly] Hngh, totally."
    },
    {
        "character": "Butters",
        "line": "[appearing] Hey, everybody, they just found out what caused the flood in Beaverton! [the other kids present in the hall follow Butters away. Kyle goes as well.]"
    },
    {
        "character": "Cartman",
        "line": "[throws down his cap] Aw crap!"
    },
    {
        "character": "",
        "line": "The school cafeteria. Mr. Mackey stands next to a TV, and Principal Victoria goes up to join him. The kids are chatty."
    },
    {
        "character": "Mr. Mackey",
        "line": "Quiet, children, quiet! We need to hear."
    },
    {
        "character": "Tom",
        "line": "At first, nobody knew what caused the dam to break, but now, shocking new evidence has indicated that the flood in Beaverton was caused by... global warming! [everyone gasps. A new graphic appears onscreen - a globe] It now appears that... all rumors of global warming were true. We were warned this would happen and ...we didn't listen! [buries his face in his hands in anguish] We didn't listen! [composes himself] All the top Colorado geologists have gathered at the governor's office for an emergency meeting."
    },
    {
        "character": "",
        "line": "The Governor's office, day. Randy addresses his peers in a meeting room."
    },
    {
        "character": "Randy",
        "line": "Ladies and Gentlemen, if Global Warming has in fact already caused the Beaverton flood, then this is only the beginning. The effects are going to spread. What we are looking at is a global warming catastrophe the likes of which we've never seen. [excited voices fill the room]"
    },
    {
        "character": "Geologist 1",
        "line": "Excuse me, sir, but, ...when? When is this going to happen?"
    },
    {
        "character": "Randy",
        "line": "My colleagues in the scientific community are still running tests, but... we believe it may happen... the day after tomorrow. [excited voices fill the room again: \"Peas and carrots! Peas and carrots! Peas and carrots!\"]"
    },
    {
        "character": "Geologist 2",
        "line": "[an elderly gent] Excuse me, I'm sure we're all very impressed with your wild theories, Doctor uh, Marsh, but the fact is no statistical proof has ever been confirmed that global warming exists. Are you suggesting we shut down the economy?!"
    },
    {
        "character": "Randy",
        "line": "With all due respect, cliché dissenting Republican, the economy isn't going to matter... the day after tomorrow. [excited voices fill the room again: \"Peas and carrots! Peas and carrots! Peas and carrots!\" The double doors open]"
    },
    {
        "character": "Scientist 1",
        "line": "Listen! Listen! We've finished running the tests!"
    },
    {
        "character": "Scientist 2",
        "line": "Global Warming is going to strike... two days before the day after tomorrow."
    },
    {
        "character": "Randy",
        "line": "[alarmed] Oh my God... That's today! [a few seconds of silence, then all the geologists begin to panic. Papers fly around the room as most of the geologists run outside.]"
    },
    {
        "character": "",
        "line": "Grocery Mart. The shoppers there begin to panic. News does spread fast."
    },
    {
        "character": "",
        "line": "The town. Everyone panics. Some shoppers run through town with shopping carts of food."
    },
    {
        "character": "",
        "line": "The school. Everyone clear out."
    },
    {
        "character": "Man 5",
        "line": "[runs by in front of the school] We didn't listen!"
    },
    {
        "character": "Randy",
        "line": "[pulls up in the family car, with everybody else already inside] Stan! Get in the car! We have to evacuate!"
    },
    {
        "character": "Man 6",
        "line": "[runs by in front of the camera] We didn't listen! [Wendy and her father run by, Anne and her mother run by.]"
    },
    {
        "character": "",
        "line": "A highway, bumper to bumper traffic on the way out. A lot of drivers beep their horns hoping other drivers in front of them start moving."
    },
    {
        "character": "Randy",
        "line": "[beeping his own horn] Come onnn, come on!"
    },
    {
        "character": "Sharon",
        "line": "It's useless. This traffic isn't moving!"
    },
    {
        "character": "Stan",
        "line": "Dad, isn't it possible the flood wasn't caused by global warming? I, I mean, the water was held back by a giant beaver dam, after all."
    },
    {
        "character": "Randy",
        "line": "No, Stan, I'm afraid us adults just let you children down. We didn't take care of our earth, and now you've inherited our problems."
    },
    {
        "character": "Driver",
        "line": "We didn't listen!"
    },
    {
        "character": "Randy",
        "line": "[hears this and rolls down his window] We, we didn't listen! [rolls up his window] Come on! Everyone grab what you can! We have to walk! [the Marshes get out the car, carrying what they can, and leave the highway. In town the looting continues. An elderly man carrying a TV comes into view...]"
    },
    {
        "character": "Man 7",
        "line": "[drops the TV and points] Oh Jesus, here it comes!"
    },
    {
        "character": "Man 8",
        "line": "Global warming! [everyone runs away from whatever the man was pointing to, and soon the street is empty.]"
    },
    {
        "character": "Man 9",
        "line": "[in the middle of the crowd] It's coming! Here comes global warming!"
    },
    {
        "character": "Man 10",
        "line": "We didn't listen! [a camera in the sky begins to act the part of Global Warming as it focuses on a man and zooms in on him. The man turns and freezes in his tracks. The POV changes to a camera on the sidewalk watching the man's reactions. The man turns over a few times and stops moving, but no other camera is seen]"
    },
    {
        "character": "Randy",
        "line": "[moving along with his family] Come on, hurry! [the panicking crowd overtakes them]"
    },
    {
        "character": "Man 11",
        "line": "It's right behind us! [the Marshes stop to let the crowd through, then start moving again. The crowd returns and passes them again in the opposite direction] It's coming the other way! [the Marshes stop, then run back the way they came]"
    },
    {
        "character": "Randy",
        "line": "Go back, go back!!"
    },
    {
        "character": "",
        "line": "The Park County Community Center, day. Stephen Stotch stands at the entrance urging people inside."
    },
    {
        "character": "Stephen",
        "line": "Everyone into the community center! Hurry! Go!"
    },
    {
        "character": "Randy",
        "line": "[arrives to lend a hand] Get inside! We have to close these doors! [everyone for miles around comes and fills up the center. Again, the Global Warming camera focuses on the entrance and floats its way towards it. The last two people around, Stephen and Randy, close the doors just before the camera gets there.]"
    },
    {
        "character": "",
        "line": "The Park County Community Center, inside. Randy has taken command of global warming preparations."
    },
    {
        "character": "Randy",
        "line": "Come on, we've got to board up that last window! Seal off all the doorways! We must try to protect ourselves from the global warming."
    },
    {
        "character": "Sheila",
        "line": "Mr. Garrison, are you all right?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "I'm in pretty bad shape. My... leg is broken and my... left boob is leaking"
    },
    {
        "character": "Sharon",
        "line": "[arrives with a blanket to wrap around Stan, who has a cot to sleep in, and is seated on it] Here you go, sweetheart."
    },
    {
        "character": "Stan",
        "line": "Mom, you know, those people in Beaverton are still trapped in the flood."
    },
    {
        "character": "Sharon",
        "line": "I know, but, I'm afraid it's too late for them, sweetie. We have to try and save ourselves now."
    },
    {
        "character": "Gerald",
        "line": "Shh, shh! We've got the television working! [one of two TVs in front of the crowd comes to life]"
    },
    {
        "character": "Announcer",
        "line": "This is a FOX News update! Global Warming Disaster!"
    },
    {
        "character": "Anchor",
        "line": "Global warming appears to have struck as predicted in the Colorado Rockies! All around the country, panic and chaos are settling in!"
    },
    {
        "character": "Field reporter",
        "line": "Tom, I am standing just outside of Chicago, where the panic of global warming has already caused countless deaths. Already we're reporting that the death toll here in Chicago is over 600 billion people"
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh God."
    },
    {
        "character": "Stephen",
        "line": "[turns around in anger] This is all your fault, Jimbo!"
    },
    {
        "character": "Jimbo",
        "line": "Me??"
    },
    {
        "character": "Stephen",
        "line": "Yeah! You drive that damn SUV around! You didn't even think about global warming, DIDJA?!"
    },
    {
        "character": "Kyle",
        "line": "[with a cup of water, approaches Stan] Can you believe it, Stan? I never thought global warming could happen so fast. I guess... I didn't listen."
    },
    {
        "character": "Stan",
        "line": "Kyle, it... it isn't global warming."
    },
    {
        "character": "Kyle",
        "line": "Huh?"
    },
    {
        "character": "Stan",
        "line": "[hops off his cot] Global warming isn't happening right now. It's, it's not what caused the Beaverton flood."
    },
    {
        "character": "Kyle",
        "line": "How do you know that?"
    },
    {
        "character": "Stan",
        "line": "Because, I know what did cause the flood."
    },
    {
        "character": "Kyle",
        "line": "George Bush?"
    },
    {
        "character": "Stan",
        "line": "No."
    },
    {
        "character": "Kyle",
        "line": "Terrorists?"
    },
    {
        "character": "Stan",
        "line": "No."
    },
    {
        "character": "Kyle",
        "line": "Communists?"
    },
    {
        "character": "Stan",
        "line": "No."
    },
    {
        "character": "Kyle",
        "line": "Chinese radicals?"
    },
    {
        "character": "Stan",
        "line": "No."
    },
    {
        "character": "Kyle",
        "line": "...Cartman?"
    },
    {
        "character": "Stan",
        "line": "...sort of."
    },
    {
        "character": "Kyle",
        "line": "[throws down his cup] Cartman flooded Beaverton?!!"
    },
    {
        "character": "Stan",
        "line": "[pulls him aside to a more private area] Shh! Not, not exactly. We were messing around in this guy's new boat, and Cartman egged me on, and, and I crashed it into the Beaverton dam."
    },
    {
        "character": "Kyle",
        "line": "[thinks a bit] Dude, you have to tell everyone. Right now."
    },
    {
        "character": "Cartman",
        "line": "[arrives] Hey Stan. [studies Stan and Kyle's faces] Oh Goddammit you told Kyle, didn't you?!"
    },
    {
        "character": "Kyle",
        "line": "Stan, people in Beaverton are still trapped on their roofs. Nobody's helping them because they think they can't go outside."
    },
    {
        "character": "Cartman",
        "line": "Oh, here we go. See? I told you! If you're so caring, Kyle, why don't you share some of your Jew gold with the people caught in the flood?!"
    },
    {
        "character": "Stan",
        "line": "Look, maybe, maybe we can help those people in Beaverton ourselves."
    },
    {
        "character": "Kyle",
        "line": "How?"
    },
    {
        "character": "Cartman",
        "line": "Why?"
    },
    {
        "character": "Stan",
        "line": "We can sneak out of here, get a boat, and go help them off their roofs. That way, I can do the right thing, but still lie about it."
    },
    {
        "character": "Randy",
        "line": "[addressing the crowd] Listen, listen everyone! Nobody can leave this building!"
    },
    {
        "character": "Mrs. Garrison",
        "line": "But... we need supplies, food, silicone."
    },
    {
        "character": "Randy",
        "line": "You go outside, and you'll die! By now, the global warming has... shifted the climate, [steps up to a laptop and presses a key. A rotating graph appears, with the graph line dipping low] bringing on a new ice age. Within the hour, the temperature outside will fall to over 70 million degrees below zero!"
    },
    {
        "character": "Stephen",
        "line": "Jesus."
    },
    {
        "character": "Randy",
        "line": "All we can do... is try to wait it out, as long as we can."
    },
    {
        "character": "Gerald",
        "line": "And... the rest of the country?"
    },
    {
        "character": "Randy",
        "line": "[sighs as he moves from the laptop to the blackboard and pulls out a marker] Everyone below this line [draws a line from the border of Colorado and New Mexico to West Virginia] will have to be evacuated to the south. Everyone above this line [draws a line from the border of Colorado and Montana to Lake Erie] is already dead. People like us in the middle states have to ride it out. [draws two lines connecting the two longer lines, around Indiana] The balmy southwestern states [draws an open circle around Arizona, most of New Mexico, California and Nevada] might have a chance but, New York [draws a short line around it] will have tidal waves that envelop all of the northeast. [the crowd looks at it for a long time, then a man puts his hand to his mouth and starts chuckling] What, Frank?! [Frank points at the inadvertent phallus Randy drew on the map. Randy looks and realizes what he did] Aw awww, Goddammit! [goes to scribble all over the map so the dong isn't so noticeable.]"
    },
    {
        "character": "",
        "line": "Beaverton, day. The flooded town is shown, and in the background, the shattered dam and empty lake."
    },
    {
        "character": "Resident 1",
        "line": "Hello? Anybody? We'd like to be rescued, please. Any day now."
    },
    {
        "character": "Resident 2",
        "line": "Why haven't they come for us?"
    },
    {
        "character": "Resident 1",
        "line": "I... I don't know."
    },
    {
        "character": "Resident 3",
        "line": "Wait, look! Here comes a boat!"
    },
    {
        "character": "Resident 2",
        "line": "Really? Oh! It's about time!"
    },
    {
        "character": "Wife",
        "line": "Oh Kevin, we're saved! [buries her face in his shoulder]"
    },
    {
        "character": "Resident 3",
        "line": "It looks like... three little boys."
    },
    {
        "character": "Resident 1",
        "line": "Hey, we'll take it! [they all start waving their arms] Over here, yes! Thank you! Thank you! [the boys appear, going backwards and screaming. They head for Beaverton Oil, a refinery nearby, and crash into it. The boys fall out of the boat and into the water, then pop up right away. Oil begins to pour out of pipes the boat broke upon crashing, and fire follows the oil. The oil slick rushes past the flooded homes, with fire riding it, and a wall of flames rises up] Oh, thanks. Thanks. That's a LOT better."
    },
    {
        "character": "",
        "line": "Beaverton Oil, inside. The boys turn to watch the boat burn."
    },
    {
        "character": "Kyle",
        "line": "We can't get out! The flames are too big!"
    },
    {
        "character": "Cartman",
        "line": "[turns around and heads towards Stan] Oh great! You see, Stan?! This is what you get for listening to Kyle! [Kyle turns and looks at him] \"Oh, you've gotta help those people. It's your responsibility.\""
    },
    {
        "character": "Kyle",
        "line": "[walks towards Stan] Stan, it's over. You have to admit what you did so our parents can help us! [Stan looks down, unsure what to do]"
    },
    {
        "character": "",
        "line": "The Park County Community Center, inside. Preparations are ongoing."
    },
    {
        "character": "Randy",
        "line": "Stan?? Stan!!"
    },
    {
        "character": "Gerald",
        "line": "Randy! We've looked everywhere! Kyle's missing too!"
    },
    {
        "character": "Sharon",
        "line": "Oh my God! Where would they go?!"
    },
    {
        "character": "Stephen",
        "line": "[on the public phone] Randy, Randy! Your son's on the phone!"
    },
    {
        "character": "Randy",
        "line": "[gets to the phone and takes the receiver from Stephen] Stan??"
    },
    {
        "character": "Stan",
        "line": "Uh, hey Dad."
    },
    {
        "character": "Randy",
        "line": "Stan, you're alive!"
    },
    {
        "character": "Stan",
        "line": "Dad, we're, we're trapped in Beaverton, We're, we were trying to save everyone!"
    },
    {
        "character": "Randy",
        "line": "Stan, you must listen to me! You must stay indoors! Do not try to go out! Global warming has brought in a new ice age!"
    },
    {
        "character": "Stan",
        "line": "No, Dad, listen: I need to tell you something."
    },
    {
        "character": "Randy",
        "line": "What is it, son?"
    },
    {
        "character": "Stan",
        "line": "Nothing. Can you just come get us, please?"
    },
    {
        "character": "Randy",
        "line": "You just stay put, son! I'm coming for you! Do you hear me?? I'm coming for you!! [hangs up the phone and struggles with his emotions, then grabs his coat and scarf and bundles up]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Randy, wheh-where are you going?"
    },
    {
        "character": "Randy",
        "line": "I'm going to Beaverton."
    },
    {
        "character": "Tom",
        "line": "[Craig's father] You can't go out there! You'll freeze to death!"
    },
    {
        "character": "Randy",
        "line": "My son is counting on me!"
    },
    {
        "character": "Gerald",
        "line": "I'm going with you."
    },
    {
        "character": "Randy",
        "line": "You can't go out there! You'll freeze to death!"
    },
    {
        "character": "Gerald",
        "line": "You can't do this alone!"
    },
    {
        "character": "Stephen",
        "line": "Let me go too."
    },
    {
        "character": "Man 12",
        "line": "You can't go out there. You'll freeze to death."
    },
    {
        "character": "Randy",
        "line": "All right, come on, both of you! We've gotta pull together every warm piece of clothing we can find."
    },
    {
        "character": "",
        "line": "South Park, day. If there's an ice age now, it certainly doesn't show. Randy, Gerald and Stephen are much too warmly dressed. They walk through town chain-gang style. Randy leads the men forward and takes a deep breath. Stephen collapses at the back end of the chain. Gerald and Randy spin around."
    },
    {
        "character": "Gerald",
        "line": "Stephen! [Stephen mumbles but can't get up] Stephen, you have to keep moving!"
    },
    {
        "character": "Stephen",
        "line": "I can't go on! Feel so... hot."
    },
    {
        "character": "Randy",
        "line": "Feeling warmth is a symptom of the last stages of hypothermia!"
    },
    {
        "character": "Gerald",
        "line": "Oh Jesus... [looking woozy] I feel warm too!"
    },
    {
        "character": "Randy",
        "line": "Yeah, me too. [walks around Gerald] Stephen, we've gotta keep moving! We're in deep hypothermia, all of us! We've gotta keep the blood flowing! [bends down to help Stephen up]"
    },
    {
        "character": "Gerald",
        "line": "Maybe we should... strip these jackets off, and warm our bodies next to each other!"
    },
    {
        "character": "Randy",
        "line": "Don't be a fag! [turns around] Come on! We can make it! [the men move forward again] We have to try!"
    },
    {
        "character": "",
        "line": "The Pentagon, day."
    },
    {
        "character": "General",
        "line": "Come on, people, we're running out of time! We need all Army helicopters to the Southern states for evacuation NOW!"
    },
    {
        "character": "Officer",
        "line": "Sir! More people in Beaverton are calling. They say they're trapped in floods and fire now."
    },
    {
        "character": "General",
        "line": "Tell them that the government can't help them, but that we're very sorry. You know the plan, people! We can only evacuate citizens below this line! [the very line Randy mentioned]"
    },
    {
        "character": "Scientist",
        "line": "E-excuse me, General?"
    },
    {
        "character": "General",
        "line": "WHAT??"
    },
    {
        "character": "Scientist",
        "line": "We've just compiled some new information. The er, the flood in Beaverton wasn't caused by global warming after all."
    },
    {
        "character": "General",
        "line": "What??"
    },
    {
        "character": "Scientist",
        "line": "We know the truth now. We know what caused it! [hands the general a photo. The general looks at it and his eyes grow big]"
    },
    {
        "character": "General",
        "line": "Oh my God. Quick! Radio the helicopters!"
    },
    {
        "character": "",
        "line": "Beaverton, day. The flooded town is shown, but now there is fire as well. Almost every building is in frames, as is the town sign."
    },
    {
        "character": "",
        "line": "Beaverton Gas. The boys wander around."
    },
    {
        "character": "Cartman",
        "line": "Help! Help! [a large drum falls from the ceiling in front of Kyle]"
    },
    {
        "character": "Kyle",
        "line": "Dude, this whole building is going to collapse!"
    },
    {
        "character": "Stan",
        "line": "We have to find a way out! [the boys start climbing the metal stairs]"
    },
    {
        "character": "",
        "line": "Beaverton, day. The army helicopters start showing up. The general leads the rescue effort."
    },
    {
        "character": "General",
        "line": "[through his bullhorn] Don't worry, everyone. The government is here to save you. [the helicopters hover above the homes and drop rope ladders down]"
    },
    {
        "character": "Resident 1",
        "line": "Oh wow, thank you so much! What a swift and speedy rescue!"
    },
    {
        "character": "",
        "line": "Beaverton Gas. The boys climb up further."
    },
    {
        "character": "Stan",
        "line": "Come on! We've gotta get to the roof! [another drom falls near Kyle, shearing off the stairs they just climbed. Kyle falls on his ass and gets up]"
    },
    {
        "character": "Kyle",
        "line": "Oh Jesus, we have to hurry!"
    },
    {
        "character": "Stan",
        "line": "[stops before an opening in the wall, where he sees sky and...] It's- it's helicopters! They finally came to help everyone! [Kyle and Cartman are on a landing below. Kyle tries to catch up to Stan, but Cartman blocks his way]"
    },
    {
        "character": "Cartman",
        "line": "Not so fast, Kyle."
    },
    {
        "character": "Kyle",
        "line": "What are you doing?"
    },
    {
        "character": "Cartman",
        "line": "Hand over the gold!"
    },
    {
        "character": "Kyle",
        "line": "What gold??"
    },
    {
        "character": "Cartman",
        "line": "You know what I'm talkng about!"
    },
    {
        "character": "Kyle",
        "line": "No, Cartman, I have no idea what you're talking about!"
    },
    {
        "character": "Cartman",
        "line": "All Jews carry gold in a little bag around their necks! Hand it over!"
    },
    {
        "character": "Stan",
        "line": "[drops down a few steps and calls] Guys, come on! [goes back up the stairs]"
    },
    {
        "character": "Kyle",
        "line": "Jews do NOT carry gold in a little bag around their necks.Cartman! Stop playing around!"
    },
    {
        "character": "Cartman",
        "line": "[pulls out a 9 mm handgun, hopefully fake.] I'm not playing around, Kyle! If we survive this, I don't intend to live in poverty! Give me your Jew gold now!"
    },
    {
        "character": "Kyle",
        "line": "Dude, we don't have time for your stupid jokes! We're gonna die!"
    },
    {
        "character": "Cartman",
        "line": "Yes, but you can live if you give me your Jew gold! The decision is yours, Kyle!"
    },
    {
        "character": "Kyle",
        "line": "Goddamnit, you know I don't carry gold in a little bag around my neck, Cartman! Whattaya want from me?!"
    },
    {
        "character": "Cartman",
        "line": "I want... your Jew gold! [Kyle has run out of things to say and stands there. Cartman glowers at him, ready to fire the gun if he moves]"
    },
    {
        "character": "Kyle",
        "line": "...Okay, fine! Here! [opens his coat and pulls out a small black bag, and hands it to Cartman] Now let's go!"
    },
    {
        "character": "Cartman",
        "line": "[moves the bag around for heaviness] Do you think I'm stupid?! I know that all Jews carry fake bags of gold around their necks to keep the real bags of gold around their necks safe! Hand over the real Jew gold, Kyle!! [Kyle, angered at this delaying tactic, pulls out another small bag from under his coat and walks over to Cartman. Cartman laughs evilly as Kyle approaches. Kyle smiles an evil smile back and tosses the second bag over his shoulder and into the fire below. Cartman rushes over to grab it, but doesn't get there in time Kyle rushes up the stairs at the other end of the landing] No! Noooooo! [watches the fire]"
    },
    {
        "character": "",
        "line": "Beaverton Oil, roof. A helicopter hovers over a roof opening. Stan and Kyle climb out of the building and head towards the helicopter, and climb on. Cartman climbs out of the building as the helicopter takes off."
    },
    {
        "character": "Cartman",
        "line": "Hey! Wait up, you assholes! God! [runs up to the platform and jumps on. The helicopter flies off]"
    },
    {
        "character": "",
        "line": "The Park County Community Center, inside. Everyone sits and waits."
    },
    {
        "character": "Mr. Mackey",
        "line": "Hey, look everybody! Helicopters! [a few people move forward to catch a glimpse though a crack among the boards nailed against the entrance]"
    },
    {
        "character": "Sharon",
        "line": "They, they've got the boys!"
    },
    {
        "character": "Tom",
        "line": "Global warming must be over!"
    },
    {
        "character": "Man 13",
        "line": "We made it! [the crowd cheers, \"We made it! Yeah! Woohoo\"]"
    },
    {
        "character": "",
        "line": "South Park, outside. Three helicopters touch down in the middle of South Park Av. and drop off the Beaverton residents as well as the boys. The mothers approach."
    },
    {
        "character": "Sharon",
        "line": "Stanley! [stands next to him and goes down on one knee.]"
    },
    {
        "character": "Sheila",
        "line": "Kyle! [Randy, Gerald, and Stephen are still sprawled on the ground nearby.]"
    },
    {
        "character": "Randy",
        "line": "[raises his head] Stan? [turns to the other two men] We've found Stan! Ugh. [faints again]"
    },
    {
        "character": "Mr. Mackey",
        "line": "So does, does this mean the storm is past. Global warming's over?"
    },
    {
        "character": "General",
        "line": "Global warming didn't cause the Beaverton flood. We know now whose fault it is. [The boys look up. Stan is a little worried.] It was... [pulls out the picture he was handed earlier, and it's a crab person] Crab people!"
    },
    {
        "character": "Crowd",
        "line": "Ohhhh."
    },
    {
        "character": "Theme",
        "line": "Crab People, Crab People, Taste like-"
    },
    {
        "character": "Stan",
        "line": "[steps forward] Stop it! Stop it!! First it was terrorists, then George Bush and global warming and now you're all blaming crab people for something that's very simple! It's MY fault. I broke the dam. [the crowd falls silent for a few seconds]"
    },
    {
        "character": "Cartman",
        "line": "...Aw man."
    },
    {
        "character": "Sharon",
        "line": "[steps forward] Stanley. You?"
    },
    {
        "character": "Man 14",
        "line": "No. Don't you see what this child is saying? We can't spend all our energy placing blame when something bad happens. He's saying... we all broke the dam. '"
    },
    {
        "character": "Stan",
        "line": "No. I broke the dam."
    },
    {
        "character": "Woman 1",
        "line": "I broke the dam."
    },
    {
        "character": "Man 15",
        "line": "I broke the dam."
    },
    {
        "character": "Man 16",
        "line": "I broke the dam."
    },
    {
        "character": "Stan",
        "line": "No. I broke the dam."
    },
    {
        "character": "Woman 2",
        "line": "And I broke the dam."
    },
    {
        "character": "Man 17",
        "line": "I broke the dam."
    },
    {
        "character": "Cartman",
        "line": "[steps forward] Hehe, I broke the dam. Hehe."
    },
    {
        "character": "Man 18",
        "line": "I broke the dam."
    },
    {
        "character": "Woman 3",
        "line": "I broke the dam."
    },
    {
        "character": "Stan",
        "line": "[annoyed that his admission isn't taking hold, adds emphasis] I broke the dam. I ran a boat into the dam and I broke it."
    },
    {
        "character": "Man 19",
        "line": "I broke the dam."
    },
    {
        "character": "Man 20",
        "line": "[deep voice] I broke the dam."
    },
    {
        "character": "Man 21",
        "line": "I broke the dam."
    },
    {
        "character": "Man 22",
        "line": "I broke the dam."
    },
    {
        "character": "Stan",
        "line": "No! I broke the fucking dam!"
    },
    {
        "character": "Man 23",
        "line": "I broke the dam."
    },
    {
        "character": "Man 24",
        "line": "I broke the dam."
    },
    {
        "character": "Stan",
        "line": "I literally broke the dam!"
    },
    {
        "character": "Man 25",
        "line": "I broke the dam."
    },
    {
        "character": "Man 26",
        "line": "I broke the dam."
    },
    {
        "character": "Stan",
        "line": "On a boat! That wasn't mine!"
    },
    {
        "character": "Man 27",
        "line": "I broke the dam."
    },
    {
        "character": "Man 28",
        "line": "I broke the dam."
    },
    {
        "character": "Stan",
        "line": "I kept it secret, for two days!"
    },
    {
        "character": "Man 29",
        "line": "I broke the dam."
    },
    {
        "character": "Man 30",
        "line": "I broke the dam."
    },
    {
        "character": "Stan",
        "line": "The boat caught on fire, and it exploded!"
    },
    {
        "character": "Man 31",
        "line": "I broke the dam."
    },
    {
        "character": "Man 32",
        "line": "I broke the dam."
    },
    {
        "character": "Stan",
        "line": "Ohhh, fuck it!"
    }
]