[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park, day, a mini-mall. Komik Factory is shown. The boys walk out the front doors."
    },
    {
        "character": "Kyle",
        "line": "Oh dude, check it out. I got a Jake Plummer."
    },
    {
        "character": "Cartman",
        "line": "Aw man, I got a crappy AJ Feeley again!"
    },
    {
        "character": "Kyle",
        "line": "How come you didn't buy any cards, Stan?"
    },
    {
        "character": "Stan",
        "line": "I can't spend any money. I'm saving up for that bike I want."
    },
    {
        "character": "Cartman",
        "line": "HA! Saving money, duhhh! [turns left and walks. The others follow. Kenny moves the card in his left hand to his right hand]"
    },
    {
        "character": "Kyle",
        "line": "So what should we do now? It's Saturday and we have to have as much fun as possible."
    },
    {
        "character": "Cartman",
        "line": "Hey, I know! Let's go play laser tag at FunPlex."
    },
    {
        "character": "Kenny",
        "line": "(Hey yeah!)"
    },
    {
        "character": "Stan",
        "line": "[stops] No, I don't wanna spend any money, you guys. [the others stop and he catches up] Let's just do something fun that's free."
    },
    {
        "character": "Cartman",
        "line": "Stan, don't you know the first law of physics? Anything that's fun costs at least eight dollars."
    },
    {
        "character": "Kyle",
        "line": "Yeah dude, nothing fun is free."
    },
    {
        "character": "Stan",
        "line": "Well I can't spend any money."
    },
    {
        "character": "Cartman",
        "line": "Okay, be a Jew. We're gonna go play laser tag. [he, Kenny and Kyle walk off]"
    },
    {
        "character": "Kyle",
        "line": "Yeah. See ya. [Stan moves on down the sidewalk and passes a Scientology center. In front are a table with two people seated behind it, waiting for prospects]"
    },
    {
        "character": "Woman",
        "line": "Hello, would you like to take a personality test? It's fun and it's free."
    },
    {
        "character": "Stan",
        "line": "[stops, thinks, and looks] Excuse me?"
    },
    {
        "character": "Woman",
        "line": "We're doing free personality tests today."
    },
    {
        "character": "Stan",
        "line": "Uh what do I have to do?"
    },
    {
        "character": "Woman",
        "line": "Have you heard of Scientology? It's all based on the book, Dianetics. A lot of really cool people are Scientologists, like Tom Cruise and John Travolta. Why don't you come on in and we'll get your fun free personality test started. [leads him in and walks by one closed door after another] Let's just find an empty room here, lots of people getting free tests today. [finds an open door and looks in] Hey Brian."
    },
    {
        "character": "Brian",
        "line": "[seated at his desk, rises and walks to the door] Hey Kelly. How's it going?"
    },
    {
        "character": "Kelly",
        "line": "Great! I want you to meet my new friend, Stan."
    },
    {
        "character": "Brian",
        "line": "Hey there! How are you?"
    },
    {
        "character": "Stan",
        "line": "Fine."
    },
    {
        "character": "Kelly",
        "line": "Brian's gonna give you your personality test and then let you know some things about Scientology."
    },
    {
        "character": "Brian",
        "line": "Good times, good times!"
    },
    {
        "character": "Stan",
        "line": "L-look, is this a religion? Because my family is like, Catholic or something."
    },
    {
        "character": "Brian",
        "line": "Ho, that's not a problem at all. Scientology is more like an alternative to psychology than a religion."
    },
    {
        "character": "Stan",
        "line": "Then how come that sign says \"Church of Scientology\"?"
    },
    {
        "character": "Brian",
        "line": "Oho, that's just this thing: What's the Denver Broncos' record now? Six and two?"
    },
    {
        "character": "Stan",
        "line": "Seven and two."
    },
    {
        "character": "Brian",
        "line": "Wow! That's great! All right, come on in and take a seat; we're gonna have some fun! [he and Stam enter the room and he changes the sign on his door so it says \"Test In Progress.\" Inside, Brian and Stan take their seats] All right now, I'm just gonna ask you a few questions. Just answer these questions as truthfully as you can, alright? [picks up a notepad and starts noting Stan's answers] Okay. Number 1: Do you ever make remarks... which you later regret?"
    },
    {
        "character": "Stan",
        "line": "Uhhh, sh-sure?"
    },
    {
        "character": "Brian",
        "line": "Uh huh. Would you rather give orders... than take them?"
    },
    {
        "character": "Stan",
        "line": "Yeah?"
    },
    {
        "character": "Brian",
        "line": "Do you ever whistle... just for the fun of it. [The wall clock reads 11:35, then 12:20, and the camera pans down to Brian and Stan.] Okay, and finally, does life sometimes feel vague and confusing to you?"
    },
    {
        "character": "Stan",
        "line": "Yes."
    },
    {
        "character": "Brian",
        "line": "Okay, Stan. Well, that's it. That's the end of the personality test."
    },
    {
        "character": "Stan",
        "line": "So how did I do?"
    },
    {
        "character": "Brian",
        "line": "Well, I hate to tell you this, Stan, but... you are one messed-up kid."
    },
    {
        "character": "Stan",
        "line": "...Huh??"
    },
    {
        "character": "Brian",
        "line": "Yeah, I'm afraid that you are completely miserable and totally depressed."
    },
    {
        "character": "Stan",
        "line": "I am?? I didn't know that!"
    },
    {
        "character": "Brian",
        "line": "Well there's certainly no question that you are a perfect candidate for Scientology. I think it can really make you happy again."
    },
    {
        "character": "Stan",
        "line": "What what do I do?"
    },
    {
        "character": "Brian",
        "line": "It's very simple. We just need two hundred and forty dollars."
    },
    {
        "character": "",
        "line": "Stan's house, dinnertime. Grandpa is still around, at the head of the table. Randy and Shelly are seated to Grandpa's right, Stan and Sharon are seated to Grandpa's left. Stan rests his head on his left arm."
    },
    {
        "character": "Sharon",
        "line": "Stanley, you haven't touched your food. What's the matter with you?"
    },
    {
        "character": "Stan",
        "line": "I'm totally depressed."
    },
    {
        "character": "Sharon",
        "line": "What? Why?"
    },
    {
        "character": "Stan",
        "line": "I don't know."
    },
    {
        "character": "Sharon",
        "line": "Well how long have you been feeling this way?"
    },
    {
        "character": "Stan",
        "line": "I'm not sure. But... I need two hundred and forty dollars."
    },
    {
        "character": "Randy",
        "line": "Two hundred and forty dollars?! What'd you do, break something?!"
    },
    {
        "character": "Stan",
        "line": "No, I found a self-help program that can cure me."
    },
    {
        "character": "Randy",
        "line": "Oh Jesus, the answer is no, Stanley."
    },
    {
        "character": "Stan",
        "line": "But I'm completely miserable and these people can help!"
    },
    {
        "character": "Sharon",
        "line": "Stanley, I didn't know you were miserable."
    },
    {
        "character": "Stan",
        "line": "Neither did I!"
    },
    {
        "character": "Randy",
        "line": "Stanley, do you have any concept of money at all? Money doesn't grow on trees, you know?"
    },
    {
        "character": "Stan",
        "line": "Don't you care that I'm depressed?! What if I become suicidal, or, or become an alcoholic like Grandpa??"
    },
    {
        "character": "Marvin",
        "line": "Huh?"
    },
    {
        "character": "Randy",
        "line": "Well, if you really think your life is so bad, Stan, why don't you take what you have out of your bicycle savings?!"
    },
    {
        "character": "Stan",
        "line": "[looking real sad] ...well but... but that's my money."
    },
    {
        "character": "Randy",
        "line": "Yeah, well just like the rest of us, you have to make choices with your money. Do you want a bike, or do you not want to be depressed?"
    },
    {
        "character": "",
        "line": "The Scientology Center, Sunday. Stan returns."
    },
    {
        "character": "Kelly",
        "line": "Michelle, our friend Stan wants to have auditing."
    },
    {
        "character": "Michelle",
        "line": "Oho good, you're going to be so happy."
    },
    {
        "character": "Stan",
        "line": "I hope so."
    },
    {
        "character": "Kelly",
        "line": "It's the beginning of a whole new life for you, Stan. See ya afterwards."
    },
    {
        "character": "Michelle",
        "line": "Great, so do you have the two hundred and forty dollars. [Stan pulls out the bills and hands them over to Michelle] Perfect! We're on our way! [puts the money in a secure drawer and escorts Stan...] Come on over here and I'll fill you in on how the Church of Scientology works. [...down a hallway] You see, Stan, Scientology was founded by a great man named L. Ron Hubbard. [a portrait of him is shown] Mr. Hubbard discovered that negative emotions are actually caused by things called \"body thetans.\""
    },
    {
        "character": "Stan",
        "line": "Really?"
    },
    {
        "character": "Michelle",
        "line": "Yes! And being the genius that he was, Mr. Hubbard invented a way to get rid of those bad thetans. [stops by a picture of a portable blue machine with two cylindrical grips plugged into the back] This is called an E-meter. It's the main tool of Scientology. You just grab a hold of these handles as I talk you through past experiences in your life. I'll be taking readings here, and we'll be able to determine your thetan levels."
    },
    {
        "character": "Stan",
        "line": "Thetan levels..."
    },
    {
        "character": "Michelle",
        "line": "Come on in the auditing room and I'll show you how it works. [moments later they are in the auditing room. They walk by a row of booths, each with a tester and a testee] All these people are just like you, Stan, auditing with E-meters to get rid of their negative emotions. [she reaches an empty booth and sits behind the controls as Stan takes his seat] All right, Stan, I want you to just relax and take hold of the E-meter handles. [Stan grabs them and draws them close]"
    },
    {
        "character": "Stan",
        "line": "So, this is gonna make me happy?"
    },
    {
        "character": "Michelle",
        "line": "Just take a few deep breaths, and I'll just get a base reading of your thetan levels. [Stan takes a deep breath and exhales, not quite sure why, then Michelle turns on the machine to take the reading. It reaches a 9.15] Huh, that's, that's strange."
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Michelle",
        "line": "Somethin-, [soft giggle] something's wrong. Brian, could you come over here a second?"
    },
    {
        "character": "Brian",
        "line": "[appears next to her] Yep- Oh hey there, Greg!"
    },
    {
        "character": "Stan",
        "line": "Stan."
    },
    {
        "character": "Michelle",
        "line": "Will you... look at his thetan levels?"
    },
    {
        "character": "Brian",
        "line": "Huh, well. We'll get another E-meter - this one's obviously broken. Sorry about this, Greg."
    },
    {
        "character": "",
        "line": "The lobby. Mr. Mackey has entered to take his own personality test."
    },
    {
        "character": "Recruiter",
        "line": "And so we just try to analyze your personality, and if it seems like you need some help, then you can have an audit counseling for a nominal fee."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well, that sounds pretty reasonable, m'kay. [Brian comes out of the auditing room nervously]"
    },
    {
        "character": "Brian",
        "line": "Mike, I need to talk to you!"
    },
    {
        "character": "Mike",
        "line": "Excuse me, sir, I'll be right back. [he and Brian go into the hallway] Are you all right? You're sweating!"
    },
    {
        "character": "Brian",
        "line": "[shows him Stan's E-meter results] Take a look at this."
    },
    {
        "character": "Mike",
        "line": "[looks] What is it?"
    },
    {
        "character": "Brian",
        "line": "The E-meter results from the little boy in Room D"
    },
    {
        "character": "Mike",
        "line": "[leafing through the results] This... this can't be right. [scans faster]"
    },
    {
        "character": "Brian",
        "line": "We ran the tests four times! We used four different E-meters!"
    },
    {
        "character": "Mike",
        "line": "Fax these results to the head office in Los Angeles. The President has to see thus right away. Go! [slaps Brian across the back] Now! [Brian leaves]"
    },
    {
        "character": "",
        "line": "L. Ron Hubbard's Scientology Celebrity Center, day."
    },
    {
        "character": "Woman",
        "line": "The boy is from a small mountain town in Colorado, sir."
    },
    {
        "character": "Man",
        "line": "Sir, how can it be that a first timer scores that kind of thetan level?? He registered OT9! I'm only OT7 and I've been in the church all my life!"
    },
    {
        "character": "President",
        "line": "I've waited... forty-two years... for this day."
    },
    {
        "character": "Man",
        "line": "Sir?"
    },
    {
        "character": "President",
        "line": "Don't you all see what this means? There was only one person who EVER registered OT9 in the history of our church. [looks at something. The others gather to look with him. They look at a framed portrait of L. Ron Hubbard] L. Ron Hubbard said he had lived past lives. That when he died his thetan would show itself again. Our prophet has returned. [removes Stan's picture from the report and holds it up against the portrait.]"
    },
    {
        "character": "",
        "line": "The Marsh house, kitchen, night."
    },
    {
        "character": "Sharon",
        "line": "Uh, Stanley, take the garbage out before you go to bed."
    },
    {
        "character": "Stan",
        "line": "I took out the garbage yesterday."
    },
    {
        "character": "Randy",
        "line": "Right now, Stan!"
    },
    {
        "character": "Stan",
        "line": "Aagh! [hauls the garbage bag out of the garbage can and drags it across the living room] Stupid dumb garbage! [opens the front door and steps out.]"
    },
    {
        "character": "",
        "line": "The Marsh house, outside, night."
    },
    {
        "character": "Man 2",
        "line": "[offscreen] There he is! [Stan's anger changes to surprise]"
    },
    {
        "character": "Man 3",
        "line": "Thank you for returning!"
    },
    {
        "character": "Man 4",
        "line": "He's wonderful. [cries] He's wonderful."
    },
    {
        "character": "Randy",
        "line": "[the rest of the family joins Stan at the door] Stan! What the hell did you do?!"
    },
    {
        "character": "Stan",
        "line": "I don't know! [a Scientology helicopter lands on the lawn and some officials open the door for the church's president, who exits, walks over to Stan, and kneels down]"
    },
    {
        "character": "President",
        "line": "Hello young man. I'm the head of Scientology. It is... [with great emotion, bows his head] a great honor to meet you!"
    },
    {
        "character": "",
        "line": "The Marsh living room. The officials and the family have entered."
    },
    {
        "character": "Randy",
        "line": "All right, what the hell is going on here?!"
    },
    {
        "character": "President",
        "line": "We've been looking for your son for a long time, Mr. Marsh. He is the reincarnation of our church's most famous prophet."
    },
    {
        "character": "Sharon",
        "line": "Wwhat??"
    },
    {
        "character": "President",
        "line": "Scientologists the world over are simply rejoicing at his second coming."
    },
    {
        "character": "Randy",
        "line": "Look, we don't want our son to join your group, okay?"
    },
    {
        "character": "President",
        "line": "We're not asking him to join us, we're asking him... to lead us."
    },
    {
        "character": "Shelly",
        "line": "Oh my God, it's John Travolta! [Sharon and Randy go to investigate]"
    },
    {
        "character": "John Travolta",
        "line": "[using an odd voice as he makes his way through the crowd] Is this where he lives? Is this where L. Ron Hubbard is? Oh my god!"
    },
    {
        "character": "President",
        "line": "Yes, John Travolta and Tom Cruise are big Scientologists. Do you believe me nooow? [kneels next to Stan] Young man, I know you don't remember it,but... your name was L. Ron Hubbard. You revealed the secret that began the whole Church of Scientology."
    },
    {
        "character": "Randy",
        "line": "Okay, Stan, it's late, go up to your room and get ready for bed! Let Mommy and Daddy handle this. [Stan walks up the stairs, not sure what's going on]"
    },
    {
        "character": "Stan",
        "line": "[enters his room] Jesus Christ..."
    },
    {
        "character": "Cruise",
        "line": "[suddenly appears in his room] L. Ron? [runs up and kneels before Stan] L. Ron! It really is you! [puts his hands over his heart] Oh, this is the greatest day of my life!"
    },
    {
        "character": "Stan",
        "line": "Aw dude, I need to go to bed."
    },
    {
        "character": "Cruise",
        "line": "Don't you understand, L. Ron? It's me! Tom Cruise!"
    },
    {
        "character": "Stan",
        "line": "Yeah, I know who you are."
    },
    {
        "character": "Cruise",
        "line": "Ha-haven't I done well, L. Ron? Haven't you enjoyed my acting? Which film did you like best?"
    },
    {
        "character": "Stan",
        "line": "Well-h. I mean, you're not... you're not like as good as Leonardo DiCaprio, but you're okay, I guess."
    },
    {
        "character": "Cruise",
        "line": "...What?"
    },
    {
        "character": "Stan",
        "line": "I mean, you're not Gene Hackman or that guy who played Napoleon Dynamite, but you're okay."
    },
    {
        "character": "Cruise",
        "line": "[buries his face in his hands] I'm nothing. [lifts his head again] I'm a failure in the eyes of the Prophet! AAAH! [runs into Stan's closet and closes the door]"
    },
    {
        "character": "Stan",
        "line": "Hey! [walks over to the closet] Dude, I'm sorry. I didn't mean it."
    },
    {
        "character": "Cruise",
        "line": "Go away!"
    },
    {
        "character": "Stan",
        "line": "Dude, this is my room!"
    },
    {
        "character": "Cruise",
        "line": "Go away, I said!"
    },
    {
        "character": "Stan",
        "line": "[walks out into the hall] Dad! Tom Cruise won't come out of the closet!"
    },
    {
        "character": "Randy",
        "line": "What?!"
    },
    {
        "character": "Stan",
        "line": "Tom Cruise locked himself in my closet and he won't come out. [Randy enters the room and tries to open the closet door, then knocks. Stan looks on]"
    },
    {
        "character": "Randy",
        "line": "Mr. Cruise? Mr. Cruise, come out of the closet."
    },
    {
        "character": "Cruise",
        "line": "No!"
    },
    {
        "character": "Randy",
        "line": "Come on, Mr. Cruise, this is ridiculous."
    },
    {
        "character": "Cruise",
        "line": "I'm never coming out!"
    },
    {
        "character": "Randy",
        "line": "[to Stan] What did you say to him?"
    },
    {
        "character": "Stan",
        "line": "I just told him I thought the Napoleon Dynamite guy is a better actor than he is."
    },
    {
        "character": "Randy",
        "line": "Oh boy. [knocks on the door again] Mr. Cruise, you can't just stay in the closet, alright? You need to come out."
    },
    {
        "character": "Sharon",
        "line": "What's going on?"
    },
    {
        "character": "Randy",
        "line": "Tom Cruise won't come out of the closet."
    },
    {
        "character": "Sharon",
        "line": "What??"
    },
    {
        "character": "Cruise",
        "line": "Just leave me alone!"
    },
    {
        "character": "Randy",
        "line": "Well, we CAN'T leave you alone because YOU won't come out of the closet!"
    },
    {
        "character": "",
        "line": "Channel 4 Network News - South Park Evening News."
    },
    {
        "character": "Chris",
        "line": "It's been four hours now, and Tom Cruise still will not come out of the closet. Hundreds of onlookers here have gathered here in hopes that the celebrity will finally give in."
    },
    {
        "character": "Sergeant",
        "line": "Tom Cruise, this is Park County police! Please come out of the closet. [the house is shown] Everybody here just wants you to come out of the closet, Tom. [someone takes a picture. The house is shown again] Nobody's gonna be mad, everything's gonna be all right. Just come out of the closet."
    },
    {
        "character": "Chris",
        "line": "We're still not exactly sure why Tom Cruise is in the closet, but I'm being joined now by famous singer/songwriter R. Kelly."
    },
    {
        "character": "R. Kelly",
        "line": "Well I was just standing here, and Tom Cruise locked himself in the closet I asked myself why won't Tom Cruise just come out the closet? Nobody has no answers, and so I pull out my gun! [The crowd screams and run] Tell me why Tom Cruise in the closet or else I am gonna shoot someone!"
    },
    {
        "character": "",
        "line": "Stan's house, kitchen. The church leaders talk to."
    },
    {
        "character": "President",
        "line": "Please, understand, we just want what is best for your son. The reincarnation of L. Ron Hubbard must be taken care of. He had many enemies."
    },
    {
        "character": "Randy",
        "line": "Wasn't L. Ron Hubbard a science-fiction writer?"
    },
    {
        "character": "President",
        "line": "Yes. But he was also a prophet... who knew the secret truth about the nature of life."
    },
    {
        "character": "Sharon",
        "line": "This is just too much."
    },
    {
        "character": "President",
        "line": "We want to reveal to Stan the great secret of life behind our church. The safely-guarded Scientology doctrine. Please, your son deserves to be enlightened."
    },
    {
        "character": "Randy",
        "line": "Stan, do you want to hear the great secret doctrine of life behind Scientology?"
    },
    {
        "character": "Stan",
        "line": "Sure."
    },
    {
        "character": "Randy",
        "line": "All right, go ahead and tell him."
    },
    {
        "character": "President",
        "line": "Would you excuse us, please? This is highly classified church information."
    },
    {
        "character": "Randy",
        "line": "Aw rats. [he and Sharon leave]"
    },
    {
        "character": "President",
        "line": "Usually, to hear the secret doctrine, you have to be in the church for several years, Stan. [leans in] Are you ready to hear the truth?"
    },
    {
        "character": "Stan",
        "line": "I, I guess."
    },
    {
        "character": "President",
        "line": "You see, Stan, there is a reason for people feeling sad and depressed. [leans in] An alien reason. It all began 75 million years ago. Back then there was a galactinc federation of planets which was ruled over by the evil Lord Xenu."
    },
    {
        "character": "Xenu",
        "line": "Ho ho ho ho ho ho."
    },
    {
        "character": "President",
        "line": "Xenu thought his galaxy was overpopulated, [Xenu gives his orders] and so he rounded up countless aliens from all different planets, [the roundup is shown] and then had those aliens frozen. [one by one, the aliens are frozen]"
    },
    {
        "character": "Xenu",
        "line": "[laughing over his plan] Wa ha ha ha!"
    },
    {
        "character": "President",
        "line": "The frozen alien bodies were loaded onto Xenu's galactic cruisers, which looked like DC-8s, except with rocket engines. The cruisers then took the frozen alien bodies to our planet, to Earth, and dumped them into the volcanoes of Hawaii. [a shot of the frozen aliens encased in ice being dropped from the orange cruisers] The aliens were no longer frozen, they were dead. The souls of those aliens, however, lived on, and all floated up towards the sky. But the evil Lord Xenu had prepared for this."
    },
    {
        "character": "Xenu",
        "line": "Wa ha ha ha!"
    },
    {
        "character": "President",
        "line": "Xenu didn't want their souls to return! And so he built giant soul-catchers in the sky! [the soul-catchers are shown] The souls were taken to a huge soul brain-washing facility, which Xenu had ALSO built on Earth. [the souls are watching a movie screen with 3D glasses] There the souls were forced to watch days of brainwashing material [Egyptian gods, Jesus carrying the Cross, and a bronze Buddha statue are shown] which tricked them into believing a false reality. Xenu then released the alien souls, which roamed the earth aimlessly in a fog of confusion. At the dawn of man, the souls finally found bodies which they can grab onto. They attached themselves to all mankind, which still to this day causes all our fears, our confusions, and our problems. [Stan looks at the president, a bit awed] L. Ron Hubbard did an amazing thing telling the world this incredible truth. Now all we're asking you to do... [hands Stan a pen and some paper] is pick up where he left off."
    },
    {
        "character": "Stan",
        "line": "But I don't know any of this stuff."
    },
    {
        "character": "President",
        "line": "Neither did L. Ron when he started. He said he just closed his eyes, and wrote down whatever came to mind. You can do the same. Just let it flow."
    },
    {
        "character": "Stan",
        "line": "Okay, I'll try. I just wish I could write in my room, but Tom Cruise won't come out of the closet."
    },
    {
        "character": "President",
        "line": "I know. We've sent Nicole Kidman up there to see if she can help."
    },
    {
        "character": "",
        "line": "Stan's bedroom. The sergeant, a photographer, the Marshes, and a few other people wait by the bedroom door."
    },
    {
        "character": "Nicole",
        "line": "[knocks on the closet door] Tom? Tom, It's Nicole."
    },
    {
        "character": "Cruise",
        "line": "Ah hi Nicole."
    },
    {
        "character": "Nicole",
        "line": "Tom, don't you think this has gone on long enough? It's time for you to come out of the closet."
    },
    {
        "character": "Cruise",
        "line": "...I'm not, I'm not in the closet."
    },
    {
        "character": "Nicole",
        "line": "Yes you are, Tom. And you need to just end this and come out. [silence] I'm not gonna think any differently of you. Katie's not gonna think any differently of you. You don't need to be in that closet anymore, Tom."
    },
    {
        "character": "Cruise",
        "line": "I'm not in here, though."
    },
    {
        "character": "Nicole",
        "line": "Yes, you are."
    },
    {
        "character": "Cruise",
        "line": "I'm not, ...I'm not in the closet."
    },
    {
        "character": "Nicole",
        "line": "Then how am I talking to you, Tom? [silence] Tom, you can't hide forever just because the reincarnation of L. Ron Hubbard doesn't like your acting. Come out of the closet, Tom. You're not fooling anyone."
    },
    {
        "character": "Cruise",
        "line": "I'm, I'm not, I'm not in here."
    },
    {
        "character": "",
        "line": "Stan's house, kitchen. Stan is at the breakfast table writing and rewriting. Wads of paper litter the table."
    },
    {
        "character": "Stan",
        "line": "[gets an idea] Yeah, yeah!"
    },
    {
        "character": "Kyle",
        "line": "Hey Stan, we're gonna go to the movies."
    },
    {
        "character": "Stan",
        "line": "I can't. I'm writing a new sacred doctrine for my church."
    },
    {
        "character": "Kyle",
        "line": "Look, Stan, we're really getting concerned about this cult that you're getting into."
    },
    {
        "character": "Stan",
        "line": "Cult? Scientology isn't a cult, Kyle. I've read all this stuff and it's based on fact."
    },
    {
        "character": "Kyle",
        "line": "Dude, L. Ron Hubbard was a science-fiction writer. He lived on a boat with only young boys and got busted by the feds numerous times."
    },
    {
        "character": "Stan",
        "line": "I did not! Those are rumors put out by people who are afraid because they don't know the secret truth."
    },
    {
        "character": "Kyle",
        "line": "What secret truth??"
    },
    {
        "character": "Stan",
        "line": "I can't tell you unless you pay for a few years of audit counseling! All I know is that I was depressed before, and now I found meaning!"
    },
    {
        "character": "Kyle",
        "line": "I didn't know you were depressed."
    },
    {
        "character": "Stan",
        "line": "Neither did I! But now, if you guys can't accept this great thing I belong to, then I suppose we're no longer friends! [Kyle and Kenny leave]"
    },
    {
        "character": "Cartman",
        "line": "Stan, I just want you to know that I still hate Kyle more than you. [leaves]"
    },
    {
        "character": "",
        "line": "Stan's house, later, outside shot. Upstairs, John Travolta has joined the effort to get Cruise out of the closet."
    },
    {
        "character": "Travolta",
        "line": "Tom! Hey Tom, it's John Travolta."
    },
    {
        "character": "Cruise",
        "line": "Oh hey John."
    },
    {
        "character": "Travolta",
        "line": "Tom, you've gotta come out of the closet. Oh my God."
    },
    {
        "character": "Cruise",
        "line": "L. Ron Hubbard doesn't think I'm a great actor."
    },
    {
        "character": "Travolta",
        "line": "Mm-maybe you took what he said out of context. Okay, 's like, if you don't come out, can I at least come in and talk to you?"
    },
    {
        "character": "Cruise",
        "line": "Oh... Okay, but no tricks."
    },
    {
        "character": "Travolta",
        "line": "No tricks. [gives the group standing out in the hall a thumbs-up. The door opens and John goes into the closet.] Hey, it's really nice n here."
    },
    {
        "character": "Cruise",
        "line": "Yeah, see?"
    },
    {
        "character": "Travolta",
        "line": "I feel really safe. Oh my god."
    },
    {
        "character": "Randy",
        "line": "[knocks] Hello? [tries to force the door open] Hey, come out of there!"
    },
    {
        "character": "",
        "line": "Stan's house, outside shot."
    },
    {
        "character": "Chris",
        "line": "Tom, it now appears that John Travolta is also in the closet, and he refuses to come out. Here with more details once again, is R. Kelly."
    },
    {
        "character": "R. Kelly",
        "line": "I was just standing here. Tom Cruise locked himself in the closet Then John Travolta come and now, John Travolta in the closet too. Please Tom Cruise and John Travolta come out the closet! But then I calm myself down, and I pull out my gun! [The crowd screams again and runs away]"
    },
    {
        "character": "Chris",
        "line": "Oh geez, here we go with the gun again."
    },
    {
        "character": "R. Kelly",
        "line": " [Grabs a lady and holds her at gunpoint] If Tom Cruise and John Travolta don't come out of the closet I'm gonna cap this bitch!"
    },
    {
        "character": "",
        "line": "Stan's house, kitchen. The president of the church is reviewing Stan's work."
    },
    {
        "character": "President",
        "line": "Yes... Yes, oh this is great, Stan!"
    },
    {
        "character": "Stan",
        "line": "I wrote that um, our followers shouldn't fly in DC-8s anymore because they're too much like Xenu's evil cruisers."
    },
    {
        "character": "President",
        "line": "Yes, of course! So wonderful!"
    },
    {
        "character": "Stan",
        "line": "And I wrote that the evil Lord Xenu was recently broken out of galactic jail."
    },
    {
        "character": "President",
        "line": "Yes, of course!"
    },
    {
        "character": "Stan",
        "line": "And best of all, I wrote that all the Scientologists should no longer have to pay money to belong."
    },
    {
        "character": "President",
        "line": "[his joy disappears] What?"
    },
    {
        "character": "Stan",
        "line": "I I realize that to really be a church, we can't charge people for help."
    },
    {
        "character": "President",
        "line": "[turns around] What are you, stupid?! Then how do we make money from those people?!"
    },
    {
        "character": "Stan",
        "line": "... Well, it's not about the money, it's about the message, right?"
    },
    {
        "character": "President",
        "line": "Wait a minute, whoa, whoa! You don't actually believe this crap, do you?? Dummy! Brainwashed alien souls?? E-meters and thetan levels?? Those people out there buy that crap and I thought YOU were smart enough to see what was really going on!"
    },
    {
        "character": "Stan",
        "line": "But you said that there were-"
    },
    {
        "character": "President",
        "line": "What's better than telling people a stupid story and having them believe you?! [Stan draws a blank] Having them PAY you for it, stupid!"
    },
    {
        "character": "Stan",
        "line": "But then, why me? Why do you need me to write something so badly?"
    },
    {
        "character": "President",
        "line": "Because if those people all think you're the reincarnation of L. Ron Hubbard, then they'll all buy your new writings, and you and I together will make three million dollars!"
    },
    {
        "character": "Stan",
        "line": "Three million dollars?"
    },
    {
        "character": "President",
        "line": "That's how the scam works! But this is a scam on a global scale! Do you fucking get me now?! [leans in a bit]"
    },
    {
        "character": "Stan",
        "line": "Yeah. Yeah, I get you."
    },
    {
        "character": "President",
        "line": "Then keep writing, L. Ron! Your people are waiting."
    },
    {
        "character": "",
        "line": "Stan's house, outside. A news brief."
    },
    {
        "character": "Chris",
        "line": "Breaking news here in South Park. Tom Cruise and John Travolta still... will not come out of the closet. Park County police have decided to try a new method."
    },
    {
        "character": "",
        "line": "Stan's room. R. Kelly is there awaiting instructions. The police signal him towards the closet."
    },
    {
        "character": "R. Kelly",
        "line": "Now I've been asked to come up here, get you both out of the closet Man, this is some crazy shit. Why won't you both just come out the closet? And they said..."
    },
    {
        "character": "Cruise, Travolta",
        "line": "We're not comin' out the closet, so you can just go away."
    },
    {
        "character": "R. Kelly",
        "line": "But everyone wants you out the closet."
    },
    {
        "character": "Cruise, Travolta",
        "line": "That doesn't matter 'cause we're gonna stay."
    },
    {
        "character": "R. Kelly",
        "line": "Now I'm startin' to get angry, so I pull out my gun! [The group screams and runs away] I'm gonna give you count of three to open this closet door. One, I'm gonna shoot you both. Two, I'm gonna cap some bitch. Three... [Closet door opens. R. Kelly walks up to the closet door slowly. Then he goes inside, the closet door closes.] Now I'm in the closet. Now I'm in the closet too."
    },
    {
        "character": "",
        "line": "Stan's house, the next day."
    },
    {
        "character": "President",
        "line": "My fellow Scientologists! Our prophet has finished his new doctrine, and will now read some passages before making it available to you all for a nominal fee. [the crowd cheers] I give you... the reincarnation of L. Ron Hubbard! [two officials bow and then spread roses before Stan's feet as he walks down a red carpet towards a marble stand with \"SCIENTOLOGY\" engraved along the front. Stan is dressed in toga and laurel. The crowd cheers wildly]"
    },
    {
        "character": "Stan",
        "line": "Uh, thanks. So, first of all, I've written that the brainwashed alien ghosts are actually from a galaxy called Nubanon."
    },
    {
        "character": "Crowd",
        "line": "Ohhhh."
    },
    {
        "character": "Man",
        "line": "Nubanon."
    },
    {
        "character": "Stan",
        "line": "And uh, oh, [hopeful faces look back at him] ...I ...I can't do this."
    },
    {
        "character": "President",
        "line": "Huh, what?"
    },
    {
        "character": "Stan",
        "line": "Look, everybody, we're all looking for answer, you know. We all want to understand who we are and where we come from, but... sometimes we want to know the answers so badly that we... believe just about anything."
    },
    {
        "character": "Man 2",
        "line": "Huh?"
    },
    {
        "character": "Woman",
        "line": "What?"
    },
    {
        "character": "Stan",
        "line": "[takes off his laurel] I'm not the reincarnation of L. Ron Hubbard. And... Scientology is just a big fat global scam."
    },
    {
        "character": "Brian",
        "line": "Oh! We are gonna sue you!"
    },
    {
        "character": "Stan",
        "line": "What??"
    },
    {
        "character": "President",
        "line": "Yeah, you think you can say our religion is a lie?! We'll sue you, buddy!"
    },
    {
        "character": "Stan",
        "line": "YOU told me it was a lie!"
    },
    {
        "character": "President",
        "line": "Ho, now you're puttin' words in MY mouth! You are so sued!"
    },
    {
        "character": "Man 3",
        "line": "You can't make fun of Scientology, kid! We are gonna sue your ass AND your balls!"
    },
    {
        "character": "Crowd",
        "line": "Yeah, that's right!"
    },
    {
        "character": "President",
        "line": "How dare you mock our faith, you little punk?! You'll be hearing from our lawyers tomorrow!"
    },
    {
        "character": "Chris",
        "line": "We've just had an incredible development here, Mitch. Tom Cruise, John Travolta, and R. Kelly, have all come out of the closet! [The three of them come out the front door and Cruise releases R. Kelly, who moves off and out of view.]"
    },
    {
        "character": "Cruise",
        "line": "[approaches Stan] So you're NOT the prophet, huh?! You made me look stupid! I'm gonna sue you too!"
    },
    {
        "character": "Stan",
        "line": "Well fine! Go ahead and sue me!"
    },
    {
        "character": "Cruise",
        "line": "I will! I'll sue you in England!"
    },
    {
        "character": "President",
        "line": "You are so sued, kid!"
    },
    {
        "character": "Stan",
        "line": "Well go on, then! Sue me!"
    },
    {
        "character": "President",
        "line": "We're going to!"
    },
    {
        "character": "Stan",
        "line": "Okay, good! Do it! I'm not scared of you! Sue me!"
    }
]