[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Stan's bedroom, night. Sharon is seated on his bed and is reading to him from a book called \"The Bubble Gum Prince In The Land Of Chocolate.\" Stan looks up at her, half-asleep and smiling"
    },
    {
        "character": "Sharon",
        "line": "But the Bubble Gum Prince wasn't afraid. He knew that the Land of Chocolate was safe forever and ever. [Stan's eyelids shut themselves and his left arm falls a bit. He's asleep. Sharon rises from the bed and bends down.] Goodnight my little angel. [kisses him on the forehead, turns out the lamp and closes the door on her way out. Moments later, the door flies off its hinges and a frantic Randy runs in with two large plastic water bottles]"
    },
    {
        "character": "Randy",
        "line": "STAAAN!!"
    },
    {
        "character": "Stan",
        "line": "[awakens and looks around as the lights come on] What?? What??"
    },
    {
        "character": "Randy",
        "line": "Get up! Get your shoes on! Gotta get out of here! MOOVE! [brings the shoes over, but yanks Stan along before Stan has a chance to put them on. As they go down the hall, Randy stops to get a vase and toss the flowers out.] Take this!! [hands the vase to Stan] We've gotta bring all the water we can!! [Shelly opens her door and steps out] Shelly, go get my gun!!"
    },
    {
        "character": "Shelly",
        "line": "Whats going on dad?"
    },
    {
        "character": "Randy",
        "line": "JUST GET THE GUN!! [runs down the hall and down the stairs. Sharon comes out of the master bedroom running while putting her coat on.]"
    },
    {
        "character": "",
        "line": "Stan's house, front, night. The family exits. Randy has a sleeping bag"
    },
    {
        "character": "Randy",
        "line": "Unh, come on! [the camera switches to a wider view and shows everyone running around with all manner of items in hand. A man carrying a large first-aid kit trips and moans in pain]"
    },
    {
        "character": "Man",
        "line": "AWWWGH!"
    },
    {
        "character": "Woman",
        "line": "Oh nooo! [Stan sees Kyle in the crowd with his family]"
    },
    {
        "character": "Stan",
        "line": "Kyle! What the hell is going on this time?!"
    },
    {
        "character": "Kyle",
        "line": "I have no idea!"
    },
    {
        "character": "",
        "line": "a red car runs into a light pole and its driver flies out through the windshield, ending up either unconscious or dead. A man breaks the display window at Tele's and runs off with a small TV. The community center has its doors open and people run inside it"
    },
    {
        "character": "Man",
        "line": "Take cover in the community center again!"
    },
    {
        "character": "",
        "line": "The community center, inside. People try to find places on which to bed down for the night. A nake redhead runs around aimlessly"
    },
    {
        "character": "Jimbo",
        "line": "All right, everyone get in and get a seal on that door!"
    },
    {
        "character": "Linda",
        "line": "Oh my God, Stephen, we've left Butters. [moves to find him. Stephen stops her]"
    },
    {
        "character": "Stephen",
        "line": "We can't go back out, Linda! It's too late for him!"
    },
    {
        "character": "Stan",
        "line": "Dad? [Randy is cutting duct tape into several equal-length strips] Dad, what the hell is going on?! [Randy stands up and faces the boys. Behind him, Mr. Mackey and a man in a raincoat set up a TV]"
    },
    {
        "character": "Randy",
        "line": "A cartoon...! A cartoon is about to air on American television with... with the Muslim prophet Mohammad as a character! [Stan and Kyle look at each other and blink]"
    },
    {
        "character": "Stan",
        "line": "So?"
    },
    {
        "character": "Randy",
        "line": "SO?! Stanley, Mohammad is sacred to the Muslim people. [people around them begin to pay attention] Ever since those cartoons in Denmark, the rules have changed. Nobody shows an image of Mohammad anymore."
    },
    {
        "character": "Gerald",
        "line": "[approaching in his pajamas] Which cartoon is it? What cartoon'll be so insensitive as to have Mohammad as a character?"
    },
    {
        "character": "Randy",
        "line": "Who do you think?! The cartoon that's always pushing buttons with their careless toilet humor! Family Guy!"
    },
    {
        "character": "Crowd",
        "line": "AWWW!"
    },
    {
        "character": "Jimbo",
        "line": "How could Family Guy do that?"
    },
    {
        "character": "Sheila",
        "line": "Why would Family Guy so blatantly insult Muslims?"
    },
    {
        "character": "Randy",
        "line": "Because Family Guy doesn't care who they insult! They only care about their... precious money!"
    },
    {
        "character": "Stan",
        "line": "Oh come on, people. You really think anybody's gonna be that pissed off about a cartoon??"
    },
    {
        "character": "Mr. Mackey",
        "line": "Wu-we've got the TV working! [the picture comes into focus]"
    },
    {
        "character": "",
        "line": "South Park News 4, Anchor Tom reporting"
    },
    {
        "character": "Tom",
        "line": "Once again, a cartoon depicting the Muslim prophet Mohammad is set to air tonight on Family Guy!"
    },
    {
        "character": "Sharon",
        "line": "Oh Randy, hold me. [Randy holds her]"
    },
    {
        "character": "Tom",
        "line": "The news has already sparked a shockwave of protests throughout the Muslim world. [Live footage is shown - a crowd holds an American flag aloft and someone sets it on fire] All over the Middle East, Muslims are burning American flags and Family Guy posters. Muslim terrorist al-Zawahri made this statement:"
    },
    {
        "character": "al-Zawahri",
        "line": "[translated] We are so super pissed off at 'Family Guy'. 'Family Guy' isn't even that funny of a show. A jihad on 'Family Guy', and the 'Family Guy' nation!"
    },
    {
        "character": "Linda",
        "line": "So what happens now?"
    },
    {
        "character": "Randy",
        "line": "We stay here through the night, wait it out to see if they do anything. If we're still alive in the morning, [dramatic closeup] then we'll know we're not dead."
    },
    {
        "character": "",
        "line": "South Park, morning. The sky is red as the sun rises. At the South Park Community Center, Mrs. Garrison opens the doors and looks out."
    },
    {
        "character": "Mrs. Garrison",
        "line": "It's okay! [everyone heads out]"
    },
    {
        "character": "Randy",
        "line": "We're alive?? We're alive! [pumps his fists]"
    },
    {
        "character": "Jimbo",
        "line": "[listening in on a boombox] Everyone. Everyone, listen. FOX Network censored the image of Mohammad at the last minute."
    },
    {
        "character": "Crowd",
        "line": "Oh thank God."
    },
    {
        "character": "Randy",
        "line": "Well, it looks like we've dodged a bullet."
    },
    {
        "character": "Stan",
        "line": "They censored the image of Mohammad? How?"
    },
    {
        "character": "Kyle",
        "line": "I TIVO every episode. We can go to my house and see what they did."
    },
    {
        "character": "",
        "line": "Kyle's house, later. Kyle leads the boys to the front door running and opens the door. They all go in"
    },
    {
        "character": "",
        "line": "Kyle's living room. Kyle gets the TiVo remote and gets to work."
    },
    {
        "character": "Kyle",
        "line": "Okay you guys, check it out. [begins scanning the recorded programming]"
    },
    {
        "character": "Cartman",
        "line": "You TiVo every episode of Family Guy?"
    },
    {
        "character": "Kyle",
        "line": "Dude, it's a good show."
    },
    {
        "character": "Stan",
        "line": "Yeah, lots of people like Family Guy."
    },
    {
        "character": "Cartman",
        "line": "Yich. [Kyle has reached his target. The Family Guy living room is shown. Peter is in his armchair, the rest of the family is on the sofa]"
    },
    {
        "character": "Lois",
        "line": "Peter, I can't believe you invited your old high-school sweetheart over for dinner."
    },
    {
        "character": "Peter",
        "line": "You think that's bad? Remember when I auditioned to be David Hasselhoff's car? [flashback #1]"
    },
    {
        "character": "Peter",
        "line": "Hey there, Knight Rider. [Michael Knight climbs onto Peter's shoulders and they're off]"
    },
    {
        "character": "Michael",
        "line": "After those bad guys, KITT! [Peter smiles and his teeth glow like KITT's headlights used to]"
    },
    {
        "character": "Chris",
        "line": "Yeah, but Dad, why would you invite an ex-girlfriend to dinner?"
    },
    {
        "character": "Stewie",
        "line": "Perhaps he wants to make our mother nervous."
    },
    {
        "character": "Peter",
        "line": "Nervous? Like when I had to sell pancakes to the school soccer captain? [flashback #2]"
    },
    {
        "character": "Peter",
        "line": "[rings a doorbell. The captain answers, dressed as Capt. Kirk] Pancakes for you, Captain?"
    },
    {
        "character": "Soccer Captain",
        "line": "I'll be the Captain, and you'll be Tenille. [rushes away and returns with a wig and pale blue dress for Peter to don. Moments later the captain is at a keyboard on the front lawn playing a Captain and Tenille tune as Peter sings]"
    },
    {
        "character": "Peter",
        "line": "Love will keep us together"
    },
    {
        "character": "Kyle",
        "line": "Hehaha, heh."
    },
    {
        "character": "Cartman",
        "line": "Yich."
    },
    {
        "character": "Lois",
        "line": "But Peter, I don't wanna cook dinner for your ex-girlfriend."
    },
    {
        "character": "Peter",
        "line": "Well, maybe we can just have tea."
    },
    {
        "character": "Brian",
        "line": "You mean like the time you had tea with Mohammad, the prophet of the Muslim faith? [flashback #3]"
    },
    {
        "character": "Peter",
        "line": "Come on, Mohammad, let's get some tea. [Mohammad is covered by a black box with the words \"IMAGE CENSORED BY FOX\" printed several times from top to bottom inside the box. They stop at a tea stand.]"
    },
    {
        "character": "Mr. T",
        "line": "Try my \"Mr. T. ...tea.\" [squints]"
    },
    {
        "character": "Peter",
        "line": "Oh boy, was that ever weird. Anyway, I can't believe I invited my old sweetheart to dinner. Huh."
    },
    {
        "character": "Kyle",
        "line": "That's it? That's all they did?"
    },
    {
        "character": "Cartman",
        "line": "Oh man, that's not cool! Seriously, that is not cool."
    },
    {
        "character": "Stan",
        "line": "What? What's the big deal?"
    },
    {
        "character": "Cartman",
        "line": "What's the big deal? You guys, they just made fun of the religion of an entire group of people. [Stan and Kyle look at each other in silence] What, you guys think that's okay?! Do you care at all about people's feelings?!"
    },
    {
        "character": "Kyle",
        "line": "Since when you care about being sensitive to people's religion, Cartman?!"
    },
    {
        "character": "Stan",
        "line": "Yeah, you rip on people's religion all the time!"
    },
    {
        "character": "Cartman",
        "line": "That's different! I'm just a little boy! That's a cartoon! Millions of people watch it! How would you feel, Kyle, if there was a cartoon on television that made fun of Jews all the time?! Huh?!"
    },
    {
        "character": "Kyle",
        "line": "Uhhh..."
    },
    {
        "character": "Cartman",
        "line": "I'm telling you guys, it's wrong! It's WRONG!! [turns and heads for the front door, then turns back and aims his index fingers at the other boys] It's wrong! [opens the door, heads out, and closes it behind him. Kyle's parents walk in from the kitchen with their survival gear]"
    },
    {
        "character": "Sheila",
        "line": "Kyle? Kyle, what are you watching?!"
    },
    {
        "character": "Peter",
        "line": "Hey Brian, this is like the time I got a job as a carrot cake."
    },
    {
        "character": "Sheila",
        "line": "Gaaah! It's Family Guy! Quick, Gerald, do something! [Gerald arrives with a bat and begins bashing the television set to bits]"
    },
    {
        "character": "Kyle",
        "line": "Dad, Dad, Jesus Christ!"
    },
    {
        "character": "Gerald",
        "line": "[stops once the picture is gone] It's okay... it's dead."
    },
    {
        "character": "Sheila",
        "line": "You boys know you're not supposed to watch that careless show!"
    },
    {
        "character": "Kyle",
        "line": "Mom, it was nothing. Mohammad just stood there and then drank some tea."
    },
    {
        "character": "Sheila",
        "line": "You boys don't understand anything! It's obvious that you ALL need Muslim-sensitivity training!"
    },
    {
        "character": "",
        "line": "Mrs. Garrison's class, day. Class is in session, and Mrs. Garrison is at the board"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Welcome to Muslim-Sensitivity Training. It is important for us to understand why the Muslim feel the way they do, and why we can never show an image of Mohammad."
    },
    {
        "character": "Kyle",
        "line": "No, Muslims can't show an image of Mohammad."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Kyle, you're not being very sensitive."
    },
    {
        "character": "Cartman",
        "line": "Yeah, Kyle. Maybe you think this is funny, but the rest of us don't."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Let's all look at why Muslims are upset: [turns and picks up a stick of chalk] First of all, in the Muslim religion, you're not allowed to have what? [no response] Sex. Good. [writes \"NO SEX\" on the board] There's no sex until marriage in the Muslim world. [faces the class] Now, this would be fine except that in the Muslim religion you also can't... Anybody? [no response] Jack off. [writes \"NO JACKING OFF\" on the board] Okay, jacking it is strictly forbidden in the Muslim religion. [faces the class] And what do we know about the places Muslims live? They live in? [no response] Good, sand. [writes \"SAND\" on the board] Now put yourself in the shoes of a Muslim. It's Friday night, but you can't have sex, and you can't jack off. There's sand in your eyes and probably in the crack of your ass, and then some cartoon comes along from a country where people are getting laid, and mocks your prophet. Well you know what? I'd be pretty pissed off too!"
    },
    {
        "character": "Cartman",
        "line": "Mrs. Garrison, that is ignorant and racist! Muslims are mad because of Family Guy, not because they can't jack off! Right, Wendy?"
    },
    {
        "character": "Wendy",
        "line": "[skeptically] ...yeah."
    },
    {
        "character": "Mr. Mackey",
        "line": "[over the school PA system] Attention students: Proceed to the school gymnasium immediately for an emergency announcement!"
    },
    {
        "character": "Stan",
        "line": "The hell's going on now?!"
    },
    {
        "character": "",
        "line": "The school gym, moments later. The teachers gather behind Mr. Mackey and Principal Victoria as Mr. Mackey gets the TV working. The kids enter and are seated on the floor"
    },
    {
        "character": "Principal Victoria",
        "line": "Shh! Quiet, students, quiet!"
    },
    {
        "character": "",
        "line": "SNN special report. A graphic about \"FOX: CENSORED\" is over the reporter's left shoulder"
    },
    {
        "character": "SNN anchor",
        "line": "Once again, we have just learned that the Family Guy episode featuring Mohammad was only Part 1 of a two-parter! And Part 2 is going to air next week, with Mohammad uncensored!"
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Why would they-?"
    },
    {
        "character": "SNN anchor",
        "line": "FOX Studios claims that the Family Guy writing staff has demanded the Mohammad character be seen in full view. [a shot of some townsmen watching the news at the bar] The head of FOX had this to say:"
    },
    {
        "character": "FOX President",
        "line": "Family Guy is our biggest show. If they insist we don't censor their work, then we we can't."
    },
    {
        "character": "Randy",
        "line": "[angrily leaves his bar stool] FAMILY GUY!!! [throws his Corona bottle down; it shatters] I DAMN YOU TO HELL!!!"
    },
    {
        "character": "SNN anchor",
        "line": "Once again, bitter riots have started in the Middle East; this time, even more massive. And terrorist leader al-Zawahri has issued a threat."
    },
    {
        "character": "al-Zawahri",
        "line": "[translated] Seriously, 'Family Guy' isn't even that well written. The jokes are all interchangeable and usually irrelevant to the plot. When this episode airs-our retaliation will be MASSIVE!!!!"
    },
    {
        "character": "Mr. Mackey",
        "line": "Retaliation... Oh my God. M'kay?"
    },
    {
        "character": "",
        "line": "South Park Elementary, afternoon. The kids pour out the front doors"
    },
    {
        "character": "Cartman",
        "line": "Goddamned Family Guy! Now they're just provoking people! It's like they want a holy war!"
    },
    {
        "character": "Stan",
        "line": "Does this mean we don't have school all week?"
    },
    {
        "character": "Cartman",
        "line": "You guys, this is serious! We have to do something!"
    },
    {
        "character": "Kenny",
        "line": "(Like what?)"
    },
    {
        "character": "Cartman",
        "line": "We have to go to the FOX network in L.A. We have to go and... try to get that episode pulled. You guys with me?"
    },
    {
        "character": "Stan",
        "line": "Dude, we can't go anywhere. They've shut down the airports and the buses."
    },
    {
        "character": "Cartman",
        "line": "Then we'll ride our Big Wheels."
    },
    {
        "character": "Stan",
        "line": "To Los Angeles?"
    },
    {
        "character": "Cartman",
        "line": "If that's what it takes, yes! We have to talk to the network! The Family Guy writers aren't gonna back down!"
    },
    {
        "character": "Kyle",
        "line": "Well good for them. They shouldn't! The writers are standing up and saying they aren't going to be intimidated!"
    },
    {
        "character": "Cartman",
        "line": "Intimidated?! Is that what you think this is about, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "All right dude, what the hell has gotten into you?! I don't trust for one second that your sudden concern for the Muslim people is real!"
    },
    {
        "character": "Cartman",
        "line": "All right, fine, Kyle. Forget the Muslim faith for a minute. People can get hurt. If ten people die because Family Guy just had to have their little joke, will you still think it's funny? [Kyle stifles an answer] What if a hundred people died? Will it be funny then, Kyle? [Kyle's jaw drops] I'm going to Los Angeles. I'm gonna do whatever I can to get that episode pulled before this gets out of hand. Somebody has to speak for the Muslim people. Somebody has to speak for what's right. [walks off]"
    },
    {
        "character": "",
        "line": "Kyle's room, night. Kyle's asleep when his father bursts into the room"
    },
    {
        "character": "Gerald",
        "line": "Kyle! Kyle, wake up! [Sheila and Ike follow him in] We have to go! The terrorists are attacking!"
    },
    {
        "character": "",
        "line": "Outside. Terrorists run around with rifles scaring everyone else, but the military gives chase"
    },
    {
        "character": "Kyle",
        "line": "Dad? Are you sure this time?"
    },
    {
        "character": "Gerald",
        "line": "This isn't a joke, Kyle! Bombs have already gone off in six cities!"
    },
    {
        "character": "Kyle",
        "line": "No!"
    },
    {
        "character": "Sheila",
        "line": "Wait a minute! [looks around and drops her stuff] Where's Ike?!"
    },
    {
        "character": "Gerald",
        "line": "[looks around and drops his stuff] He was just here! Ike!"
    },
    {
        "character": "Sheila",
        "line": "Ike! [Kyle goes back through the crowd to look for him]"
    },
    {
        "character": "Kyle",
        "line": "Ike? Iiike! [sees him] Ike! [Ike is heading for the ice cream shop]"
    },
    {
        "character": "Ike",
        "line": "Ice cream. And chocolate."
    },
    {
        "character": "Kyle",
        "line": "Ike! [points left] This way! [a flash of light fills the night, and Kyle shields his eyes from it. A bomb has gone off behind the ice cream shop and the shockwaves spread out, obliterating the row of stores before Ike.] Iiike! [races towards him. Ike is engulfed by the flames, flesh turning to bone]"
    },
    {
        "character": "Ike",
        "line": "[hauntingly] Kyyyle! [Kyle's flesh is consumed by the flames] Nooooo!"
    },
    {
        "character": "Kyle",
        "line": "[sits upright in his bed and is quite awake now. He catches his breath, then leaves his bed to check on Ike. He opens Ike's door and looks in. Ike is sound asleep under his mobile. Kyle lets out a soft sigh of relief]"
    },
    {
        "character": "",
        "line": "Cartman's house, next day. He equips his Big Wheels with whatever he can take to keep him going for the trip to Los Angeles. Cheesy Poofs. Socks. Doughnuts... Kyle stops by on his own Big Wheels"
    },
    {
        "character": "Cartman",
        "line": "Come to try and stop me?! [...a bigger box of Cheesy Poofs...] It isn't gonna work. [...a can of Dr. Pep-er, a can of lemon-lime soda...]"
    },
    {
        "character": "Kyle",
        "line": "I didn't come to stop you. I... I think you're right, Cartman. I want to help you get the Family Guy episode pulled."
    },
    {
        "character": "Cartman",
        "line": "[...Snacky Cakes...] Yeah well, I don't need a partner on this. [...another can of Dr. Pep-er...] Especially one who doesn't trust me. [seals his knapsack shut]"
    },
    {
        "character": "Kyle",
        "line": "Look, Cartman, I don't know what's gotten into you, but... I I think it's pretty amazing. And I think it's real. You have to understand why I didn't believe you before."
    },
    {
        "character": "Cartman",
        "line": "[turns around slowly] Yeah. I do understand, Kyle. I've been doing the wrong things for a long time. Doing things for my own selfish reasons. I just wanna do something right, you know? Just this one time."
    },
    {
        "character": "Kyle",
        "line": "It's a long trip, dude. You're gonna need help. We can try and get the episode pulled together."
    },
    {
        "character": "Cartman",
        "line": "You know we might not even make it into the studio."
    },
    {
        "character": "Kyle",
        "line": "I know. But just like you, I feel like I have to try. People can really get hurt, and a joke just isn't worth that."
    },
    {
        "character": "Cartman",
        "line": "So what made you change your mind?"
    },
    {
        "character": "Kyle",
        "line": "I got some sound advice... from an old friend. [they smile at each other. Cartman turns and hops onto his Big Wheels]"
    },
    {
        "character": "Cartman",
        "line": "Well Kyle, we'd better get going."
    },
    {
        "character": "Kyle",
        "line": "Yeah! [dramatic shots of Cartman getting on his Big Wheels, then of Kyle doing the same]"
    },
    {
        "character": "Cartman",
        "line": "Are you set?"
    },
    {
        "character": "Kyle",
        "line": "I'm set! Let's do this!"
    },
    {
        "character": "Cartman",
        "line": "All right, let's roll! [they ride off, slowly]"
    },
    {
        "character": "",
        "line": "Town meeting in one of the rooms in City Hall. Everyone is talking all at once"
    },
    {
        "character": "Mayor McDaniels",
        "line": "People! People, quiet, please! [the crowd quiets down] We must not panic!"
    },
    {
        "character": "Randy",
        "line": "Well what are we gonna do, Mayor?! Part 2 of the Family Guy episode airs in six days!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "I believe that Professor Thomas from the University has come up with a solution."
    },
    {
        "character": "Prof. Thomas",
        "line": "[steps up to the podium] Thank you, Mayor. [everyone sits] Now look, everyone, Muslim terrorists and extremists are threatening us for what Family Guy is going to do... because they've wrongly grouped us together. Our only hope is to make the Muslim extremists know... that we had no part in the Mohammad episode. That even though the episode aired, we didn't watch it, we didn't hear it, and we didn't talk about it."
    },
    {
        "character": "Jimbo",
        "line": "So how do we do that?"
    },
    {
        "character": "Prof. Thomas",
        "line": "We bury our heads. In sand. [flips a board over to reveal his plan for disavowing any knowledge of the episode] We take twenty to twenty-five dump trucks, fill them with sand from Monarch Lake, and then dump the sand along South Park Avenue. By using approximately eighteen dozen shovels, we can each dig a hole in the sand, stick our heads in the holes, and then have the person to our left bury them. If we can manage to get every person's head buried deep, deep in sand before the Mohammad episode airs, we could avoid looking like we're responsible for any part of this at all."
    },
    {
        "character": "Stephen",
        "line": "No, no, wait a minute, [Mrs. Garrison looks at him] that's ridiculous. [Gerald looks at him] What we need to do is just the opposite. Freedom of speech is at stake here, don't you all see? [makes his way to the board] If anything, we should ALL make cartoons of Mohammad, and show the terrorists and the extremists that we are all united in the belief that every person has a right to say what they want! Look, people, it's... been real easy for us to stand up for free speech lately. For the past few decades we haven't had to risk anything to defend it. But those times are going to come! And one of those times is right now. And if WE... aren't willing to RISK... what we have, then we just believe in free speech, but we don't defend it. [the other people there mull this speech over...]"
    },
    {
        "character": "Randy",
        "line": "I like the sand idea."
    },
    {
        "character": "Mr. Mackey",
        "line": "Yeah, me too."
    },
    {
        "character": "Gerald",
        "line": "Yeah. The sand thing sounds a lot simpler. [everyone else agrees]"
    },
    {
        "character": "Mayor McDaniels",
        "line": "We're gonna need eight dozen shovels and sixteen tons of sand! Let's move, people!"
    },
    {
        "character": "",
        "line": "Out in the desert during the day, Cartman and Kyle ride along. Cars pass them by"
    },
    {
        "character": "Kyle",
        "line": "We got six days to make it to Los Angeles. If we keep our stops to a minimum, we should be able to get the episode pulled just in time."
    },
    {
        "character": "Cartman",
        "line": "Yes, and in just a few weeks from now, Family Guy will be off the air forever."
    },
    {
        "character": "Kyle",
        "line": "[puzzled] Off the air? But... we're just going to try to get the Mohammad episode pulled."
    },
    {
        "character": "Cartman",
        "line": "It's simple television economics, Kyle. All it takes to kill a show forever is get one episode pulled. If we convince the network to pull this episode for the sake of Muslims, then the Catholics can demand a show they don't like get pulled. And then people with disabilities can demand another show get pulled. And so on and so on, until Family Guy is no more! It's exactly what happened to Laverne & Shirley."
    },
    {
        "character": "Kyle",
        "line": "[races ahead] Whoa whoa wait a minute! [pulls a hand brake so as to block Cartman, then gets off his Big Wheels] This isn't what I signed up for! I like Family Guy. Why do we have to get it off the air forever?"
    },
    {
        "character": "Cartman",
        "line": "Because they made f-fun of Muslims, and and that's wrong."
    },
    {
        "character": "Kyle",
        "line": "But that doesn't mean it has to go off the air. You should like that show. Your sense of humor is just like Family Guy."
    },
    {
        "character": "Cartman",
        "line": "[gets off his Big Wheels, his anger sudden and strong, and walks up to Kyle] Don't you EVER, EVER, compare me to Family Guy! You hear me Kyle??!! Compare me to Family Guy again, and so help me I will kill you where you stand! [turns and goes back to his Big Wheels]"
    },
    {
        "character": "Kyle",
        "line": "[realizes Cartman's true intent] You unbelievable son of a bitch. You never cared about the Muslim religion. Or the safety of people in America. You just want Family Guy off the air."
    },
    {
        "character": "Cartman",
        "line": "Do you have any idea what it's like?! Everywhere I go, \"Hey Cartman, you must like Family Guy, right?\" \"Hey, your sense of humor reminds me of Family Guy, Cartman.\" [turns and faces Kyle] I am NOTHING like Family Guy! When I make jokes, they are inherent to a story! Deep, situational and emotional jokes based on what is relevant and has a POINT! Not just one interchangeable joke after another!!"
    },
    {
        "character": "Kyle",
        "line": "What are you talking about?!"
    },
    {
        "character": "Cartman",
        "line": "YOU DON'T UNDERSTAND!"
    },
    {
        "character": "Kyle",
        "line": "I can't believe I let you scare me into taking your side. You used fear to make me stop believing in free speech."
    },
    {
        "character": "Cartman",
        "line": "Well... I guess you won't be helping me now. No biggie. I don't NEED you to get the episode pulled! [begins to walk towards his Big Wheels]"
    },
    {
        "character": "Kyle",
        "line": "No! [moves to stop Cartman in his tracks] I am NOT letting you go to that television studio and pretend... to care about safety and sensitivity to get a show you don't like off the air!"
    },
    {
        "character": "Cartman",
        "line": "Well then Kyle, I guess we- ...Oh my God, is that Tim McGraw?"
    },
    {
        "character": "Kyle",
        "line": "[turns around to see] What? [Cartman shoves him to the ground from behind and quickly gets on his Big Wheels, and peels away. Kyle gets up] CARTMAN! [gets on his Big Wheels and gives chase.]"
    },
    {
        "character": "",
        "line": "The highway. Kyle catches up to Cartman and then tries to run him off the road. Cartman recovers and Kyle tries again. Cartman pulls ahead and Kyle works on one of Cartman's back tires with his big front one. That gets Cartman to fishtail back and forth"
    },
    {
        "character": "Cartman",
        "line": "Kyle, stop it!"
    },
    {
        "character": "",
        "line": "Cartman pulls ahead. Kyle can't catch up. A car goes by, and then Cartman gets an ingenious idea. He crosses the sandy median and continues down the highway the wrong way. Kyle decides to catch up with Cartman, so he crosses the median as well and pops up behind Cartman. Cartman looks over his shoulder at Kyle, then looks ahead, then looks in disbelief as a tanker truck barrels towards them"
    },
    {
        "character": "Cartman",
        "line": "Holy Crap! [swerves to the right]"
    },
    {
        "character": "Kyle",
        "line": "Ahhh!"
    },
    {
        "character": "",
        "line": "Kyle swerves to his left. The truck rolls by between them. The two of them line up again and continue riding. They pass a patrol car, which turns on its sirens and follows them. Both bikes and the cruiser fishtail down the highway"
    },
    {
        "character": "Trooper",
        "line": "Stay on 'em! [the fishtailing continues, but the patrol car loses control] Jesus, Mary! [the car falls back into the median, flips over backwards, and falls apart. Cartman and Kyle continue on as fast as possible towards the setting sun]"
    },
    {
        "character": "",
        "line": "South Park, next day. The sand has been brought in and is now being spread out, Mr and Mrs Tucker walk by with their son Craig; Mr Tucker holds a shovel"
    },
    {
        "character": "Prof. Thomas",
        "line": "If you have children, be sure to bury their heads in the sand before you bury your own. [the camera pans across as a row of residents already has their heads buried, with snorkels in place for undisturbed breathing. The camera stops at Stan.]"
    },
    {
        "character": "Stan",
        "line": "Dad, I don't wanna bury my head in the sand."
    },
    {
        "character": "Randy",
        "line": "It's the best say, Stanley. Did you eat your Fruit Roll-Up?"
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Randy",
        "line": "All right, make sure your snorkel is working. [Stan slips it on] All right, now get your head in the hole."
    },
    {
        "character": "Stan",
        "line": "Dad, this is stupid."
    },
    {
        "character": "Randy",
        "line": "Stanley, there's no time for your immaturity! Do it! [Stan dips his head into the hole and Randy quickly buries it] All right Sharon, now do me. [gives the thumbs-up sign, puts on the snorkel, and dips his head in the hole. Sharon buries his head]"
    },
    {
        "character": "Jimbo",
        "line": "[approaches Prof. Thomas with Mrs. Garrison] Uh Professor, we all just thought of somethin'. If everyone has their head buried by the person standing to their left, then who's gonna bury the last person's head?"
    },
    {
        "character": "Prof. Thomas",
        "line": "Yes. I'm afraid one person is going to have to be last, and... not have his head in the sand."
    },
    {
        "character": "Farmer",
        "line": "[steps forward through the crowd] I'll do it."
    },
    {
        "character": "Wife",
        "line": "[appears and tries to stop him] Dylan, no!"
    },
    {
        "character": "Prof. Thomas",
        "line": "You realize by not burying your head in sand, you'll appear to be a part of the Family Guy audience."
    },
    {
        "character": "Dylan",
        "line": "Yes, I know."
    },
    {
        "character": "Wife",
        "line": "Dylan, please, you can't!"
    },
    {
        "character": "Dylan",
        "line": "Somebody has to do it, Sarah. [strokes her hair and face] You run along now and you get your head in the sand. I'll be all right. [she looks at him, then cries uncontrollably into his shoulder. He looks at the professor] You have to understand... I'm all she has. [the other townsfolk look on for a few seconds]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[to Jimbo] Who are those people?"
    },
    {
        "character": "",
        "line": "The Highway. Cartman and Kyle continue racing towards Los Angeles. Kyle is closing in. Cartman looks back and opens his knapsack, unleashing everything he packed in there. Kyle gamely swerves to avoid it all. Cartman opens the big box of Cheesy Poofs and pours out the contents"
    },
    {
        "character": "Kyle",
        "line": "[begins losing control] No! [his Big Wheels go left and he can't brake] AAAAH! [he jumps off as he nears the edge of a cliff] AAAAH! [the Big Wheels goes over the edge and starts bouncing down the side of the cliff. At the first bounce, a rear wheel comes off. At the second bounce, Kyle's knapsack flies off. The rest bounces a few more times until it reaches the ground below, upside down. The Big Wheels explode. Kyle rises and looks down at the wreckage. He nurses an injured right shoulder]"
    },
    {
        "character": "Cartman",
        "line": "Hahahaha! So long, Kyle!"
    },
    {
        "character": "Kyle",
        "line": "You son of a bitch! I won't let you win! You hear me?!"
    },
    {
        "character": "Cartman",
        "line": "[riding into the distance] Suck mah balls, Kyle! [Kyle sobs a little, then pounds his left fist into the sand along the side of the highway]"
    },
    {
        "character": "",
        "line": "FOX STUDIOS, a heliport. A government helicopter emblazoned with the Presidential seal descends onto the heliport. FOX executives come out to greet the visitors. President Bush and Condoleeza Rice exit the helicopter with two Secret Service agents flanking them"
    },
    {
        "character": "President Bush",
        "line": "Are you the network president?"
    },
    {
        "character": "FOX President",
        "line": "Yes, Mr. President."
    },
    {
        "character": "President Bush",
        "line": "We need to discuss this Family Guy episode, Mr. President."
    },
    {
        "character": "FOX President",
        "line": "Mr. President, my hands are tied. The Family Guy writers insist I don't censor Mohammad."
    },
    {
        "character": "President Bush",
        "line": "But Mr. President, this is a matter of national security. They must be reasoned with."
    },
    {
        "character": "FOX President",
        "line": "Mr. President, there's something about the Family Guy writing staff I think you should know. [a close-up of Bush looking perplexed.]"
    },
    {
        "character": "",
        "line": "End sequence. Cartman sneaks out from behind the Family Guy Studios sign with a gun and runs up to the front doors. He enters the writing room..."
    },
    {
        "character": "Announcer",
        "line": "Next week on South Park: The race continues. Cartman reaches the Family Guy Studio and learns the shocking secret behind the Family Guy writing staff."
    },
    {
        "character": "Cartman",
        "line": "[...and reaches a slow, undulating glowing light, judging from the reflection coming off him] This... explains everything."
    },
    {
        "character": "Announcer",
        "line": "As an entire nation buries its head in sand... [a city is shown with sand everywhere, with heads buried in the sand, snorkels out]"
    },
    {
        "character": "SNN anchor",
        "line": "The idea has swept the nation! But where will we find enough sand for everyone?"
    },
    {
        "character": "Announcer",
        "line": "...and the battle between Good and Evil is finally waged..."
    },
    {
        "character": "Cartman",
        "line": "[he and Kyle fight in a burning studio] Kyle, quit it! Stop it, Kyle!"
    },
    {
        "character": "Announcer",
        "line": "Will the cartoon be allowed to appear uncensored? Will Family Guy be destroyed??? Will television executives fight for free speech? Or will Comedy Central puss out? Tune in to see Part 2 of Family Guy, next week, on South Park!"
    }
]