[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "P.F Chang's China Bistro, night. A waiter arrives at a table"
    },
    {
        "character": "Waiter",
        "line": "Hi, welcome to P.F Chang's. How spicy would you like me to make your Chang sauce?"
    },
    {
        "character": "Head waiter",
        "line": "Chris, the people at Table 3 need their check."
    },
    {
        "character": "Chris",
        "line": "[whispers] I know. I'm swamped. I've got no help here!"
    },
    {
        "character": "Head waiter",
        "line": "Well what about the new waiter?"
    },
    {
        "character": "Chris",
        "line": "The new waiter is useless. And, I think he's high."
    },
    {
        "character": "Towelie",
        "line": "[at another table, mixing sauce...] How spicy would you like your Chang sauce?"
    },
    {
        "character": "Male diner",
        "line": "Will you just place our order, please?"
    },
    {
        "character": "Towelie",
        "line": "Oh man, I have no idea what's goin' on."
    },
    {
        "character": "Head waiter",
        "line": "Everything okay here?"
    },
    {
        "character": "Male diner",
        "line": "Fine, except this towel has been mixing Chang sauce for fifteen minutes. He's clueless!"
    },
    {
        "character": "Towelie",
        "line": "Don't call me shoeless! You're shoeless!"
    },
    {
        "character": "Male diner",
        "line": "Yeah? Well you're a towel!"
    },
    {
        "character": "Towelie",
        "line": "You're a towel!"
    },
    {
        "character": "Head waiter",
        "line": "All right, that's it! Get out of here! You're fired!"
    },
    {
        "character": "Towelie",
        "line": "Yeah!"
    },
    {
        "character": "Head waiter",
        "line": "Not him, you!"
    },
    {
        "character": "Towelie",
        "line": "Awww."
    },
    {
        "character": "",
        "line": "The sidewalk outside P.F. Chang's. Towelie walks towards the camera, dejected"
    },
    {
        "character": "Towelie",
        "line": "Aw man, I really screwed up this time. The rent's due at the end of the month, and I don't have any money. I need to shape up and find a new job, quick. [stops] But first, maybe I'll get a little high. [pulls out a lighter and joint, and lights up. His eyes change color from white to pink] Wait. Here it goes. Good ideas comin'. Yeah. Hey yeah! I should become a writer! If I just write a book about my life, I can get it published and then make plenty of money to pay rent."
    },
    {
        "character": "",
        "line": "Towelie, at home, night. He gets to work at an old typewriter: he puts a paper in and rolls it into place."
    },
    {
        "character": "Waiter",
        "line": "Hi, welcome to P.F Chang's. How spicy would you like me to make your Chang sauce?"
    },
    {
        "character": "Head waiter",
        "line": "Chris, the people at Table 3 need their check."
    },
    {
        "character": "Chris",
        "line": "[whispers] I know. I'm swamped. I've got no help here!"
    },
    {
        "character": "Head waiter",
        "line": "Well what about the new waiter?"
    },
    {
        "character": "Chris",
        "line": "The new waiter is useless. And, I think he's high."
    },
    {
        "character": "Towelie",
        "line": "[at another table, mixing sauce...] How spicy would you like your Chang sauce?"
    },
    {
        "character": "Male diner",
        "line": "Will you just place our order, please?"
    },
    {
        "character": "Towelie",
        "line": "Oh man, I have no idea what's goin' on."
    },
    {
        "character": "Head waiter",
        "line": "Everything okay here?"
    },
    {
        "character": "Male diner",
        "line": "Fine, except this towel has been mixing Chang sauce for fifteen minutes. He's clueless!"
    },
    {
        "character": "Towelie",
        "line": "Don't call me shoeless! You're shoeless!"
    },
    {
        "character": "Male diner",
        "line": "Yeah? Well you're a towel!"
    },
    {
        "character": "Towelie",
        "line": "You're a towel!"
    },
    {
        "character": "Head waiter",
        "line": "All right, that's it! Get out of here! You're fired!"
    },
    {
        "character": "Towelie",
        "line": "Yeah!"
    },
    {
        "character": "Head waiter",
        "line": "Not him, you!"
    },
    {
        "character": "Towelie",
        "line": "Awww."
    },
    {
        "character": "",
        "line": "The sidewalk outside P.F. Chang's. Towelie walks towards the camera, dejected"
    },
    {
        "character": "Towelie",
        "line": "Aw man, I really screwed up this time. The rent's due at the end of the month, and I don't have any money. I need to shape up and find a new job, quick. [stops] But first, maybe I'll get a little high. [pulls out a lighter and joint, and lights up. His eyes change color from white to pink] Wait. Here it goes. Good ideas comin'. Yeah. Hey yeah! I should become a writer! If I just write a book about my life, I can get it published and then make plenty of money to pay rent."
    },
    {
        "character": "",
        "line": "Towelie, at home, night. He gets to work at an old typewriter: he puts a paper in and rolls it into place."
    },
    {
        "character": "Towelie",
        "line": "I bet people can't wait to read my memoirs. [begins to type]"
    },
    {
        "character": "",
        "line": "A publisher's office, day. The publisher reviews the first draft Towelie brings in"
    },
    {
        "character": "Publisher 1",
        "line": "Aha. Mmm. Yes. Yes, I see. Well, that's quite a fascinating story, you being engineered as a towel with a computer chip that determines dryness."
    },
    {
        "character": "Towelie",
        "line": "Yep! And it's all true."
    },
    {
        "character": "Publisher 1",
        "line": "Chapters 4 through 8, however, seem to all be about Doritos Brand Corn Chips."
    },
    {
        "character": "Towelie",
        "line": "I guess I could edit those chapters down some."
    },
    {
        "character": "Publisher 1",
        "line": "Don't bother. I'm sorry to tell you this, sir, but nobody's ever going to publish your memoirs."
    },
    {
        "character": "Towelie",
        "line": "Huh? Why not?"
    },
    {
        "character": "Publisher 1",
        "line": "Well, just the small trivial fact that... people aren't interested in autobiographies of towels."
    },
    {
        "character": "Towelie",
        "line": "Wull yeah, but, maybe people will read my memoirs and like, apply its lessons to their own lives."
    },
    {
        "character": "Publisher 1",
        "line": "No. They won't. Because they're people. And you're a towel."
    },
    {
        "character": "Towelie",
        "line": "You're a towel!"
    },
    {
        "character": "Publisher 1",
        "line": "No. I'm a big book publisher who's not the least bit interested in your stony memoirs. You're a towel."
    },
    {
        "character": "",
        "line": "Porcupine Press, day. Towelie leaves the building"
    },
    {
        "character": "Towelie",
        "line": "Now what am I gonna do? I gotta pay rent and I just wasted three weeks writin' my memoirs. It's time for me to stop bein' so irresponsible. I've gotta shape up, focus, an' come up with real solutions to my problems. [pulls out his joint and lighter again] I'd better get a little high. [strikes the flint once, but doesn't light the joint] Oh, maybe I shouldn't."
    },
    {
        "character": "Joint",
        "line": "But you have to think of somethin' fast, an' gettin' high makes you smart."
    },
    {
        "character": "Towelie",
        "line": "All right, I'll just use my special gettin'-high powers one more time. [lights the joint and sucks some fumes in. His eyes turn pink again] Hey. Hey, wait a minute. Of course! That's it! Why didn't I think of it before? [grins a small grin]"
    },
    {
        "character": "",
        "line": "\"A MILLION LITTLE FIBERS\""
    },
    {
        "character": "",
        "line": "The page turns and the Chapter 1 is shown"
    },
    {
        "character": "Towelie",
        "line": "[in the stacks of a library, he proof-reads] All my life I've been a pretty irresponsible towel. [crosses out \"towel\" and writes] person. I thought I was somehow stronger and more immune than other towels. [crosses out \"towels\" and writes] people. [the next sentence reads \"But as I pursued my derelict...\"] This is a really good idea."
    },
    {
        "character": "",
        "line": "Another publisher's office, day. The publisher reads"
    },
    {
        "character": "Publisher 2",
        "line": "Ogh. Oh my God. Uh I could not believe a human being has led this kind of life, Mr...!"
    },
    {
        "character": "Towelie",
        "line": "[wears a small fedora and fake mustache] McTowelie. Steven McTowelie."
    },
    {
        "character": "Publisher 2",
        "line": "It's heartbreaking passages like this one: \"I am a person who often gets hung out to dry by all those around me.\" I know this company would be honored to publish this book. I just have one small question first. You're not... a towel, are you?"
    },
    {
        "character": "Towelie",
        "line": "...No. If I was a towel, why would I be wearin' this hat, an' this fake mustache?"
    },
    {
        "character": "Publisher 2",
        "line": "Right, I'm sorry. [rises] Well Steveen, if it's all right with you, I'm gonna to get our agents and lawyers on the phone right now. We're in business, sir."
    },
    {
        "character": "Towelie",
        "line": "[quite pleased] All right!"
    },
    {
        "character": "",
        "line": "Oprah. Her splash screen comes on, the studio audience cheers"
    },
    {
        "character": "Oprah",
        "line": "Thank you so much. [the applause dies down] Once in a while I come across a book that is sooo honest and sooo moving that it changes my life. [holds up a book] \"A Million Little Fibers\" is the true story about a man who was born in a laboratory. Please welcome author Stevem McTowelie! [she fairly sings his last name. Towelie comes out to cheers from the audience and climbs onto the sofa with some difficulty] Steven, when I read your book, I thought to myself, \"How can a human being go through all this and still turn out okay?\""
    },
    {
        "character": "Towelie",
        "line": "Well, I guess I'm just an extra-special tow- [stops himself] person."
    },
    {
        "character": "Oprah",
        "line": "You talk in your book how you would sometimes have to spend days hung up on a rack. What would that do to you emotionally? You have been through... so much, [the camera pans down to her crotch] and I think that people all over America could benefit..."
    },
    {
        "character": "Her crotch",
        "line": "[in one UK accent] Oh God, there she goes again, babblin' about people's lives and carryin' on. She hasn't paid any attention to me in years!"
    },
    {
        "character": "Oprah",
        "line": "...a life that kept getting up whenever it was down..."
    },
    {
        "character": "Her crotch",
        "line": "Nobody knows what it's like to be Oprah's minge. All she does is work, never gives her ol' minge a nice rub now and again. A minge needs attention! At least a scratch once in a while!"
    },
    {
        "character": "Oprah",
        "line": "Well Steven, your book hasn't sold a lot of copies yet, but I have some pretty exciting news for you!"
    },
    {
        "character": "Mingie",
        "line": "Used to be a time when Oprah would play with me night and day. She'd pet me for hours usin' every finger. Now I just sit here, in the dark, not even so much as a pinky! I should write a book! Be much more depressin' than his!"
    },
    {
        "character": "Oprah",
        "line": "And so, Steven, I'm making your book my official Book of the Month selection! [sing-song ending]"
    },
    {
        "character": "Towelie",
        "line": "Really? [the audience cheers] Wow. I'm gonna get super-rich now."
    },
    {
        "character": "",
        "line": "The book goes into mass circulation, the presses printing, cutting and binding at a fast pace. The paper cover goes on last, and the new book drops through a trap floor into a waiting cardboard box with more copies of the book within. The cover is shown and the box closed and shipped out. Next, Towelie is at a book-signing at Frontier Books autographing the books of a line of waiting readers. Posters promoting his book appear on the sides of buses, another shot of Towelie signing books at Frontier as dollar signs float by, a man checking the book out through a window at Tiara Books, shoppers buying the book at Barnes & Legal as Towelie floats by with his bong"
    },
    {
        "character": "",
        "line": "Oprah's office. She has a lovely Persian rug there."
    },
    {
        "character": "Oprah",
        "line": "[talking to her programming people] Uh huh, okay. Well listen, maybe we can get her in as a guest on the 19th. All right, is John Travolta available to be a guest the week after that? Okay, that might work better since it's Sweeps Week."
    },
    {
        "character": "Mingie",
        "line": "Can't take it anymore. All she ever does is work work work, never pays attention to the ol' minge. I'm always trapped in these stuffy pantsuits. I want attention! I'm bloody bored!"
    },
    {
        "character": "A voice",
        "line": "[in a different UK accent] Oh stop your complainin'! I'm tryin' to sleep back here."
    },
    {
        "character": "Mingie",
        "line": "Ay, 'oo's that? Is that you, Gary?"
    },
    {
        "character": "Gary",
        "line": "Yes it's me. You think you've go' it bad? Oprah hasn't paid any attention to me in years."
    },
    {
        "character": "Mingie",
        "line": "Oh, what do you care? You're just an asshole. I'm a minge! Minges need stimulation."
    },
    {
        "character": "Gary",
        "line": "Assholes need stimulation too, you bastard! I want to travel. I want to see Paris. I thought lamp was goin' to get better, but Oprah's always busy. Werkin' and werkin', diyatin' and not diyatin'. I need a pukin' up mounds of chocolate cake or teaspoons of weedgrass."
    },
    {
        "character": "Mingie",
        "line": "She's a workaholic. Let's face it: the only way we're ever goin' tuh get any attention is if Oprah doesn't work anymore."
    },
    {
        "character": "Gary",
        "line": "Well that'll never happen."
    },
    {
        "character": "Mingie",
        "line": "Not unless she gets fired."
    },
    {
        "character": "Gary",
        "line": "[wonders] Fired... You got a plan, Mingie?"
    },
    {
        "character": "Mingie",
        "line": "That bloke on the show today, the one Oprah supported. 'E isn't a bloke at all. 'E's a towel."
    },
    {
        "character": "Gary",
        "line": "Ooo. How d'you know?"
    },
    {
        "character": "Mingie",
        "line": "[low, ominous voice] I'm a minge. Minges know a towel when they hear one. If evidence gets out that Oprah's champion author is a towel, she'll look right foolish. Fans'll start droppin' off by the millions."
    },
    {
        "character": "Gary",
        "line": "'Ow do we get proof?"
    },
    {
        "character": "Mingie",
        "line": "We get somebody else to do it. The greatest investiga'ive reporter of our time."
    },
    {
        "character": "",
        "line": "Geraldo Rivera's office, evening. Geraldo is busy writing up a report"
    },
    {
        "character": "Butler",
        "line": "Mr. Rivera."
    },
    {
        "character": "Geraldo",
        "line": "What is it, Dimitri?"
    },
    {
        "character": "Dimitri",
        "line": "There's somebody on the phone to speak with you. He says he has inside information for you that may discredit Oprah Winfrey. [Geraldo stops, rises, and goes into his private offce, where he answers the phone]"
    },
    {
        "character": "Geraldo",
        "line": "[sits down] Thith ith Geraldo."
    },
    {
        "character": "Mingie",
        "line": "[somehow on the phone] 'Allo 'Eraldo. I've got some information for you ya might find interestin'. It could make Oprah Winfrey look quite foolish."
    },
    {
        "character": "Geraldo",
        "line": "Who am I thpeaking with?!"
    },
    {
        "character": "Gary",
        "line": "'E wants to know who 'e's speakin' with."
    },
    {
        "character": "Mingie",
        "line": "Let's just say I work very closely with Oprah. You'd like to see 'er discredited, wouldn't ya?"
    },
    {
        "character": "Geraldo",
        "line": "[his left hand spread out over his chest] What information do you have?"
    },
    {
        "character": "Mingie",
        "line": "What'd 'e say?"
    },
    {
        "character": "Gary",
        "line": "He wants to know what information we have."
    },
    {
        "character": "Mingie",
        "line": "Just tell me wha' 'e says, Gary! Don't wait for me 'o ask you \"wha' 'e say?\"!"
    },
    {
        "character": "Gary",
        "line": "Stop wastin' my time."
    },
    {
        "character": "Mingie",
        "line": "Ay, don't get snooty with me, Gary!"
    },
    {
        "character": "Gary",
        "line": "I didn't say \"stop wastin' my time,\" Geraldo did."
    },
    {
        "character": "Geraldo",
        "line": "What ith going on here?!"
    },
    {
        "character": "Mingie",
        "line": "Oh all right Gary, this isn't workin'. Let's switch. I'll listen and you talk. [a few second later]"
    },
    {
        "character": "Gary",
        "line": "Hallo?"
    },
    {
        "character": "Geraldo",
        "line": "Who ith thith?"
    },
    {
        "character": "Gary",
        "line": "This is Gary."
    },
    {
        "character": "Geraldo",
        "line": "Gary who?! What is your last name?!"
    },
    {
        "character": "Mingie",
        "line": "Don't give away your name. We don't want anyone to know where we are."
    },
    {
        "character": "Gary",
        "line": "A'right, look. All you need to know is that I'm definitely not Oprah's asshole."
    },
    {
        "character": "Mingie",
        "line": "Aw you stupid twit!!"
    },
    {
        "character": "Gary",
        "line": "Don't call me a twit, Geraldo!"
    },
    {
        "character": "Mingie",
        "line": "He didn't call you \"stupid twit,\" I did!! Now just tell 'im this:"
    },
    {
        "character": "Gary",
        "line": "The writer of the book on Oprah's Book of the Month Club is a phonih. He's not a person at all. He's a towel."
    },
    {
        "character": "Geraldo",
        "line": "A towel? A talking towel? That doethn't make any thenthe."
    },
    {
        "character": "Mingie",
        "line": "Tell 'im 'e'd be surprised at things that can talk."
    },
    {
        "character": "Gary",
        "line": "You'd be surprised at things that can talk."
    },
    {
        "character": "Geraldo",
        "line": "What proof do you have of this accusation?!"
    },
    {
        "character": "Gary",
        "line": "Just look into the author of \"A Million Little Fiyabers,\" and you'll discover the truth."
    },
    {
        "character": "Geraldo",
        "line": "And how do I go about that? [click, and a dial tone. Geraldo tries to get the caller back on] Hello? HELLO?!"
    },
    {
        "character": "",
        "line": "Larry King Live. The splash screen pops up"
    },
    {
        "character": "Announcer",
        "line": "This is Larry King Live."
    },
    {
        "character": "Larry King",
        "line": "[Towelie is in the guest chair] My guest tonight is Steven McTowelie, author of the acclaimed book, \"A Million LIttle Fibers.\" How are you tonight, Steven?"
    },
    {
        "character": "Towelie",
        "line": "Well Larry, I'm a little high."
    },
    {
        "character": "Larry King",
        "line": "Your book has helped a lot of people beat addiction. What made you write it?"
    },
    {
        "character": "Towelie",
        "line": "Well Larry, I was... really just writin' down my memoirs as I-"
    },
    {
        "character": "Larry King",
        "line": "[holds his left hand up and looks to his director] What? What's that? Oh ex- oh excuse me, Steven, I understand that we have a special report coming in. Joining us live from Afghanistan, here is Geraldo Rivera. [a split screen comes up and Geraldo's feed struggles to come in]"
    },
    {
        "character": "Geraldo",
        "line": "Hello? Larry, are you receiving me?"
    },
    {
        "character": "Larry King",
        "line": "We're here, Geraldo. You're live on the show."
    },
    {
        "character": "Geraldo",
        "line": "Larry, this brave reporter has been days investigating and researching, and I have come up with a shocking discovery that is going to rock the balls and ass of the literary world! Steven McTowelie, author of \"A Million LIttle Fibers,\" is a towel!"
    },
    {
        "character": "Towelie",
        "line": "You're a towel."
    },
    {
        "character": "Geraldo",
        "line": "No, you're a towel."
    },
    {
        "character": "Towelie",
        "line": "Well you're a beaner towel."
    },
    {
        "character": "Geraldo",
        "line": "What did you say??"
    },
    {
        "character": "",
        "line": "Oprah and two agents looks on from her office"
    },
    {
        "character": "Towelie",
        "line": "I'm sorry. I'm high."
    },
    {
        "character": "Aide 1",
        "line": "This looks pretty bad, Oprah."
    },
    {
        "character": "Aide 2",
        "line": "Your fans look to you to be all-knowing and all-seeing, and you've just spent two weeks supporting a lying racist towel."
    },
    {
        "character": "Mingie",
        "line": "'E did it, Gary! 'Eraldo got the proof!"
    },
    {
        "character": "Gary",
        "line": "Oprah's got egg all over her face! She'll have to retire!"
    },
    {
        "character": "Mingie",
        "line": "It's the beginning of a new life for us, Gary. Without 'er career 'o worry about, Oprah's sure to travel the world! Enjoy the finer things in life! She'll spend hours just ... playin' with 'er own minge!"
    },
    {
        "character": "Gary",
        "line": "And her Gary too."
    },
    {
        "character": "Mingie",
        "line": "Sure. And 'er Gary. We did it, mate!"
    },
    {
        "character": "Aide 2",
        "line": "Oprah, we need to know what we're going to do."
    },
    {
        "character": "Oprah",
        "line": "What's the big deal? His book helped people. Why does it matter than he made some stuff up? Are people really going to be that mad?"
    },
    {
        "character": "",
        "line": "A Marryot Hotel, outside, day. Towelie looks down at the crowd from his hotel window. A large group has signs calling hima LIAR and demanding that he be put on trial or punished. More signs demand refunds on the books the bearers bought."
    },
    {
        "character": "Protester 1",
        "line": "Your book got me to give up alcohol! But I thought you were a person!"
    },
    {
        "character": "Protester 2",
        "line": "Yeah, we want our money back, you dumb towel!"
    },
    {
        "character": "Latino Protesters",
        "line": "¡No insultar Mexicanos! ¿Oye? ¡No insultar Mexicanos! ¿Oye?"
    },
    {
        "character": "Towelie",
        "line": "Oh God, I'm really in trouble now. [his phone rings and he answers] Hello?"
    },
    {
        "character": "Oprah",
        "line": "Steven, it's Oprah. Can you come on my show again tomorrow?"
    },
    {
        "character": "Towelie",
        "line": "Why?"
    },
    {
        "character": "Oprah",
        "line": "We need to tell the audience why you changed some of the facts in your book; that you thought it necessary to \"heighten\" certain things to make the book more relevant to people."
    },
    {
        "character": "Towelie",
        "line": "Hey yeah."
    },
    {
        "character": "Oprah",
        "line": "Just come on the show and explain in a very level-headed way that changing some facts shouldn't matter if the book helps people, okay?"
    },
    {
        "character": "Towelie",
        "line": "Okay. Thanks Oprah! You're a real friend."
    },
    {
        "character": "Oprah",
        "line": "See you tomorrow."
    },
    {
        "character": "Towelie",
        "line": "All right, I got one chance here. I need to focus and come up with what I'm gonna say. [gets out his joint and lighter] Maybe I should get a little high. [stops himself] No! Wait a minute! I'm not going to get high this time. [closes his lighter]"
    },
    {
        "character": "Joint",
        "line": "Aw, come on. You need to come up with ideas of what to say on Oprah."
    },
    {
        "character": "Towelie",
        "line": "But, the ideas I come up with when I'm high keep gettin' me in trouble."
    },
    {
        "character": "Joint",
        "line": "Yeah. That's why you should only get a little high."
    },
    {
        "character": "Towelie",
        "line": "Well, maybe just a little high. [lights up and starts tokin']"
    },
    {
        "character": "",
        "line": "Oprah. Towelie returns for a second interview with her"
    },
    {
        "character": "Oprah",
        "line": "Today my guest is once again Steven McTowelie, whose memoirs many of you purchased after I made it my Book of the Month Selection. [a sea of angry faces looks back at the stage]"
    },
    {
        "character": "Mingie",
        "line": "Ya hear that, Gary? Nobody's applaudin'!"
    },
    {
        "character": "Gary",
        "line": "Yeah! They're all right pissed off! This is great!"
    },
    {
        "character": "Oprah",
        "line": "Now, it turns out that your name isn't really Steven. It's Towelie, correct?"
    },
    {
        "character": "Towelie",
        "line": "[sheepishly] Yeah."
    },
    {
        "character": "Oprah",
        "line": "And you are a towel."
    },
    {
        "character": "Towelie",
        "line": "Yes, I'm pretty much a towel, Oprah."
    },
    {
        "character": "Oprah",
        "line": "Can you explain to the audience why you said you weren't a towel before?"
    },
    {
        "character": "Towelie",
        "line": "Well Oprah, I was all, like, um... uh, woo dat all like... It's like..."
    },
    {
        "character": "Oprah",
        "line": "Was it that you thought embellishing the story was okay if it helped people?"
    },
    {
        "character": "Towelie",
        "line": "Yeah. Yeah, that's it!"
    },
    {
        "character": "Oprah",
        "line": "Well you know what I think, Towelie? I think you're a LYING SACK OF SHIT! [the audience is a little shocked] You lied to all these people, and for what??!! To make money!! They bought your book thinking it was true!!"
    },
    {
        "character": "Man 1",
        "line": "That's right!"
    },
    {
        "character": "Man 2",
        "line": "Yeah."
    },
    {
        "character": "Towelie",
        "line": "But I thought you said-"
    },
    {
        "character": "Oprah",
        "line": "How DARE you like to me and make me look foolish?!"
    },
    {
        "character": "Mingie",
        "line": "What's this? What's she doin'?"
    },
    {
        "character": "Gary",
        "line": "I don't understand, Mingie."
    },
    {
        "character": "Oprah",
        "line": "You think writing is a joke, you stupid towel?!"
    },
    {
        "character": "Man 3",
        "line": "Yeah, you you get him, Oprah!"
    },
    {
        "character": "Audience",
        "line": "Yeah!"
    },
    {
        "character": "Oprah",
        "line": "You will not get away with this!"
    },
    {
        "character": "Mingie",
        "line": "She's getting everyone back on er side! Oh, tha' clever cow!"
    },
    {
        "character": "Oprah",
        "line": "You lied to me, Towelie! And therefore you have lied to America! [stands up] We are going to rise up against you! [the audience cheers her on] Is this audience ready for a good old-fashioned lynching?!"
    },
    {
        "character": "Audience",
        "line": "Yeah!"
    },
    {
        "character": "Towelie",
        "line": "Huh?"
    },
    {
        "character": "Oprah",
        "line": "Audience, if you look under your seats, you'll find your very own torches! [the audience members reach down under their seats and pull up the torches they find there]"
    },
    {
        "character": "Audience",
        "line": "Whoa."
    },
    {
        "character": "Gary",
        "line": "Minge, does this mean I have to wait to see Paris?"
    },
    {
        "character": "Mingie",
        "line": "There's not gonna be any Paris! Don't you get it, Gary?! The fat cow get everyone on 'er side again! She'll be workin' more than ever now! Our plan is ruined!"
    },
    {
        "character": "Gary",
        "line": "No!"
    },
    {
        "character": "Oprah",
        "line": "We'll give you a five-second headstart. [lights up her torch] One. Two. [throws away her lighter. Towelie hops off and starts running]"
    },
    {
        "character": "Towelie",
        "line": "Hoooo!"
    },
    {
        "character": "Oprah",
        "line": "Let's get him! [turns right and chases him]"
    },
    {
        "character": "Woman",
        "line": "Burn him! Burn the towel!"
    },
    {
        "character": "Man 4",
        "line": "Burn that which lies to Oprah!"
    },
    {
        "character": "",
        "line": "The Chicago streets. Towelie is running for his life, with Oprah and her audience in hot pursuit. Towelie rounds a corner and enters the First National Bank of Chicago. Towelie tries to get in, but finds he can't open the doors. Oprah and her audience quickly surround him at the doors."
    },
    {
        "character": "Oprah",
        "line": "Looks like your time is up, Towelie! I've led my adoring fans RIGHT to you!"
    },
    {
        "character": "Man 5",
        "line": "All right Oprah!"
    },
    {
        "character": "Oprah",
        "line": "I've shown my fans that... ugh! Ow! Wha?? [her pants rip open over her crotch and a handgun pops out]"
    },
    {
        "character": "Mingie",
        "line": "All right! Everyone back! Get back I said! [takes control of Oprah's body and turns her around. The fans cower]"
    },
    {
        "character": "Oprah",
        "line": "What the hell is this??!!"
    },
    {
        "character": "Mingie",
        "line": "[waves the gun around] Nobody moves, nobody gets hurt!"
    },
    {
        "character": "Gary",
        "line": "Mingie, what're you doin'?"
    },
    {
        "character": "Mingie",
        "line": "Gettin' ou'a here Gary! One way or another! [a police officer shows up, gun at the ready]"
    },
    {
        "character": "Oprah",
        "line": "What is going on??!!"
    },
    {
        "character": "Mingie",
        "line": "[aims the gun at Oprah's head] Shut up! Shut up, you miserable old cow, or so help me I'll blow your brains out! [aims it at the police officer] I want a chooper! You got that?! And a jet waiting at the airport!"
    },
    {
        "character": "Gary",
        "line": "Mingie, have you lost your mind?"
    },
    {
        "character": "Mingie",
        "line": "Come on, Gary! You always said you wanted to see Paris!"
    },
    {
        "character": "Gary",
        "line": "Not like this, Mingie. Not like this!"
    },
    {
        "character": "Officer",
        "line": "[approaching cautiously, ready to fire his gun] All right, gig is up. Put down the gun!"
    },
    {
        "character": "Mingie",
        "line": "Stay back, mate!"
    },
    {
        "character": "Officer",
        "line": "Drop the gun and step away."
    },
    {
        "character": "Mingie",
        "line": "I'm warnin' you!"
    },
    {
        "character": "Officer",
        "line": "[takes a few steps forward] Put it down, I said- [a gunshot hits him in the chest] Augh! [falls onto his knees] Gawhh [falls forward and dies]"
    },
    {
        "character": "Gary",
        "line": "Jesus Minge! You killed him! You shot him dead!"
    },
    {
        "character": "Mingie",
        "line": "No turnin' back now, Gary."
    },
    {
        "character": "Gary",
        "line": "Oh God, I think I'm goinna be sick eh."
    },
    {
        "character": "Mingie",
        "line": "Oh keep your head, Gary."
    },
    {
        "character": "Gary",
        "line": "I can't, uh... I'm goinna puke! [moments later he begins to puke]"
    },
    {
        "character": "Mingie",
        "line": "Ah, Gary, that smells awful! Now I'm gonna throw up! [moments later he begins to puke. Everyone is looking on in amazement. One of the fans begins to move slowly away from Oprah, but Mingie notices and aims the gun at him] Try to leave and I'll shoot you too! You hostages aren't goin' anywhere till we get what we want!"
    },
    {
        "character": "Man 6",
        "line": "Oh my God, what are we goinna do?"
    },
    {
        "character": "Man 7",
        "line": "You got us into this, towel. Think of somethin'!"
    },
    {
        "character": "Towelie",
        "line": "All right, I'm gonna get a little high. [sets up to light the joint, but stops himself again] No! No I'm NOT gonna get high! Every time I get high, I come up with ideas that get me in more trouble. I'm not gettin' high this time!"
    },
    {
        "character": "",
        "line": "HBC World News"
    },
    {
        "character": "Geraldo",
        "line": "I'm standing in the business district of central Chicago, where Oprah's vagina has killed a police officer and taken several people hostage. It is yet unconfirmed but believed that Oprah's asshole may be an accomplice in this as well."
    },
    {
        "character": "SWAT officer 1",
        "line": "Got the walkie-talkie you asked for."
    },
    {
        "character": "Mingie",
        "line": "Put it underneath me. [the SWAT officer bends down and place the walkie-talkie underneath Mingie] Slowly, mate, slowly! [the officer slides it in place] Now back off. [the officer backs away] All right, Gary, squeeze the walkie button. [click] This is Oprah's minge!"
    },
    {
        "character": "Lt. Nelson",
        "line": "Hellow, I'm Lieutenant Nelson. What are your demands?"
    },
    {
        "character": "Mingie",
        "line": "I want a chopper, and a jet waiting at the airport to take us to France! Plus we need some fresh knickers right away."
    },
    {
        "character": "Lt. Nelson",
        "line": "All right, how about fresh underwear for one hostage."
    },
    {
        "character": "Mingie",
        "line": "I'm not playing games with you, mate! Gary's drownin' in his own sick!"
    },
    {
        "character": "Lt. Nelson",
        "line": "All right, we'll work on it. Don't do anything foolish. [turns off the walkie talkie] We don't have any time; this is the most unstable vagina I've ever talked to."
    },
    {
        "character": "SWAT officer 2",
        "line": "O'Reilly, you got a shot?"
    },
    {
        "character": "O'Reilly",
        "line": "[from a nearby rooftop] I got it. [has his sights on Oprah's minge]"
    },
    {
        "character": "Lt. Nelson",
        "line": "[shifting gears] Not with those hostages so close! It's too risky!"
    },
    {
        "character": "Gary",
        "line": "Oh just put down the gun, Mingie. Maybe they'll go easy on us."
    },
    {
        "character": "Mingie",
        "line": "Don't be stupid, Gary. I've got a policeman. They'll fry me, lock you up for life."
    },
    {
        "character": "Gary",
        "line": "[emotional] Aw Mingie, I'm soo scared."
    },
    {
        "character": "Mingie",
        "line": "We're gonna get out of here, mate. Just leave it to me."
    },
    {
        "character": "SWAT officer 3",
        "line": "Oprah's vagina, this is your last warning! Put down the gun!"
    },
    {
        "character": "Mingie",
        "line": "If that chopper isn't here in two minutes, I'm killin' a hostage!"
    },
    {
        "character": "Towelie",
        "line": "Hey wait a minute. [begins to move slowly, then quickly to the bank doors again. He thinks a moment, then slides in under the doors and stands up. He turns around and opens the doors] Pssst! [the hostages look and then move into the bank]"
    },
    {
        "character": "Mingie",
        "line": "I mean it! Hostages are gonna start dyin' if you don't listen! [the hostages run through the bank and out the back doors]"
    },
    {
        "character": "SWAT officer 4",
        "line": "Hostages are clear!"
    },
    {
        "character": "Lt. Nelson",
        "line": "All right, that's it. Take it out! [O'Reilly shoots]"
    },
    {
        "character": "Oprah",
        "line": "AAAAaaah!"
    },
    {
        "character": "Mingie",
        "line": "What the? Haha! You missed me, you stewpid buggers! You see that Gary? They can't even aim!"
    },
    {
        "character": "Gary",
        "line": "[softly] Min... [louder] Mingie."
    },
    {
        "character": "Mingie",
        "line": "Gary, what's, what's wrong?"
    },
    {
        "character": "Gary",
        "line": "They got me, Mingie."
    },
    {
        "character": "Mingie",
        "line": "No... Oh no!"
    },
    {
        "character": "Gary",
        "line": "Aye. They got me bad. Oh, the blood."
    },
    {
        "character": "Mingie",
        "line": "Try to hang on, Gary!"
    },
    {
        "character": "Gary",
        "line": "Ih... It's gettin' dark, Minge."
    },
    {
        "character": "Mingie",
        "line": "Oh Gary! What have I gotten ya into?"
    },
    {
        "character": "Gary",
        "line": "I've seen muh life flash before me eyes. Mingie!"
    },
    {
        "character": "Mingie",
        "line": "I'm 'ere, Gary!"
    },
    {
        "character": "Gary",
        "line": "Where... where are we, Mingie? Are we in Paris?"
    },
    {
        "character": "Mingie",
        "line": "Yeah. Yeah, we're in Paris, mate."
    },
    {
        "character": "Gary",
        "line": "Ahhh... Is it as wonderful as I 'oped?"
    },
    {
        "character": "Mingie",
        "line": "Ih, it's beautiful. We've finally made it!"
    },
    {
        "character": "Gary",
        "line": "Tell me what you see, Mingie."
    },
    {
        "character": "Mingie",
        "line": "[getting emotional] Well, there's the... Eiffel Tower right in front of us. The Louvre, right over there behind ya. And f-fresh baguettes all around."
    },
    {
        "character": "Gary",
        "line": "Ahhh... I can smell them, Mingie. At least I got to see Paris before I- [and no more is heard from him]"
    },
    {
        "character": "Mingie",
        "line": "Gary? Gary, say somethin'. [Gary craps his last, or maybe it's just a final fart] You killed him, you bastards! He didn't even want any part in this! This is all your fault, you stupid cow! You never gave your ol' Gary the time of day and now he's gone! Life ain't worth livin' any more! What's the use?! ...I'm comin' to see you, Gary! [the gun is cocked] I'm comin' to see ya!"
    },
    {
        "character": "Oprah",
        "line": "No! Don't! [the gun goes off. Moments later, Oprah is put on a gurney and wheeled over to a waiting ambulance, and rolled in]"
    },
    {
        "character": "Lt. Nelson",
        "line": "Oprah's going to be okay. Wish I could say the same for her vagina and asshole."
    },
    {
        "character": "Detective",
        "line": "That's a great idea you had to sneak the hostages inside the bank."
    },
    {
        "character": "Man 7",
        "line": "Yeah, it sure was. We're sorry we tried to burn you and murder you before."
    },
    {
        "character": "Towelie",
        "line": "Aw, that's okay. This whole thing was my fault. I learned that I shouldn't get high to come up with ideas. I should come up with ideas and then get high, to reward myself. [whips out his joint and lighter]"
    },
    {
        "character": "Joint",
        "line": "Youuu said it. [Towelie lights it up and chugs away]"
    }
]