[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Scenes from the World of Warcraft are shown. Various beings mill around. The camera pans down and a red-bearded dwarf walks into view."
    },
    {
        "character": "Cartman",
        "line": "[as the dwarf, with mallet] Oh, dude! I just took the biggest crap. Hey-where are you guys?"
    },
    {
        "character": "Kyle",
        "line": "[voice only] We're over here, by the cart. [POV switches to three other characters - a blue knight, a green lady, and an orange knight stand around waiting for the dwarf. The dwarf walks into the group]"
    },
    {
        "character": "Cartman",
        "line": "Okay, I'm back."
    },
    {
        "character": "Stan",
        "line": "[the blue knight, with sword and shield] Dude! We've been waiting forever!"
    },
    {
        "character": "Cartman",
        "line": "Well, I'm sorry, I had to take a dump!"
    },
    {
        "character": "Kyle",
        "line": "[the green lady with big breasts] If you didn't eat so much, you wouldn't have diarrhea all the time, fatass!"
    },
    {
        "character": "Cartman",
        "line": "Hey, I don't need to take any lip from a frickin' girl!"
    },
    {
        "character": "Kenny",
        "line": "[orange knight] [mumbles, then] (I think Kyle has sweet titties, hahahaha)"
    },
    {
        "character": "Cartman",
        "line": "Heheh, totally, heheh."
    },
    {
        "character": "Kyle",
        "line": "Come on, we have to finish the quest in Stonehaven. [walks off, and the others follow]"
    },
    {
        "character": "Randy",
        "line": "[voice only] Stan? [Stan stops] Stan?"
    },
    {
        "character": "Stan",
        "line": "H-hang on, guys, my dad wants something."
    },
    {
        "character": "Randy",
        "line": "Stan!"
    },
    {
        "character": "",
        "line": "Randy's den. Stan removes his headset and furiously glares at Randy."
    },
    {
        "character": "Stan",
        "line": "What?!"
    },
    {
        "character": "Randy",
        "line": "[displeased] You've been on your computer all weekend. Shouldn't you go out and socialize with your friends?"
    },
    {
        "character": "Stan",
        "line": "[swivels around to face his dad] I am socializing, r-tard. I'm logged on to an MMORPG with people from all over the world, and getting XP with my party using TeamSpeak."
    },
    {
        "character": "Randy",
        "line": "[stares, then gets dejected] ...I'm not a r-tard. [turns and leaves. Stan returns to his game]"
    },
    {
        "character": "",
        "line": "World of Warcraft, the land of Azeroth."
    },
    {
        "character": "Stan",
        "line": "All right, sorry guys. So where to now?"
    },
    {
        "character": "Kyle",
        "line": "See where I am? It's this way. [Stan joins the group. Kyle's character turns around, realizes its mistake, and jumps back around]"
    },
    {
        "character": "Cartman",
        "line": "Yeah, come on, let's go! [the four now walk abreast] I am the mightiest dwarf in all of Azeroth!"
    },
    {
        "character": "Kyle",
        "line": "Wow, look at all these people playing right now."
    },
    {
        "character": "Cartman",
        "line": "Yeah, it's bullcrap. I'll bet half of these people are Koreans."
    },
    {
        "character": "Stan",
        "line": "[stops and motions] Oh crap! It's that guy again! [a player approaches them and begins to dance. The character is wearing a helmet, boots, elbow-length gloves, and tight shorts. No shirt, no other armor]"
    },
    {
        "character": "Kyle",
        "line": "Who is this?"
    },
    {
        "character": "Stan",
        "line": "This is the guy that kept killing us after you went to bed!"
    },
    {
        "character": "Cartman",
        "line": "Get out of here, asshole!"
    },
    {
        "character": "Stan",
        "line": "He's a way higher level than us. It isn't fair."
    },
    {
        "character": "Kyle",
        "line": "It's all right. He can't kill us unless we agree to duel. [the ganker jabs at Kenny, who immediately dies.]"
    },
    {
        "character": "Stan",
        "line": "Oh my God, he killed Kenny!"
    },
    {
        "character": "Kyle",
        "line": "[in a soft feminine voice, makes a fist and holds it up for emphasis] You bastard! [the ganker stabs Kyle and then Stan, who both drop and die]"
    },
    {
        "character": "Cartman",
        "line": "Don't you have better things to do than going online killing people?! [the ganker begins generating power] No! I don't want them to start over at the graveyard! [the ganker shoots a fireball at Cartman] No! [the fireball hits and Cartman falls face down and dies.]"
    },
    {
        "character": "",
        "line": "Cartman's room. Cartman looks stunned, then throws down his headset"
    },
    {
        "character": "Cartman",
        "line": "That son of a bitch!"
    },
    {
        "character": "",
        "line": "Gerald's den."
    },
    {
        "character": "Kyle",
        "line": "Who is that guy?"
    },
    {
        "character": "",
        "line": "Randy's den."
    },
    {
        "character": "Stan",
        "line": "[head resting on left hand] Whoever he is, he is one tough badass."
    },
    {
        "character": "",
        "line": "The rogue's apartment. The rogue is actually an obese man who's taken to leaning back and playing WoW. Empty soda cans and candy wrappers litter his pad. A red glow emanates from his computer through a clear side panel. He continues playing while adjusting his glasses"
    },
    {
        "character": "",
        "line": "Blizzard Gaming Entertainment, day, exterior. Lovely architecture."
    },
    {
        "character": "",
        "line": "Blizzard Gaming Entertainment, interior. A pool of telephone representatives fields incoming calls."
    },
    {
        "character": "Rep",
        "line": "[female] World of Warcraft support line."
    },
    {
        "character": "Stan",
        "line": "Yeah, we bought your game, and played it online, but every time we log in, some other player comes in and kills us!"
    },
    {
        "character": "Rep",
        "line": "O..ohhh that shouldn't happen. We designed the game so that players have to agree to a duel before they can kill each other."
    },
    {
        "character": "Stan",
        "line": "Yeah? Well this guy does it anyway!"
    },
    {
        "character": "Cartman",
        "line": "He's a God damned butthole!"
    },
    {
        "character": "Rep",
        "line": "Really? That's odd. [her co-worker approaches. She muffles the mic to talk to him] More people calling in about their characters getting killed. [removes her hand]"
    },
    {
        "character": "Co-Worker",
        "line": "Oh no."
    },
    {
        "character": "Rep",
        "line": "Well, we'll certainly keep a look out for that player and ban him from the network. [She muffles the mic] Better tell the guys upstairs."
    },
    {
        "character": "",
        "line": "Blizzard Gaming Entertainment, executive boardroom."
    },
    {
        "character": "President",
        "line": "Fellow board members, we have a problem: somebody in the World of Warcraft is ignoring the World's rules...and is going around killing innocent players.."
    },
    {
        "character": "Member 1",
        "line": "Why kill innocent players? The game is about finishing quests."
    },
    {
        "character": "Member 2",
        "line": "We've got to delete him from the servers."
    },
    {
        "character": "President",
        "line": "We can't. Whoever this player is, he has played World of Warcraft so much, that he has reached a level we thought unreachable. He's actually able to kill our admins. And he grows stronger every day."
    },
    {
        "character": "Member 3",
        "line": "Jesus..."
    },
    {
        "character": "Jim",
        "line": "[rises from his chair] I've gotta get home! My kids are playing World of Warcraft right now!"
    },
    {
        "character": "President",
        "line": "Jim, your kids' characters are already dead."
    },
    {
        "character": "Jim",
        "line": "No... [sinks back into his seat] No... [frustrated] They just started playing!"
    },
    {
        "character": "Member 2",
        "line": "What kind of person would do this?"
    },
    {
        "character": "President",
        "line": "[walks back to the end of the table, by the doors] Only one kind. Whoever this player is, he has played World of Warcraft nearly every hour of every day for the past year and a half. Gentlemen, we are dealing with someone here who...has absolutely no life."
    },
    {
        "character": "Member 3",
        "line": "How do you kill...that which has no life? [the question hangs there for a long time...]"
    },
    {
        "character": "",
        "line": "USGS. Randy is working in a much better environment now - much more modern office, with several LCD screens around. Randy is online"
    },
    {
        "character": "Nelson",
        "line": "[walks into view] Randy, you workin' on that sediment analysis?"
    },
    {
        "character": "Randy",
        "line": "Not now, Nelson. I just joined a big party of night elves and we're gonna explore the Tower of Azora together."
    },
    {
        "character": "Nelson",
        "line": "[walks up to Randy's desk] Is that a computer game?"
    },
    {
        "character": "Randy",
        "line": "No, r-tard, it's an MMORPG. These are real people I'm playing with. See, I'm a hunter, level 2. [he moves his blond character around] I can chat with all these other people. I can even wave to this guy, see? [demonstrates.] \"Hello.\" [the character waves back] In the outside world, I'm a simple geologist, but in here...I am Falcorn, Defender of the Alliance. I've braved the Fargodeep mine and defeated the Bloodfish at Jarod's Landing. [the griefer returns and stabs Falcorn in the back, killing him, then walks away]"
    },
    {
        "character": "Nelson",
        "line": "Hm. Looks like that guy just killed you. [turns around and walks away]"
    },
    {
        "character": "Randy",
        "line": "What?? Why?? Why?!"
    },
    {
        "character": "",
        "line": "Cartman's basement. Most of the boys in class are seated in chairs, listening to Cartman. In the back row are Tweek, Jimmy, Kevin, and Jason. In the middle row are Clyde, Tolkien, Butters, and Timmy. In the front row are Craig, Stan, Kyle, and Kenny."
    },
    {
        "character": "Cartman",
        "line": "My friends: as you all know, some giant butthole keeps logging onto Warcraft and killing all our characters."
    },
    {
        "character": "Kyle",
        "line": "The past...four nights we've tried to play, he shows up and kills us!"
    },
    {
        "character": "Craig",
        "line": "He killed my character right in the middle of a quest!"
    },
    {
        "character": "Tweek",
        "line": "Mine too!"
    },
    {
        "character": "Cartman",
        "line": "We've learned that the four of us can't fight him alone. But, if we all log in together!, we might have a chance."
    },
    {
        "character": "Tolkien",
        "line": "Hey yeah!"
    },
    {
        "character": "Jimmy",
        "line": "We can really stick it to that assm-m-muncher!"
    },
    {
        "character": "Clyde",
        "line": "Are you guys dumb? We can't beat him, even with all of us. It's a waste of time."
    },
    {
        "character": "Stan",
        "line": "Dude, we have to try."
    },
    {
        "character": "Clyde",
        "line": "I've got better things to do."
    },
    {
        "character": "Cartman",
        "line": "Clyde, Clyde! [moves around his podium to talk to Clyde more directly] If you had a chance right now to go back in time and stop Hitler, wouldn't you do it? [beat] I mean, I personally wouldn't stop him because I think he was awesome, but you would, right?"
    },
    {
        "character": "Clyde",
        "line": "[unshaken] I'm just gonna stop playing."
    },
    {
        "character": "Cartman",
        "line": "When Hitler rose to power there were a lot of people who just stopped playing. You know who those people were? The French! Are you French, Clyde?"
    },
    {
        "character": "Clyde",
        "line": "No."
    },
    {
        "character": "Cartman",
        "line": "Voulez-vous coucher avec moi, Clyde? (Would you like to sleep with me, Clyde?)"
    },
    {
        "character": "Clyde",
        "line": "All right all right, I'll do it!"
    },
    {
        "character": "Jimmy",
        "line": "So what's the p-plan?"
    },
    {
        "character": "Cartman",
        "line": "All right, you all login from your computers at precisely 7:30. [walks up to a map of their quest] We will meet here, on the plains of the elven forest near Westfall. My friends, to victory!"
    },
    {
        "character": "All",
        "line": "To victory!"
    },
    {
        "character": "Butters",
        "line": "I don't play World of Warcraft."
    },
    {
        "character": "Cartman",
        "line": "Butters, you said you were on your computer all the time!"
    },
    {
        "character": "Butters",
        "line": "Yeah, but I'm playing Hello Kitty Island Adventure."
    },
    {
        "character": "Cartman",
        "line": "Butters, go buy World of Warcraft, install it on your computer, and join the online sensation before we all murder you."
    },
    {
        "character": "Butters",
        "line": "O-oh, o-oh, a-alright. All right then."
    },
    {
        "character": "",
        "line": "World of Warcraft, near Westfall. The camera looks upon a meadow, then pans down to show a group of characters. Cartman is marshaling his forces."
    },
    {
        "character": "Cartman",
        "line": "All right, you guys, this is it! When the attack begins, all warriors click on defensive stance. Everyone else, wait for Craig to cast his intellect buff."
    },
    {
        "character": "Tolkien",
        "line": "[playing a black warrior] Okay."
    },
    {
        "character": "Craig",
        "line": "Got it."
    },
    {
        "character": "Cartman",
        "line": "The battle is sure to be long, so make sure you all have your special abilities macroed to your keyboards."
    },
    {
        "character": "Jimmy",
        "line": "All right, Eric. You can c-c-count on us."
    },
    {
        "character": "Timmy",
        "line": "Timmy!"
    },
    {
        "character": "Cartman",
        "line": "This shall be a day for all to remember! Let us bravely charge the fields of Azeroth! [another dwarf walks in looking just like Cartman's dwarf] From with-"
    },
    {
        "character": "Butters",
        "line": "Hey fellas! [Cartman's dwarf looks over] Boy, this is neato, huh?"
    },
    {
        "character": "Cartman",
        "line": "Butters? What the hell are you doing?"
    },
    {
        "character": "Butters",
        "line": "I got World of Warcraft, like you said."
    },
    {
        "character": "Cartman",
        "line": "You can't be the dwarf character, Butters, I'm the dwarf."
    },
    {
        "character": "Butters",
        "line": "Well, there's only like four races to choose from-"
    },
    {
        "character": "Cartman",
        "line": "So pick another one! I'm the dwarf, you stupid asshole! Log out, create a new character, and log back in!"
    },
    {
        "character": "Butters",
        "line": "[walks off grumbling] I like Hello Kitty Island Adventure a lot more 'n this stuff."
    },
    {
        "character": "Stan",
        "line": "Come on, let's do this!"
    },
    {
        "character": "Jason",
        "line": "Yeah, my mom says I have to be in bed at 9:30."
    },
    {
        "character": "Cartman",
        "line": "[turns around and leads] Then let's move out! [the others charge after him]"
    },
    {
        "character": "",
        "line": "A field. The ganker walks along his merry way, but with one armswing he slaughters other players nearby with an energy blast. It's a very effective move."
    },
    {
        "character": "Stan",
        "line": "Look! There he is!"
    },
    {
        "character": "Cartman",
        "line": "Everyone hold! [everyone stops in their tracks. The ganker turns around and faces them.]"
    },
    {
        "character": "Kyle",
        "line": "He's targeting us."
    },
    {
        "character": "Cartman",
        "line": "Prepare to charge! Scroll over him with your mouse cursors! And...Right-click! [that sends the group charging at the ganker, who responds by summoning an army of giant scorpions] What the? Oh Jesus, he summoned scorpions! [the actual rogue player is shown in his apartment, leaning back on his chair and playing without needing to think very much about what to do next. His character and scorpions decimate the group]"
    },
    {
        "character": "Tweek",
        "line": "Aaaa! [his character runs all over the place, with no one offering to smother him and put out the flames] I'm burning! Oh Jesus I'm burning! [a scorpion kills Kenny's character nearby]"
    },
    {
        "character": "Jimmy",
        "line": "Kenny's down. K-k-kenny is down. [Tweek is still burning, running around]"
    },
    {
        "character": "Ike",
        "line": "[purple mage] I'm gonna poop on my pants."
    },
    {
        "character": "Kyle",
        "line": "Ike, look out! [the ganker rushes in and stabs him in the back]"
    },
    {
        "character": "Ike",
        "line": "Aah Kyle! [Ike is out of the game. Stan runs through a group of scorpions]"
    },
    {
        "character": "Cartman",
        "line": "All right, Clyde, hit him with your crossbow! [Clyde's character looks like he's about to aim a crossbow] Hit him now, Clyde! Clyde? Clyde! [Clyde is at his computer, but not participating in the game. He's looking at Playboy centerfolds.] Clyde! Clyde, you asshole! [rushes to join the others] Goddammit we lost Clyde!"
    },
    {
        "character": "",
        "line": "Nearby, Stan is fending off scorpions, and the blond hunter walks up."
    },
    {
        "character": "Randy",
        "line": "Hey, Stan, can I play with you guys? [Stan's character turns around]"
    },
    {
        "character": "Stan",
        "line": "Dad??"
    },
    {
        "character": "Randy",
        "line": "Yeah, I'm playing from the office."
    },
    {
        "character": "Stan",
        "line": "Dad, get off our teamspeak line!"
    },
    {
        "character": "Tolkien",
        "line": "[the ganker kills him] That's it, I'm dead!"
    },
    {
        "character": "Stan",
        "line": "[the ganker kills him. He throws off his headset again] That's it, screw this game!"
    },
    {
        "character": "Cartman",
        "line": "No, leave me alone, don't do- [the ganker stabs Cartman with his dagger through the mallet] god, dugh [Cartman dies, and the ganker skips away. Cartman screams into his mic, then throws down his headset] God-fucking-dammit!!! [meanwhile, in his apartment, the ganker just keeps plugging along.]"
    },
    {
        "character": "",
        "line": "The Blizzard boardroom."
    },
    {
        "character": "Member 3",
        "line": "Oh Jesus...Oh God no..."
    },
    {
        "character": "President",
        "line": "What?"
    },
    {
        "character": "Member 3",
        "line": "He just finished killing every single player in the Arathi Highlands."
    },
    {
        "character": "Member 1",
        "line": "How many people's characters were in there?"
    },
    {
        "character": "Member 2",
        "line": "Over five thousand. [some of the members sit down. Member 1 rises]"
    },
    {
        "character": "Member 1",
        "line": "There are over seven million people who log on to World of Warcraft! Are you telling me all those people's characters are going to die, and there's nothing we can do to save them?"
    },
    {
        "character": "President",
        "line": "Yes. And it won't be long before everyone gets really really frustrated and stops playing altogether. Gentlemen, this could very well lead to the end of the World...of Warcraft."
    },
    {
        "character": "Member 5",
        "line": "[grabs his head] No! Nooooooooo!"
    },
    {
        "character": "",
        "line": "The neighborhood park. Stan, Kyle, and Kenny are playing basketball. Cartman enters the park."
    },
    {
        "character": "Cartman",
        "line": "What the hell are you guys doing?? Don't tell me you all quit playing World of Warcraft too?!"
    },
    {
        "character": "Stan",
        "line": "Dude, we're done. we're sick of getting killed all the time."
    },
    {
        "character": "Cartman",
        "line": "Guys, when things look bad, you can't just give up on the world. Of Warcraft."
    },
    {
        "character": "Kyle",
        "line": "We don't have a choice, dude. That guy killed our characters 14 times."
    },
    {
        "character": "Cartman",
        "line": "I have a solution, you guys. That guy can kill us so easily because he's a super-high level, right? What if we were super-high level too?"
    },
    {
        "character": "Stan",
        "line": "We can't get to a higher level because that dude doesn't let us finish quests!"
    },
    {
        "character": "Cartman",
        "line": "That's why we just need to log in and stay in the forest, killing boars."
    },
    {
        "character": "Kyle",
        "line": "Boars?"
    },
    {
        "character": "Cartman",
        "line": "There's lots of computer-generated boars in Warcraft that die with just one blow."
    },
    {
        "character": "Kyle",
        "line": "Dude, boars are only worth two experience points apiece. Do you know how many we would have to kill to get up 30 levels?"
    },
    {
        "character": "Cartman",
        "line": "Yes. [whips out a sheet full of calculations] Sixty-five million three hundred and forty thousand two hundred and eighty five. Which should take us seven weeks five days thirteen hours and twenty minutes, giving ourselves three hours a night to sleep. What do you say, guys? You can just...you can just hang outside in the sun all day tossin' a ball around, [firmly] or you can sit at your computer and do somethin' that matters."
    },
    {
        "character": "",
        "line": "World of Warcraft. \"Live to Win\" by Paul Stanley begins to play. The four friends are back in the forest looking for boars. They slaughter the boars as they come upon the groups of them. Cartman chugs down energy drinks and has doughnuts and other sweets around his keyboard. He wipes his mouth dry with his jacket sleeve. In the McCormick living room Kenny plays while his parents argue in the background. In Gerald's den, Ike nourishes Kyle on the fly. The days fly by, starting at September 3...During recess and lunch, as the other kids play outside as usual, the boys are at computers at the school's computer lab playing WoW. As Tweek, Craig, Clyde, Kevin, and Tolkien play football in the street outside, Stan plays WoW in his room. Day passes into night and back into day..."
    },
    {
        "character": "Paul Stanley",
        "line": "Live to win, 'till you die, 'till the light dies in your eyes!Live to win, take it all, just keep fighting till you fall!\n\nDay by day, kickin' all the way, I'm not cavin' inLet another round begin, live to winYeah! [...and back into night...Stan's first pimples appear and his face is fatter.]Live! [More pimples appear, and his hair begins to look matted]Yeah!Win! [He's gotten fatter than Cartman normally is, to the point where he's too fat to wear his jacket anymore]\n\n"
    },
    {
        "character": "",
        "line": "The Blizzard boardroom. Executives are monitoring the gameplay."
    },
    {
        "character": "Member 3",
        "line": "Sir, you'd better have a look at this! Four of our subscribers...They've gone up fifty levels in three weeks."
    },
    {
        "character": "President",
        "line": "My God...they must have no lives at all."
    },
    {
        "character": "Member 3",
        "line": "A hope?"
    },
    {
        "character": "President",
        "line": "A chance."
    },
    {
        "character": "Paul Stanley",
        "line": "Live to win, 'till you die, 'till the light dies in your eyesLive to win, take it all, just keep fighting 'till you fallDay by day, kickin' all the way, I'm not cavin' inLet another round begin, live to winLive to winLive to winYeah, win.\n\n"
    },
    {
        "character": "",
        "line": "Kyle's room, 6:30 a.m. He rises from bed, which means he went to bed at 3:30 a.m. He's gotten as big and pimply as Stan. He hops out of bed, heads for his father's den and then to the computer and logs into the game to slaughter more boars."
    },
    {
        "character": "Kyle",
        "line": "Dude, my mouse-clicking finger hurts."
    },
    {
        "character": "Cartman",
        "line": "Keep clicking, Kyle! You can do it!"
    },
    {
        "character": "",
        "line": "Kenny's playing from the living room. Stan is at his dad's computer now, and Randy looks in on him. Stan earns an xp of 142. Cartman has gotten so big he looks like Jabba the Hutt. His fingers are shown up close typing away. Kyle flexes his right wrist and fingers to get circulation back in them, them resumes playing the game. More boar slaughter ensues. Next, Cartman is shown on the toilet crapping away and reading the World of Warcraft game manual. Stan's left hand is shown typing away. Kenny's still at it, but he's not as big as Stan is now. Stan looks like a huge baby...with pimples. Back at school, the boys are back in the computer lab playing away. As the music ends, Cartman raises his fist seemingly in victory"
    },
    {
        "character": "",
        "line": "The Blizzard boardroom, night. The president looks out over the city from the boardroom. He stands at a table in front of the window, on which stand some WoW statuettes."
    },
    {
        "character": "President",
        "line": "The admins tell us they are four players from a small town in Colorado."
    },
    {
        "character": "Member 1",
        "line": "Are they strong enough to defeat the Evil One?"
    },
    {
        "character": "Member 5",
        "line": "[wearing a black T-shirt with the green words \"Dwarf Needs FOOD!\" on it] We ran the numbers: even with their amazing rise in levels, they have a 90% mortality probability. They'd be walking in a slaughter!"
    },
    {
        "character": "Member 1",
        "line": "There has to be...someway we can help them."
    },
    {
        "character": "Member 6",
        "line": "What about...the Sword of a Thousand Truths?"
    },
    {
        "character": "Member 7",
        "line": "Quiet, Thomas! We aren't even to speak of that sword!"
    },
    {
        "character": "Thomas",
        "line": "But maybe these new players are the ones the prophecy foretold of."
    },
    {
        "character": "Member 7",
        "line": "It is not an option!"
    },
    {
        "character": "Member 1",
        "line": "What is this sword?"
    },
    {
        "character": "Member 7",
        "line": "Long ago, when the World of Warcraft was created, one of the programmers put a sword called the Sword of a Thousand Truths into the game inventory."
    },
    {
        "character": "President",
        "line": "Apparently it could cause 120 damage per second, with an instant mana burn and an enchantment that boosts its stamina +80."
    },
    {
        "character": "Member 7",
        "line": "But the sword was considered to be too powerful for anyone to possess. So it was removed from the game and stored on a one-gig flash drive."
    },
    {
        "character": "Thomas",
        "line": "But it was foretold that one day, players who could wield the sword might reveal themselves."
    },
    {
        "character": "Member 1",
        "line": "Who foretold this prophecy?"
    },
    {
        "character": "President",
        "line": "Soltzman. He's an accountant."
    },
    {
        "character": "",
        "line": "The accountants' room, night. The executives open the door and walk in slowly, softly. Member 1 opens the top drawer and pulls out a small safe, gets the key and opens it. The President reaches in side and pulls out the small flash drive."
    },
    {
        "character": "President",
        "line": "Behold, the Sword of a Thousand Truths. [the flash drive gets its close-up] We must get this sword to the ones who have proven they have no life. Let's just hope to Christ they don't start the battle before we can reach them."
    },
    {
        "character": "",
        "line": "Cartman's basement, night. The boys have taken their computers and assembled them in the basement. They are all now connected and online."
    },
    {
        "character": "Cartman",
        "line": "All right, you guys. The Moment of Truth is here. It is time for our final battle. Everyone, log in!"
    },
    {
        "character": "Stan",
        "line": "I'm in."
    },
    {
        "character": "Kyle",
        "line": "Me too."
    },
    {
        "character": "Kenny",
        "line": "(Me too.)"
    },
    {
        "character": "Cartman",
        "line": "[begins to slur his speech ever so slightly, giving it a blasé feel] Everyone equip healing potions to the hotbar if you haven't already. Uh, Kyle, go ahead and cast Arcane Brilliance to raise our intelligence."
    },
    {
        "character": "Kyle",
        "line": "Hang on, I'm chaining my fire spells for max range."
    },
    {
        "character": "Cartman",
        "line": "Nice. Stan, what enchantment does your Cloak of the Tiger have?"
    },
    {
        "character": "Stan",
        "line": " +15 agility."
    },
    {
        "character": "Cartman",
        "line": "Give the cloak to Kenny, he needs the agility boost for bow attacks."
    },
    {
        "character": "Stan",
        "line": "'K."
    },
    {
        "character": "Kyle",
        "line": "Hold on, this fight could last more than twelve hours. What if we run out of food?"
    },
    {
        "character": "Cartman",
        "line": "Don't worry, I have that covered. [pressed a button on a small intercom on his desk] Mom?"
    },
    {
        "character": "Liane",
        "line": "Yes hon?"
    },
    {
        "character": "Cartman",
        "line": "More Hot Pockets!"
    },
    {
        "character": "Liane",
        "line": "[answering at the other end] Right away, hon. [Cartman turns it off]"
    },
    {
        "character": "Stan",
        "line": "That's übercool."
    },
    {
        "character": "Cartman",
        "line": "All right, everyone ready?"
    },
    {
        "character": "Kyle/Stan",
        "line": "Ready."
    },
    {
        "character": "Cartman",
        "line": "Let's go get him! [the battle begins. The rogue is playing with the right hand, eating a cookie with the left.]"
    },
    {
        "character": "Stan",
        "line": "Wait, I think I see him. Yeah, yeah, he's here in Goldshire."
    },
    {
        "character": "Cartman",
        "line": "Okay, everyone open your uplifts and autolocate to Stan."
    },
    {
        "character": "Kyle",
        "line": "What's the autolocate macro?"
    },
    {
        "character": "Cartman",
        "line": "Command-0. [sniffs]"
    },
    {
        "character": "Kyle",
        "line": "Okay, right behind Stan."
    },
    {
        "character": "Cartman",
        "line": "Kenny, get ready to turn on true-shot aura. At that moment, I will use intimidating shout."
    },
    {
        "character": "Stan",
        "line": "Okay, he sees us...He's targeted us."
    },
    {
        "character": "Cartman",
        "line": "Okay, hit him with pyroblast, Kyle."
    },
    {
        "character": "Kyle",
        "line": "Casting...there's an 8-second cast time."
    },
    {
        "character": "Cartman",
        "line": "Aren't you spec'd to reduce cast time?"
    },
    {
        "character": "Kyle",
        "line": "No, ah, I'm an arcane fire mage."
    },
    {
        "character": "Cartman",
        "line": "Christ..."
    },
    {
        "character": "Kyle",
        "line": "Cast on him again."
    },
    {
        "character": "Cartman",
        "line": "Everyone target scorpions."
    },
    {
        "character": "",
        "line": "World of Warcraft, final battle. The four boys are attacking the ganker, who's just defending himself right now, mostly attacking Kenny. Seventeen hours later...the rogue is sitting up, signifying that he's paying attention now that the boys have battled him this long without dying. Meanwhile, the President of Blizzard and Member 1 arrive at Stan's house. Member 1 bangs on the door. The door opens"
    },
    {
        "character": "Randy",
        "line": "Yes?"
    },
    {
        "character": "Member 1",
        "line": "We are looking for a great knight by the name of LovesToSpooge."
    },
    {
        "character": "Randy",
        "line": "That's my son's character's name in Warcraft."
    },
    {
        "character": "President",
        "line": "Where is he?!"
    },
    {
        "character": "Randy",
        "line": "Who are you?"
    },
    {
        "character": "President",
        "line": "Sir, we don't have time! We just heard from our admins that your son's party is already in battle!"
    },
    {
        "character": "Member 1",
        "line": "Unless they have this sword, [pulls out the flash drive] your son's character is going to die!"
    },
    {
        "character": "Randy",
        "line": "[close-up, Randy's eyes widen] Nn-Oh my God! [drops his coffee cup and runs upstairs. The two other men look at each other and follow]"
    },
    {
        "character": "",
        "line": "Back in the World of Warcraft the battle continues."
    },
    {
        "character": "Cartman",
        "line": "Kyle! Fire spell!"
    },
    {
        "character": "Kyle",
        "line": "Aaaa... [starts generating the spell, but it abruptly goes out] AH! Huh?! [his character grabs her right wrist with her left hand]"
    },
    {
        "character": "Stan",
        "line": "Kyle! [Kyle leaves his desk grabbing onto his right hand, then flexes his right wrist around. Stan leaves his desk and approaches him] Kyle! Dude, what's wrong?"
    },
    {
        "character": "Kyle",
        "line": "Carpal tunnel! Carpal tunnel! It's aaaah! [pain shoots through his wrist as he continues flexing his wrist and stretching his fingers]"
    },
    {
        "character": "Stan",
        "line": "Oh, Jesus, he's got it bad! [Cartman walks over]"
    },
    {
        "character": "Cartman",
        "line": "Wait, we need Ben-Gay. [waddles to Kenny's desk desk and pulls out a tube of the stuff, then walks back and squirts some of it onto Kyle's right wrist, then rubs it in.]"
    },
    {
        "character": "Stan",
        "line": "Hurry dude!"
    },
    {
        "character": "Cartman",
        "line": "I'm going as fast as I can!"
    },
    {
        "character": "Stan",
        "line": "Kyle, you have to keep playing."
    },
    {
        "character": "Kyle",
        "line": "I can't. Just leave me behind."
    },
    {
        "character": "Stan",
        "line": "We can't do this without you now! Come on! [he and Cartman help Kyle back to his computer]"
    },
    {
        "character": "",
        "line": "Stan's room. The computer is missing. Randy and the two executives run in"
    },
    {
        "character": "Randy",
        "line": "Stan?! Stan! [turns around and sees Sharon walk by with the laundry] Sharon, where is Stan?!"
    },
    {
        "character": "Sharon",
        "line": "I don't know. He took his computer somewhere to play that stupid online game."
    },
    {
        "character": "Member 1",
        "line": "Stupid?"
    },
    {
        "character": "Randy",
        "line": "Where?!"
    },
    {
        "character": "Sharon",
        "line": "I don't know."
    },
    {
        "character": "Randy",
        "line": "Sharon, his character is going to die if we don't get to him!"
    },
    {
        "character": "Sharon",
        "line": "So what?"
    },
    {
        "character": "The three men",
        "line": "So what?! [Sharon rolls her eyes and walks away]"
    },
    {
        "character": "President",
        "line": "We're too late. Without the sword the players will fail."
    },
    {
        "character": "Member 1",
        "line": "I-if we could get to a computer, we could sign on to the World of Warcraft and give the boys the sword online."
    },
    {
        "character": "President",
        "line": "I don't have a World of Warcraft account. Do you?"
    },
    {
        "character": "Member 1",
        "line": "No, I have a life. [the men fall silent]"
    },
    {
        "character": "Randy",
        "line": "Give me the sword."
    },
    {
        "character": "Member 1",
        "line": "You?"
    },
    {
        "character": "Randy",
        "line": "I have a Warcraft character. I'm a newb, but I can log on and get the sword to Stan online."
    },
    {
        "character": "Member 1",
        "line": "We can't trust the Sword of a Thousand Truths to a newb!"
    },
    {
        "character": "Randy",
        "line": "Sounds to me like we don't have a choice! Give me the sword. [Member 1 kneels and reverently gives the USB drive to Randy. Randy holds it above his head like an actual sword] Ahhhh. Come on, we've got to get to a computer that works! [runs out of the house with the other two men behind him]"
    },
    {
        "character": "",
        "line": "Outside, night, snowing."
    },
    {
        "character": "Randy",
        "line": "Where's your car?"
    },
    {
        "character": "Member 1",
        "line": "We took a cab here!"
    },
    {
        "character": "Randy",
        "line": "Dammit, mine's in the shop! [runs out into the street] Uh hey! Eh help! Stop! [a car slows down] Please, it's an emergency! [the driver opens his door, Randy yanks him out and knocks him out with one punch. Randy and the other two men get in the car and speed away. The driver comes to and looks on. Randy is now on his cell phone] Nelson! Nelson, I need to come over and use your computer! No, I d-I need to play World of Warcraft! NELSON!"
    },
    {
        "character": "",
        "line": "The rogue's apartment, day. He's eating tortilla chips. Part of one falls onto his shirt. He looks at it and scoots it off, then goes back to playing without missing a beat."
    },
    {
        "character": "",
        "line": "Cartman's basement. The boys haven't missed a beat either."
    },
    {
        "character": "Cartman",
        "line": "All right, major stone shield potions should be...Oh God, I'm going to have diarrhea again. Ohhh...Duuuh..."
    },
    {
        "character": "Stan",
        "line": "You can't go to the bathroom, you're stacking sunder armor!"
    },
    {
        "character": "Cartman",
        "line": "It's okay. [clicks on the intercom] Mom? Bathroom!"
    },
    {
        "character": "Liane",
        "line": "What hon?"
    },
    {
        "character": "Cartman",
        "line": "Bathroom! Bathroom! [clicks off. A second later Liane goes into the basement with a bedpan. Cartman senses this and lowers his pants as Liane positions the bedpan in place. Cartman lets go and a log comes out first, followed by a spattering stream of crap. Some of it ends up on the floor, some of it on Liane's blouse. Nasty.]"
    },
    {
        "character": "Liane",
        "line": "Oohh, that's a big boy, isn't he? [walks away with the poop. Cartman lifts his pants back in place without cleaning his ass]"
    },
    {
        "character": "Cartman",
        "line": "All right, Kenny, drink your elixir of the mongoose. I'm now going to use mocking blow."
    },
    {
        "character": "",
        "line": "The road, night. Randy hangs up and rests his cell phone when he notices a Best Buy off to his left. He pulls into the parking lot and runs into the store. He grabs a greeter."
    },
    {
        "character": "Randy",
        "line": "World of Warcraft! I need to play!"
    },
    {
        "character": "Greeter",
        "line": "Our demo is set up right over by the- [Randy runs to the demo. A small boy is playing the game. Randy shoves him off and logs him out.]"
    },
    {
        "character": "Randy",
        "line": "Got to...sign in...character name...All right, I'm in! [puts on the headset]"
    },
    {
        "character": "",
        "line": "Cartman's basement."
    },
    {
        "character": "Stan",
        "line": "Dude, I'm almost dead."
    },
    {
        "character": "Cartman",
        "line": "Kyle, cast arcane missiles!"
    },
    {
        "character": "Kyle",
        "line": "I'm out of mana, I told you."
    },
    {
        "character": "",
        "line": "Within the game."
    },
    {
        "character": "Stan",
        "line": "[his character leaves the battle] I've gotta heal. [his character turns to see the battle]"
    },
    {
        "character": "Randy",
        "line": "Staaan! [Stan's character looks around trying to determine where the voice is coming from, then turns around]"
    },
    {
        "character": "Stan",
        "line": "Dad? Not now!"
    },
    {
        "character": "Randy",
        "line": "Stan! I've been sent here...to bring you this. [holds the Sword of a Thousand Truths aloft] This sword can completely drain his mana."
    },
    {
        "character": "Stan",
        "line": "Dad, how did you get that?!"
    },
    {
        "character": "Randy",
        "line": "No time! Just take it! Here! [the sword stays fixed to his left hand] ...How, how do you hand something from one player to another?"
    },
    {
        "character": "Stan",
        "line": "Bring up your inventory screen: Control-I..."
    },
    {
        "character": "Randy",
        "line": "Okay. [The ganker notices the lull in action and faces Stan. Cartman is alarmed and spins around to look at Stan.]"
    },
    {
        "character": "Cartman",
        "line": "Stan, what the hell are you doing?! [the ganker runs and leaps toward Stan and Randy]"
    },
    {
        "character": "Stan",
        "line": "I got it! [the ganker stabs Randy and Randy goes down]"
    },
    {
        "character": "Randy",
        "line": "Augh!"
    },
    {
        "character": "Stan",
        "line": "Dad!"
    },
    {
        "character": "Randy",
        "line": "Stan... [falls down face first]"
    },
    {
        "character": "Stan",
        "line": "Dad, no! [turns around to face the ganker] You killed my father. [walks up to the ganker and strikes him with one blow of the sword. The ganker's defenses start to crack.]"
    },
    {
        "character": "Cartman",
        "line": "His shield and armor spells are down!"
    },
    {
        "character": "Kyle",
        "line": "Attack! [Kenny quickly takes his bow and arrow and fires an arrow into the ganker's chest. Kyle fires an energy ball at the ganker. The energy ball knocks the knife from the ganker's hand and disables him some more. He falls to the ground on all fours, and the dwarf approaches him, ready to smash the ganker's head in with the mallet]"
    },
    {
        "character": "Cartman",
        "line": "Looks like you're about to get pwned. [swings back and then pulls the mallet forward] Heeyeah! [the mallet smashed the ganker's head into little bloody pieces.]"
    },
    {
        "character": "",
        "line": "The rogue's apartment. The rogue sits at his desk as usual, but now his mouth is slightly open in astonishment. Random noises follow, and his game is through."
    },
    {
        "character": "",
        "line": "Within the game, Stan throws away the Sword of a Thousand Truths and rushes up to his father's dying character. He shakes the character around a bit"
    },
    {
        "character": "Stan",
        "line": "Dad? Dad?"
    },
    {
        "character": "Randy",
        "line": "[answers] Staaan. [falters a bit, but Stan holds him up] I've never been able to say this before, but...I love you, son."
    },
    {
        "character": "Stan",
        "line": "I know you do, Dad."
    },
    {
        "character": "Randy",
        "line": "[swats Stan's hand away] Augh! Aaaaaaaaaaaaaaaaaaa..."
    },
    {
        "character": "",
        "line": "Cuts to Randy continuing the melodrama at the demo desk in Best Buy."
    },
    {
        "character": "Member 1",
        "line": "They did it!"
    },
    {
        "character": "President",
        "line": "Our world is saved! [Randy smiles]"
    },
    {
        "character": "",
        "line": "Within the game. The boys' characters gather around the fallen ganker. Other characters appear and gather around the group"
    },
    {
        "character": "Man 1",
        "line": "They did it! They killed him! [leaves his hiding place. Others follow]"
    },
    {
        "character": "Man 2",
        "line": "They did it!"
    },
    {
        "character": "Woman",
        "line": "They killed him! We can come out!"
    },
    {
        "character": "Cartman",
        "line": "Yes!"
    },
    {
        "character": "Stan",
        "line": "We did it!"
    },
    {
        "character": "Cartman",
        "line": "Yeah!"
    },
    {
        "character": "",
        "line": "Cartman's basement."
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Kyle",
        "line": "Yeah yeah."
    },
    {
        "character": "Cartman",
        "line": "All right, yay."
    },
    {
        "character": "Kenny",
        "line": "(Woohoo! Oh man!)"
    },
    {
        "character": "Cartman",
        "line": "We did it you guys. We're totally heroes."
    },
    {
        "character": "Kyle",
        "line": "That was such über pwnage"
    },
    {
        "character": "Stan",
        "line": "I can't believe it's all over. What do we do now?"
    },
    {
        "character": "Cartman",
        "line": "What do you mean? Now we can finally play the game."
    },
    {
        "character": "Kyle",
        "line": "Oh yeah."
    },
    {
        "character": "Cartman",
        "line": "Okay Kenny, add Eyes of the Beast to your hotbar. Stan, check your fury talents to boost your shots."
    },
    {
        "character": "Stan",
        "line": "Got it."
    }
]