[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day, school hall. The bell rings and the students go to their lockers. Stan and Kyle put some books away as Cartman shares an encounter with Kenny and the other two."
    },
    {
        "character": "Cartman",
        "line": "And so then, I put my finger up my butthole, right? And I walked up to Kelly Nelson, and I said, \"Do you smell lemon grass?\", and she smelled my finger and puked! Hehehehe. Oh, guys, you should have been there."
    },
    {
        "character": "Hall monitor",
        "line": "[a ginger, he taps on Cartman's right shoulder] Eric, I have to take you to the principal's office."
    },
    {
        "character": "Cartman",
        "line": "What? I didn't do it, Kelly Nelson's a liar!"
    },
    {
        "character": "Hall monitor",
        "line": "I've been instructed to bring you to the principal's office."
    },
    {
        "character": "Cartman",
        "line": "Oh, suck my balls you ginger Jew rat hall monitor! Punkass stoolie, who the fuck do you think you are?!"
    },
    {
        "character": "Hall monitor",
        "line": "I'm just doin' my job."
    },
    {
        "character": "Cartman",
        "line": "[taunting and jabbing at him] I'm juh duh duh duhhh! Do you know why you're a hallway monitor?! Because you don't have any friends! You should kill yourself! You should kill yourself!!"
    },
    {
        "character": "Principal Victoria",
        "line": "Eric Cartman, report to the principal's office immediately."
    },
    {
        "character": "Cartman",
        "line": "Aw Goddamnit!"
    },
    {
        "character": "",
        "line": "The principal's office, moments later. A knock is heard at the door."
    },
    {
        "character": "Principal Victoria",
        "line": "Come on in, Eric. [Cartman and the hall monitor enter]"
    },
    {
        "character": "Cartman",
        "line": "[apologizes, but in a blasé fashion] I'm sorry, Principal Victoria. I didn't mean to do it, how could I have been so foolish?"
    },
    {
        "character": "Principal Victoria",
        "line": "Eric, the reason we called you in here is because it is your turn to be the school hallway monitor. [the former hall monitor removes his belt and sash and prepares to give them to Cartman]"
    },
    {
        "character": "Cartman",
        "line": "The hall monit- me?"
    },
    {
        "character": "Mr. Mackey",
        "line": "You need to watch for bad behavior, and make sure anyone in the halls during class has a hall pass. M'kay? [Cartman receives the sash and the former hall monitor leaves]"
    },
    {
        "character": "Principal Victoria",
        "line": "If anyone doesn't, you have the authority to bring them to me."
    },
    {
        "character": "Cartman",
        "line": "[incredulous] Auth- authoritah?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Now Eric, being the school hallway monitor is a big responsibility. M'kay? It is important that you take the job seriously, and that you don't abuse the power."
    },
    {
        "character": "Cartman",
        "line": "Ahem. Me?"
    },
    {
        "character": "",
        "line": "A montage. First scene is the school hall. Cartman pops up dressed as Dog the Bounty Hunter. He walks around and strikes a few poses. He pockets a can of Bear Spray into its holster, makes sure he has handcuffs, then resets his fake facial hair. Next, he pretends he's driving a real car. Back at school, he walks into view and strikes one more dramatic pose, then the POV changes and he's walking towards the camera. One more scene has him turning the steering wheel of an SUV."
    },
    {
        "character": "Cartman",
        "line": "There's fear and darkness all around you\nThe criminals are on the run\nNo use in not having your hall pass\nI'll take you to the principal 'cause I'm the Dawg\nI am the Dawg, the big bad Dawg\nThe Hallway Monitor!\n[laughs until a hand appears and knocks on the driver's window.]\n\n\n"
    },
    {
        "character": "Car Salesman",
        "line": "[opens the door] Hey, kid, get outta there."
    },
    {
        "character": "Cartman",
        "line": "That's cool. I'm done making my video anyways. [leaves. The video shoot resumes at school. Cartman is on the job when he turns around and sees someone else in the hall. He strikes a dramatic pose and yells] Hall pass! Show me your hall pass!"
    },
    {
        "character": "Boy",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "[shoves the boy into the lockers and whips out the Bear Spray] You know what this is? This is the mace that they use on bears, faggot! Now let me see your hall pass!"
    },
    {
        "character": "Boy",
        "line": "It's right here. [reaches into his pocket and pulls it out to show him]"
    },
    {
        "character": "Cartman",
        "line": "[releases the boy] All right, cool, brah. Go with Christ. [turns right and walks away. The boy isn't quite finished]"
    },
    {
        "character": "Boy",
        "line": "What? You can't just push me up against the-"
    },
    {
        "character": "Cartman",
        "line": "[kicks the boy away] Argh!"
    },
    {
        "character": "Boy",
        "line": "[flies out of view]Aah!"
    },
    {
        "character": "Cartman",
        "line": "[marches on] I am the Dawg, the big bad- [stops] Oh my God! [sees a wad of paper on the floor, runs up to pick it up and checks it out] What the fuck is this?!"
    },
    {
        "character": "",
        "line": "Kindergarten. The kindergartners' new teacher is shown teaching them about shapes. She's drawn a circle and is now drawing a square"
    },
    {
        "character": "Teacher",
        "line": "And so this shape with four sides is what, class?"
    },
    {
        "character": "Cartman",
        "line": "[bursts into the classroom] Boyarrrgh! [everyone turns to see who it is. Cartman walks up to Ike] Ike Broflovski! You littering my hallway, brah?!"
    },
    {
        "character": "Teacher",
        "line": "What are you doing?!"
    },
    {
        "character": "Cartman",
        "line": "I found this in the hallway. [unfolds the wad of paper - it's a drawing Ike made of his teacher with hearts all around her] Apparently your student Ike has a crush on you. [Ike looks around nervously] You got a crush on your teacher, brah?! Keep it out of my hallway! Go with Christ. Here you go. [hands the drawing to the teacher and heads for the door]"
    },
    {
        "character": "Teacher",
        "line": "I don't think that's really necessary."
    },
    {
        "character": "Cartman",
        "line": "Hey! I don't tell you how to run your class, don't tell me how to run my hallway! [leaves and closes the door]"
    },
    {
        "character": "Fillmore",
        "line": "Ike has a crush on teacher!"
    },
    {
        "character": "Class",
        "line": "Ike has a crush on teacher! [the class laughs]"
    },
    {
        "character": "Teacher",
        "line": "That's enough, class! [the period ends and the teacher begins erasing the chalkboard] Okay, well see you tomorrow, everybody. Ike, could you stay just a few minutes, please? [Fillmore takes his crayon and leaves. The teacher moves towards Ike] Ike, I'm very flattered, by all of your love notes, but I need to be clear. See, there've been a lot of female teachers on the news lately who have been having relationships with young male students and, people might get the wrong idea, even though... I do admire you. You are so smart and gifted. Soo mature for your age."
    },
    {
        "character": "Ike",
        "line": "I don't like Mason."
    },
    {
        "character": "Teacher",
        "line": "You listen, and you really care about what I have to say. You make me feel things I've never... [reaches out to Ike and touches his right hand] felt before. [she and Ike hold hands, but she lets go and leaves her seat] Ike, this is crazy. I'm your teacher. How can we be having these feelings for each other? [turns around and faces him] You're so mysterious, and I can't... and I can't... [begins to swoon. A montage follows]"
    },
    {
        "character": "",
        "line": "She and Ike rub noses as a heart frames them. Their shadows rush up and hug each other, then twirl around together as hearts pulsate outward. They hold hands again. She takes him out to dinner and chatters away. She takes him out to ice-skate at a skating rink. She takes him out to a dinner picnic before a setting sun - they share wine and cheese. She takes him out for a ride on a duck boat - she does the driving. She has an artist draw a picture of them. They hop onto a merry-go-round and get on horses - she blows a kiss at him there. She takes him home and watches TV with him"
    },
    {
        "character": "REO Speedwagon",
        "line": "And I can't fight this feelin' anymore\nI've forgotten what I started fightin' for\nAnd if I have to crawl upon the floor\nCome crashin' through your door\nBaby, I cant fight this feelin' anymore\n[the last scene is the two of them under the covers ]\n\n\n"
    },
    {
        "character": "Teacher",
        "line": "That was unbelievable. I've never felt like such a woman before. They'll say our love is wrong, but we can't let anybody know; they'll never understand. [rolls to her right and starts massaging Ike tenderly] We were meant to be, I know it. How else could sex be that incredible? [lays back down]"
    },
    {
        "character": "Ike",
        "line": "[oops] Ike made a nuno."
    },
    {
        "character": "",
        "line": "The boy's room at South Park Elementary. Butters rushes in and towards the urinal. Once in place, he sets his hall pass aside, drops his pants, raises his shirt, and lets fly"
    },
    {
        "character": "Butters",
        "line": "Hey there, Mr. Wiener, whattaya know? Do ya need to tinkle tinkle? [falsetto] Yes I do think so."
    },
    {
        "character": "Cartman",
        "line": "[bursts into the restroom. Butters is startled] Hands?! Let me see those hands!"
    },
    {
        "character": "Butters",
        "line": "[backs off] Haaaah!"
    },
    {
        "character": "Cartman",
        "line": "[advances] Where's your pass?! Show me your hall pass, brah!"
    },
    {
        "character": "Butters",
        "line": "[looks around frantically for it] It's, it's... I just had it! [keeps looking, but Cartman grabs him...]"
    },
    {
        "character": "Cartman",
        "line": "I knew it! [...slams his head against a toilet stall, then tosses him to the floor, cuffs him, and escorts him out of the restroom. Butters doesn't get a chance to pull his pants up. The hall pass remains on the sink where Butters left it.]"
    },
    {
        "character": "",
        "line": "The waiting room outside the principal office, moments later. Cartman and Butters wait on the bench outside, and Butters still has his pants around his ankles"
    },
    {
        "character": "Cartman",
        "line": "Look, brah, I had to bring you in, but I don't have any hard feelin's against you all right?"
    },
    {
        "character": "Butters",
        "line": "Huh?"
    },
    {
        "character": "Cartman",
        "line": "Here, you need a smoke, brah?"
    },
    {
        "character": "Butters",
        "line": "Uhh, okay. [Cartman puts a cigarette into Butters' mouth, then lights it for him]"
    },
    {
        "character": "Cartman",
        "line": "You've gotta give yourself over to Christ, brah."
    },
    {
        "character": "Butters",
        "line": "I do. [coughs]"
    },
    {
        "character": "Cartman",
        "line": "Jesus is Lord. You can go one direction in life, or you just walk around the hallways without a hall pass. Or you can see the light, brah. [Butters coughs some more]"
    },
    {
        "character": "",
        "line": "The Broflovski house, afternoon. Kyle walks in."
    },
    {
        "character": "Sheila",
        "line": "[greets him holding some laundry] Kyle, I need you to go get your brother over at his teacher's house."
    },
    {
        "character": "Kyle",
        "line": "Huh?"
    },
    {
        "character": "Sheila",
        "line": "Tell his teacher I'm sorry, but I forgot he has a doctor's appointment today."
    },
    {
        "character": "Kyle",
        "line": "What's he doing at his teacher's house?"
    },
    {
        "character": "Sheila",
        "line": "He's been going there in the afternoons for private tutoring."
    },
    {
        "character": "",
        "line": "The teacher's house, a lovely one-story structure. Starland Vocal Band's \"Afternoon Delight\" is playing inside. Kyle walks up to the front door and knocks."
    },
    {
        "character": "Kyle",
        "line": "Hello? [finds the door open and walks in] Excuse me. I'm here to pick up Ike? [moves further into the house] Uh, hello? Is Ike here? [enters the room the music and some giggling is coming from - it's the bathroom] Hello? [the teacher, in the bathtub, looks at him]"
    },
    {
        "character": "Teacher",
        "line": "OOOH! [covers her breasts]"
    },
    {
        "character": "Kyle",
        "line": "Oh God! [squeezes his eyes shut] I'm sorry. [opens them again] I didn't mean to-ah, I'm looking for my brother. [Ike pops up out of the water dressed in snorkel gear. Kyle's eyebrows go up] Ike?? [they just look at him] What the hell is going on??"
    },
    {
        "character": "Teacher",
        "line": "Oh, what's the use, Ike? We're caught. [moments later, an angry Kyle is pulling Ike towards the front door] Hold on, please, you don't understand."
    },
    {
        "character": "Kyle",
        "line": "[turns to look at her] Really?! What's there not to understand?!"
    },
    {
        "character": "Teacher",
        "line": "Your brother and I... are in love."
    },
    {
        "character": "Kyle",
        "line": "He's a little young, don't you think?!"
    },
    {
        "character": "Ike",
        "line": "Oh. [angrily, he leaves Kyle for his teacher]"
    },
    {
        "character": "Teacher",
        "line": "Ike is very mature for his age, and you know it!"
    },
    {
        "character": "Ike",
        "line": "Ring around the rosey."
    },
    {
        "character": "Teacher",
        "line": "He makes me feel like nobody else does. He loves me and only me, and I know I'm a goddess to him. When we make love, he can give it to me HARD, or soft and gentle-"
    },
    {
        "character": "Kyle",
        "line": "All right! We're getting the hell out of here! [begins to pull Ike away from the teacher]"
    },
    {
        "character": "Ike",
        "line": "[resisting] Nonono, nononono."
    },
    {
        "character": "Kyle",
        "line": "Ike, you can't possibly want this. We have to tell Mom."
    },
    {
        "character": "Ike",
        "line": "[sobbing] No, no."
    },
    {
        "character": "Kyle",
        "line": "Ike?"
    },
    {
        "character": "Teacher",
        "line": "Is it so hard to believe that true love exists?"
    },
    {
        "character": "Kyle",
        "line": "[turns to the front door] This is nuts."
    },
    {
        "character": "",
        "line": "The Broflovski house, dinnertime."
    },
    {
        "character": "Kyle",
        "line": "Mom, Dad, have you ever met Ike's kindergarten teacher? [Ike glares at Kyle]"
    },
    {
        "character": "Sheila",
        "line": "Miss Stevenson? Yes. She's very nice."
    },
    {
        "character": "Kyle",
        "line": "Yeah. Well, she likes Ike a whole lot."
    },
    {
        "character": "Sheila",
        "line": "That's great."
    },
    {
        "character": "Kyle",
        "line": "Yyeah, except maybe it's not perfectly great, because to some degree, Ike and Ms. Stevenson are having an-."
    },
    {
        "character": "Ike",
        "line": "Spider-Man! I'm safe, Mom."
    },
    {
        "character": "Sheila",
        "line": "Yes, Ike, you like Spider-Man, don't you?"
    },
    {
        "character": "Kyle",
        "line": "Mom, there might be something that you should look into about Ike staying after school all the time-"
    },
    {
        "character": "Ike",
        "line": "Weohhh part ten. Mom-my I love you I love you."
    },
    {
        "character": "Sheila",
        "line": "Mommy loves you too, sweetie."
    },
    {
        "character": "Kyle",
        "line": "Would you excuse us for a second? [leaves his chair and takes Ike to the living room. Kyle now addresses Ike] You just can't expect me to sit there and say nothing. No, Ike, I'm supposed to be looking out for you. So what? I wasn't going to just blurt it out, I was gonna use some tact, but you won't even let me... What? Uh uh! Stop right there, Ike! [Ike replies with a series of snippets from nursery rhymes, which has nothing to do with Kyle's concern. Kyle is finished, and the two of them return to the table] Mom, I think maybe you should talk to Ike about love and sex!"
    },
    {
        "character": "Sheila",
        "line": "Sex? Oh bubbe, Ike is much too young. [silence follows as the family continues eating]"
    },
    {
        "character": "",
        "line": "Park County Police Station, day. Seems like Officer Barbrady and his police station have been phased out for good now. Detective Yates and his men are in the breakroom eating lunch"
    },
    {
        "character": "Det. Yates",
        "line": "You're so full of crap, Foley."
    },
    {
        "character": "Foley",
        "line": "What? I did shoot him in the face. Twice."
    },
    {
        "character": "Kyle",
        "line": "[appears at the breakroom entrance] Ex, excuse me? [the officers look, and he walks in] My name is... Brad. And uh I need to report a crime. Anonymously."
    },
    {
        "character": "Yates",
        "line": "Oh? What's the crime?"
    },
    {
        "character": "Kyle",
        "line": "Well, I attend South Park Elementary, ah-and... w-one of the teachers is having sssex with a student."
    },
    {
        "character": "Yates",
        "line": "Oh my God! This is terrible! [other officers say other things. Yates and another officer get on bended knee next to Kyle] Ya-you did the right thing telling the police, Brad. Now, who is the teacher? What's his name?"
    },
    {
        "character": "Kyle",
        "line": "Well, it isn't a guy teacher. It's a woman."
    },
    {
        "character": "Foley",
        "line": "A woman?"
    },
    {
        "character": "Kyle",
        "line": "Yeah. She's having sex with a boy. [the officer to his right is taking notes.]"
    },
    {
        "character": "Mitch",
        "line": "Oh, but, but she's ugly, right?"
    },
    {
        "character": "Kyle",
        "line": "Well no, not really. It's the Kindergarten teacher, Miss Stevenson."
    },
    {
        "character": "Yates",
        "line": "The blonde?"
    },
    {
        "character": "Kyle",
        "line": "Yeah."
    },
    {
        "character": "Foley",
        "line": "Some young boy is having sex with Miss Stevenson?"
    },
    {
        "character": "Kyle",
        "line": "[firmly] Yes."
    },
    {
        "character": "Foley",
        "line": "Nisssse."
    },
    {
        "character": "Yates",
        "line": "Nnice."
    },
    {
        "character": "Kyle",
        "line": "What?! No, you don't understand-"
    },
    {
        "character": "Foley",
        "line": "You sure they've had sex?"
    },
    {
        "character": "Kyle",
        "line": "Yeah."
    },
    {
        "character": "Officer 1",
        "line": "Has she performed oral sex on him?"
    },
    {
        "character": "Kyle",
        "line": "I think so."
    },
    {
        "character": "Officer 1",
        "line": "...Nice."
    },
    {
        "character": "Foley",
        "line": "Nisssse."
    },
    {
        "character": "Officer 1",
        "line": "[whispers] Nisssse."
    },
    {
        "character": "Yates",
        "line": "So wait, what, what's the crime?"
    },
    {
        "character": "Foley",
        "line": "The crime is, she isn't doing it with me. [jabs jokingly at Officer 2. All the officers laugh]"
    },
    {
        "character": "Kyle",
        "line": "Hay! He's totally underage. She's taking advantage of him."
    },
    {
        "character": "Yates",
        "line": "You're right. We're sorry. This is serious. We need to track this student down and... give him his \"Luckiest Boy In America\" medal right away. [All the officers laugh harder]"
    },
    {
        "character": "Kyle",
        "line": "[throws his hands up in frustration and leaves] Gargh!"
    },
    {
        "character": "",
        "line": "South Park Elementary, day, hallway. The students at either at their lockers or milling around. Kyle approaches Stan and Kenny."
    },
    {
        "character": "Kyle",
        "line": "Guys, can I talk to you?"
    },
    {
        "character": "Stan",
        "line": "Sure dude."
    },
    {
        "character": "Kyle",
        "line": "I need you to keep quiet about this, all right? [Cartman walks up] My little brother and his tea-"
    },
    {
        "character": "Cartman",
        "line": "Brahs, it's almost class time. I need you to start clearin' the hallways aright?"
    },
    {
        "character": "Kyle",
        "line": "Not now, Cartman! I have really serious problems!"
    },
    {
        "character": "Stan",
        "line": "Dude, what's the matter?"
    },
    {
        "character": "Kyle",
        "line": "The kindergarten teacher is having sex with my little brother."
    },
    {
        "character": "Stan",
        "line": "...Wow."
    },
    {
        "character": "Kenny",
        "line": "(Reaaly??)"
    },
    {
        "character": "Cartman",
        "line": "Damn, brah, your little brother's pretty cool."
    },
    {
        "character": "Kyle",
        "line": "It's not cool! Ike isn't old enough to understand."
    },
    {
        "character": "Cartman",
        "line": "What's to understand? You get a boner, slap her titties around some and then stick it inside her and pee."
    },
    {
        "character": "Kyle",
        "line": "[looks long and hard at Cartman] \"stick it inside her and pee\""
    },
    {
        "character": "Cartman",
        "line": "Well, okay, fine. Unless you don't want to get her pregnant, then you pull it out and pee on her leg."
    },
    {
        "character": "Stan",
        "line": "Dude, I really don't see a problem."
    },
    {
        "character": "Cartman",
        "line": "Yeah, I've got bigger things to deal with."
    },
    {
        "character": "Kyle",
        "line": "You guys don't understand! His wacko teacher is like a schoolgirl! They pass notes to each other in the classroom, they have sex at her house over lunch break, [Cartman waves Kyle off and walks away] and during class they sneak out and kiss in the hallways! [this stops Cartman and makes his eyes big]"
    },
    {
        "character": "Cartman",
        "line": "They what??"
    },
    {
        "character": "Kyle",
        "line": "They sneak out during class and make out in the hallways!"
    },
    {
        "character": "Cartman",
        "line": "[spins around] Hang on a second: making out in the hallways is strictly against school policy!"
    },
    {
        "character": "Kyle",
        "line": "Well they're doing it!"
    },
    {
        "character": "Cartman",
        "line": "Yeah, well now it's personal! The hallways are my jurisdiction! If there's a hallway infraction going on, they're gonna have to deal with the Dawg!"
    },
    {
        "character": "",
        "line": "Kindergarten class, in session"
    },
    {
        "character": "Miss Stevenson",
        "line": "Okay, just continue with your macaroni pictures. Teacher has to step out for a second. Uh Ike, could you help me out, please? [Ike leaves his seat and joins Miss Stevenson outside. She puts him on the shelf of the telephone booth next to the classroom] Oh Ike, I just had to have a second alone with you."
    },
    {
        "character": "Ike",
        "line": "I like dada better."
    },
    {
        "character": "Miss Stevenson",
        "line": "I got your love letter, and I wrote you one back. Oh, just one kiss to hold me over for the rest of class. [she begins to kiss Ike. Cartman appears in the distance and turns right...]"
    },
    {
        "character": "Cartman",
        "line": "Hall infraction! [runs up to Miss Stevenson]"
    },
    {
        "character": "Miss Stevenson",
        "line": "[turning to Cartman] Oh uhh, we were just heading back in."
    },
    {
        "character": "Cartman",
        "line": "You got a hall pass, brah?!"
    },
    {
        "character": "Miss Stevenson",
        "line": "I don't need a hall pass. I'm a teacher."
    },
    {
        "character": "Cartman",
        "line": "Yeah? Well, where's his hall pass?!"
    },
    {
        "character": "Miss Stevenson",
        "line": "Look, just let us get back in-"
    },
    {
        "character": "Cartman",
        "line": "Get down on the floor!"
    },
    {
        "character": "Miss Stevenson",
        "line": "We're going back inside!"
    },
    {
        "character": "Cartman",
        "line": "[whips out the Bear Spray] You like bear mace, icehead?!"
    },
    {
        "character": "Miss Stevenson",
        "line": "Bear mace??"
    },
    {
        "character": "Cartman",
        "line": "You're goin' with Christ! [sprays Miss Stevenson pretty good]"
    },
    {
        "character": "Miss Stevenson",
        "line": "Oooooh!"
    },
    {
        "character": "",
        "line": "Next stop, the principal's office. Cartman, Miss Stevenson and Ike stand before Principal Victoria"
    },
    {
        "character": "Cartman",
        "line": "...And that's what I got, Principal brah. These two were in the hallway making out. She had those love letters on her person."
    },
    {
        "character": "Principal Victoria",
        "line": "\"Ike, I long to feel your arms around me\"?? Miss Stevenson, you- you're having a relationship with this student?"
    },
    {
        "character": "Cartman",
        "line": "Yes. During classtime, without a hall pass."
    },
    {
        "character": "Principal Victoria",
        "line": "This is unbelievable."
    },
    {
        "character": "Cartman",
        "line": "I know. It's like a hall pass doesn't even matter to her."
    },
    {
        "character": "Principal Victoria",
        "line": "Miss Stevenson, I will need to inform the police."
    },
    {
        "character": "Miss Stevenson",
        "line": "[puts her hands to her cheeks] Oh God..."
    },
    {
        "character": "Cartman",
        "line": "You just dealt with the Dawg, bitch!"
    },
    {
        "character": "",
        "line": "South Park Elementary, later. The front doors are open, revealing the school logo and the steps leading up to the hallways. Police and news reporters are present. Two officers exit with Miss Stevenson in handcuffs."
    },
    {
        "character": "Yates",
        "line": "[sarcastically] Sorry we had to do this, but the lady principal insisted. [the officers move past Yates]"
    },
    {
        "character": "Randy",
        "line": "[shows up next to Jimbo and Ned] What's goin' on?"
    },
    {
        "character": "Jimbo",
        "line": "The kindergarten teacher is suspected of having sex with a student"
    },
    {
        "character": "Randy",
        "line": "With a student? But... she's a woman."
    },
    {
        "character": "Jimbo",
        "line": "Yeah. I know."
    },
    {
        "character": "Randy",
        "line": "But... she's hot."
    },
    {
        "character": "Kyle",
        "line": "Wow. I think I owe you one, Cartman."
    },
    {
        "character": "Cartman",
        "line": "You don't owe me anything. My hallways are cleeean. [points his index fingers at the camera]"
    },
    {
        "character": "",
        "line": "The Broflovski house, night, Kyle's room. Kyle is writing something out when Ike appears at his doorway, pissed off that his teacher was taken away"
    },
    {
        "character": "Kyle",
        "line": "[sensing Ike, turns around in his chair] Ike, I didn't tell on you, you got busted by the hallway monitor. [Ike glares at him] Okay, okay. I did have something to do with it. But someday you're gonna realize it was for the best."
    },
    {
        "character": "Ike",
        "line": "You are dead to me!"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Ike",
        "line": "I said, you're dead to me!"
    },
    {
        "character": "Kyle",
        "line": "I'm dead to you?"
    },
    {
        "character": "Ike",
        "line": "[points at him] You're dead to me, Kyle!"
    },
    {
        "character": "",
        "line": "Park County Police Station, day. Miss Stevenson is calling someone from there as officers stand around and discuss police items"
    },
    {
        "character": "Miss Stevenson",
        "line": "I'm at the police station. They say they found some evidence. I'm so scared. [Ike is at the other end of the line] Listen, I want you to know it's okay. If anybody tries to talk to you, you don't need to say anything. Just leave it to me. I know a way out of this."
    },
    {
        "character": "",
        "line": "News 4 Newsbreak: A reporter in front of the South Park Courthouse"
    },
    {
        "character": "Reporter",
        "line": "Tom, an elementary school teacher is under arrest for allegedly having an affair... with one of her young students. The case is shocking, due mostly to the fact that the teacher... is pretty hot, Tom. If the accusations are true, then... damn! Uh, looks like the defendant and her lawyer are about to give a statement, Tom."
    },
    {
        "character": "Miss Stevenson",
        "line": "I am deeply sorry to announce that the allegations against me are true. Over the past several weeks, I have been having physical relations with one of my students."
    },
    {
        "character": "Man 1",
        "line": "Nice."
    },
    {
        "character": "Man 2",
        "line": "[whispers and squeezes his eyes shut] Nissse"
    },
    {
        "character": "Miss Stevenson",
        "line": "I know my actions were wrong, but I cannot be fully to blame. You see, I am an alcoholic."
    },
    {
        "character": "Officer 2",
        "line": "Ohhhh."
    },
    {
        "character": "",
        "line": "Kyle's hosue, day. Cartman and Kyle are watching the special report on TV"
    },
    {
        "character": "Miss Stevenson",
        "line": "Yes, I'm afraid it's true."
    },
    {
        "character": "Cartman",
        "line": "Oh no!"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "I don't believe it. She's using the Mel Gibson defense."
    },
    {
        "character": "",
        "line": "Back at the Courthouse"
    },
    {
        "character": "Miss Stevenson",
        "line": "I am a perfectly good person, but when I drink, the alcohol makes me say and do things I wouldn't normally do."
    },
    {
        "character": "Yates",
        "line": "Well, that explains it."
    },
    {
        "character": "Foley",
        "line": "Do we still press charges?"
    },
    {
        "character": "Yates",
        "line": "Who are we gonna convict? Johnny Walker?"
    },
    {
        "character": "Man 3",
        "line": "Poor woman. She's a victim."
    },
    {
        "character": "Randy",
        "line": "Yeah, she's a hot victim. [looks around for any reaction, but none comes]"
    },
    {
        "character": "Lawyer",
        "line": "[steps up to the mic] My client has agreed to check herself into rehab immediately. [everyone cheers her on]"
    },
    {
        "character": "Print reporter",
        "line": "Good luck, ma'am. You can beat your alcoholism. [more cheering]"
    },
    {
        "character": "",
        "line": "Park County Drug & Alcohol Rehabilitation Center. Patients line up and go in through a revolving door only to come back out and continue down the line."
    },
    {
        "character": "",
        "line": "The office of a rehab counselor. Miss Stevenson is seated before the counselor."
    },
    {
        "character": "Therapist",
        "line": "Alcohol is a crutch which we use to medicate ourselves; to, to cover up emotional baggage from our past. Was there ever a history of sexual abuse in your family?"
    },
    {
        "character": "Miss Stevenson",
        "line": "No, but my uncle used to ask me and my twin sister to kiss and he'd take pictures."
    },
    {
        "character": "Therapist",
        "line": "Nissse. [sometime later, they're outside the center. He sees her off] Congratulations, Miss Stevenson."
    },
    {
        "character": "Miss Stevenson",
        "line": "All better now. [walks away, gets into her truck and drives away. She drives up to the Broflovski house, stops, gets out a ladder and extends it, props it up against Ike's window, and climbs up]"
    },
    {
        "character": "",
        "line": "Ike's room. Ike is building something with Legos. Miss Stevenson appears at the window and opens it up"
    },
    {
        "character": "Miss Stevenson",
        "line": "Ike. [climbs in and walks to Ike. He turns and stands, his arms outstretched]"
    },
    {
        "character": "Ike",
        "line": "Miss Stephenson [she kneels down, picks him up and holds him close]"
    },
    {
        "character": "Miss Stevenson",
        "line": "Ike, we have to get out of here! They'll never let us be together. I think... I think we should go to Milan, like we always talked about. [puts both her hands to her heart]"
    },
    {
        "character": "Ike",
        "line": "Yaaaaaaaaaaaaay, Mulan!"
    },
    {
        "character": "Miss Stevenson",
        "line": "Get your things together. We don't have much time."
    },
    {
        "character": "",
        "line": "Kyle's room. He's at his desk copying text from from a book. He hears the sound of something landing on the ground outside, then of a car door closing. He gets up to investigate. He goes to Ike's room and opens the door, then looks around."
    },
    {
        "character": "Kyle",
        "line": "Ike, are you okay? [sees an emptier room than usual, and the open window.] Ike? [walks up to the window and sees the ladder still in place.] Iiiike! [the teacher and Ike away.]"
    },
    {
        "character": "",
        "line": "Park County Police Station, breakroom day. The officers are now eating pizza."
    },
    {
        "character": "Yates",
        "line": "Are you sure you're not lying, Foley?"
    },
    {
        "character": "Foley",
        "line": "No, really! I shot both of them! They weren't even doin' nothin'!"
    },
    {
        "character": "Sheila",
        "line": "[enters the breakroom with Kyle following close behind] Help! Please, I need your help! That teacher, Miss Stevenson, she, she left town with my son! I got a note saying they're going to Milan!"
    },
    {
        "character": "Yates",
        "line": "You're kidding!"
    },
    {
        "character": "Sheila",
        "line": "No, it's true!"
    },
    {
        "character": "Yates",
        "line": "Damnit, where were all these sexed-up teachers when I was a kid?!"
    },
    {
        "character": "Sheila",
        "line": "This is serious!"
    },
    {
        "character": "Officer 1",
        "line": "Yeah, boys going to Milan with a beautiful older woman. Quick! Call the FBI! [the officers laugh. Detective Yates smiles]"
    },
    {
        "character": "Sheila",
        "line": "Are you going to do nothing?!"
    },
    {
        "character": "Yates",
        "line": "[irritated] All right all right, we'll make a report. Jesus..."
    },
    {
        "character": "",
        "line": "The Broflovski house, day. Kyle sits at the edge of the patio, depressed. Cartman walks up to him"
    },
    {
        "character": "Cartman",
        "line": "There you are. What are you doing? You giving up, brah?!"
    },
    {
        "character": "Kyle",
        "line": "Dude, my brother's in Milan. There's nothing I can do."
    },
    {
        "character": "Cartman",
        "line": "No, they haven't left yet. Their flight is tomorrow morning."
    },
    {
        "character": "Kyle",
        "line": "How do you know that?"
    },
    {
        "character": "Cartman",
        "line": "I had Beth check out their Travelocity account."
    },
    {
        "character": "Kyle",
        "line": "Who's Beth?"
    },
    {
        "character": "Cartman",
        "line": "Beth is my bitch. I put a whole crew together, brah. I'm gonna get that hallway-defilng slut no matter what it takes! Are you in?!"
    },
    {
        "character": "",
        "line": "Music video. In this one, Cartman introduces his crew. One of them is \"Kyle, Jew.\""
    },
    {
        "character": "Cartman",
        "line": "\nI got some badass guys to help me.\nI only had to pay them fifteen bucks.\nYou think you got away with not having a hall pass?\nYou won't get away from me 'cause I'm the Dawg!\nI am the Dawg, the big bad Dawg!\nThink you can get away with not having a hall pass? Think again! [the video ends and the hallway looks normal again] How was that, Butters?\n\n\n\n"
    },
    {
        "character": "Butters",
        "line": "[behind the camera] Ehthat was pretty good."
    },
    {
        "character": "Kyle",
        "line": "Can we get going now, please?!"
    },
    {
        "character": "Cartman",
        "line": "Yep. We're all done with the video, let's move out! [they go forth]"
    },
    {
        "character": "",
        "line": "An airport Hilton, night. Planes can be seen behind it taking off."
    },
    {
        "character": "",
        "line": "A room at the Hilton. Ike is in bed watching TV. Miss Stevenson comes out of the bathroom."
    },
    {
        "character": "Miss Stevenson",
        "line": "Ike, is that all you're gonna do is watch TV?"
    },
    {
        "character": "Ike",
        "line": "I love TV. Yaaay!"
    },
    {
        "character": "Miss Stevenson",
        "line": "[climbs into bed] But what about me? I want to talk. [Ike just goes back to watching the TV]"
    },
    {
        "character": "",
        "line": "A car, night. Cartman and his crew are driving to the airport"
    },
    {
        "character": "Cartman",
        "line": "Everyone get a good look at our fugitive! I want her taken down fast and clean!"
    },
    {
        "character": "Leeroy",
        "line": "[in a retarded voice] She ran away; now she got to deal with the Dawg, huh?"
    },
    {
        "character": "Cartman",
        "line": "[determined] Beth found out they have a room at the Airport Hilton. We need to search it. Here's the hotel! [into the Intercom] Beth, tell Leeroy to pull up here! [Beth just signals for Earl to drive into the hotel driveway and stop at the front doors. Earl pulls up and brakes quickly] All right, let's go! Move out! [they leave the SUV and rush into the hotel]"
    },
    {
        "character": "Bellboy",
        "line": "Hey! You can't leave your car there!"
    },
    {
        "character": "Cartman",
        "line": "It's okay! I'm a hallway monitor! [they pass through the front entrance] Keep separation! Leeroy, check out our twenty!"
    },
    {
        "character": "Receptionist",
        "line": "Can I help you?"
    },
    {
        "character": "Cartman",
        "line": "You seen this woman, brah? [shows her a picture of Miss Stevenson] She's staying here!"
    },
    {
        "character": "Receptionist",
        "line": "Who are you?"
    },
    {
        "character": "Cartman",
        "line": "I am the Dawg, the big bad Dawg!"
    },
    {
        "character": "Head concierge",
        "line": "I think you should leave before I call the police!"
    },
    {
        "character": "Cartman",
        "line": "Beth! Bear-mace that guy! [she sprays bear mace all over the concierge and he crumbles to the floor, trying to vomit] Let's check out the rooms! Leeroy and Kyle go that way! Beth, you come with me!"
    },
    {
        "character": "Bellboy",
        "line": "[dials 911] We need police here, right away! [Cartman begins his rounds. He goes to Room 236 and knocks on the door with the bear mace can]"
    },
    {
        "character": "Guest 1",
        "line": "[a man, opens the door] Yes?"
    },
    {
        "character": "Cartman",
        "line": "I'm looking for this teacher! Is she in your room, brah?!"
    },
    {
        "character": "Guest 2",
        "line": "[an elderly man in Room 233] Do you mind keepin' it down?"
    },
    {
        "character": "Cartman",
        "line": "[walks over to the second guest] Keep your mouth shut, brah!!"
    },
    {
        "character": "",
        "line": "Ike and the teacher's room. Both of them react to something. In the distance, police sirens sound and get closer to the hotel. Miss Stevenson looks out the window and sees three police cruisers pull up to the hotel, right outside her window"
    },
    {
        "character": "Miss Stevenson",
        "line": "Oh no! Ike! [Ike climbs up to see the commotion] They're on to us!"
    },
    {
        "character": "Ike",
        "line": "Oh no!"
    },
    {
        "character": "Miss Stevenson",
        "line": "Hurry darling! We have to get out of here!"
    },
    {
        "character": "",
        "line": "The hotel lobby. The police rush in"
    },
    {
        "character": "Officers",
        "line": "What have we got? What have we got?!"
    },
    {
        "character": "Officer 3",
        "line": "Who called 911?!"
    },
    {
        "character": "Receptionist",
        "line": "They went that way. [points in the direction Kyle and Leeroy took. The concierge barfs continuously. The officers leave] Look out! They have bear mace!"
    },
    {
        "character": "",
        "line": "The hotel, upstairs. Kyle and Leeroy make the rounds on the third floor."
    },
    {
        "character": "Leeroy",
        "line": "[pounds at the door at Room 323] Open up! I'm with the Dawg! [pounds some more]"
    },
    {
        "character": "Kyle",
        "line": "Oh crap! [some officers round the corner at the far end of the hall]"
    },
    {
        "character": "Officer 4",
        "line": "[draws his gun] You freeze right there! [Kyle and Leeroy run in the other direction]"
    },
    {
        "character": "",
        "line": "The fifth floor. Miss Stevenson covers up and peeks into the hallway. She looks both ways, then steps out of the room"
    },
    {
        "character": "Miss Stevenson",
        "line": "Come on, darling! [Ike steps out and they beginning walking. Earl rounds the corner behind them and catches them]"
    },
    {
        "character": "Earl",
        "line": "Hey! [they stop and the camera zooms in on Earl.] Uh I got 'em, Dawg. Fifth floor!"
    },
    {
        "character": "Cartman",
        "line": "Praise Christ! Let's go! [the elderly man is convulsing from the effects of the bear mace.]"
    },
    {
        "character": "Miss Stevenson",
        "line": "Ike, run! [back on the second floor, Cartman and Beth run down a hallway]"
    },
    {
        "character": "Cartman",
        "line": "Bear mace that guy! And that guy! [Beth maces another bellboy and a guest as she and Cartman run by. Police officers round the corner and run after them]"
    },
    {
        "character": "",
        "line": "The roof. Miss Stevenson and Ike have made it all the way to the top. Cartman, Beth and Earl show up behind them and run out onto the roof. Police officers show up behind them and run out onto the roof "
    },
    {
        "character": "Cartman",
        "line": "Freeze, bitch!"
    },
    {
        "character": "Officer 5",
        "line": "Freeze!"
    },
    {
        "character": "Officer 6",
        "line": "Hands up! Hands up!"
    },
    {
        "character": "Officer 7",
        "line": "Don't move! Don't move!"
    },
    {
        "character": "Cartman",
        "line": "It's all right! There's been a misunderstanding! I'm a hall monitor. [the officers are somewhat stunned] This fugitive is trying to avoid a hallway infraction by skipping off to Milan."
    },
    {
        "character": "Officer 8",
        "line": "Hey, that is the teacher we just got the report about. [she and Ike back up slowly, towards the roof's edge. Kyle and Leeroy show up]"
    },
    {
        "character": "Officer 5",
        "line": "[through his bullhorn] All right, Miss Stevenson, you got nowhere to go!"
    },
    {
        "character": "Miss Stevenson",
        "line": "Why couldn't you just leave us alone? All we wanted was to love."
    },
    {
        "character": "Cartman",
        "line": "Get down! We can do this the easy way, or we can do it Dawg-style!"
    },
    {
        "character": "Leeroy",
        "line": "She gawt a scarf awn her heyed, huh?"
    },
    {
        "character": "Miss Stevenson",
        "line": "It's all over, Ike. Milan, the house in Tuscany. They'll never let us be together! We have to go with the backup plan. [she and Ike walk to the roof's edge and look down at the ground]"
    },
    {
        "character": "Officer 5",
        "line": "[through his bullhorn] Now hold on, don't do anything foolish! We can talk about this!"
    },
    {
        "character": "Miss Stevenson",
        "line": "[returns from the edge with Ike] You can't accept our love? So then we can only be together in eternity."
    },
    {
        "character": "Kyle",
        "line": "[steps through Cartman and Beth towards Ike] No! Ike, don't do it!"
    },
    {
        "character": "Ike",
        "line": "I don deser futty bad man."
    },
    {
        "character": "Kyle",
        "line": "Ike, please. I know your first love seems like the only love, but trust me, it's not. You have so much life ahead of you. [Ike looks at Kyle intently]"
    },
    {
        "character": "Miss Stevenson",
        "line": "You who don't believe in true love don't understand."
    },
    {
        "character": "Kyle",
        "line": "Ike, you need to have a life. Have fun. Then ruin it by having a serious relationship. [Ike thinks it over]"
    },
    {
        "character": "Miss Stevenson",
        "line": "I'm afraid you're too late. [to Ike] Are you ready, my love? [she and Ike turn around and run for the edge] Here we go! One, two, three, aaaahhh! [she jumps over the edge, Ike turns back and walks towards Kyle. She looks up at the roof's edge] Ike?? [she lands on her back and dies on impact]"
    },
    {
        "character": "Ike",
        "line": "Yaaaay!"
    },
    {
        "character": "Kyle",
        "line": "Ike!"
    },
    {
        "character": "Cartman",
        "line": "[moves towards the camera] Well, looks like once again, the Dawg has prevailed. I hope you've learned, kids, that if you don't go with Christ, you could end up just like that splattered bitch down on the pavement."
    },
    {
        "character": "Officer 6",
        "line": "Hey kid, you need to get off the roof now."
    },
    {
        "character": "Cartman",
        "line": "That's cool. I'm done making my video anyways. [walks towards the camera to turn it off.]"
    }
]