[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Hell, outside Satan's castle."
    },
    {
        "character": "",
        "line": "Hell, inside the castle. Satan is seated on his throne with two lava fountains behind him, one on either side. Before each fountain is a pile of bleached skulls. Before the throne is a semicircular table with six elder demons sitting behind it. Nine steps lead up to the throne"
    },
    {
        "character": "Satan",
        "line": "[slow and deliberate] Halloween is a night for evil. It is time for me to take what is mine."
    },
    {
        "character": "Demon 1",
        "line": "[the pale one] What do you plan, Lord Satan?"
    },
    {
        "character": "Satan",
        "line": "On Halloween we shall open the Gates of Hell, rise up to the earth, and we will rent out the entire W Hotel, for an awesome party, and invite a bunch of celebrities!"
    },
    {
        "character": "Demon 2",
        "line": "[second from right] How big a party are we talking?"
    },
    {
        "character": "Satan",
        "line": "Have you seen those rich, spoiled, teenage girls who have massive Sweet 16 parties? That big."
    },
    {
        "character": "Demon 2",
        "line": "Satan, we can't possibly do-"
    },
    {
        "character": "Satan",
        "line": "SILENCE! [descends from his thrown to the floor] Halloween is about me! And I deserve a par-ty! This... shall be MY Super Sweet 16!! [raises his arms up in victory and laughs heartily. A few blasts of steam pop out of volcanoes and the citizens of Hell are frightened. Satan's image appears in the smoke] Minions of Hell! The time has come for us to rise! For my Super Sweet 16 Halloween party!! [the minions look at each other] I got Bacardi, and Ghetto One to sponsor the party, and I'm calling it [a poster for the event appears] Hell On Earth 2006! [everyone yells approval] But now, heed my words: in order to get in to the party, you have to RSVP and get a blue wristband. Everyone is gonna try and get into this party, so if you don't get your wristband in advance, or you're not wearing that wristband at the door, you're NOT GETTING IN!! [the volcanoes fire off another batch of smoke and the minions tremble] And NOW know this: It's a costume party, so you have to wear a costume. BUT... nobody better show up as The Crow! I'm serious. Every costume party there's like fourteen guys come dressed like the Crow 'cause they wanna look hot and hook up. It's lame! If you come dressed as the Crow, you're NOT GETTING IN to the party!! [the volcanoes fire off another batch of smoke and the minions tremble] Go now and prepare!! If you miss my party you are a looozer!! [laughs miniacally and vanishes. The minions tremble once more]"
    },
    {
        "character": "George Burns",
        "line": "Oh boy, a Halloween party up on Earth."
    },
    {
        "character": "Ghandi",
        "line": "I can't believe he got the entire W Hotel."
    },
    {
        "character": "Princess Diana",
        "line": "This is going to be the best Halloween ever. [Other minions raise their arms and cheer]"
    },
    {
        "character": "",
        "line": "Stan's house, night. The house looks darker than normal, but that could be because the lights are on and jack-o'lanterns decorate the windows and the steps outside."
    },
    {
        "character": "",
        "line": "Stan's House, bathroom, in the dark. The boys has turned it into something of a temple, with candles on the vanity to make it look like an altar, and another two candles on the toilet seat cover. Kyle is in there with five other students: Stan, Cartman, Butters, Tolkien, and Tweek. Kyle looks at the mirror."
    },
    {
        "character": "Stan",
        "line": "Go ahead, Kyle, do it."
    },
    {
        "character": "Kyle",
        "line": "[glances defiantly at Stan] I am doing it."
    },
    {
        "character": "Tweek",
        "line": "No! Don't do it!"
    },
    {
        "character": "Cartman",
        "line": "What's the big deal, Kyle? You just look in the mirror, and say the name three times."
    },
    {
        "character": "Kyle",
        "line": "[blinking rather quickly] Biggie. Smalls... Biggie Smalls..."
    },
    {
        "character": "Cartman",
        "line": "See? You're scared. Because you know if you say it a third time, he's gonna show up and shoot you in the face. [starts imitating a hen's cluck]"
    },
    {
        "character": "Kyle",
        "line": "Fine! [hops off the stool and walks past Cartman] Then YOU do it, you're so tough!"
    },
    {
        "character": "Cartman",
        "line": "I've done it lots of times."
    },
    {
        "character": "Kyle",
        "line": "[pushes Cartman to the stool] Prove it!"
    },
    {
        "character": "Cartman",
        "line": "[now on the stool facing the mirror, laughs a bit] Biggie Smalls... Biggie Smalls... This is dumb, you guys, let's do somethin' else."
    },
    {
        "character": "Kyle",
        "line": "You're afraid to do it, too."
    },
    {
        "character": "Cartman",
        "line": "I am not!"
    },
    {
        "character": "Butters",
        "line": "Then do it, if you're not yellow! [Cartman is shocked that Butters talked to him this way, so he raises a fist as if he's about to punch him in the face. Butters flinches.]"
    },
    {
        "character": "Cartman",
        "line": "[turns back to the mirror] Biggie Smalls... Biggie Smalls... [the door opens and Jimmy enters]"
    },
    {
        "character": "Jimmy",
        "line": "Hey fellas. [Cartman freaks out and falls from the stool.] You should come downstairs. Stan's mom made pa-pizza."
    },
    {
        "character": "The other boys",
        "line": "[rushing out of the bathroom] Let's go. Yeah, let's go!"
    },
    {
        "character": "Cartman",
        "line": "Oh my God. I crapped my pants. [feels his ass through his pants to be sure] You guys, I crapped my pants! [thinks, then leaves the bathroom] Heheh. You guys! You guys, check it out!"
    },
    {
        "character": "",
        "line": "Back at Hell's castle, Satan gazes at his crystal ball. The pale demon enters."
    },
    {
        "character": "Demon 1",
        "line": "Satan, I must speak with thee."
    },
    {
        "character": "Satan",
        "line": "[turns around] What is it?"
    },
    {
        "character": "Demon 1",
        "line": "You've invited so many celebrities on Earth to your party that people in Hell can't get wristbands."
    },
    {
        "character": "Satan",
        "line": "Well I have to invite celebrities or else my party won't be cool."
    },
    {
        "character": "Demon 1",
        "line": "Satan, I warn thee, do not throw this party at the cost of alienating your friends."
    },
    {
        "character": "Satan",
        "line": "[childishly] I'm not alienating my friends! I know they come first!"
    },
    {
        "character": "Demon 1",
        "line": "I hope for your sake that's true. You've never thrown a party of this magnitude before, Satan. Be wary. [turns and leaves]"
    },
    {
        "character": "",
        "line": "Cathedral of Our Lady Of the Angels, morning. Inside, Cardinal Mahoney addresses a group of Church leaders"
    },
    {
        "character": "Cardinal Mahoney",
        "line": "Halloween has always been a time of evil and darkness. But now it appears that Satan will literally be among us. He is bringing Hell here to Los Angeles, and from what we understand, the gathering is going to be... completely off the hook. [the clergymen begin to murmur amongst themselves] There's more: None of us... are invited. [the murmurs get louder]"
    },
    {
        "character": "Bishop 1",
        "line": "None?"
    },
    {
        "character": "Bishop 2",
        "line": "Satan mocks us."
    },
    {
        "character": "Bishop 3",
        "line": "His party must be stopped."
    },
    {
        "character": "Priest 1",
        "line": "Yes, we cannot let evil take over our city, even for a night. [he's holding a leash... which has a small naked boy at the other end of it.]"
    },
    {
        "character": "Priest 2",
        "line": "[an old priest with his own boy] What can we do? [more boys on leashes begin to appear]"
    },
    {
        "character": "Resident Bishop",
        "line": "Tomorrow night, after all of Satan's guests have arrived, we'll call in a complaint about how many people are there. We'll see how long Satan's party lasts... after the fire marshal shows up."
    },
    {
        "character": "",
        "line": "Butters' house, bathroom. Butters is brushing his teeth for the night. He's wearing some Wonder Bread pajamas."
    },
    {
        "character": "Butters",
        "line": "That's why I like to brush my teeth; I know they're clean and white. All the [begins to choke on the words and spits out some toothpaste] I truly love to brush my teeth. [smiles, then frowns. He looks around, then] Biggie Smalls... Biggie Smalls... [hesitates a bit] Biggie Smalls... [a second later, Biggie materializes behind Butters]"
    },
    {
        "character": "Biggie Smalls",
        "line": "What the fuck is THIS?!"
    },
    {
        "character": "Butters",
        "line": "AAAAH! [dodges the bullets Biggie begins firing at him.]"
    },
    {
        "character": "Biggie Smalls",
        "line": "Hey! [Butters falls off the stool and gets up, runs to the bathroom door and gets out without getting any bullets in him, and makes his way to the front door.]"
    },
    {
        "character": "Butters",
        "line": "[runs outside] WAAAAAAAAAAAAAAAAAAAH! [his parents pull into the driveway just as Butters leaves the front steps, and get out of the car]"
    },
    {
        "character": "Stephen",
        "line": "Butters! We told you to be in bed! What are you doing?!"
    },
    {
        "character": "Butters",
        "line": "I summoned Biggie Smalls, the hip-hop rapper!"
    },
    {
        "character": "Stephen",
        "line": "You had a nightmare! Turn around and get back in your room right now!"
    },
    {
        "character": "Butters",
        "line": "But Dad, he's gonna bust a cap in my ass!"
    },
    {
        "character": "Stephen",
        "line": "Well, you wanna get shot or you wanna be grounded?!"
    },
    {
        "character": "Butters",
        "line": "AAAAAAAAAAH! [runs back up to his room]"
    },
    {
        "character": "Stephen",
        "line": "[to his wife Linda] ...Honestly, why do let him watch that darn Black Entertainment Channel?"
    },
    {
        "character": "",
        "line": "The W Hotel. Satan is present with his chief demons and the head W staffers."
    },
    {
        "character": "Satan",
        "line": "So I want the DJ to set up over here, and then the main dance floor area can be this whole area right here."
    },
    {
        "character": "Male Staffer",
        "line": "What about valets? Ha, how will people be arriving from Hell?"
    },
    {
        "character": "Satan",
        "line": "Oh, it's like a dimensional vortex gate thingy, they won't have cars."
    },
    {
        "character": "Female Staffer",
        "line": "Buut we're probably gonna want security at the dimensional vortex gate."
    },
    {
        "character": "Satan",
        "line": "I want all the servers dressed in skimpy outfits serving all the hors d'oeuvres."
    },
    {
        "character": "Demon 1",
        "line": "This is getting really expensive."
    },
    {
        "character": "Satan",
        "line": "Shut up, it's Halloween! This is my night! Then at midnight, for dessert, I'm thinking over here, we bring out a huuuge chocolate fondue fountain."
    },
    {
        "character": "Male Staffer",
        "line": "Oh yeah, P Diddy had his birthday party here a couple years back and he had one of those."
    },
    {
        "character": "Satan",
        "line": "Oh, screw that, then. I don't want a fondue fountain if P Diddy had one."
    },
    {
        "character": "Demon 1",
        "line": "[between his teeth] Does it matter?!"
    },
    {
        "character": "Satan",
        "line": "Yes it matters! I don't wanna do it if Diddy did it!"
    },
    {
        "character": "Demon 1",
        "line": "How about a doughnut machine?"
    },
    {
        "character": "Satan",
        "line": "Did Diddy do it?"
    },
    {
        "character": "Male Staffer",
        "line": "Diddy did do it."
    },
    {
        "character": "Satan",
        "line": "A full ice cream bar!"
    },
    {
        "character": "Male Staffer",
        "line": "Diddy did it."
    },
    {
        "character": "Satan",
        "line": "[steps forward in frustration] Damnit, what didn't Diddy do?! [thinks a moment] Wait. I know. [turns right] Yes. It's perfect. At midnight, all the lights go down. The music stops. And then we wheel in... a Ferrari. Only it isn't a Ferrari... It's a cake. And everyone gets a piece."
    },
    {
        "character": "Demon 1",
        "line": "A Ferrari cake?"
    },
    {
        "character": "Male Staffer",
        "line": "Diddy didn't do it."
    },
    {
        "character": "Demon 1",
        "line": "Satan, really, the logistics of getting a cake the size of a Ferrari made in time-"
    },
    {
        "character": "Satan",
        "line": "[spins around] This party has to be the bomb! Don't you get it?! [turns around] When everyone sees the Ferrari cake, [makes a fist and says in a low voice] they will shudder and know my greatness!"
    },
    {
        "character": "Demon 3",
        "line": "Hear me, demons! Lord Satan has demanded a Ferrari cake! Now I will take charge of Halloween, and call upon the spirits of Hell's most evil souls! Ted Bundy! [walks into view] Jeffrey Dahmer! [walks into view] And John Wayne Gacy! [walks into view. Each entrance is accompanied by newspaper clippings and actual background shots of their faces] You shall rise once again to walk the earth, for tomorrow is Halloween, and I need you... to pick up Satan's Ferrari cake, and deliver it to the W Hotel!"
    },
    {
        "character": "Bundy",
        "line": "No problem."
    },
    {
        "character": "Dahmer",
        "line": "We can handle it."
    },
    {
        "character": "Demon 3",
        "line": "Heed my words: Satan's entire Halloween depends on this Ferrari cake. Fail, and you will know his greatest wrath!"
    },
    {
        "character": "",
        "line": "Butters' room, later. He slowly opens his door and looks inside. Quickly, he enters and closes the door, then begins to sneak across the room. He feels a gun against his head and looks up"
    },
    {
        "character": "Smalls",
        "line": "You punkass fool!"
    },
    {
        "character": "Butters",
        "line": "Haaaah."
    },
    {
        "character": "Smalls",
        "line": "Why'd you summon me?"
    },
    {
        "character": "Butters",
        "line": "P-please don't ice me, homie?"
    },
    {
        "character": "Smalls",
        "line": "You'd better have a good reason, sucka!"
    },
    {
        "character": "Butters",
        "line": "I just... w-was seein' if it works."
    },
    {
        "character": "Smalls",
        "line": "[lowers the pistol and walks away] Damn! Every Halloween I gots tuh deal with this shit! I'm in hell, mindin' my own business, and the next thing I know, I'm in some kid's bafroom."
    },
    {
        "character": "Butters",
        "line": "[scared] I Iii, I apologize, Mr. Smalls."
    },
    {
        "character": "Smalls",
        "line": "[returns and places the tip of the gun against Butters' forehead] You don't understand, fool! I ain't missin' the party!"
    },
    {
        "character": "Butters",
        "line": "W-what party?"
    },
    {
        "character": "Smalls",
        "line": "I already got my wristband, see? [lowers the gun and shows off the blue wristband Satan was passing out] You've got to get me to Los Angeles!"
    },
    {
        "character": "Butters",
        "line": "Uh whah well can't you just take a plane?"
    },
    {
        "character": "Smalls",
        "line": "How, punk?! We don't use money in here, ni**a!"
    },
    {
        "character": "Butters",
        "line": "Well damn, ni**er, there's gotta be some way!"
    },
    {
        "character": "Smalls",
        "line": "[places the tip of the gun against Butters' forehead again] This is your fault, homie! You've gots to get me to that party in L.A., or i'm gonna smoke your ass!"
    },
    {
        "character": "Butters",
        "line": "Oh hamburgers!"
    },
    {
        "character": "",
        "line": "Satan's castle. Some of his advisors come to talk to him..."
    },
    {
        "character": "Demon 1",
        "line": "Yes. Yes, Satan. Your Halloween costume turned out perfect."
    },
    {
        "character": "Satan",
        "line": "[dressed as the Crow] Yeah, it's okay, but everyone thinks Zazul's schoolgirl costume is hotter."
    },
    {
        "character": "Zazul",
        "line": "[Deomn 3] Ehhhhhhh."
    },
    {
        "character": "Satan",
        "line": "Zazul, switch costumes with me."
    },
    {
        "character": "Demon 1",
        "line": "Satan, Zazul worked really hard on his costume."
    },
    {
        "character": "Satan",
        "line": "Nobody can look hotter than me! It's my Super Sweet 16 Halloween party! Take it off, Zazul. [dejected, Zazul walks away slowly] And what about my Ferrari cake?! Where's the Ferrari cake?!"
    },
    {
        "character": "Demon 1",
        "line": "Relax, it's being picked up from the bakery."
    },
    {
        "character": "",
        "line": "Montage, to the tune of Yello's \"Oh Yeah.\" The bakers have made a life-size replica of a Ferrari and are now decorating it. The bakery in question is Napoleon Bakery. Bundy, Dahmer, and Gacy appear at the door"
    },
    {
        "character": "Bundy",
        "line": "[looking at a map] All right, this is the place. Now remember, you numbskulls, this Ferrari cake is really important for Satan's party, so don't louse it up!"
    },
    {
        "character": "Dahmer",
        "line": "[as Larry] Who's lousing?"
    },
    {
        "character": "Bundy",
        "line": "[as Moe] Come 'ere. [Dahmer draws near, Bundy slaps him] Shut up! [Bundy opens the doors and the three killers go inside]"
    },
    {
        "character": "Head Baker",
        "line": "Can I help you?"
    },
    {
        "character": "Bundy",
        "line": "We're here to pick up the Ferrari cake."
    },
    {
        "character": "Head Baker",
        "line": "Ohhh yes, it's just about finished. What kind of truck are we loading it up to?"
    },
    {
        "character": "Bundy",
        "line": "We got that flatbed. [Gacy whips out a butcher knife]"
    },
    {
        "character": "Head Baker",
        "line": "Okay well, we're just gonna need to- GYAAAH! [Gacy has just impaled him and begins to slice his body in two by moving the knife towards his head]"
    },
    {
        "character": "Bundy",
        "line": "Gacy, you numbskull, what'd ya kill him for?!"
    },
    {
        "character": "Gacy",
        "line": "[as Curly] I didn't mean tuh. [a second baker comes out of the kitchen]"
    },
    {
        "character": "Bundy",
        "line": "Give me that! [takes the knife from him and smacks him upside the head]"
    },
    {
        "character": "Gacy",
        "line": "Oh!"
    },
    {
        "character": "Bundy",
        "line": "What's the matter with you?! [hands the knife to Dahmer] Take this!"
    },
    {
        "character": "Baker 2",
        "line": "Everything all right? [Dahmer stabs him in the throat with the knife.] Bwa! Gaaaghaghaghagh!"
    },
    {
        "character": "Bundy",
        "line": "You nincompoop! [bops him on the head]"
    },
    {
        "character": "Dahmer",
        "line": "Ow."
    },
    {
        "character": "Bundy",
        "line": "That was the baker!"
    },
    {
        "character": "Dahmer",
        "line": "He startled me."
    },
    {
        "character": "Bundy",
        "line": "[looks to his left] Gacy! [goes into the kitchen, where Gacy is stabbing away at a third baker] What'dja kill him for?! [bops him on the head] Siddonw!"
    },
    {
        "character": "Gacy",
        "line": "I'm a victim of circumstance. [Dahmer bops him on the head]"
    },
    {
        "character": "Bundy",
        "line": "[grabs Dahmer by the back of the head] Ahh, who're you hittin'? [picks him in the eyes.]"
    },
    {
        "character": "Dahmer",
        "line": "Ohhhh... [stumbles away]"
    },
    {
        "character": "Gacy",
        "line": "Nyuk nyuk nyuk nyuk nyuk nyuk nyuk. [Bundy smacks him] Oh!"
    },
    {
        "character": "Bundy",
        "line": "[to Dahmer] Get outta here. [to Gacy] Be quiet. [Gacy makes like he's rubbing blood from his face as he groans] You idiots! Now who's gonna help us load the Ferrari cake onto the flatbed?!"
    },
    {
        "character": "",
        "line": "Butters' house, later. Stan, Kyle, Cartman, Jimmy, Tweek, and Tolkien are with Butters, and their parents are behind them. Stan's parents are not there. The police have arrived to talk to Butters' parents"
    },
    {
        "character": "Officer",
        "line": "Did your son say anything before he disappeared, Mrs. Stotch?"
    },
    {
        "character": "Linda",
        "line": "He just said something about... summoning Biggie Smalls... [upon hearing this, the other boys know what happened and look at each other.]"
    },
    {
        "character": "Cartman",
        "line": "Dude..."
    },
    {
        "character": "Jimmy",
        "line": "Du... du... dude."
    },
    {
        "character": "",
        "line": "Stan's house, moments later."
    },
    {
        "character": "Stan",
        "line": "[rushes into the living room with the other boys] Dad! Dad!"
    },
    {
        "character": "Randy",
        "line": "[reading his newspaper on the sofa] What?"
    },
    {
        "character": "Stan",
        "line": "If you look in the mirror and say Biggie Smalls' name three times, he doesn't come and get you, right??"
    },
    {
        "character": "Randy",
        "line": "[thinks a moment] Biggie Smalls?"
    },
    {
        "character": "Cartman",
        "line": "You know, escargot, my cargo, one eighteen, sippin' on booze at the House of Blues"
    },
    {
        "character": "Randy",
        "line": "[folds his paper up and rises] All right, boys, I know it's Halloween, but you can't summon dead rappers in the mirror."
    },
    {
        "character": "Cartman",
        "line": "How do you know??"
    },
    {
        "character": "Randy",
        "line": "I'm a geologist! [leaves]"
    },
    {
        "character": "Kyle",
        "line": "He's right. It's just a spooky story."
    },
    {
        "character": "Tweek",
        "line": "Hguh. Then how come you couldn't do it?"
    },
    {
        "character": "Kyle",
        "line": "I can do it. It just got... look, it just doesn't matter, because it's not true."
    },
    {
        "character": "Cartman",
        "line": "How can we be sure? How do we know Butters isn't with Biggie right now? Being tormented by him?"
    },
    {
        "character": "",
        "line": "Up in the sky. A jet plane heads towards Los Angeles"
    },
    {
        "character": "Butters",
        "line": "I'm going going, back back, to Cali Cali. Uhh, yeah, I'm going going, back back, to Cali Cali. Uhh-\n\n\n"
    },
    {
        "character": "Smalls",
        "line": "Yo dawg, keep it down."
    },
    {
        "character": "Butters",
        "line": "Yo dawg, uh, can't I just go back home right after the flight so I don't get grounded?"
    },
    {
        "character": "Smalls",
        "line": "Oh no! YOU summoned my spirit, YOU're gettin' me all the way to the party! As long as I get to the party in time to party, everything'll be all right. [begins to vanish] Hey! [Smalls is gone]"
    },
    {
        "character": "",
        "line": "Kyle's bathroom. The boys are assembled once again to summon Biggie Smalls"
    },
    {
        "character": "Kyle",
        "line": "...Smalls. [Smalls materializes]"
    },
    {
        "character": "Smalls",
        "line": "Oh, God-damnit! [the boys scream and run out of the bathroom, leaving Kyle on the stool]"
    },
    {
        "character": "Stan",
        "line": "It does work!!"
    },
    {
        "character": "Kyle",
        "line": "Holy crap!!"
    },
    {
        "character": "Smalls",
        "line": "[pulls out his gun...] That's it! Now I'm pissed! [...and begins firing away. Kyle and Tolkien are the last to leave.]"
    },
    {
        "character": "",
        "line": "The W, moments later. Klieg lights are lit up and light up the night as guests arrive. The camera pans around showing the costumed people waiting outside and the party scene inside. Pumpkin disco balls spin around slowly from the ceiling. Two bartenders mix drinks. A large poster of Satan is up on a wall, a DJ spins records."
    },
    {
        "character": "George Burns",
        "line": "Hehey, everybody. Check out Hitler. [Hitler appears with a cell phone attached to his ear] He's the \"Can you hear me now?\" guy. [the minions around him laugh]"
    },
    {
        "character": "Hitler",
        "line": "[moves from spot to spot and asks] Can you hear me now? Can you hear me now? [the minions around him laugh again]"
    },
    {
        "character": "Satan",
        "line": "[introducing himself] Everyone quiet! Here he is, the man of the night, SATAN! [four Chippendale men enter, two with leather pants and two with leather briefs, carrying Satan on a litter. Satan is seated on his throne dressed as a girl celebrating her Sweet 16 party. Adolf Hitler wanders by still testing out that cell phone] Get out of the way, Hitler! You're ruining my entrance! Gaau!"
    },
    {
        "character": "",
        "line": "Outside, across the street from the hotel entrance, some Catholic clergy have gathered around a pay phone. Cardinal Roger Mahoney places a call"
    },
    {
        "character": "Cardinal Mahoney",
        "line": "Yes, hello? It this the fire department? [the other clergy whisper and remind him what to say, he whispers back] Wait, shh, shh, shh. [normal voice] I need to make a complaint to the fire marshal. [listens for the reply] He's what? Where? [soon hangs up, having gotten nowhere] Damn your evil heart, Satan!!"
    },
    {
        "character": "Resident Bishop",
        "line": "What?"
    },
    {
        "character": "Cardinal Mahoney",
        "line": "The Fire Marshal is at the party! Satan invited him!"
    },
    {
        "character": "Priest",
        "line": "Satan's trickery knows no bounds!"
    },
    {
        "character": "Cardinal Mahoney",
        "line": "That's it! One way or another, we're crashing this party!"
    },
    {
        "character": "",
        "line": "Back at the party. Satan is talking to a bouncer"
    },
    {
        "character": "Satan",
        "line": "This is VIP. Don't just let anybody into my VIP area, okay? [the bouncer walks away and an elderly minion arrives]"
    },
    {
        "character": "Frank Sinatra",
        "line": "Hey, Satan, you got a little problem."
    },
    {
        "character": "Satan",
        "line": "What?"
    },
    {
        "character": "Frank Sinatra",
        "line": "Somebody showed up in a Crocodile Hunter costume. It's really offending some of the other guests."
    },
    {
        "character": "Satan",
        "line": "Oh jeez. [walks over to the offending guest, who happens to be none other than Steve Irwin, with a stingray attached to his chest. Steve looks around with a smile on his face. Satan arrives] Hey, uh, hi, listen, dude, ya know, the whole Crocodile Hunter thing? It... it's just a little soon, you know? I mean, he just dies a few weeks ago and... it's just not supercool and you gotta leave."
    },
    {
        "character": "Steve Irwin",
        "line": "But it's me, Satan. Steve Irwin. I am the Crocodile Hunter."
    },
    {
        "character": "Satan",
        "line": "[thinks a moment] Oh... oh, but then, dude, no costume. Sorry, you gotta go. [two bouncers come and escort him away]"
    },
    {
        "character": "Steve Irwin",
        "line": "Wait! I thought we were friends!"
    },
    {
        "character": "Satan",
        "line": "[watches Irwin leave, then] Oh hey, Sinatra! [walks away]"
    },
    {
        "character": "Male Staffer",
        "line": "Demonius! [approaches a minion wearing a Captain America outfit] Demonius, we have a problem!"
    },
    {
        "character": "Demonius",
        "line": "[the pale elder demon, lifts up his mask] What is it?"
    },
    {
        "character": "Male Staffer",
        "line": "The Ferrari cake! It isn't here!"
    },
    {
        "character": "Demonius",
        "line": "What?? Don't even tell me that!"
    },
    {
        "character": "Male Staffer",
        "line": "It was never delivered to the hotel."
    },
    {
        "character": "Demonius",
        "line": "Deva! Fetch my Blackberry! That Ferrari cake must get here by midnight! [lowers his mask and moves on]"
    },
    {
        "character": "",
        "line": "a short pops up - The Three Murderers, using music from The Three Stooges"
    },
    {
        "character": "",
        "line": "The scene is the Napoleon Bakery. Gacy and Dahmer guide the Ferrari cake onto the flatbed. Bundy is at the controls. A man walks by and stops to watch"
    },
    {
        "character": "Man",
        "line": "Do you gentlemen need a hand? [Gacy and Dahmer look; Gacy runs over, jumps on him and stabs him to death with a knife. Bundy notices, jumps out of the crane and runs over]"
    },
    {
        "character": "Bundy",
        "line": "Gacy! [Gacy jumps off the man and cleans the knife quickly] Whatcha do that foor?!"
    },
    {
        "character": "Gacy",
        "line": "I did it for Dahmer."
    },
    {
        "character": "Bundy",
        "line": "For Dahmer?"
    },
    {
        "character": "Gacy",
        "line": "Yeah. He likes havin' sex with dead bodies. [Dahmer is shown pumping away, from the elbow up]"
    },
    {
        "character": "Bundy",
        "line": "Dahmer! Stop havin' sex with them intestines!"
    },
    {
        "character": "Dahmer",
        "line": "What good are intestines if you can't have sex with them?"
    },
    {
        "character": "Bundy",
        "line": "[slaps Dahmer hard] We gotta get rid of this body before anyone sees it! [brings out a portable saw and begins sawing the body to bits. The crane continues moving the cake around, and no one is at the controls. Bundy finishes cutting up the body] Now get those to the trashcan! [Gacy has the man's head, Dahmer has the man's left forearm and starts eating it] Stop eating that! [takes the forearm and slaps him with it.]"
    },
    {
        "character": "Gacy",
        "line": "Leave him alone! [Bundy slaps him with the forearm] Unh!"
    },
    {
        "character": "Bundy",
        "line": "Cut it! [punches Gacy in the belly] Come 'ere, ya. [takes Dahmer's right hand and places it under Gacy's chin, then forces an upper cut with his own fist]"
    },
    {
        "character": "Dahmer, Gacy",
        "line": "Oh! [both men then take their right hands and move them up an imaginary pole]"
    },
    {
        "character": "Dahmer",
        "line": "There. [Bundy punches them both in the belly and the nose] Oh. [the cable snaps and the cake drops down a bit] The cake! [the pulley is undone and the cake flips over and hits the ground. Pieces of it fly everywhere. The three murderers are covered in it]"
    },
    {
        "character": "Bundy",
        "line": "Oh no!"
    },
    {
        "character": "Gacy",
        "line": "Mmm, Ferrari."
    },
    {
        "character": "Bundy",
        "line": "[smacks him] What's the matter with you?! It's ruined!"
    },
    {
        "character": "Dahmer",
        "line": "We're gonna get it now."
    },
    {
        "character": "",
        "line": "Back at the party..."
    },
    {
        "character": "A guest",
        "line": "This is a really extravagant party, Satan."
    },
    {
        "character": "Satan",
        "line": "I know, but just wait till midnight. You are not gonna believe what's coming for desert! [laughs heartily]"
    },
    {
        "character": "",
        "line": "The entrance. The bouncers let a Conehead and a maid enter, and the Catholic clergy are next in line. They show their wristbands, which are yellow, not blue"
    },
    {
        "character": "Black Bouncer",
        "line": "Uh, these aren't the right wristbands."
    },
    {
        "character": "A Bishop",
        "line": "Uh, yes they are."
    },
    {
        "character": "White Bouncer",
        "line": "Then how come they say \"Knott's Berry Farm\"? [the clergy get restless, the bouncers hold them back]"
    },
    {
        "character": "Cardinal Mahoney",
        "line": "In the name of Christ, just let us in!"
    },
    {
        "character": "",
        "line": "Denver International Airport. The other six boys are now going to Satan's party with Biggie Smalls. Kyle is ordering the tickets"
    },
    {
        "character": "Stan",
        "line": "We're really sorry, Mr. Smalls."
    },
    {
        "character": "Smalls",
        "line": "Not as sorry as you're gonna be, if I completely miss the party!"
    },
    {
        "character": "Ticket agent",
        "line": "Here you go, flight 72 to Los Angeles boarding in 10 minutes."
    },
    {
        "character": "Kyle",
        "line": "[gets the ticket and goes back to Smalls] See? You can still make it for the end of the party."
    },
    {
        "character": "Smalls",
        "line": "Yeah, I'm just gonna be pissed if I miss- [begins to vanish again] What the? No! No!"
    },
    {
        "character": "",
        "line": "Stan's bathroom. Randy is now summoning Biggie Smalls"
    },
    {
        "character": "Randy",
        "line": "...Smalls. [Bigge Smalls materializes behind him] No way!"
    },
    {
        "character": "Smalls",
        "line": "Motherfucking God-damnit!"
    },
    {
        "character": "Randy",
        "line": "That's pretty cool. Hey, Hey Sharon!"
    },
    {
        "character": "Smalls",
        "line": "Cool this, sucka! [begins firing at Randy, who's grazed by a few bullets but runs out of the bathroom.]"
    },
    {
        "character": "",
        "line": "A second Three Murderers short. This time, the murderers have dressed as chefs so they can make the Ferrari cake themselves"
    },
    {
        "character": "Bundy",
        "line": "All right, listen you mugs! It's now 11:30. That means we only have twenty minutes to bake a new Ferrari cake."
    },
    {
        "character": "Dahmer",
        "line": "No problem! It just so happens that I went to an Italian cooking school."
    },
    {
        "character": "Bundy",
        "line": "Yeah? Why'd you quit?"
    },
    {
        "character": "Dahmer",
        "line": "There weren't enough Italians to eat. [a second later Bundy smacks him across the face]"
    },
    {
        "character": "Gacy",
        "line": "Nyak nyak nyak nyak nya-eh [Bundy moves his hand in front of Gacy and then moves it around his head] Nyaaa nyaaaa"
    },
    {
        "character": "Bundy",
        "line": "Get over here! [pulls Gacy by the left ear. Dahmer follows. They go to a clean, ready counter] All right, what's the recipe call for first?"
    },
    {
        "character": "Dahmer",
        "line": "Ten thousand eggs."
    },
    {
        "character": "Bundy",
        "line": "Gacy, go get ten thousand eggs."
    },
    {
        "character": "Gacy",
        "line": "You get 'em!"
    },
    {
        "character": "Bundy",
        "line": "[bops him on the head] Shut up!"
    },
    {
        "character": "Gacy",
        "line": "Nyaaaaa! [pokes Bundy in the left eye]"
    },
    {
        "character": "Bundy",
        "line": "Oh! Ohh, wise guy, ey? [pokes both of Gacy's eyes out, leaving him with bleeding sockets]"
    },
    {
        "character": "Gacy",
        "line": "GAAAAAAAAAAAAAH!"
    },
    {
        "character": "Bundy",
        "line": "How's that?"
    },
    {
        "character": "Dahmer",
        "line": "Hey! Leave him alone! [gets the knife and stabs him in the ribs]"
    },
    {
        "character": "Bundy",
        "line": "AAA!"
    },
    {
        "character": "Dahmer",
        "line": "[sticks his tongue out at Bundy] Nehhh!"
    },
    {
        "character": "Bundy",
        "line": "Try that again!"
    },
    {
        "character": "Dahmer",
        "line": "[sticks his tongue out at Bundy again] Nehhh! [Bundy grabs the tongue and cuts it right out with a knife]"
    },
    {
        "character": "Gacy",
        "line": "What happened??"
    },
    {
        "character": "Bundy",
        "line": "Shut up! [smacks Gacy with Dahmer's tongue. Dahmer sticks a knife in Bundy's chin, making him fall down. Gacy with loss of eyesight smacks Dahmer's head open with a rolling pin, leaving his brains pouring out]"
    },
    {
        "character": "",
        "line": "A men's room in the hotel. Various costumed men are there looking at a man dressed as John Elway tries to summon Biggie Smalls, daring him all the while"
    },
    {
        "character": "Cowboy",
        "line": "He can't do it, he can't do it."
    },
    {
        "character": "John Elway",
        "line": "All right, be quiet. [laughs] Biggie Smalls... Biggie Smalls... [the others crowd in for the payoff] Oh I can't do it! I'm too freaked out. [the others laugh at him as he leaves the restroom]"
    },
    {
        "character": "",
        "line": "Back at the hotel..."
    },
    {
        "character": "Male Staffer",
        "line": "What do we do?? It's midnight. The Ferrari cake never arrived!"
    },
    {
        "character": "Zazul",
        "line": "This is terrible!"
    },
    {
        "character": "Demonius",
        "line": "[rushes up] It's okay! It's okay! [lifts up his mask] I found a backup! Go ahead and start the ceremony! [the music dies out and the lights go down]"
    },
    {
        "character": "Zazul",
        "line": "[through the party's speakers] Your attention please: It is now midnight! Time for Satan's special surprise. [the guests gather around a raised platform]"
    },
    {
        "character": "A Guest",
        "line": "I wonder what this is going to be."
    },
    {
        "character": "Satan",
        "line": "[in a low voice, making a fist] Just you wait. [the sound of revving car engines play through the speaker system. The doors open and the surprise is revealed] Yes. Here it comes. [the car is rolled into place and begins rotating counterclockwise]"
    },
    {
        "character": "Zazul",
        "line": "Ladies and gentlemen: a fully edible Acura cake! [the guests cheer, not knowing what Satan really wanted]"
    },
    {
        "character": "Satan",
        "line": "Acura?? But I wanted a Ferrari! [Zazul and Demonius are quickly at his side]"
    },
    {
        "character": "Demonius",
        "line": "We did the best we could; there was a problem."
    },
    {
        "character": "Zazul",
        "line": "Acuras are really nice."
    },
    {
        "character": "Satan",
        "line": "IT'S NOT THE CAR I WANTED! THE WHOLE PARTY'S RUINED! [one swing of his left arm and Zazul flies out of the picture]"
    },
    {
        "character": "Demonius",
        "line": "It doesn't matter. Your guests are having fun. They don't care."
    },
    {
        "character": "Satan",
        "line": "[jumps up and down] IT'S NOT ABOUT THEM, IT'S ALL ABOUT MEEEEEEE!!! [his voice echoes throughout the hotel and no one says a word for several seconds]"
    },
    {
        "character": "Frank Sinatra",
        "line": "Wow, what a jerk."
    },
    {
        "character": "A Cowboy",
        "line": "Come on, Helen. Let's just go back to hell. I'm suddenly not so hungry for Acura cake."
    },
    {
        "character": "Satan",
        "line": "Oh God, what's happened to me? I've never been this terrible before. By trying to have a party like those spoiled rich teenage girls on MTV, I've become like one of them."
    },
    {
        "character": "Zazul",
        "line": "[returns] Satan, don't be so hard on yourself. You're not as bad as they are."
    },
    {
        "character": "Satan",
        "line": "But I am. Throwing people out, making a big entrance, having these stupid pictures of me all over. Halloween is supposed to be for everyone. Everybody, I'm sorry. This party is for you. It's for all of you who make my life so special. If I don't realize that, then I'm no better than a rich American teenage girl. [the guest begin to applaud the speech] Open the doors! Let everyone in, wristband or no! [everyone cheers at this and the waiting guests rush in, including the Catholic clergy and their naked boys on leashes. Butters appears in the crowd and stops a catwoman powdering herself]"
    },
    {
        "character": "",
        "line": "Outside"
    },
    {
        "character": "Butters",
        "line": "Uhh, excuse me. uh ma'am, can I borrow that? [she hands him her mirror, and he looks into it] Biggie Smalls Biggie Smalls Biggie Smalls. [Smalls materializes next to him]"
    },
    {
        "character": "Smalls",
        "line": "What the-?"
    },
    {
        "character": "Butters",
        "line": "Thanks. [hands the mirror back to the catwoman, and she enters the party]"
    },
    {
        "character": "Smalls",
        "line": "I am soo sick of this! Wait, I'm at the party."
    },
    {
        "character": "Butters",
        "line": "Sure, homie. I got your back, yo."
    },
    {
        "character": "Smalls",
        "line": "[happily] And it's not too late. Hey, why don't you come in with me?"
    },
    {
        "character": "Butters",
        "line": "Wull what the heck? I'm gonna get grounded anyway, might as well. [they both enter the party happily]"
    },
    {
        "character": "",
        "line": "Inside. Butters is dancing with everyone else, the priests dance with their naked boys, Satan dances with Captain America."
    }
]