[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, morning. The school bell rings and the kids rush in to sit down. Mrs. Garrison enters the classroom."
    },
    {
        "character": "Mrs. Garrison",
        "line": "All right, students, let's take our seats. Everyone try to be nice because we have a new student joining us today, and I know you'll all make him feel welcome. Say hello to... Baahir Hassan Abdul Hakeem."
    },
    {
        "character": "Cartman",
        "line": "Uh oh! [Kyle's seat is empty, and he fears the worst]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Welcome to our class, Baahir."
    },
    {
        "character": "Baahir",
        "line": "Thank you."
    },
    {
        "character": "Cartman",
        "line": "Duhude, dude, [throws out his arms, palms out] not cool!"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Why don't you take a seat in Kyle's empty desk for now?"
    },
    {
        "character": "Baahir",
        "line": "Okay. [goes to Kyle's seat. Cartman begins crawling out of his, away from Baahir]"
    },
    {
        "character": "Cartman",
        "line": "Oooh hooohoho. Nooo, noohoohoo."
    },
    {
        "character": "Mrs. Garrison",
        "line": "[stopping him. What follows is in hushed tones] Eric, what the hell is wrong with you?!"
    },
    {
        "character": "Cartman",
        "line": "What's wrong? [looks at Baahir, who's looking back at him, then looks back at Mrs. Garrison and takes her aside] Has he been checked for bombs?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Eric, that's enough! Not all Muslim people are terrorists!"
    },
    {
        "character": "Cartman",
        "line": "No, but most of them are. And all it takes is most of them."
    },
    {
        "character": "",
        "line": "The school playground, recess. There are several kids waiting at the slide, Butters takes his turn."
    },
    {
        "character": "Butters",
        "line": "[slides down gleefully] Now you go, Baahir. [Baahir climbs the ladder steps and slides down. Butters cheers him on. Cartman shows up and looks at them. Baahir dusts himself off. Cartman turns and walks away, then places a call on his cell phone]"
    },
    {
        "character": "",
        "line": "Kyle's bedroom, day. Kyle is still in bed, his window curtains drawn shut. There's lots of little tissues on his bed and surrounding floor with two plates on the floor next to the bed. His cordless phone is on the covers. It rings, he picks up"
    },
    {
        "character": "Kyle",
        "line": "[sniffs - he has a stuffy nose] Yeah?"
    },
    {
        "character": "Cartman",
        "line": "[hushed] Kyle, are you on your computer?"
    },
    {
        "character": "Kyle",
        "line": "What? No, I'm sick. [sniffs]"
    },
    {
        "character": "Cartman",
        "line": "Get online. I need you to check something for me."
    },
    {
        "character": "Kyle",
        "line": "Dude, leave me alone."
    },
    {
        "character": "Cartman",
        "line": "Kyle, every one of our friends might be in serious danger!"
    },
    {
        "character": "Kyle",
        "line": "[sits right up] What? Why?"
    },
    {
        "character": "Cartman",
        "line": "Get online now!"
    },
    {
        "character": "Kyle",
        "line": "All right, all right. [leaves his bed and goes to his computer, sits down and starts clicking]"
    },
    {
        "character": "Cartman",
        "line": "Go to MySpace. [enters the school building] See if there's a MySpace page for a Baahir Hakeem."
    },
    {
        "character": "Kyle",
        "line": "[types a search term at MySpace] Baahir Hakeem. [Baahir's page pops up] Born in Chicago, eight years old, his favorite color is green... Car, Cartman, what is this all about?"
    },
    {
        "character": "Cartman",
        "line": "[begins walking down the hallway] Kyle, I want you to check his buddy list. How many MySpace friends does he have?"
    },
    {
        "character": "Kyle",
        "line": "Over a hundred."
    },
    {
        "character": "Cartman",
        "line": "[walks further along] Look further down the page. Does he list his favorite band?"
    },
    {
        "character": "Kyle",
        "line": "White Stripes"
    },
    {
        "character": "Cartman",
        "line": "[stops suddenly] That's funny."
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "He told everyone in class today his favorite band was Blink 182."
    },
    {
        "character": "",
        "line": "A ticking clock: 11:59:57... 11:59:58... 11:59:59... 12:00:00... Darkness. The following text appears onscreen, then disappears after Cartman finishes speaking."
    },
    {
        "character": "Cartman",
        "line": "[voiceover] The following takes place between Recess and Geography class."
    },
    {
        "character": "",
        "line": "South Park Police Station, day, Officer Barbrady's desk. A hovering camera looks at a ringing phone. Officer Barbrady answers."
    },
    {
        "character": "Barbrady",
        "line": "Hello?"
    },
    {
        "character": "Cartman",
        "line": "[entering the boys' restroom, still in hushed tones] Officer Barbrady, South Park Elementary is in serious danger! [checks the toilet stalls on all fours]"
    },
    {
        "character": "Barbrady",
        "line": "From what? Who is this?"
    },
    {
        "character": "Cartman",
        "line": "I've just ID'd a Muslim and his MySpace page does not check out. You've got to get these people out of here now!"
    },
    {
        "character": "Barbrady",
        "line": "Are you serious?"
    },
    {
        "character": "Cartman",
        "line": "If I wasn't serious, would I be talking like this?"
    },
    {
        "character": "Barbrady",
        "line": "Like what?"
    },
    {
        "character": "Cartman",
        "line": "Whispering, but whispering really loudly for dramatic effect."
    },
    {
        "character": "Barbrady",
        "line": "Oh jeez."
    },
    {
        "character": "",
        "line": "South Park Elementary, Mrs. Garrison's class, later. Mrs. Garrison moves on to History, but the school bell goes off as a fire drill."
    },
    {
        "character": "Mrs. Garrison",
        "line": "What the hell?"
    },
    {
        "character": "Principal Victoria",
        "line": "[over the PA system] All students are to evacuate the school immediately! [Baahir looks around]"
    },
    {
        "character": "",
        "line": "The front of South Park Elementary, later. The kids pour out happily."
    },
    {
        "character": "Butters",
        "line": "Hey, Baahir, uh since we get to go home, you wanna come over uh, play checkers?"
    },
    {
        "character": "Baahir",
        "line": "Sure, okay. [12:02:32 pops up on screen and ticks the seconds away.]"
    },
    {
        "character": "Butters",
        "line": "Well all right! [they walk off together]"
    },
    {
        "character": "Kyle",
        "line": "Dude. [sniffs and calls Cartman. The LED readout vanishes]"
    },
    {
        "character": "Cartman",
        "line": "[exits the building through a side door and answers the call] Yeah. [walks among various trash cans and bins]"
    },
    {
        "character": "Kyle",
        "line": "Dude, I just got an IM from Stan that they evacuated the school."
    },
    {
        "character": "Cartman",
        "line": "Yeah. Now do you believe me that somethin' is goin' on?!"
    },
    {
        "character": "Kyle",
        "line": "I guess so."
    },
    {
        "character": "Cartman",
        "line": "Yeah well I don't like it! It doesn't follow!"
    },
    {
        "character": "Kyle",
        "line": "Wuh what doesn't follow?"
    },
    {
        "character": "Cartman",
        "line": "Why would a terrorist just blow up a school? It's not their M.O. Unless... Oh my God! Unless this was all just a big diversion. [starts running] Kyle, I need you to Google-search the South Park Chamber of Commerce!"
    },
    {
        "character": "Kyle",
        "line": "Okay."
    },
    {
        "character": "Cartman",
        "line": "Their Web site should have a calendar of events: is there anything big going on in town today?!"
    },
    {
        "character": "Kyle",
        "line": "[looks up the info as Cartman talks] Yeah. Actually, there is."
    },
    {
        "character": "Cartman",
        "line": "[stops] What?"
    },
    {
        "character": "Kyle",
        "line": "There's a Hillary Clinton campaign rally. [Cartman stays silent] Cartman? ...Cartman? [Cartman has turned off his phone and runs out of school]"
    },
    {
        "character": "",
        "line": "Central Intelligence Agency, day. An agent takes a call and-"
    },
    {
        "character": "Agent",
        "line": "Sir! There's somebody calling in saying there's going to be a terrorist attack on the Hillary Clinton rally today."
    },
    {
        "character": "Head agent",
        "line": "What? [takes the call] This is CIA head, Alan Thompson."
    },
    {
        "character": "Cartman",
        "line": "Mr. Thompson, you have to call off the Clinton rally! There's a terrorist in South Park!"
    },
    {
        "character": "Mr. Thompson",
        "line": "What do you know?"
    },
    {
        "character": "Cartman",
        "line": "He just showed up out of the blue! I need to speak with the President right away!"
    },
    {
        "character": "Mr. Thompson",
        "line": "I'm the head of the CIA! You can tell me!"
    },
    {
        "character": "Cartman",
        "line": "I said I will only talk to the President!"
    },
    {
        "character": "Mr. Thompson",
        "line": "Look, if you have information of a threat, you could-"
    },
    {
        "character": "Cartman",
        "line": "LALALALALALALALA!"
    },
    {
        "character": "Mr. Thompson",
        "line": "I will have you arrested for-!"
    },
    {
        "character": "Cartman",
        "line": "LALALA-I can't hear you! Only the President! LALALALALALA!"
    },
    {
        "character": "",
        "line": "The Oval Office, 12:04:27 South Park time. The LED readout ticks away, the ominous echo follows."
    },
    {
        "character": "Aide",
        "line": "Call is coming through now, Mr. President."
    },
    {
        "character": "Bush",
        "line": "Hello?"
    },
    {
        "character": "Cartman",
        "line": "President Bush, this is Eric Cartman! Are we on a secure line?"
    },
    {
        "character": "Bush",
        "line": "Huh? Who."
    },
    {
        "character": "Cartman",
        "line": "Look, I know you're not the biggest Hildog fan, but she is in great danger right now!"
    },
    {
        "character": "Bush",
        "line": "Hildog?"
    },
    {
        "character": "",
        "line": "A motorcade in South Park, day. The American flag waving from a pole on the hood indicates Secret Service protection."
    },
    {
        "character": "Aide",
        "line": "Yes, I understand. I'll let Ms. Clinton know."
    },
    {
        "character": "Hillary",
        "line": "What is it, Brian?"
    },
    {
        "character": "Brian",
        "line": "Ms. Clinton, we just received word of a possible terrorist attack on your rally today."
    },
    {
        "character": "Hillary",
        "line": "Is the thread credible?"
    },
    {
        "character": "Brian",
        "line": "We aren't sure, but... perhaps it's best we call it off. [behind him, the rally gets closer and closer]"
    },
    {
        "character": "Hillary",
        "line": "No. No, I will not be bullied by terrorist threats. Your men do a good job, Brian. I have faith that any thread will be taken care of accordingly."
    },
    {
        "character": "Driver",
        "line": "We've reached the rally site, Hildog."
    },
    {
        "character": "",
        "line": "The rally site, downtown South Park."
    },
    {
        "character": "Aide 2",
        "line": "Don't worry, Mrs. Clinton, I'm sure everything will be fine."
    },
    {
        "character": "Hillary",
        "line": "Thank you, Chris. [leaves with Brian and a third aide. The driver walks off in the opposite direction, and Chris whips out a cell phone. He walks forward and calls someone]"
    },
    {
        "character": "Chris",
        "line": "They know about the bomb!"
    },
    {
        "character": "Blond Russian",
        "line": "That is impossible! We took every measure to assure the bomb was hidden from sight."
    },
    {
        "character": "Chris",
        "line": "Well somebody tipped off the CIA. I don't know how much they know, but security has been heightened."
    },
    {
        "character": "Blond Russian",
        "line": "That bomb must travel with the Clinton rally to Boston!"
    },
    {
        "character": "Chris",
        "line": "The bomb won't make it to Boston now! With the heightened security, it's only a matter of time before they find it!"
    },
    {
        "character": "Blonde Russian",
        "line": "Then we have no choice. We have to move up the attack."
    },
    {
        "character": "Chris",
        "line": "I understand, comrade."
    },
    {
        "character": "Blonde Russian",
        "line": "Prepare yourself. We detonate the bomb... within the hour."
    },
    {
        "character": "",
        "line": "12:17:56. Time keeps on ticking, ticking, ticking... Kyle is still at home, Cartman roams the rally."
    },
    {
        "character": "Cartman",
        "line": "Kyle, I'm at the Clinton rally site, but there's no sign of that kid!"
    },
    {
        "character": "Kyle",
        "line": "So then maybe you're wrong."
    },
    {
        "character": "Cartman",
        "line": "Nope, I'm not wrong. He must be somehow attacking remotely from his house. Did you find the address?"
    },
    {
        "character": "Kyle",
        "line": "Yeah. I cross-referenced his MySpace page with realtor.com. His parents moved into that green house on Janice Street."
    },
    {
        "character": "Cartman",
        "line": "Jesus, that's on the other side of town. All right, Kyle, I'm going to take a picture with my camera phone and upload it to you. You ready?"
    },
    {
        "character": "Kyle",
        "line": "Yeah. [Cartman giggles and sticks the phone down his pants, in front of his genitals. He takes the picture and sends it to Kyle. Kyle receives it on his computer] What is that?"
    },
    {
        "character": "Cartman",
        "line": "It's my balls! [laughs as Kyle just looks at the image]"
    },
    {
        "character": "Kyle",
        "line": "God damn it Cartman!"
    },
    {
        "character": "Cartman",
        "line": "[his laugh dies down, then] Okay. Okay, Kyle, let's stay focused here."
    },
    {
        "character": "Mayor McDaniels",
        "line": "People of South Park, it is my honor to introduce a woman who deserves nothing but respect. Mrs. Hillary Rodham Clinton! [the crowd cheers and holds up pro-Hillary signs: \"Hildog\", \"In Hildog We Trust\", \"Hildog, we love you!\", \"Hildog #1 fan\", \"South Park Wants Hildog!!\", \"Hildog '08\", \"We Love You\"]"
    },
    {
        "character": "Hillary",
        "line": "[affecting a Southern accent] It is so nice to be back in a small town like the one I came from. [more cheers for her]"
    },
    {
        "character": "Hildog Fan",
        "line": "Here we go! [his friends don dog-headed helmets and start barking.]"
    },
    {
        "character": "Brian",
        "line": "Otis Green, anything on that bomb threat? [\"You know, when I start my life in office, quite a few changes have to be made!\"]"
    },
    {
        "character": "Otis",
        "line": "We have the bomb-sniffing pig going through the crowd. If there is a bomb, the pig will find it. [the third aide has the pig on a leash, letting it roam as it will]"
    },
    {
        "character": "Hillary",
        "line": "This is why I campaign in small towns like these! Because it is in towns like South Park that you find the true America! [more cheers go up as aide and pig move around]"
    },
    {
        "character": "Aide 3",
        "line": "Oh my God, she got a scent! [the pig walks faster]"
    },
    {
        "character": "Brian",
        "line": "What?!"
    },
    {
        "character": "Aide 3",
        "line": "The pig is picking up the smell of nuclear residue. Terrorists have hidden a bomb!"
    },
    {
        "character": "Brian",
        "line": "[getting nervous] Oh my God! Where?! Where could they have stashed it?!"
    },
    {
        "character": "Aide 3",
        "line": "Come on, find it. Find! [the pig leads him up the steps to the stage]"
    },
    {
        "character": "Brian",
        "line": "My God, they hid it under the stage?!"
    },
    {
        "character": "Female aide",
        "line": "No wait, look. [the pig approaches Hillary and really wants to get at that bomb]"
    },
    {
        "character": "Hillary",
        "line": "How much money do we have to waste on needless spendin' when we should be focusing all our attention on... uh... [the pig buries its snout in Hillary's ass] on the education of all- Woo haha, whoa there, girl. Haha, [puts some distance between herself and the pig, but the pig won't back off] uh, uh, on the education of all children. [the pig tries the groin this time] Oh, I declare!"
    },
    {
        "character": "Otis",
        "line": "Oh my God. Do you think they could have hidden a nuclear device up Mrs. Clinton's..."
    },
    {
        "character": "",
        "line": "CIA Headquarters. An agent comes up to Mr. Thompson with a report."
    },
    {
        "character": "Agent",
        "line": "Mr. Thompson, the kid who called in the warning was right! We uncovered intel that terrorists have obtained a nuclear device, and that they have most likely hidden it in Mrs. Clinton's... well, in her..."
    },
    {
        "character": "Mr. Thompson",
        "line": "In her what?"
    },
    {
        "character": "Agent",
        "line": "In her snatch, sir."
    },
    {
        "character": "Mr. Thompson",
        "line": "What?!"
    },
    {
        "character": "",
        "line": "Back at the rally, later. Brian observes as two paramedics seat Hillary down on a gurney."
    },
    {
        "character": "Hillary",
        "line": "What is goin' on? I wasn't finished."
    },
    {
        "character": "Brian",
        "line": "Security measure, Mrs. Clinton. Probably nothing. [receives a call and answers it] Yes."
    },
    {
        "character": "",
        "line": "A CIA helicopter on its way to South Park, day."
    },
    {
        "character": "Mr. Thompson",
        "line": "Mr. Jeffries, this is Alan Thompson with the CIA. We have reason to believe that Mrs. Clinton may have a nuclear device up her snatch."
    },
    {
        "character": "Brian",
        "line": "A what?!"
    },
    {
        "character": "Mr. Thompson",
        "line": "A snatch. It's the technical term for vagina."
    },
    {
        "character": "Brian",
        "line": "No, I mean what kind of nuclear device?!"
    },
    {
        "character": "",
        "line": "A diagram of a bomb inside a woman's uterus. Zoom out to reveal CIA headquarters"
    },
    {
        "character": "Mr. Waters",
        "line": "Mr. Jeffries, this is Frank Waters. It's a suitcase nuke, designed to fit in a woman's snizz. It's called a snuke."
    },
    {
        "character": "",
        "line": "Back at the rally, later. Brian walks up to Hillary."
    },
    {
        "character": "Hillary",
        "line": "What is goin' on, Brian?"
    },
    {
        "character": "Brian",
        "line": "Ms. Clinton, it appears that terrorists have snuck a snuke up your snizz."
    },
    {
        "character": "Hillary",
        "line": "[fans herself in a Southern fashion] Oh my."
    },
    {
        "character": "Brian",
        "line": "What do we do? Can we disable the timer?"
    },
    {
        "character": "Mr. Thompson",
        "line": "It won't have a timer. Snukes are detonated remotely. Whoever our terrorist is has a detonator with him."
    },
    {
        "character": "Brian",
        "line": "But then that means..."
    },
    {
        "character": "Mr. Thompson",
        "line": "Yes. If we don't find that detonator, everyone in the town of South Park is going to die. For-ever."
    },
    {
        "character": "",
        "line": "12:28:38 and counting. Four images come up: Hillary on the gurney, Kyle at his computer, Butters and Baahir playing checkers in Butters' living room, and the CIA landing in South Park"
    },
    {
        "character": "Mr. Thompson",
        "line": "Do we have that phone trace?"
    },
    {
        "character": "CIA vice head",
        "line": "[hands him the phone] The call is going through now, sir."
    },
    {
        "character": "Cartman",
        "line": "[gets the call] Yeah? [walks through a parking lot]"
    },
    {
        "character": "Mr. Thompson",
        "line": "This is CIA head Alan Thompson. We spoke before about the- [he and his agents walk down the street. Two angles are shown of that, and a third image of Cartman walking through the lot]"
    },
    {
        "character": "Cartman",
        "line": "Yes, Mr. Thompson?"
    },
    {
        "character": "Mr. Thompson",
        "line": "Well, we've just arrived in your town."
    },
    {
        "character": "Cartman",
        "line": "Why? Did you find something?"
    },
    {
        "character": "Mr. Thompson",
        "line": "Yes. There's a suitcase nuke in Ms. Clinton's snizz."
    },
    {
        "character": "Cartman",
        "line": "[stops] A snuke?"
    },
    {
        "character": "Mr. Thompson",
        "line": "That's right. It's controlled by a remote detonator. We have to locate the terrorist before he sets it off."
    },
    {
        "character": "Cartman",
        "line": "[walks again] I have the address of the house the terrorist moved into. I'm almost there now; where are you?"
    },
    {
        "character": "Mr. Thompson",
        "line": "We're on the town's main street, right by an ice cream shop."
    },
    {
        "character": "Cartman",
        "line": "Oh dude, I'm, I'm right next to you. [the framing for the two scenes is removed to reveal the one image of Cartman standing next to the CIA agents. They look at each other]"
    },
    {
        "character": "Mr. Thompson",
        "line": "Oh, hey."
    },
    {
        "character": "",
        "line": "Kyle's room, day. Kyle is still at his computer when Stan walks in."
    },
    {
        "character": "Stan",
        "line": "Dude, we totally got let out of school."
    },
    {
        "character": "Kyle",
        "line": "I know. Something big is going on. Take a look at this. I did a Google search for \"Hillary Clinton Campaign Rally\" right? And one of the links was to YouTube, where this Russian guy had a bunch of videos."
    },
    {
        "character": "Stan",
        "line": "Russian?"
    },
    {
        "character": "Kyle",
        "line": "Yeah, this guy. [a YouTube profile page is shown] Vladimir Stolfsky. He had videos on YouTube of every single rally."
    },
    {
        "character": "Stan",
        "line": "So he's a Hillary Clinton fan."
    },
    {
        "character": "Kyle",
        "line": "No. I cross-referenced his YouTube profile with MySpace, and according to his blog, he's an old-school Communist. So what's he doing at every Clinton rally?"
    },
    {
        "character": "Stan",
        "line": "Do a WebCrawler search: maybe he has podcasts up somewhere."
    },
    {
        "character": "Kyle",
        "line": "Oh that's a good idea. [does the search]"
    },
    {
        "character": "",
        "line": "The Hakeem house, later. Police, SWAT, and CIA move in on the house and arrest Baahir's parents."
    },
    {
        "character": "Mr. Hakeem",
        "line": "What is going on? What have we done?"
    },
    {
        "character": "Mr. Thompson",
        "line": "They claim they don't know anything about an attack."
    },
    {
        "character": "Cartman",
        "line": "Big surprise!"
    },
    {
        "character": "Police officer",
        "line": "Sir, first pass of the house, we didn't find a snuke detonator anywhere."
    },
    {
        "character": "Mr. Thompson",
        "line": "Mr. Hakeem, where is your son?"
    },
    {
        "character": "Mr. Hakeem",
        "line": "We thought he was at school. He's not at school?"
    },
    {
        "character": "",
        "line": "A clinic nearby. Hillary is up on stirrups while some police and agents look at an X-ray of her abdomen and groin."
    },
    {
        "character": "Brian",
        "line": "You're doing great, Ms. Clinton."
    },
    {
        "character": "Hillary",
        "line": "Do they know how long, Brian? How long before the snuke in my snizz goes off?"
    },
    {
        "character": "Brian",
        "line": "They'll find the detonator, Hildog."
    },
    {
        "character": "Aide 3",
        "line": "We can't wait for them to find the detonator. If we can get to the bomb, me-maybe we can deactivate it. Can't somebody go and take a look inside Mrs. Clinton's snizz?"
    },
    {
        "character": "EOD leader",
        "line": "[part of the bomb squad] I'm not sending any of my men in there."
    },
    {
        "character": "Chris",
        "line": "Are you almost ready to set off the bomb?"
    },
    {
        "character": "Vladimir",
        "line": "Everything is set. We have the detonator up and running. [the detonator is shown with its LED readout: 12:34:10... 12:34:11... 12:34:12... 12:34:13... ]"
    },
    {
        "character": "",
        "line": "An interrogation room. A CIA agent grills Mr. Hakeem, with a female agent as witness."
    },
    {
        "character": "Agent 2",
        "line": "Mr. Hakeem, we need to know where your son is!"
    },
    {
        "character": "Mr. Hakeem",
        "line": "I tell you, I do not know."
    },
    {
        "character": "Agent 2",
        "line": "[sighs, then leaves the room with the female agent and enters the adjoining control room, where Mr. Thompson is waiting] This is getting us nowhere. If he knows anything, he's not saying."
    },
    {
        "character": "Cartman",
        "line": "Let me have time with him."
    },
    {
        "character": "Female agent",
        "line": "What are you going to do?"
    },
    {
        "character": "Cartman",
        "line": "We have to find that detonator! Let me have time with him! [removes his cap and goes in] You will tell me where your son is!"
    },
    {
        "character": "Mr. Hakeem",
        "line": "He should be at school! [Cartman walks off and brings back a stool, setting it against Mr. Hakeem's chair. He climbs up and stands on the stool, drops his pants, and starts farting.] Hey!"
    },
    {
        "character": "Cartman",
        "line": "[farts] Where is the detonator?!"
    },
    {
        "character": "Mr. Hakeem",
        "line": "Wuh-what detonator are you ta-"
    },
    {
        "character": "Cartman",
        "line": "[farts some more, and again, and again] I can do this aaall day."
    },
    {
        "character": "Mr. Hakeem",
        "line": "[coughs] I don't know anything about a- [Cartman farts a short one, and then a long one that makes Mr. Hakeem turn away] Aawwwwgh [holds his breath, gasps for air and coughs] Stop it! Really!"
    },
    {
        "character": "Cartman",
        "line": "You can make it stop!"
    },
    {
        "character": "Mr. Hakeem",
        "line": "[almost weeps] I don't have the- [Cartman farts for a long time, and the female agent turns away from the one-way window]"
    },
    {
        "character": "Female agent",
        "line": "Are we just gonna let this go on? [Cartman continues farting]"
    },
    {
        "character": "",
        "line": "Kyle's room, later."
    },
    {
        "character": "Kyle",
        "line": "Okay, I got a text of the Russian guy's podcast. It's all a bunch of links to eBay."
    },
    {
        "character": "Stan",
        "line": "You should be able to search his username on eBay and see what he's been buying and selling. [CIA agents enter the room quickly with their equipment]"
    },
    {
        "character": "CIA vice head",
        "line": "Ferris, set up over there. Two of you can take that bed area. [Stan steps down for a better look at the activity]"
    },
    {
        "character": "Kyle",
        "line": "Hey."
    },
    {
        "character": "CIA vice head",
        "line": "Donner, take over that station. [points to Kyle. Donner walks over and shoves Kyle off his chair]"
    },
    {
        "character": "Kyle",
        "line": "[stands up] What's going on?"
    },
    {
        "character": "CIA vice head",
        "line": "This department is being absorbed by Homeland Security!"
    },
    {
        "character": "Kyle",
        "line": "...Homeland Security?"
    },
    {
        "character": "CIA vice head",
        "line": "Look, your little game of goin' over people's heads is over! You could still work, but from now on you answer to me, you got that?!"
    },
    {
        "character": "FBI leader",
        "line": "'Scuse me, who's in charge here?!"
    },
    {
        "character": "CIA vice head",
        "line": "I am!"
    },
    {
        "character": "FBI leader",
        "line": "[more people come in] Yeah well not anymore you're not. This department has just been assigned to the FBI."
    },
    {
        "character": "CIA vice head",
        "line": "That's outrageous! On whose orders?!"
    },
    {
        "character": "FBI leader",
        "line": "On order of the Secretary of Defense! You had your shot, now I'm in charge!"
    },
    {
        "character": "ATF leader",
        "line": "[more people come in] Not anymore you're not! Orders just came down from Central! They want ATF handling this on all fronts! All right people, from now on you're answering to me!"
    },
    {
        "character": "Secret Service leader",
        "line": "[more people come in] Not anymore they're not! Orders from the President: he wants this handled by his staff personally! Now Nelson is in charge."
    },
    {
        "character": "Nelson",
        "line": "[bursts into the scene] Not anymore I'm not! [everyone else falls silent]"
    },
    {
        "character": "",
        "line": "The interrogation room, later. Cartman walks in with a metal suitcase containing syringes. He takes one out"
    },
    {
        "character": "Mr. Hakeem",
        "line": "What are you going to do to my wife?!"
    },
    {
        "character": "Cartman",
        "line": "Nothing... if you tell me where your son is!"
    },
    {
        "character": "Mrs. Hakeem",
        "line": "We told you: we don't know."
    },
    {
        "character": "Cartman",
        "line": "[whips around and shows them the syringe] Do you know what this is?! [they look at each other, unsure] This... is apple juice. It gives super bad farts. [injects himself with the syringe into the right arm and hops up on the stool next to Mrs. Hakeem]"
    },
    {
        "character": "Female agent",
        "line": "Did he just inject himself with apple juice?"
    },
    {
        "character": "Cartman",
        "line": "Where is your son?!"
    },
    {
        "character": "Mr. Hakeem",
        "line": "She doesn't know either. [Cartman turns and drops his pants, and farts on Mrs. Hakeem's face]"
    },
    {
        "character": "Mrs. Hakeem",
        "line": "Aaaaaaaah! Aaaaaaaah!"
    },
    {
        "character": "Mr. Hakeem",
        "line": "I mean it! Stop! That is disgusting! Where is your mother?! [a phone rings and the camera zooms in on Mrs. Hakeem's shirt pocket. Cartman turns and reaches into the pocket, pulling out the cell phone]"
    },
    {
        "character": "Cartman",
        "line": "Answer it! [holds the phone to Mrs. Hakeem's right ear]"
    },
    {
        "character": "Mrs. Hakeem",
        "line": "Hallo? Hallo Baahir. Where are you? Who it But-ters?"
    },
    {
        "character": "Cartman",
        "line": "Butters."
    },
    {
        "character": "Mrs. Hakeem",
        "line": "Baahir, one of your classmates is keeping us hostage. [Cartman drops the phone and farts a good gust of flatulence against Mrs. Hakeem's face] Aaaaaaaah! Aaaaaaaah! [Cartman drops off the stool and enters the control room.]"
    },
    {
        "character": "Mr. Hakeem",
        "line": "Ogh! You filthy little rapscallion!"
    },
    {
        "character": "Cartman",
        "line": "We got him! I know where he is!"
    },
    {
        "character": "Female agent",
        "line": "All right, where? We'll send our people in."
    },
    {
        "character": "Cartman",
        "line": "No no, he's my lead. [opens the suitcase]"
    },
    {
        "character": "Mr. Thompson",
        "line": "You're not going alone."
    },
    {
        "character": "Cartman",
        "line": "You blow in there and you risk taking him down without finding the detonator! I'm going to find out where it is! [gives himself a double injection of apple juice]"
    },
    {
        "character": "",
        "line": "Kyle's room, later. The Secret Service is running the show now."
    },
    {
        "character": "CIA leader 2",
        "line": "[white hair] All right, people, I'm in charge now and we will find the terrorists. Jarvis, I want you to check for any terrorist chatter on AOL. Marley and Greggs, try searching for nuclear devices on askjeeves.com."
    },
    {
        "character": "Kyle",
        "line": "Ask Jeeves? Nobody uses Ask Jeeves! Just Google-search it!"
    },
    {
        "character": "CIA leader 2",
        "line": "Are you tellin' me how to do my job?"
    },
    {
        "character": "Kyle",
        "line": "Yes. There's a Russian guy named Vladimir Stolfsky who's got search engine hits all over this thing."
    },
    {
        "character": "CIA leader 2",
        "line": "Chase, search the name Stolfsky on YouTube and cross-reference it with JDate!"
    },
    {
        "character": "Chase",
        "line": "Checking."
    },
    {
        "character": "Stan",
        "line": "Look, these Russian guys all have blogs talking about this like it's just some big diversion for something much bigger!"
    },
    {
        "character": "Female agent 2",
        "line": "[with a stack of papers] Sir, these kids are right. We've just received intel that Russian terrorists are believed to be responsible for the threat."
    },
    {
        "character": "CIA leader 2",
        "line": "Where's the intel from?"
    },
    {
        "character": "Female agent 2",
        "line": "We just read it on Drudge Report."
    },
    {
        "character": "Kyle",
        "line": "Look, we already have the guy's blog. Maybe we can find an address and check it out on MapQuest."
    },
    {
        "character": "CIA leader 2",
        "line": "We do this my way! I'm the one in charge!"
    },
    {
        "character": "Kyle",
        "line": "[he and Stan look at each other] ...Not anymore you're not."
    },
    {
        "character": "CIA leader 2",
        "line": "Oh, snap. [walks off dejected]"
    },
    {
        "character": "",
        "line": "Butters' living room, day. He and Baahir are playing Checkers, and Butters looks like he's winning."
    },
    {
        "character": "Butters",
        "line": "[makes his move] Whoopee! I captured another one of your pieces, Baahir. [outside, Cartman runs up to the window and crashes through it.]"
    },
    {
        "character": "Cartman",
        "line": "Uuugh! [lies motionless for a few seconds, then gets up]"
    },
    {
        "character": "Butters",
        "line": "Oh hey Eric."
    },
    {
        "character": "Cartman",
        "line": "[walks up to Baahir and grabs him by the collar] Where is the detonator!"
    },
    {
        "character": "Baahir",
        "line": "The what?"
    },
    {
        "character": "Cartman",
        "line": "You have exactly five seconds before I start dropping serious apple juice farts on your face! One!"
    },
    {
        "character": "Baahir",
        "line": "Leave me alone! [heads for the front door and walks out. Cartman follows him] Upta!"
    },
    {
        "character": "Butters",
        "line": "[watches them leave] Hey, I was about to win!"
    },
    {
        "character": "",
        "line": "The sidewalk. Cartman chases Baahir down the street."
    },
    {
        "character": "Cartman",
        "line": "Stop, terrorist, or I will shoot you! [A black van pulls up next to them and the side door slides open. Three real terrorists jump out and aim their semiautomatics at the two boys]"
    },
    {
        "character": "Terrorist #1",
        "line": "[olive-colored] Get in the van! [Both boys are scared, but Cartman backs away]"
    },
    {
        "character": "Cartman",
        "line": "Uh, that's cool. I'm actually not... playing anymore."
    },
    {
        "character": "Terrorist #1",
        "line": "[they aim their guns at Cartman] Get in the van!"
    },
    {
        "character": "",
        "line": "The clinic."
    },
    {
        "character": "Aide 3",
        "line": "That's it! We don't have a choice anymore! Somebody is going to have to go in, and try to disarm the snuke manually!"
    },
    {
        "character": "EOD leader",
        "line": "No, it's too dangerous! That snatch has not seen action in over 30 years! It could be toxic!"
    },
    {
        "character": "Brian",
        "line": "[overhearing it] I'll do it! I'll check out Ms. Clinton's snizz."
    },
    {
        "character": "",
        "line": "The terrorists' hideout, 12:40:27 and counting. Vladimir has Cartman and Baahir tied up in chairs"
    },
    {
        "character": "Cartman",
        "line": "Let me go! Please! I am just a little boy!"
    },
    {
        "character": "Vladimir",
        "line": "You called and warned the government of our plans! What you don't know is that we are simply mercenaries! We were paid to set up the snuke so that the real enemy of America could attack!"
    },
    {
        "character": "Cartman",
        "line": "That's cool. I'm fine with Muslims invading."
    },
    {
        "character": "Vladimir",
        "line": "[aims the semiautomatic at him] Do you really think Muslims are behind this terrorist threat?!"
    },
    {
        "character": "Cartman",
        "line": "Uhh yes, of course?"
    },
    {
        "character": "Vladimir",
        "line": "America had other enemies before the Muslims, you know. Who is America's oldest enemy?"
    },
    {
        "character": "Cartman",
        "line": "The Russians?"
    },
    {
        "character": "Vladimir",
        "line": "Before that."
    },
    {
        "character": "Cartman",
        "line": "The Germans?"
    },
    {
        "character": "Vladimir",
        "line": "Before that."
    },
    {
        "character": "Cartman",
        "line": "The Germans again?"
    },
    {
        "character": "Vladimir",
        "line": "Before that! I am talking about the oldest threat to America! The greatest enemy America has ever known!"
    },
    {
        "character": "Cartman",
        "line": "You can't possible mean...?"
    },
    {
        "character": "",
        "line": "The ocean blue. A fleet of British ships is sailing towards the United States, but these ships are from another era. The men are dressed in uniforms of the Revolutionary War era - as Red Coats"
    },
    {
        "character": "Captain",
        "line": "Two hundred years we've waited. Finally. We will get those traitors to the Crown! [gets a call and answers it on his cell phone] Yes, Your Majesty?"
    },
    {
        "character": "Queen Elizabeth II",
        "line": "The Russians are ready to set off the diversion. Full sail."
    },
    {
        "character": "Captain",
        "line": "Full sail, Your Majesty?"
    },
    {
        "character": "",
        "line": "12:43:57 and counting."
    },
    {
        "character": "",
        "line": "12:47:18 and Hillary is back on stirrups (upper left picture). 12:47:19 and Kyle is back at his computer (upper right picture). 12:47:20 and Cartman is shown struggling in his seat (lower right picture). 12:47:21 and the British fleet is shown (lower left picture)."
    },
    {
        "character": "",
        "line": "The clinic. The aide, doctor, and other officials are behind protective glass in a booth. Brian is dressed in a Hazmat suit and gas mask"
    },
    {
        "character": "Aide 3",
        "line": "All right, Brian, this is it. Get in there and see if you can disarm the snuke in Ms. Clinton's snatch."
    },
    {
        "character": "Brian",
        "line": "[diving in slowly, has radio communication with the booth] All right. I'm nearing her snizz now."
    },
    {
        "character": "EOD leader",
        "line": "God help him."
    },
    {
        "character": "Aide 3",
        "line": "What do you see, Brian?"
    },
    {
        "character": "Brian",
        "line": "It's dark... cold..."
    },
    {
        "character": "Aide 3",
        "line": "You're doing fine, Brian. Get as close as you can... Y-you have to look inside the snizz."
    },
    {
        "character": "Brian",
        "line": "Uh, uh, all right, I'm looking. Yes, I see... I see the device! [begins to cough]"
    },
    {
        "character": "Aide 3",
        "line": "You're doin' great, Brian. Hang in there."
    },
    {
        "character": "Brian",
        "line": "There's um, metal housing... some kind of three-pronged triggering mechanism that... Wait there's... there's something else here! There's something... [static fills the transmission and the aide tries to restore communication]"
    },
    {
        "character": "Aide 3",
        "line": "Say again, Brian."
    },
    {
        "character": "Brian",
        "line": "[amid heavy static] There's something perched on the snuke's coil... Oh God, it's looking at me!"
    },
    {
        "character": "EOD leader",
        "line": "[takes control] Brian, get out of there!"
    },
    {
        "character": "Brian",
        "line": "Wha... what are you?! I have no qualm with you! Stay back! Stay back I- agh! Aaagh!"
    },
    {
        "character": "EOD leader",
        "line": "Brian? Brian, what's happening?"
    },
    {
        "character": "Brian",
        "line": "It's... eating my head! It's eating my head! [the camera zooms back to show his body gyrating helplessly, then being spit out by Mrs. Clinton's snizz]"
    },
    {
        "character": "Hillary",
        "line": "Hoh my!"
    },
    {
        "character": "",
        "line": "Kyle's bedroom. He's at his computer as agents discuss things behind him."
    },
    {
        "character": "Kyle",
        "line": "I got it! I got it! According to PayPal, the Russian guys are just hired mercenaries who had ads up on Craig's List and got paid through eBay so that Boston could be attacked by... the British."
    },
    {
        "character": "Female agent 2",
        "line": "The British?"
    },
    {
        "character": "Agent 4",
        "line": "Loyalist Red Coats!"
    },
    {
        "character": "Chase",
        "line": "Sir, I found the Russian's eHarmony account! It does list an address in South Park!"
    },
    {
        "character": "Kyle",
        "line": "All right! MapQuest the address!"
    },
    {
        "character": "Chase",
        "line": "I'll use Google Maps. It has live traffic."
    },
    {
        "character": "Kyle",
        "line": "Good thinking"
    },
    {
        "character": "CIA leader 2",
        "line": "Sir, we have the terrorists' location. IM'ing you now."
    },
    {
        "character": "",
        "line": "The terrorists' hideout."
    },
    {
        "character": "Vladimir",
        "line": "[warmly shakes a terrorist's hand] It was good knowing you, comrade."
    },
    {
        "character": "Baahir",
        "line": "Please. Think about what you are doing. The British are just using you; you're going to die."
    },
    {
        "character": "Vladimir",
        "line": "Yes, but we will be rich."
    },
    {
        "character": "Agent",
        "line": "[outside] Left flank, prig prang and clear! Go go go! [the doors to the hideout fly open and CIA agents pour in, with the CIA Vice Head supervising the riad]"
    },
    {
        "character": "Mr. Thompson",
        "line": "[last to enter, gun drawn] The game is over! Get down on the ground!"
    },
    {
        "character": "Vladimir",
        "line": "How did they find us?"
    },
    {
        "character": "Mr. Thompson",
        "line": "We know about everything! Your diversion to help the Red Coats is over!"
    },
    {
        "character": "Vladimir",
        "line": "It doesn't matter. The detonator is on a timer. You are too late! In three minutes! [the camera quickly moves to the detonator: 12:56:57 and counting. Four seconds later the power is shut off] What the hell?!"
    },
    {
        "character": "Agent",
        "line": "The power went out!"
    },
    {
        "character": "Mr. Thompson",
        "line": "Well so then what time is it? [the power returns and the detonator's timer is reset to a blinking 12:00:00]"
    },
    {
        "character": "Vladimir",
        "line": "Oh crap."
    },
    {
        "character": "Mr. Thompson",
        "line": "Take 'em down! [the agents fire away. One after one, terrorists go down, dead. Vladimir climbs a wooden ladder to the hideout's roof]"
    },
    {
        "character": "Vladimir",
        "line": "No! I don't want to die without being paid! [an agent shoots him down, he hits the floor and blows up. CIA agents remove the ropes from Cartman and Baahir]"
    },
    {
        "character": "Mr. Thompson",
        "line": "[places a call] The detonator is secured, general. You are cleared to proceed."
    },
    {
        "character": "",
        "line": "The ocean blue. The British fleet continues towards the United State. American jets fly over them and prepare to fire"
    },
    {
        "character": "Captain",
        "line": "The Rebel Americans know of our attack?!"
    },
    {
        "character": "Soldier",
        "line": "How?"
    },
    {
        "character": "Captain",
        "line": "Fire at will! [the soldiers quickly aim and fire. The bullets have no effect, as the jets simply unload their bombs on the ships and sink them.]"
    },
    {
        "character": "",
        "line": "The Royal Palace, the Queen's throne room. She's seated at her throne and gets a call. She gets the phone from one of her servants"
    },
    {
        "character": "Queen Elizabeth II",
        "line": "Yes?"
    },
    {
        "character": "Captain",
        "line": "Your Majesty, the attack has failed. We were... unable to end the American Revolution."
    },
    {
        "character": "Queen Elizabeth II",
        "line": "I see. [sets the phone down, takes a loaded gun to her mouth, and shoots her brains out. She falls forward and hits the ground, dead.]"
    },
    {
        "character": "",
        "line": "South Park, at Long Road Shipping, the apparent hideout. Everyone stands in the street."
    },
    {
        "character": "Mr. Thompson",
        "line": "[walking into view] Well, looks like we saved our country from British rule once again."
    },
    {
        "character": "Kyle",
        "line": "Yeah. It just proves we need to learn not to profile one race of people. Because, actually, most of the world hates us."
    },
    {
        "character": "Cartman",
        "line": "Well Baahir, I was thinking that maybe I owe you an apology."
    },
    {
        "character": "Baahir",
        "line": "Really?"
    },
    {
        "character": "Cartman",
        "line": "Yes, but then I realized that, technically, I don't. Because by being suspicious of you I saved your life and everyone else's. So really, you owe me an apology. But that's cool."
    },
    {
        "character": "Kyle",
        "line": "...You didn't save everyone, I did! You were just out harassing Muslims!"
    },
    {
        "character": "Cartman",
        "line": "But if I hadn't called you in the first place to check out the Muslim, you would have just stayed in bed sick all day, right?"
    },
    {
        "character": "Kyle",
        "line": "...Maybe. [looks away]"
    },
    {
        "character": "Cartman",
        "line": "Maybe? If I hadn't called you, you wouldn't have been on your computer checking out the Clinton rally. That means my intolerance of Muslims saved America."
    },
    {
        "character": "Kyle",
        "line": "...That is so missing the point."
    },
    {
        "character": "Cartman",
        "line": "Me being a bigot stopped a nuclear bomb from going off, yes or no?!"
    },
    {
        "character": "Kyle",
        "line": "The-that's not the right way to look at it, I-"
    },
    {
        "character": "Cartman",
        "line": "Yes or no, Kyle?!"
    },
    {
        "character": "Kyle",
        "line": "No! ...Not... not like you're saying."
    },
    {
        "character": "Cartman",
        "line": "But that's all I'm saying: today, bigotry and racism saved the day. Baahir, you get this, right? [Baahir's parents approach, looking around at all the activity in front of their house]"
    },
    {
        "character": "Mr. Hakeem",
        "line": "Baahir! Get away from that disgusting child! Get back home and start packing your things! We are leaving this whole intolerant country! [Mr. Hakeem nudges Baahir forward, and the family leaves]"
    },
    {
        "character": "Butters",
        "line": "Awwwww."
    },
    {
        "character": "Cartman",
        "line": "Okay. Who got rid of the Muslims, huh? [raises his own hand] That was all me. Simple thank you will suffice."
    }
]