[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, Friday during the day, Mrs. Garrison's class. The kids enter the classroom"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[enters and drops her books on her desk in anger] Everyone, sit down and shut the fuck up! God damn it! [some papers flutter off the top of the stack. She turns and erases some addition problems she had up on the blackboard earlier] Stupid ass man! They're all the same! [Stan crosses his arms and buries his head in them. He's the only student to do so]"
    },
    {
        "character": "Kyle",
        "line": "Oh God, here we go again."
    },
    {
        "character": "Mrs. Garrison",
        "line": "All men care about is sex! I spent two hours getting ready for that stupid date! And when the bastard checks out my body, he just says, \"Hey, did you used to be a guy or somethin'?\" I'm a woman now, so what's it matter?!"
    },
    {
        "character": "Stan",
        "line": "Uh oh, this isn't good."
    },
    {
        "character": "Mrs. Garrison",
        "line": "[gets into Stan's face] Did I say something to you, sugartits?!"
    },
    {
        "character": "Stan",
        "line": "[frightened] No ma'am."
    },
    {
        "character": "Mrs. Garrison",
        "line": "[heads back to the blackboard] You boys make me sick! You're well on your way to being men, who only think with their penises! I am assigning all of you weekend homework! You are going to read Hemmingway's book, \"The Old Man and the Sea\"!"
    },
    {
        "character": "Cartman",
        "line": "Have you lost your mind?"
    },
    {
        "character": "Stan",
        "line": "Dude, we can't read an entire book in one weekend."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Oh, that's too bad, dude. Maybe if you boys could keep your penises in your pants once in a while you'd get more done!"
    },
    {
        "character": "Butters",
        "line": "But Teacher, my penis never slips out of my pants. Eh-except sometimes when I'm wearin' pajamas."
    },
    {
        "character": "Mrs. Garrison",
        "line": "If you do not have an essay written on Monday, then you will fail! Is that clear?!"
    },
    {
        "character": "",
        "line": "South Park Elementary, after school, outside. The students exit and head home."
    },
    {
        "character": "Stan",
        "line": "Dude, how are we supposed to read an entire book over the weekend and write an essay?"
    },
    {
        "character": "Kyle",
        "line": "Our whole weekend is shot."
    },
    {
        "character": "Kenny",
        "line": "(What the hell are we going to do?!)"
    },
    {
        "character": "Cartman",
        "line": "You guys, you guys, relax. We don't have to read the book or write the essay."
    },
    {
        "character": "Stan",
        "line": "We don't?"
    },
    {
        "character": "Cartman",
        "line": "No. There's people you can hire to do these kinds of things."
    },
    {
        "character": "",
        "line": "Moovit Truck Rental, in the industrial section of South Park, Friday afternoon. A group of Mexican day laborers stand around waiting for work. Cartman and friends approach them. And Cartman whistles"
    },
    {
        "character": "Cartman",
        "line": "¿Que paso? ¿Que paso? Looking for work? ¿Sí? ¿Trabajo?"
    },
    {
        "character": "Laborer 1",
        "line": "[wearing baseball cap with flag] Yeis."
    },
    {
        "character": "Laborer 2",
        "line": "[wearing cap backwards] We looking work, sí."
    },
    {
        "character": "Cartman",
        "line": "[holds his arms out in open embrace] Okay, listen up, Mexicans. We need you to read [whips out the book from his back pocket] \"The Old Man and the Sea\" for us. Comprende? \"E Old Mand Y La Mer\"."
    },
    {
        "character": "Laborer 2",
        "line": "Okay."
    },
    {
        "character": "Laborer 1",
        "line": "Sure."
    },
    {
        "character": "Laborer 3",
        "line": "[wearing NY baseball cap] Okay."
    },
    {
        "character": "Laborer 4",
        "line": "[wearing gray baseball cap] Yeah."
    },
    {
        "character": "Cartman",
        "line": "Here. We need you to work together, read the book and write four essays, comprende? La samaraisia."
    },
    {
        "character": "Laborer 2",
        "line": "Okay no problem. That's no problem."
    },
    {
        "character": "Laborer 1",
        "line": "Yeah, we can do that."
    },
    {
        "character": "Laborer 5",
        "line": "Sí, la samaraisia."
    },
    {
        "character": "Cartman",
        "line": "Okay, gracias."
    },
    {
        "character": "Stan and Kyle",
        "line": "Gracias."
    },
    {
        "character": "Stan",
        "line": "Dude, that is awesome. I had no idea you could do that."
    },
    {
        "character": "Cartman",
        "line": "Oh yeah, dude. Havin' Mexicans around totally kicks fuckin' ass."
    },
    {
        "character": "",
        "line": "Curves, a fitness and weight loss center, day. Mrs. Garrison is running hard on a treadmill, taking out her frustrations."
    },
    {
        "character": "Mrs. Garrison",
        "line": "They can all rot in hell! Who needs men anyway?! They're God damned arrogant self-centered assholes is what they are! [a woman walks up and gets on the treadmill to her right]"
    },
    {
        "character": "Woman",
        "line": "Are you okay, hon?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "I just hate men is all. It's like all they care about is how hot you look!"
    },
    {
        "character": "Woman",
        "line": "Yeah, I've never been into men. That's why I work out here. Since it's women only we don't get oogled at or feel self-conscious."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Tell me about it! I can't even stretch at a normal gym without some guy trying to stare down my vage."
    },
    {
        "character": "Woman",
        "line": "I'm Allyson."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Oh, I'm Janet. Janet Garrison. Sorry I'm so pissed off."
    },
    {
        "character": "Allyson",
        "line": "No, I like it. You seem like a very strong woman."
    },
    {
        "character": "Janet",
        "line": "Yeah, I've been told that."
    },
    {
        "character": "Allyson",
        "line": "How come I've never seen you down at the girl bar?"
    },
    {
        "character": "Janet",
        "line": "Girl bar? I never even knew there was such a place."
    },
    {
        "character": "Allyson",
        "line": "Oh you'd love it. It's the only bar in town where women like us can hang out and be ourselves. It's called \"Lebow\"."
    },
    {
        "character": "",
        "line": "Les Bos, night, 13280. \"Lebow\" is the French pronunciation of Les Bos. Allyson and Janet approach the front door. Allyson leads Janet in."
    },
    {
        "character": "Allyson",
        "line": "Hi Linda, hi Kate."
    },
    {
        "character": "Woman 2",
        "line": "Hey Allyson."
    },
    {
        "character": "Woman 3",
        "line": "Who's the new girl?"
    },
    {
        "character": "Woman 2",
        "line": "Allyson always goes for the butch ones."
    },
    {
        "character": "Allyson",
        "line": "[approaches the bar with Janet] Hey Nell. What's up, Tracy?"
    },
    {
        "character": "Janet",
        "line": "Oowhat a great place. All the girls here seem to know each other."
    },
    {
        "character": "Allyson",
        "line": "Yeah. Well, most of the girls here have done each other. [gets a glass and a beer and pours the beer into the glass.]"
    },
    {
        "character": "Janet",
        "line": "He-yeah. Done what?"
    },
    {
        "character": "Allyson",
        "line": "You know. [smiles] Had sex. [passes the beer to Janet and orders a second beer for herself.]"
    },
    {
        "character": "Janet",
        "line": "[looks around] Oh my God, this is a lesbian bar?"
    },
    {
        "character": "Allyson",
        "line": "Yeah. I... thought you understood that."
    },
    {
        "character": "Janet",
        "line": "Oh jeez. [fans herself]"
    },
    {
        "character": "Allyson",
        "line": "I'm sorry. I thought you knew what \"girl bar\" meant."
    },
    {
        "character": "Janet",
        "line": "But I'm not a- ...whoa! Who-o-o-o-oa. [moves away]"
    },
    {
        "character": "",
        "line": "Les Bos, bathroom. Janet is washing her face."
    },
    {
        "character": "Allyson",
        "line": "Janet, I'm really sorry. It's just that at the gym you said you didn't like being with men, so I thought you were a-"
    },
    {
        "character": "Janet",
        "line": "I don't like being with men! They're perverted selfish pigs!"
    },
    {
        "character": "Allyson",
        "line": "Have you... never even... thought... of being... with another woman?"
    },
    {
        "character": "Janet",
        "line": "Oho goodness no! Of course I haven't. I mean... really I don't even understand how two women can make love. I mean un, unless they just kinda [demonstrates with her fingers] scissor or something."
    },
    {
        "character": "Allyson",
        "line": "There are a lot of ways to make love, Janet."
    },
    {
        "character": "Janet",
        "line": "I guess I'd be lying if I said I wasn't a little ...titillated."
    },
    {
        "character": "Allyson",
        "line": "Could I... maybe kiss you? [gets close, but Janet turns and walks away]"
    },
    {
        "character": "Janet",
        "line": "Oh, this is wrong! You're another woman; it doesn't make sense!"
    },
    {
        "character": "Allyson",
        "line": "Is it wrong, Janet? Let your inhibitions go. Let's just have fun tonight. [they hold hands] No commitments. [Allyson lets go] Just fun. [she grabs her hand and they close in for the kiss]"
    },
    {
        "character": "",
        "line": "Janet's bedroom, later. Janet and Allyson are going at it in bed."
    },
    {
        "character": "Janet",
        "line": "Oh yeah, scissor! Yeah, scissor me Allyson!"
    },
    {
        "character": "Allyson",
        "line": "Janet, you're crazy!"
    },
    {
        "character": "Janet",
        "line": "Oh, this is hot scissoring! Ohh! Scissor me timbers!"
    },
    {
        "character": "",
        "line": "South Park, Monday, just before dawn. The boys walk over to Moovit Trucking to meet up with the laborers and get their finished essays."
    },
    {
        "character": "Kyle",
        "line": "They'd better be done with the book reports! School starts in 15 minutes!"
    },
    {
        "character": "Cartman",
        "line": "They'll be done. [whistles to get the laborers' attention.] ¿Que paso? ¿Que paso? [the laborers approach] All right, did you read the book?"
    },
    {
        "character": "Laborers",
        "line": "Sí, sí."
    },
    {
        "character": "Kyle",
        "line": "What was it about? Ih-in case our teacher asks us."
    },
    {
        "character": "Laborer 1",
        "line": "Eet starts there the old man, and his job is to catch the feesh, so he get in the boht, to try and catch feesh."
    },
    {
        "character": "Laborer 2",
        "line": "Saw he catch the feesh, but the feesh is very strong, so the old man, cannot reel in the feesh."
    },
    {
        "character": "Laborer 5",
        "line": "So then he fight the feesh. Some more. And he finally catch the feesh."
    },
    {
        "character": "Kyle",
        "line": "He catches the feesh so, then he can make money."
    },
    {
        "character": "Laborer 1",
        "line": "No, because on the way home, the sharks come and eat the feesh. And so, he no make money. [all five laborers take off their hats and put them against their chests in mourning]"
    },
    {
        "character": "Stan",
        "line": "That's it, that's the whole story?"
    },
    {
        "character": "Laborer 1",
        "line": "Sí."
    },
    {
        "character": "Cartman",
        "line": "All right, did you write the four essays?"
    },
    {
        "character": "Laborer 1",
        "line": "Sí, we all wrote essays for you. [the laborers put their caps back on]"
    },
    {
        "character": "The Boys",
        "line": "[all thumbs up] All right!"
    },
    {
        "character": "Cartman",
        "line": "Okay, let's have 'em."
    },
    {
        "character": "Laborer 4",
        "line": "Have what?"
    },
    {
        "character": "Kyle",
        "line": "You said you all wrote essays."
    },
    {
        "character": "Laborer 1",
        "line": "Well, my ese lives in Miami. I wrote to him like you said, but I don't think he got the letter yet."
    },
    {
        "character": "Laborer 2",
        "line": "I wrote my ese in Albuquerque."
    },
    {
        "character": "Laborer 5",
        "line": "I wrote three eses: my ese back home, my ese in Denver, and my ese in Glenwood even wrote me back. \"Thanks for writing me, ese.\" [the boys are stunned]"
    },
    {
        "character": "Kenny",
        "line": "(Uh oh...)"
    },
    {
        "character": "Kyle",
        "line": "Dude, we're totally fucked now!"
    },
    {
        "character": "Cartman",
        "line": "Why the hell would we pay you to write your friends?!"
    },
    {
        "character": "Laborer 1",
        "line": "We thought it was kind of strange."
    },
    {
        "character": "Kyle",
        "line": "This is your fault, Cartman! Now we're gonna fail!"
    },
    {
        "character": "Stan",
        "line": "You guys, school starts in ten minutes!"
    },
    {
        "character": "Kyle",
        "line": "Son of a bitch! [the boys turn and head for school]"
    },
    {
        "character": "",
        "line": "South Park Elementary, Monday morning, Mrs. Garrison's class. The kids enter the classroom"
    },
    {
        "character": "Stan",
        "line": "[sees Clyde] Clyde? Clyde! Heyhey Clyde! [Clyde turns around] You didn't finish your essay either, right?"
    },
    {
        "character": "Clyde",
        "line": "No, I got it done. [turns and walks to his desk. Jimmy walks up beside the boys]"
    },
    {
        "character": "Kyle",
        "line": "Jimmy, did you finish your book report?"
    },
    {
        "character": "Jimmy",
        "line": "Yeah. I feel pretty good about it. I finished my whole book report and, I got a really nice letter from my ese who works down at the U-Haul. [walks off, leaving the boys dumbfounded]"
    },
    {
        "character": "Cartman",
        "line": "Crap! [the boys head for their seats]"
    },
    {
        "character": "Kyle",
        "line": "We're dead."
    },
    {
        "character": "Mrs. Garrison",
        "line": "[dances into the room and sings] Hello, class. Here's my little desk [strokes it gently], my nice lil chalkboard. [hugs it. The boys are surprised at her behavior]"
    },
    {
        "character": "Cartman",
        "line": "Mrs. Garrison, about our book reports."
    },
    {
        "character": "Mrs. Garrison",
        "line": "[acting bashful] Oho, that's okay Eric. If you need a little more time with your homework, just say so."
    },
    {
        "character": "Kyle",
        "line": "[looks at Cartman, then at Stan. Stan looks back at both of them] Really?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Kids, I need to tell you something that you might find shocking. [sighs] I'm gay. [silence follows]"
    },
    {
        "character": "Stan",
        "line": "Again?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[sits on the edge of her desk, right leg over left] It was a shock to me too. I... met another woman and... we went to this fabulous bar called \"Les Bos\" where I finally felt at home. Allyson and I talked, and really opened up to each other and... then we... [demonstrates] scissored all night long."
    },
    {
        "character": "Butters",
        "line": "You have to be careful with scissors."
    },
    {
        "character": "Mrs. Garrison",
        "line": "But listen, I am not going to just rush into a relationship with Allyson. I'm a late-in-life lesbian. So I need to play the field for a while, right? [closes her eyes] Oh I'm so happy."
    },
    {
        "character": "Cartman",
        "line": "That's great! Let's hear it for Teacher being a lesbian!"
    },
    {
        "character": "Class",
        "line": "Yay!"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[blushing and hides behind her hands] Teeheeheehee."
    },
    {
        "character": "",
        "line": "Les Bos, night. Janet goes to the bar alone."
    },
    {
        "character": "Janet",
        "line": "[now confident] Hey Tracy, hey Kate."
    },
    {
        "character": "Tracy",
        "line": "Hi Janet."
    },
    {
        "character": "Janet",
        "line": "Lookin' hot, Linda. Wanna go somewhere and scissor later on? [moves away]"
    },
    {
        "character": "Linda",
        "line": "[Woman 2] Huh?"
    },
    {
        "character": "Janet",
        "line": "Hey Patty."
    },
    {
        "character": "Patty",
        "line": "What's up, Janet."
    },
    {
        "character": "Janet",
        "line": "[lights a cigarette] Ooo, stop giving me that look. Scissoring me with your eyes."
    },
    {
        "character": "Big Woman",
        "line": "Hey Janet, why don't you pick up on your own girl? [Janet flicks the cigarette away and leaves her seat, comes up behind the big woman and pulls her down on her stool to the ground and starts punching her.]"
    },
    {
        "character": "Janet",
        "line": "Oh yeah, dyke fight! [they roll around on the floor and the big woman gets away. The other women gather to watch. the big woman lands a kick to Janet's groin] You kicked me right in the pussy! [the fight resumes and they tumble into a booth, fighting all the way to the floor again. The big woman fights Janet off, but Janet gets turned on and starts having sex...] Uh? Oh! Oh, we're scissoring. Oh yeah, scissor! [the big woman, distracted for a moment, goes back to attacking Janet.]"
    },
    {
        "character": "Lesbian 4",
        "line": "You guys. You guys, stop it. Listen to me, everybody. I got some bad news."
    },
    {
        "character": "Lesbian 5",
        "line": "What is it, Katie?"
    },
    {
        "character": "Katie",
        "line": "They're closing down the bar. For good!"
    },
    {
        "character": "Linda",
        "line": "Closing it down? They can't do that."
    },
    {
        "character": "Lesbian 6",
        "line": "[blonde] This is our home."
    },
    {
        "character": "Janet",
        "line": "Yeah, this is our home."
    },
    {
        "character": "Katie",
        "line": "Well it's true, I just talked to the owners. They've sold the bar to Persians."
    },
    {
        "character": "Janet",
        "line": "Persians?!"
    },
    {
        "character": "Tracy",
        "line": "So where are we supposed to go?"
    },
    {
        "character": "Janet",
        "line": "We aren't going anywhere! We have a history here! Persians are closing this bar over my dead lesbian body!"
    },
    {
        "character": "",
        "line": "City Hall, the Mayor's Office, day. Janet and the other lesbians are in the office."
    },
    {
        "character": "Janet",
        "line": "Mayor, this is an outrage! We are being discriminated against as lesbians!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "You're a lesbian now?"
    },
    {
        "character": "Janet",
        "line": "That's right. A proud lesbian! And our home is being taken away!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "The bar has been sold to Persian club owners. I don't know what you want me to do about it."
    },
    {
        "character": "Janet",
        "line": "Forbid the transaction! This is happening all over the country, Mayor. Lesbian bars being bought out, shut down, it isn't right!"
    },
    {
        "character": "Lesbians",
        "line": "Yeah, that's right!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "I'm sorry, but my hands are tied. The new owners plan to start redecorating the bar tomorrow. You have to be out by then."
    },
    {
        "character": "Janet",
        "line": "[approaches the desk] Have you seen how Persians decorate? They will cover that bar in cheesy blue carpeting, white statues and gold curtain rods to the point that you will want to puke!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Mrs. Garrison, get out of here."
    },
    {
        "character": "",
        "line": "Les Bos, later. The lesbians gather there for one last time."
    },
    {
        "character": "Tracy",
        "line": "Well, here's to some great times at this place."
    },
    {
        "character": "Lesbian 7",
        "line": "Yeah. Guess we'll just have to find somewhere else to hang out."
    },
    {
        "character": "Janet",
        "line": "Now, come on gals! I can't believe what I'm hearing! We can't just give up!"
    },
    {
        "character": "Allyson",
        "line": "Well, what are we supposed to do, Janet?"
    },
    {
        "character": "Janet",
        "line": "We stand and fight! When the Persians come we tell them \"We aren't leaving Les Bos.\""
    },
    {
        "character": "Katie",
        "line": "Actually, it's \"Lebow\"."
    },
    {
        "character": "Janet",
        "line": "[faces Katie with a ready fist to be pumped] No, it's Les Bos! [addressing all the lesbians] We... are Lesbos! And as Lesbos, we cannot just stand and watch as one girl bar after another gets shut dowwwwwn!"
    },
    {
        "character": "Linda",
        "line": "[coming into view] The Persians have sent somebody to talk to us."
    },
    {
        "character": "Emir",
        "line": "Hello, my name is Emir Hadi. My boss sent me over here because he heard that you were upset about us trying to take over the bar."
    },
    {
        "character": "Lesbian 6",
        "line": "Yes, we are."
    },
    {
        "character": "Emir",
        "line": "Well, we want to assure you that when this place becomes another Club Persh, you will all still be 100% welcome. All they want is to make the place really nice. We're going to put down some lovely blue carpet, and gold curtain rods."
    },
    {
        "character": "Janet",
        "line": "I knew it! I knew it!"
    },
    {
        "character": "Emir",
        "line": "But you are still welcome to come. My boss wants you to know that you will not be discriminated against in any way."
    },
    {
        "character": "Janet",
        "line": "Would you allow straight people in? Men?"
    },
    {
        "character": "Emir",
        "line": "Well... we would allow whoev-"
    },
    {
        "character": "Janet",
        "line": "Choose your next words wisely, Persian! [jabs a finger into Emir's chest. Emir backs away]"
    },
    {
        "character": "Emir",
        "line": "Look uhh, we don't have to offer you anything, so... I don't know why you're being so difficult. This is crazy."
    },
    {
        "character": "Janet",
        "line": "No, this isn't crazy. This... is... Les Bos! [kicks him in the groin and walks away]"
    },
    {
        "character": "Emir",
        "line": "Ohhhhh!"
    },
    {
        "character": "Persian",
        "line": "How dare you! [Janet is shown in slow motion, her hips swaying back and forth]"
    },
    {
        "character": "Narrator",
        "line": "And so it had begun. By kicking the Persian messenger in the balls, the lesbos had sent a message. [Emir throws up on the floor]. All over the country lesbians heard of the brave standoff."
    },
    {
        "character": "Anchor",
        "line": "As a group of lesbians in Colorado are refusing to allow the new owners of their bar in."
    },
    {
        "character": "Lesbian 8",
        "line": "Good for them!"
    },
    {
        "character": "Lesbian 9",
        "line": "You go girls! [she takes a chip and bites into it. The bite is shown in slow motion.]"
    },
    {
        "character": "Narrator",
        "line": "The Persians returned to their office and told their coworkers how the thirty lesbos were refusing to let them in."
    },
    {
        "character": "Tumon",
        "line": "Well fine. If they're going to block the entrance, we'll just bring like, sixty of us! I'll call more Persians for help. [turns left and picks up a phone in slow mo, then a fast-forward to dialing the numbers. The dialing is shown in slow motion. Next shot is Les Bos under a sepia sky]"
    },
    {
        "character": "Narrator",
        "line": "The hours pass quickly, and the lesbians boldly stood out in front of their bar to stop the Persians from entering."
    },
    {
        "character": "Lesbian 6",
        "line": "Here they come. [the Persians approach, but stop short]"
    },
    {
        "character": "Big Woman",
        "line": "There's so many of them."
    },
    {
        "character": "Janet",
        "line": "Lesbos! Positions! [they all take a battle stance]"
    },
    {
        "character": "Tumon",
        "line": "Lesbians! Stand aside. We're coming in to redecorate it!"
    },
    {
        "character": "Janet",
        "line": "The hell you are! You can take your blue carpet and gold curtain rods and shove them up your Persian buttholes!"
    },
    {
        "character": "Tumon",
        "line": "All right! Come on! They can't stop all of us! Huuu!"
    },
    {
        "character": "Persians",
        "line": "[charging forward] Huuu! [slow motion feet are shown]"
    },
    {
        "character": "Janet",
        "line": "Lesbos! Remember this day! Remember this fight! [the battle begins with both sides pushing, the line going back and forth] Don't give them an inch! [she gets poked somewhere] Ow! Iranian faggot!"
    },
    {
        "character": "Tumon",
        "line": "Come on, seriously, let us in!"
    },
    {
        "character": "Janet",
        "line": "Never!"
    },
    {
        "character": "Narrator",
        "line": "For hours, the Lesbos kept the Persians back, holding them off, keeping them from decorating. [Janet and the second Persian are shown in intense shoving combat] Finally the Persians grew tired. and many of them wanted to go shopping for more designer sunglasses. They retreated. [and threw down their weapons] The Lesbos... had held."
    },
    {
        "character": "Janet",
        "line": "Lesbohhhs!"
    },
    {
        "character": "Lesbians",
        "line": "Huok! Huok!"
    },
    {
        "character": "Narrator",
        "line": "The Persians who did not go shopping now knew they must face their boss."
    },
    {
        "character": "Tumon",
        "line": "[turns around] Here he comes. [the others turn to see. An opulent Hummer draws closer and closer]"
    },
    {
        "character": "Narrator",
        "line": "Rauf Xerxes. He sat atop a gold Hummer with customized Gucci accessories which only a Persian would think was cool. [four men pour out of the Hummer and arrange themselves into steps in front of the grille]"
    },
    {
        "character": "Tumon",
        "line": "Mr. Xerxes, the Lesbos wouldn't move. We could not get inside to redecorate."
    },
    {
        "character": "Xerxes",
        "line": "[deep voice] Tumon, how could you have failed me in this simple task? I am so seriously pissed off right now. I could bust a testicle."
    },
    {
        "character": "Narrator",
        "line": "And with that the Persian club owner came to a realization."
    },
    {
        "character": "Xerxes",
        "line": "I shall have to deal with these lesbos myself."
    },
    {
        "character": "",
        "line": "Les Bos, the aftermath of the Battle of South Park. The improvised weapons are strewn all over the street."
    },
    {
        "character": "Janet",
        "line": "Girls, I just want to say that I am very proud of you. The way we kept those Persians from takin' over our bar was Les-tastic."
    },
    {
        "character": "Allyson",
        "line": "Well that's great, Janet, but what now? We can't just stay here pushing them away our whole lives."
    },
    {
        "character": "Janet",
        "line": "We can't? I think it's pretty fun."
    },
    {
        "character": "Linda",
        "line": "We have to have a more solid plan. Something we can use against them permanently."
    },
    {
        "character": "Lesbian 10",
        "line": "[WNBA player] Maybe we can dig up some dirt on the club owner."
    },
    {
        "character": "Janet",
        "line": "Hey, that's a great idea, Betsy. We need somebody working on the inside."
    },
    {
        "character": "Allyson",
        "line": "Whattaya mean?"
    },
    {
        "character": "Janet",
        "line": "If we could get some Persians on our side, we could send them in to try to dig up some dirt on the owner!"
    },
    {
        "character": "Allyson",
        "line": "But who's gonna spy on them for us? We don't know any Persians."
    },
    {
        "character": "Janet",
        "line": "It's okay. There's people you can hire for this kind of thing."
    },
    {
        "character": "",
        "line": "Moovit Trucking, day. Janet shows up with Women 6 and 8 and whistles at the laborers."
    },
    {
        "character": "Janet",
        "line": "¿Que paso? ¿Que paso? Looking for work? Sí? Trabajo?"
    },
    {
        "character": "Laborer 1",
        "line": "Yeis."
    },
    {
        "character": "Laborer 2",
        "line": "We looking work, sí."
    },
    {
        "character": "Janet",
        "line": "All right. We need you to infiltrate some Persians who run Club Persh. And dig up some dirt on the owner."
    },
    {
        "character": "Laborer 2",
        "line": "Okay."
    },
    {
        "character": "Laborer 1",
        "line": "Sure."
    },
    {
        "character": "Laborer 3",
        "line": "[wearing NY baseball cap] Okay."
    },
    {
        "character": "Laborer 4",
        "line": "[wearing gray baseball cap] Yeah."
    },
    {
        "character": "Allyson",
        "line": "Janet, how is this gonna work? They don't look Persian."
    },
    {
        "character": "Janet",
        "line": "Sure they do. [walks over to one of the laborers, Laborer 1, and works on him] Just have to- gel the hair, put on a silk shirt, some gold chains, and tons of cologne. [shields her eyes from the cologne, then presents the new man] Persian."
    },
    {
        "character": "Laborer 1",
        "line": "Sí. [the two women smile]"
    },
    {
        "character": "Lesbian 6",
        "line": "Wow!"
    },
    {
        "character": "Janet",
        "line": "All right, Mexicans, take the rest of these outfits and see what you can find out. The address is in there too."
    },
    {
        "character": "Laborer 1",
        "line": "Okay."
    },
    {
        "character": "Laborer 5",
        "line": "No problem."
    },
    {
        "character": "Laborer 2",
        "line": "Yes."
    },
    {
        "character": "Laborer 4",
        "line": "Sí. [they turn around and walk away]"
    },
    {
        "character": "Janet",
        "line": "And Mexicans, please hurry. Our girl bar has very little time."
    },
    {
        "character": "",
        "line": "Les Bos, stormy sky, day. The camera pans down from the sky."
    },
    {
        "character": "Narrator",
        "line": "A full day passed, and the Lesbos knew a second Persian attack was imminent. Outside, Lesbo lookouts kept watch, ready to alert the others. The Lesbo leader sat nervously inside. Her plan to dress Mexicans as Persians to act as spies - perhaps it had failed. She looked around at her fellow Lesbos. They were tired. In order to keep her Lesbos awake, she had no choice: she would have to make coffee. [Janet turns around (fast motion) and heads to the kitchen (slow motion). She enters the kitchen (fast motion) and grabs the glass kettle from the coffee maker (slow motion). She turns towards the sink (fast motion), and pours water into the kettle (slow motion). She turns back to the coffee maker (fast motion) and pour the water into it (slow motion). She closes the water cover, opens the coffee cover, gets some coffee, returns (all fast motion), and pours the coffee into the coffee filter (slow motion). She closes the coffee cover (fast motion) and presses the on button (slow motion).] With fresh coffee brewed, the Lesbos found new life, but would it be enough?"
    },
    {
        "character": "Lesbian 6",
        "line": "[standing on a booth bench and looking out a window] The Persians are attacking again!"
    },
    {
        "character": "Janet",
        "line": "Take positions, Lesbos!"
    },
    {
        "character": "Lesbian 11",
        "line": "Get outside! [the lesbians begin to move towards the door]"
    },
    {
        "character": "Janet",
        "line": "No wait, wait! That's not the Persians, it's the Mexicans."
    },
    {
        "character": "Linda",
        "line": "Really?"
    },
    {
        "character": "Allyson",
        "line": "How can you tell?"
    },
    {
        "character": "Janet",
        "line": "Let them through. It's okay."
    },
    {
        "character": "Laborer 3",
        "line": "Hola, ¿como estas?"
    },
    {
        "character": "Laborer 4",
        "line": "Hola."
    },
    {
        "character": "Janet",
        "line": "Did you uncover anything? Are the Persians doing anything illegal?"
    },
    {
        "character": "Laborer 4",
        "line": "Ahh, no. They're not doing anything illegal."
    },
    {
        "character": "Janet",
        "line": "A-are you sure?"
    },
    {
        "character": "Laborer 1",
        "line": "No, but we did find out a kind of secret about the person in charge."
    },
    {
        "character": "Janet",
        "line": "What secret?! [Laborer 4 hands him some photos] Oh my God, are, are you sure about this?"
    },
    {
        "character": "Laborers",
        "line": "Sí."
    },
    {
        "character": "Allyson",
        "line": "Janet! Janet, the Persian boss is here. He wants to talk to you and you alone."
    },
    {
        "character": "Janet",
        "line": "It's okay. It's time I met this rich Persian asshole face to face."
    },
    {
        "character": "",
        "line": "Les Bos, outside, moments later. Xerxes descends from his throne as Janet approaches"
    },
    {
        "character": "Xerxes",
        "line": "Why are you lesbians being so difficult?"
    },
    {
        "character": "Janet",
        "line": "Because we're protecting the only home we have."
    },
    {
        "character": "Xerxes",
        "line": "I don't know why you have to be all superlame about this."
    },
    {
        "character": "Janet",
        "line": "You know, a long time ago when I first realized I was a lesbian, I felt isolated, confused. And finally I found a place that accepts me for who I am."
    },
    {
        "character": "Xerxes",
        "line": "Okay, how about this? [stands behind her and puts his hands on her shoulders] I will make you the manager of Club Persh. You'll make good money."
    },
    {
        "character": "Janet",
        "line": "That's a generous offer, Xerxes, but you see, there's something I know about you. [takes Xerxes' left hand and sniffs it] I know you're actually a woman."
    },
    {
        "character": "Xerxes",
        "line": "[lets go and backs away quickly] How..? How did you find that out?"
    },
    {
        "character": "Janet",
        "line": "I hired Mexicans to spy on you! They saw you working out at Curves."
    },
    {
        "character": "Xerxes",
        "line": "You don't understand. Women can't be the boss in Persian culture. Nobody can know about this."
    },
    {
        "character": "Janet",
        "line": "Yeah. And you know why? Because men are all assholes! They make you feel ashamed for being a little... big, or, manly looking. [Xerxes wasn't expecting this response] But not Lesbos. We accept other women for who they are inside!"
    },
    {
        "character": "Xerxes",
        "line": "You do? Seriously?"
    },
    {
        "character": "Janet",
        "line": "Have you never... even thought, of being with another woman before?"
    },
    {
        "character": "Xerxes",
        "line": "No. I don't even know how two women... can make love. Unless they just kind of [demonstrates with her fingers] scissor or something."
    },
    {
        "character": "",
        "line": "Janet's bedroom, later. Janet and Xerxes are going at it in bed."
    },
    {
        "character": "Janet",
        "line": "Ohh yeah! Scissor me, Xerxes!"
    },
    {
        "character": "Xerxes",
        "line": "Ohh, that feels so supercool!"
    },
    {
        "character": "Janet",
        "line": "Yeah, scissor!"
    },
    {
        "character": "Xerxes",
        "line": "Ohh, I'm a new woman!"
    },
    {
        "character": "",
        "line": "Les Bos, next day. A bright blue sky and fluffy clouds grace it."
    },
    {
        "character": "Narrator",
        "line": "And so it was that Les Bos was saved. The Persians had agreed to keep it a lesbian bar, for no dyke should be without cocktails."
    },
    {
        "character": "Janet",
        "line": "Thanks for everything, Xerxes."
    },
    {
        "character": "Xerxes",
        "line": "No. Thank you, friend."
    },
    {
        "character": "Allyson",
        "line": "Hey, aren't you supposed to be teaching school right now?"
    },
    {
        "character": "Janet",
        "line": "The school hired a substitute to cover for me."
    },
    {
        "character": "",
        "line": "South Park Elementary, morning, Mrs. Garrison's class. The kids are quietly paying attention"
    },
    {
        "character": "Laborer 1",
        "line": "Hand so to find the sum of the two fractions, zhyou must always first check for the lowest common denominator. [the five laborers the boys first hired are there]"
    },
    {
        "character": "Laborer 2",
        "line": "Sí."
    },
    {
        "character": "Laborers",
        "line": "Sí. Sí. Yes. Yes. That's right."
    },
    {
        "character": "Laborer 4",
        "line": "Sí."
    },
    {
        "character": "Stan",
        "line": "These guys are pretty good."
    },
    {
        "character": "Kyle",
        "line": "Yeah. I think I'm actually learning something. [both boys resume taking notes.]"
    }
]