[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Toy Safari, day. Shoppers walk by, enter, leave, browse, etc. Inside, in Aisle 3: Action Figures. Cartman browses one set of shelves. Another boy is shown behind him, browsing the facing shelves."
    },
    {
        "character": "Cartman",
        "line": "[picks out a figure] Big Ring Slammer. Comes with posable neck-smash grip. [moves the package around with his left hand and strokes his chin with his right] That's pretty kewl. Let's see..."
    },
    {
        "character": "Boy",
        "line": "Cock! [Cartman is startled.]"
    },
    {
        "character": "Cartman",
        "line": "[puts the Slammer back on the rack and selects another figure.] The Black Jackal. Karate Kick Panel Force and bendable neck-"
    },
    {
        "character": "Boy",
        "line": "Asshole! Cock! Asshole, shit, shit cock! [his neck and face get taut as he blurts this out]"
    },
    {
        "character": "Clerk",
        "line": "[nearby] Ma'am, is that your son over there?"
    },
    {
        "character": "Mom",
        "line": "Yes, I'm sorry. My son has Tourette's Syndrome."
    },
    {
        "character": "Clerk",
        "line": "Tourette's Syndrome?"
    },
    {
        "character": "Mom",
        "line": "It's a neurological disorder. He-he can't control what he says."
    },
    {
        "character": "Clerk",
        "line": "Oh..."
    },
    {
        "character": "Boy",
        "line": "[turns his head hard to the left, his eyes shut] Shiit! [turns his head back to face forward] Dumb shiiit!"
    },
    {
        "character": "Mom",
        "line": "[goes to take her son home] A-alright Thomas, maybe we should go?"
    },
    {
        "character": "Thomas",
        "line": "All right Mom- Bitch! Ass bitch!"
    },
    {
        "character": "Mom",
        "line": "Here, let's buy you a nice toy to take home. [selects a figure and hands it to Thomas, who walks away with her, smiling. Cartman watches as they leave]"
    },
    {
        "character": "Cartman",
        "line": "[turns around and walks off, saying softly] Dude, that mom is kewl. [he arrives at the checkout line with his action figure]"
    },
    {
        "character": "Thomas",
        "line": "[stands in line behind Cartman] Cocknut! Augh... Stupid shit!"
    },
    {
        "character": "Cartman",
        "line": "[turns around and glares at Thomas] Are you talkin' to me?!"
    },
    {
        "character": "Thomas",
        "line": "No. Cocknose!"
    },
    {
        "character": "Cartman",
        "line": "What's your problem, kid?!"
    },
    {
        "character": "Mom",
        "line": "Oh, a-I'm sorry. [Thomas backs away a bit] My... son Thomas has Tourette's Syndrome. [a crowd begins to gather around them]"
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Thomas",
        "line": "Mom, let's just go. Shhhit!"
    },
    {
        "character": "Mom",
        "line": "People with Tourette's can't control certain tics. It's it's like a sneeze."
    },
    {
        "character": "Thomas",
        "line": "Asshole ASSHOLE."
    },
    {
        "character": "Cartman",
        "line": "[waves his arms around] Wait waitwait whoa whoa whoa. You're telling me there's an illness that makes you blurt out obscenities?"
    },
    {
        "character": "Thomas",
        "line": "Mom, can we just go home, please?"
    },
    {
        "character": "Mom",
        "line": "It's okay, Thomas. They understand."
    },
    {
        "character": "Thomas",
        "line": "I want tuh go! [throws down his action figure and walks off, his hands over his mouth] Shitfag!"
    },
    {
        "character": "Man 1",
        "line": "Poor kid."
    },
    {
        "character": "Clerk",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "[turns around and faces the crowd] All right, hold on just a second here: Are you telling me that if you have this Tourette's Syndrome you can say whatever you want, all the time, and never get in trouble?"
    },
    {
        "character": "Clerk",
        "line": "It's a neurological disorder; he can't help it."
    },
    {
        "character": "Man 1",
        "line": "Yeah! [Cartman blinks - CHING! He begins to think: \"I've got a golden ticket... I've got a golden\"]"
    },
    {
        "character": "Cartman",
        "line": "Twinkle in my eye. [turns and heads for the entrance] haha. HahaHAAhahahaha. [throws his action figure into the air and runs out the door]"
    },
    {
        "character": "Clerk",
        "line": "Hey don't you wanna buy that toy?"
    },
    {
        "character": "Cartman",
        "line": "I don't need the toy! I've found something better! [dances away] 'Cause I've got a golden ticket! I've got a golden chance to make my way!"
    },
    {
        "character": "",
        "line": "Colorado Neurology Center, some days later. A doctor checks Cartman out as Liane watches"
    },
    {
        "character": "Liane",
        "line": "It started about four days ago, Doctor, and every day he seems to get worse."
    },
    {
        "character": "Cartman",
        "line": "Puh- pussy!"
    },
    {
        "character": "Liane",
        "line": "Oh..."
    },
    {
        "character": "Cartman",
        "line": "Pussy! Cock! Shit! [covers his mouth in faking embarrassment]"
    },
    {
        "character": "Liane",
        "line": "Oh dear... I was checking out the Internet and ih, it almost seems like his symptoms are like those in something called \"Tour, Tourette's Syndrome\"?"
    },
    {
        "character": "Cartman",
        "line": "Tourette's Syndrome? What is that, Mommy. Butthole! Titties! Balls! [covers his mouth immediately]"
    },
    {
        "character": "Doctor",
        "line": "That doesn't seem likely. Tourette's is a hereditary disease; it doesn't just suddenly start."
    },
    {
        "character": "Cartman",
        "line": "...Cocksucker!"
    },
    {
        "character": "Doctor",
        "line": "[begins to think and walks off a bit] ...On the other hand, Tourette's does often develop later in a child's life, getting progressively worse."
    },
    {
        "character": "Cartman",
        "line": "Oh wuh, well that's it! Shithead! Asshole! Mexican sticky balls!"
    },
    {
        "character": "Liane",
        "line": "Oh Doctor, can you help him?"
    },
    {
        "character": "Doctor",
        "line": "[turns around and walks back to them] We don't know very much about Tourette's I'm afraid. But we will give your son all the help we can."
    },
    {
        "character": "Cartman",
        "line": "But what about school, Doctor? The teachers and the principal, they won't understand that I can't control what I say."
    },
    {
        "character": "Doctor",
        "line": "Don't worry, young man. We'll make sure everyone understands your disease and gives you the compassion you deserve."
    },
    {
        "character": "Cartman",
        "line": "Ohohh, that's awesome. Thank you. Faggot! [gives him a mischievous look]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Cartman walks into view as the kids are at their lockers"
    },
    {
        "character": "Cartman",
        "line": "Shit! Butthole! [walks up to Wendy] Hey Wendy. DUMB BITCH! Uh, sorry. [smiles and moves on] Titties! Cock! [he's relishing this. He points to a redhead] Ginger retard! Asslicker dickface!"
    },
    {
        "character": "Kyle",
        "line": "Dude, you'd better watch it. The principal's right over there. [she walks up to them]"
    },
    {
        "character": "Cartman",
        "line": "Uh, Good morning, Principal Victoria. Shitballs!"
    },
    {
        "character": "Principal Victoria",
        "line": "Good morning, Eric. [turns right and walks away. Cartman walks off in the opposite direction]"
    },
    {
        "character": "Kyle",
        "line": "Did Cartman just say \"shitballs\" to the principal?"
    },
    {
        "character": "Butters",
        "line": "Huhyou didn't hear? Well Cartman has some, mental disease called Tourette's Syndrome or somethin'."
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Craig",
        "line": "[in admiration] He's the luckiest kid in the world. If I could say \"shitballs\" to the principal I'd be sooo happy."
    },
    {
        "character": "Cartman",
        "line": "[deciding to explain things. Mr. Mackey is in the background] Uh excuse me, excuse me everyone I, I guess you might have noticed my awkward tics. Asshole! Pussy asshole! [the other kids lean away] Ach, augh, I just want you to know that I can't control it."
    },
    {
        "character": "Principal Victoria",
        "line": "It's okay, Eric. We all understand and we think you're very brave."
    },
    {
        "character": "Kyle",
        "line": "[after some thought, points and says] He's faking."
    },
    {
        "character": "Cartman",
        "line": "[his thunder is stolen and he covers for it] Ahahahaha, ayah- Excuse me everyone, I need to have a moment alone with my good friend Kyle? [walks to Kyle] Asscheeks! [hauls Kyle off to a clearing] Kyle, apparently you missed the school assembly yesterday, but I've been diagnosed with a very serious mental condition."
    },
    {
        "character": "Kyle",
        "line": "You do not have Tourette's Syndrome, fatass!"
    },
    {
        "character": "Cartman",
        "line": "...Oh, okay, you figured me out. [claps] Bravo, Kyle, bravo. Don't you see how awesome this is? It's like, a magic cloak that makes me impervious to getting in trouble."
    },
    {
        "character": "Kyle",
        "line": "Who cares about saying whatever you-?"
    },
    {
        "character": "Cartman",
        "line": "Of course, if you want to be Sergeant Buzzkill once again, and spoil my fun because you're jealous you didn't think of it first, well go right ahead, Kyle."
    },
    {
        "character": "Kyle",
        "line": "Grrhh, whatever. [walks off in a huff. Mr. Mackey walks by]"
    },
    {
        "character": "Cartman",
        "line": "Good morning, Mr. Mackey. Asspussy! [Mr. Mackey does nothing but walk away]"
    },
    {
        "character": "Craig",
        "line": "If I could say \"asspussy\" to the counselor I would be sooo happy."
    },
    {
        "character": "",
        "line": "Mrs. Garrison's class, later. Mrs. Garrison writes a math problem on the board: (-7)X(-2)"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Okay, so what do we get when we multiply a negative number-?"
    },
    {
        "character": "Cartman",
        "line": "Dicktits!"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[glances back at Cartman, then finishes writing] -when we multiply a negative number by another negative-?"
    },
    {
        "character": "Cartman",
        "line": "Shit! Asshole! [Mrs. Garrison looks at Cartman with a bit of shock, then turns to the board.] 'Scuse me. [Cartman smiles]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Ih if we apply what we've just learned, we see that all negatives can-"
    },
    {
        "character": "Cartman",
        "line": "Spooge, balls, bloody... vaginal... belch! [the class laughs. Cartman pretends to be hurt] You guys, don't laugh. It makes me feel insecure about my illness."
    },
    {
        "character": "Mrs. Garrison",
        "line": "[facing the class] All right kids, let's just try to focus on learning, okay? [turns to the board] Now all you need to remember here is that negative numbers"
    },
    {
        "character": "Cartman",
        "line": "Tampon! Tampon DICKshit!"
    },
    {
        "character": "Kyle",
        "line": "Will you knock it off already?!"
    },
    {
        "character": "Cartman",
        "line": "Kyle, don't you think I wish I could? I'd give anything to be normal like you. KIKE."
    },
    {
        "character": "Kyle",
        "line": "Don't push me, asshole!"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Kyle, watch your language! [Cartman lets out a hearty laugh]"
    },
    {
        "character": "Craig",
        "line": "[getting miserable] If I could yell \"tampon dickshit\" in the classroom I'd be sooo happy."
    },
    {
        "character": "",
        "line": "The principal's office, later. Mrs. Garrison is inside talking with her."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Principal Victoria, it's just that Eric has become such a distraction I, I don't think I can teach my class anymore."
    },
    {
        "character": "Principal Victoria",
        "line": "I understand it's been difficult, Mrs. Garrison, and so, Mr. Donaldson has come from the Tourette's Tolerance and Understanding Foundation. [Mr. Donaldson walks into view]"
    },
    {
        "character": "Mr. Donaldson",
        "line": "Hello Mrs. Garrison- [turns his head to the left] Ass. ASS. [recovers] I want to help your class better understand this illness. [turns his head to the left] Piss!"
    },
    {
        "character": "Kyle",
        "line": "[walks into the office, with Cartman following] No! Up yours, fatboy!"
    },
    {
        "character": "Cartman",
        "line": "Kyle please! I'm sorry!"
    },
    {
        "character": "Kyle",
        "line": "Principal Victoria, there's something you need to know! Cartman's Tourette's isn't real! He's faking!"
    },
    {
        "character": "Mr. Donaldson",
        "line": "Faking? [Kyle is sure he's got Cartman on the hook] You think people with Tourette's are faking?!"
    },
    {
        "character": "Kyle",
        "line": "[his certainty gone] N-no, I'm just saying that I think-"
    },
    {
        "character": "Mr. Donaldson",
        "line": "Do you have any idea how horrible that is to say? [turns his head to the left] Ass! ASS! [recovers] We aren't \"faking\", young man. Trust me, nobody wants this illness, ass. [turns his head to the left] PISS! PIIISS!"
    },
    {
        "character": "Cartman",
        "line": "That's right, Kyle. [turns his head to the left, where Kyle happens to be] Crap-filled vagina!"
    },
    {
        "character": "Mr. Donaldson",
        "line": "This is the kind of intolerance you teach at this school, Principal Victoria?!"
    },
    {
        "character": "Principal Victoria",
        "line": "No."
    },
    {
        "character": "Mr. Donaldson",
        "line": "This if you wouldn't mind, I'd like to take this \"bully\" to see that Tourette's is very real. [turns his head to the left] Piiiss."
    },
    {
        "character": "",
        "line": "The Children's Therapy Center, day. Mr. Donaldson is seated with seven kids on chairs in a circle in the middle of the room. Two of them are Thomas and Kyle."
    },
    {
        "character": "Mr. Donaldson",
        "line": "Kids, today during therapy class we have a special visitor. [turns his head to the right, where Kyle happens to be. Kyle jumps in his chair] ASS! [recovers and clears his throat] I, I wanted him to meet all of you so he could try to understand Tourette's"
    },
    {
        "character": "Teen Boy",
        "line": "Tourette's is like a cough or a sneeze. [shakes his head quickly] Brrrrr! [recovers] It isn't contagious like some people think. [shakes his head quickly] Brrrrrrrrr!"
    },
    {
        "character": "Blonde Girl",
        "line": "A lot of people with Tourette's have different tics. My tic [leans her head to the left, straightens it out, and snaps her fingers] is that I have to bend my neck and snap my fingers. But a lot of people don't even notice it. [leans her head to the left, straightens it out, and snaps her fingers]"
    },
    {
        "character": "Thomas",
        "line": "[turns his head to the right] Aw shit! COCK!"
    },
    {
        "character": "Brunette",
        "line": "Sometimes it can be embarrassing to have Tourette's, but I- [blinks and bobs her head] Boop. I've learned I shouldn't be mad at myself."
    },
    {
        "character": "Mr. Donaldson",
        "line": "You see? These kids can't control their actions. Ass! Piss in the ass!"
    },
    {
        "character": "Kyle",
        "line": "L-look, I was just suggesting that maybe this one person could control what he said, but just didn't, for fun."
    },
    {
        "character": "Teen Boy",
        "line": "Fun? [shakes his head quickly] Brrrrr! [recovers] This really isn't all that fun. [shakes his head quickly] Brrr, brrrrrr!"
    },
    {
        "character": "Thomas",
        "line": "Aw shit!"
    },
    {
        "character": "Brunette",
        "line": "[blinks and bobs her head] Boop. [The blonde girl leans her head to the left, straightens it out, and snaps her fingers]"
    },
    {
        "character": "Mr. Donaldson",
        "line": "[turns his head to the left] Piiiss, coming from my aaass!"
    },
    {
        "character": "Thomas",
        "line": "Yee-you wanna know about fun? Going to public places knowing you're going to make a fool of yourself. Embarrass your parents [turns his head to the right] Aw shit! [recovers] My dad... finally couldn't take it anymore. He... divorced my mom, s-said he'd still be around, but I only see him at Christmastime now. S-sh-shit! S-sh-shit! The worst part is I know how lonely my mom is. A lot of times I know she'd be better off if I was dead."
    },
    {
        "character": "Kyle",
        "line": "Dude..."
    },
    {
        "character": "Mr. Donaldson",
        "line": "Your mom would not be better off if you were dead, Thomas. Even if people like Kyle here think so."
    },
    {
        "character": "Kyle",
        "line": "Aw, come on!"
    },
    {
        "character": "Mr. Donaldson",
        "line": "So then you apologize for what you said before?"
    },
    {
        "character": "Kyle",
        "line": "Ah, I was just trying to... just, just in one instance... [the others stare at him] No. No, I'm sorry. I'm sorry. [The blonde girl leans her head to the left, straightens it out, and snaps her fingers]"
    },
    {
        "character": "",
        "line": "The Children's Therapy Center, outside. Mr. Donaldson takes Kyle to his waiting parents as the other kids look on."
    },
    {
        "character": "Mr. Donaldson",
        "line": "Well, Mr. and Ms. Broflovski, I think your son has learned a lot, and he appears to be honestly remorseful for making fun of people with disabilities. [turns his head to the left] Piss! PISS!"
    },
    {
        "character": "Sheila",
        "line": "Our son is a good kid. He just didn't understand Tourette's was a real disease."
    },
    {
        "character": "Mr. Donaldson",
        "line": "Well, I think the only thing left now is for your son to apologize to his little classmate. [Cartman walks into view and bats his eyes at Kyle sweetly. Kyle does not appreciate this]"
    },
    {
        "character": "Gerald",
        "line": "Well Kyle?"
    },
    {
        "character": "Kyle",
        "line": "[grudgingly] I'm sorry."
    },
    {
        "character": "Cartman",
        "line": "Oh, what was that? I I couldn't quite make that out, Kyle."
    },
    {
        "character": "Kyle",
        "line": "[grudgingly, louder] I'm sorry."
    },
    {
        "character": "Cartman",
        "line": "You're starry? I I don't get what you mean by that, Kyle. You're starry because uh I don't want it?"
    },
    {
        "character": "Kyle",
        "line": "I said I'm sorry, you piece of sh- [stops himself]"
    },
    {
        "character": "Cartman",
        "line": "Oh, oh, no, don't worry about it, Kyle. Now I understand. I've learned to deal with intolerance. Dumbshit douche bag! And it means a lot that you're standing here apologizing with your dad and lovely mother. [looks at Gerald and Sheila] Fag Jew! Jew bitch!"
    },
    {
        "character": "Sheila",
        "line": "Oh, thank you Eric."
    },
    {
        "character": "Cartman",
        "line": "Thank you. Big-nosed kike! [Sheila laughs nervously]"
    },
    {
        "character": "Mr. Donaldson",
        "line": "Well I think we can all put this behind us now. [turns his head to the left] Piiiss out my aaass!"
    },
    {
        "character": "Cartman",
        "line": "Yeah. Piss out your ass right onto Kyle's mom's fat fucking Jew face! [thumps his chest and clears his throat] Oh goodness, 'scuse me. Jeez, that was a bad one. [starts to walk away] Well, gotta run, everybody. Got some big things in the works. [stops to whisper to Thomas] Isn't having Tourette's awesome? [leaves]"
    },
    {
        "character": "",
        "line": "A Dateline commercial. Dateline graphics come up"
    },
    {
        "character": "Announcer",
        "line": "Next week on Dateline NBC: it's a Dateline special report."
    },
    {
        "character": "Hansen",
        "line": "I'm Chris Hansen. You probably know me from To Catch A Predator, where we bust men looking for sex with children."
    },
    {
        "character": "",
        "line": "a clip from that show"
    },
    {
        "character": "Hansen",
        "line": "Go ahead and take a seat. Take a seat right over there."
    },
    {
        "character": "Predator",
        "line": "Oh God, whoa, no."
    },
    {
        "character": "Hansen",
        "line": "What are you doin' here?"
    },
    {
        "character": "Predator",
        "line": "I'm just bein' stupid, I guess."
    },
    {
        "character": "",
        "line": "return to the current show, with graphics indicating the change of focus from pedophiles to Tourette's"
    },
    {
        "character": "Hansen",
        "line": "But now we're switching our focus from pedophiles to Tourette's Syndrome. It all started when I received this touching letter from a brave little boy in Colorado."
    },
    {
        "character": "Cartman",
        "line": "[doing a voice-over]\nDear Mr. Hansen, \nI have Tourettes and I want the world to understand what it's like. Won't you do a special report on me so that the world can learn to ACCEPT us instead of just laugh? Donkey Boner!!! \nEric Cartman\n\n\n[he doesn't say his name]\n\n"
    },
    {
        "character": "Hansen",
        "line": "This Saturday on Dateline I'll be bringing you Eric's story, live and uncensored, from his home in Colorado."
    },
    {
        "character": "Announcer",
        "line": "Living with Tourette's: The Eric Cartman Story. This Saturday on Dateline NBC."
    },
    {
        "character": "Cartman",
        "line": "[adding to the commercial] Finally, my wish of going public with my illness can come true. [jumps at the camera] Goddamn Jews! Suck my ass barf! [jumps back in shock, covers his mouth, then smiles at the camera sweetly, bending his head to the right]"
    },
    {
        "character": "",
        "line": "A sleepy night, Cartman's house."
    },
    {
        "character": "",
        "line": "Cartman's room. Cartman makes himself a drink, adult-style: He has two liquor bottles, a bucket of ice, and two wine glasses. Why two? Hm... He serves himself some ice. A few seconds later, Kyle enters his room and slams the door shut"
    },
    {
        "character": "Cartman",
        "line": "Hello, Kyle. Dickhead!"
    },
    {
        "character": "Kyle",
        "line": "What's this about you going on live television on Saturday?!"
    },
    {
        "character": "Cartman",
        "line": "[serves himself some liquid] Yes. It's all finally come to fruition. [gently swirls the ice around] The final cog in my... master plan. [turns around to face Kyle] This Saturday I will go on national television, live. I will say ...horrible things on the air. [turns back and prepares a drink for Kyle] Despicable things. And people will call me brave."
    },
    {
        "character": "Kyle",
        "line": "Cartman, there are people in the world who really have Tourette's Syndrome. This isn't funny!"
    },
    {
        "character": "Cartman",
        "line": "[takes the drink to Kyle] Not funny? I have free rein to say anything I want and you get into trouble if you try and stop me. Care for a Scotch?"
    },
    {
        "character": "Kyle",
        "line": "...Scotch?"
    },
    {
        "character": "Cartman",
        "line": "[quickly gives him the drink in triumph] Kyle I've won! No matter how you look at it! I've managed not only to get away with saying whatever I want at school, on the bus, at the dinner table, but this Saturday I will actually say anything I want... on national television. I'm going to blast the Jews, Kyle. I'm going to call them every name in the book, and people will call it brilliant television. They'll probably give me an Emmy."
    },
    {
        "character": "Kyle",
        "line": "You are not going to go on national television and spew a bunch of hate speech about Jewish people! I won't let you do it, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Then the game is on, Kyle."
    },
    {
        "character": "Kyle",
        "line": "It's not a game, you derelict! And this isn't Scotch! It's apple juice! [Cartman looks at his drink]"
    },
    {
        "character": "Cartman",
        "line": "[walks back to make another \"Scotch\"] Do you have any idea how liberating it is to say whatever comes to mind? \"Big titties! Buttmunch!\" There's no walls anymore! \"Shit!\" Whatever enters my brain I can just say without thinking about it. \"I wet my bed last night.\" [realizes what just happened]"
    },
    {
        "character": "Kyle",
        "line": "What did you say?"
    },
    {
        "character": "Cartman",
        "line": "Uhh nuh-nothing..."
    },
    {
        "character": "Kyle",
        "line": "You aren't gonna get away with this you stupid asshole! [runs out of the room and slams the door]"
    },
    {
        "character": "Cartman",
        "line": "Hm. That was... weird."
    },
    {
        "character": "",
        "line": "Whistlin' Willy's Pizza Gultch, day. Inside, a crowd has gathered to watch this Dateline special. A banner hanging from the ceiling says \"WE'RE PROUD OF YOU ERIC!\" On a low stage are Mr. Mackey, Liane Cartman and Eric, Mr. Donaldson, and Principal Victoria"
    },
    {
        "character": "Mr. Donaldson",
        "line": "We are here today to congratulate a brave little boy. Tonight, Eric Cartman will go on television and become the spokesman for Tourette's Syndrome. [turns his head to the left] Piiiss out my aaass! [applause rises from the crowd]"
    },
    {
        "character": "Thomas",
        "line": "The spokesman for Tourette's? Oh no... [turns his head to the right] Cock!"
    },
    {
        "character": "Cartman",
        "line": "[Mr. Donaldson adjusts the mic to his height] Thanks, everybody. Suck my balls! [applause rises from the crowd] You've all been so understanding and supportive of my illness. Jizz farmer dick sneeze. And it is because of you... that I have the courage to go on national television tonight. Titty sprinkles. [applause rises from the crowd]"
    },
    {
        "character": "Craig",
        "line": "If I could say \"titty sprinkles\" on national television I would be sooo happy."
    },
    {
        "character": "Cartman",
        "line": "And I also just want to say that... I'm making this all up! [startled by his own words, then covers his mouth as the crowd falls silent.] Uh, I... I...'m making this all up to you, for putting up with my mental disorder. I cry at night because I don't have a dad. [turns away from the mic and mumbles] What the hell is going on?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Uhit's okay, Eric. We understand your illness, m'kay?"
    },
    {
        "character": "Cartman",
        "line": "No hey ut what, what I meant to say was \"asslicker cumballs.\" And uhh, [helplessly] I'm secretly in love with Patty Nelson. I fantasize about kissing Patty Nelson! [covers his mouth]"
    },
    {
        "character": "Patty",
        "line": "Eewwww!"
    },
    {
        "character": "Cartman",
        "line": "[clambors offstage] Uhuh, excuse me I, I need a toilet! Bathroom! Bathroom! [runs through the crowd]"
    },
    {
        "character": "",
        "line": "The mens room. Cartman runs in and heads for the sink. Butters is pissing at the urinal and his pants are at his ankles. Cartman washes his face."
    },
    {
        "character": "Butters",
        "line": "[does a double take and smiles] Uh hey Eric!"
    },
    {
        "character": "Cartman",
        "line": "[finishes up and looks at Butters] Butters, do you think it's possible that you can lose the ability to filter what you say? I mean, if somebody got used to saying whatever came to their mind, could they start saying things that they would normally never say?"
    },
    {
        "character": "Butters",
        "line": "Wuh who are you talking about?"
    },
    {
        "character": "Cartman",
        "line": "Uh, my cousin. My cousin one time my cousin and I touched wieners. [he covers his mouth in horror as Butters is stunned] Wah! [faces Butters]"
    },
    {
        "character": "Butters",
        "line": "You... you and your cousin touched wieners?"
    },
    {
        "character": "Cartman",
        "line": "I didn't say that YES I DID BUT WHY? Oh! Stop it! [runs out of the restroom]"
    },
    {
        "character": "",
        "line": "The dining area. Cartman runs through the crowd"
    },
    {
        "character": "Cartman",
        "line": "Excuse me! Excuse me, I need to go! I gotta run!"
    },
    {
        "character": "Liane",
        "line": "Is there a problem, sweetie?"
    },
    {
        "character": "Cartman",
        "line": "[turns around and faces her] No, no problem. I just need to- my cousin and I touched each other's [struggles to keep control] AAAA no, NAAAA! [he's got the crowd's attention] I just... no I... I just want to thank everyone for coming- my cousin and I touched wiener- we wiener we, weenter! Winter is a cold time of year. [now composed] Ah, I need to be going now."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well all right Eric. Well good luck on Dateline tonight."
    },
    {
        "character": "Cartman",
        "line": "[apprehensive] Dateline. Right. [backs away but can't control his statements] I wet my b-AAA! I touched my cousin's WEE-NUH! This sure has been fun! G'bye! [runs out the door screaming with his hands firmly over his mouth]"
    },
    {
        "character": "",
        "line": "KSPC Channel 4, an HBC affiliate, day. In his own office, Hansen rehearses his lines as the staff listens. A cameraman preps his camera"
    },
    {
        "character": "Hansen",
        "line": "Tonight, an inside look at Tourette's Syndrooome. I'm Chris Hansen. Mmh. I'm Chris Hansen."
    },
    {
        "character": "Cartman",
        "line": "[rushes onto the set] Ah, Mr. Hansen? I'm afraid I can't do the show."
    },
    {
        "character": "Hansen",
        "line": "Why not?"
    },
    {
        "character": "Cartman",
        "line": "My uh, my grandma just died, so I have to go to Memphis- That's not true. My grandma's fine."
    },
    {
        "character": "Hansen",
        "line": "[rolls up his notes and motions Cartman to a stool] Why don't you have a seat?"
    },
    {
        "character": "Cartman",
        "line": "No I just need to get home. I'm not doin' the show."
    },
    {
        "character": "Hansen",
        "line": "Go ahead and take a seat."
    },
    {
        "character": "Cartman",
        "line": "[heads for the door] But I'm not gonna do the-"
    },
    {
        "character": "Hansen",
        "line": "Take a seat, right over there. [Cartman backs up and sits on the stool, then puts his cap on the bar] What are you doing here?"
    },
    {
        "character": "Cartman",
        "line": "I'm, I'm telling you that I'm not doing the show?"
    },
    {
        "character": "Hansen",
        "line": "But you are doing the show."
    },
    {
        "character": "Cartman",
        "line": "You don't understand! All of a sudden, I can't control what I say."
    },
    {
        "character": "Hansen",
        "line": "Well of course you can't control what you say. You have Tourehhtte's."
    },
    {
        "character": "Cartman",
        "line": "No! My Tourette's has gotten worse! Before I just blurted out cool stuff about Jews being lame and stuff. But now it's gotten really bad. [gets his cap and puts it on] So ah I'm sorry, but I'm not doin' the show, that's it. Goodbye. [hops off the stool and walks away]"
    },
    {
        "character": "Hansen",
        "line": "Why don't you take a seat?"
    },
    {
        "character": "Cartman",
        "line": "Oh, I don't wanna take a seat!"
    },
    {
        "character": "Hansen",
        "line": "Have a seat."
    },
    {
        "character": "Cartman",
        "line": "[begins backing up] No, I'm just gonna go- [wonders how this is happening]"
    },
    {
        "character": "Hansen",
        "line": "Take a seat, right over there."
    },
    {
        "character": "Cartman",
        "line": "[gets back on the stool and whispers to himself] How does he do that?"
    },
    {
        "character": "Hansen",
        "line": "You know, one tiiime, I was doin' a show called \"To Catch A Predator\". We almost caught this pedophile, but then he raaan from us 'cause he didn't wanna be on Dateline. Se we tracked him down to his hoouuse. And you know what he did? He shot himself. [Cartman is scared] It'd be a shame if... you didn't wanna go on Dateline. Be a shame if we had to track you down and you \"shot yourself\". [Cartman is more scared, and a series of expressions cross his face]"
    },
    {
        "character": "",
        "line": "The program begins: \"Dateline \\living with tourette's syndrome.\""
    },
    {
        "character": "Announcer",
        "line": "Live, from our satellite studio in Colorado. This! ...is Dateline."
    },
    {
        "character": "Hansen",
        "line": "Tonight, an inside look at Tourette's Syndrome. I'm [stretches his name out so it sounds like nails on a chalkboard] Chris Hansen. In a few minutes, you will meet little Eric Cartman, who wants the world to understand his affliction."
    },
    {
        "character": "",
        "line": "The green room. Cartman paces back and forth. Someone knocks on the door"
    },
    {
        "character": "A Page",
        "line": "Five minutes, kid."
    },
    {
        "character": "Cartman",
        "line": "Jesus Christ. How did I get myself into this? [walks to a nearby table and begins to pray] God? Please uh, I know I screwed up. I should have never pretended to have Tourette's Syndrome, but see, ah I get it now. You can't just walk around saying whatever you want. You gave us a filter because, people don't wanna hear things like \"I touched penises with my cousin!\" [covers his mouth quickly] Ahaab, ahaabuh. And, and I learned, you especially can't say whatever you want on national television, 'cause, there could be kids watching. Please, God, don't make me embarrass myself on national television. You... must see how this is all somewhat your fault, right? Please, I need a miracle."
    },
    {
        "character": "",
        "line": "KSPC Channel 4, outside, night, moments after the program began. Kyle jumps into view wearing dark camouflage and a headset at the parking lot entrance"
    },
    {
        "character": "Kyle",
        "line": "Tango, this is Foxtrot. Are you in position?"
    },
    {
        "character": "Thomas",
        "line": "[using a walkie talkie] Copy Foxtrot. Tango in position. Awww shit!"
    },
    {
        "character": "Kyle",
        "line": "You sure you don't wanna back out?"
    },
    {
        "character": "Thomas",
        "line": "Nono, you were right. The fat kid is faking it! If he goes on TV, more people will think that having Tourette's is fun. Asshole shit!"
    },
    {
        "character": "Kyle",
        "line": "All right, then we go with the plan. Just like \"To Catch A Predator\". [a light brown car pulls in] The first guy is here. This is probably HotForBoys219. [the car stops and Thomas looks around]"
    },
    {
        "character": "HotForBoys219",
        "line": "[walks up to Thomas] Hi, are you CuteBilly182?"
    },
    {
        "character": "Thomas",
        "line": "Yeah. I was chatting with you online. SHIT!"
    },
    {
        "character": "HotForBoys219",
        "line": "[shaking with excitement] Oh God, I'm so turned on right now. This is your house? Your, your parents aren't home, are they?"
    },
    {
        "character": "Thomas",
        "line": "N-no, it's cool. Go on inside. I made brownies. SHIT! I'm just gonna slip into something more comf'table. COCK!"
    },
    {
        "character": "HotForBoys219",
        "line": "[dances by] Okay. Cock! Don't take too long. [laughs and prances into the studio]"
    },
    {
        "character": "",
        "line": "The studio set. The opening segment is finished."
    },
    {
        "character": "Hansen",
        "line": "So now let's meet a child who haaas Tourette's Syndrooome, and who must fi- [the audience doors open and HotForBoys219 prances down the aisle laughing]"
    },
    {
        "character": "HotForBoys219",
        "line": "Ho, whoa, wait a minute. This ain't no house."
    },
    {
        "character": "Hansen",
        "line": "[stands up angrily] What are you doing?!"
    },
    {
        "character": "HotForBoys219",
        "line": "[gasps and hides his face] Chris Hansen?! Oh no, it's a setup! I knew it!"
    },
    {
        "character": "Hansen",
        "line": "Sir, why don't you take a seat, right over there."
    },
    {
        "character": "HotForBoys219",
        "line": "Now everyone's gonna know I'm a perv! Whoa! [takes out a gun and shoots himself in the head. Nearby audience members move away, and the audience gets restless]"
    },
    {
        "character": "Hansen",
        "line": "Aw, not again."
    },
    {
        "character": "",
        "line": "The green room. Cartman paces back and forth. The door opens and Kyle walks in"
    },
    {
        "character": "Cartman",
        "line": "Kyle?"
    },
    {
        "character": "Kyle",
        "line": "Surprise, fatass!"
    },
    {
        "character": "Cartman",
        "line": "Kyle, what are you doing?"
    },
    {
        "character": "Kyle",
        "line": "I went online posing as a boy who would have sex with older men, and told them to meet me here. My plan worked perfectly! [car horns blare outside, and Kyle goes to take a look. The parking lot quickly fills up as drivers park and leave their cars.] Whoa."
    },
    {
        "character": "",
        "line": "Outside. Thomas sees the pedophiles coming and motions them into the studio"
    },
    {
        "character": "Pedo 2",
        "line": "[walks up to Thomas and waves a Wendy's bag in front of him] Hey, I brought you some Wendy's."
    },
    {
        "character": "Thomas",
        "line": "Yeah yeah, go on in. There's a hot tub inside. STUPID SHIT!"
    },
    {
        "character": "Pedo 2",
        "line": "Score! [goes inside]"
    },
    {
        "character": "",
        "line": "The studio set. The driver stops in his tracks"
    },
    {
        "character": "Pedo 2",
        "line": "Oh no, it's Chris Hansen! [drops his meal and shoots himself]"
    },
    {
        "character": "Audience Members",
        "line": "Whoa! Who is that? What's going on?"
    },
    {
        "character": "Hansen",
        "line": "What the hell is going on?!"
    },
    {
        "character": "Pedo 3",
        "line": "Wait a minute. Oh God, it's Chris Hansen! [shoots himself]"
    },
    {
        "character": "Pedo 4",
        "line": "Chris Hansen! [shoots himself]"
    },
    {
        "character": "Pedo 5",
        "line": "Dateline?! [shoots himself]"
    },
    {
        "character": "Pedo 6",
        "line": "I knew it! [shoots himself]"
    },
    {
        "character": "Pedo 7",
        "line": "There aren't really brownies! [shoots himself. More pedophiles enter and kill themselves, and the audience begins rushing out of the studio]"
    },
    {
        "character": "",
        "line": "Outside. Chris Hansen finds Thomas."
    },
    {
        "character": "Hansen",
        "line": "Hey! Do you have something to do with this? Answer meee!"
    },
    {
        "character": "Thomas",
        "line": "Stupid shit! Cock! [more audience members rush by]"
    },
    {
        "character": "Hansen",
        "line": "What?! Nobody talks to me like that! Why don't you take a seat? Take a seat, right over there."
    },
    {
        "character": "Thomas",
        "line": "Suck it! Asshole licker dickfart!"
    },
    {
        "character": "Hansen",
        "line": "Why, you lil- I'll, I'll tell on you! [leaves, and there are no other adults left]"
    },
    {
        "character": "Craig",
        "line": "[walks up to Thomas] Wow, you're the coolest kid in the world. If I could call Chris Hansen an asshole-licking dickfart to his face, I would be sooo happy."
    },
    {
        "character": "Thomas",
        "line": "You would?"
    },
    {
        "character": "Craig",
        "line": "Could I just like, hang out with you sometime? Like, do your laundry maybe?"
    },
    {
        "character": "",
        "line": "The studio set. It's dim, and Cartman and Kyle walk onto the set."
    },
    {
        "character": "Kyle",
        "line": "[feeling triumphant] Take a look, fatass! I beat you! You aren't going on Dateline; what have you got to say now?! [Cartman is silent for a moment, then hugs Kyle and sobs. Kyle wasn't expecting this]"
    },
    {
        "character": "Cartman",
        "line": "Oh thank you! Thank you Kyle!"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "I asked God to send someone to help me, and you came, Kyle! I love you man!"
    },
    {
        "character": "Kyle",
        "line": "No, I- I beat you!"
    },
    {
        "character": "Cartman",
        "line": "You totally saved my ass, Kyle. You must... really care about me. See you Kyle! I gotta get to a psychiatrist and learn to control what I say! [heads up the aisle and out of the studio] I got a golden ticket! Thanks to Kyle! I got a golden twinkle in my eye! [Kyle is alone on set, but Thomas comes up and stands next to him]"
    },
    {
        "character": "Thomas, Kyle",
        "line": "Aww shit!"
    }
]