[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Previously on South Park."
    },
    {
        "character": "Cartman",
        "line": "[voiceover] Previously on Battlestar Galactica [clips from last week's episode follow]"
    },
    {
        "character": "Stan",
        "line": "What is this place?"
    },
    {
        "character": "Fanciful Mayor",
        "line": "This... is Imaginationland."
    },
    {
        "character": "A Terrorist",
        "line": "[runs in out of nowhere] ALLAH!!! [the terrorist sets off the bomb as everyone else leans back. The explosion sends creatures flying everywhere, with some of them dying as their bodies fall apart.]"
    },
    {
        "character": "Kyle",
        "line": "[above all the noise] We have to get out of here!!"
    },
    {
        "character": "Butters",
        "line": "[running up to the boys as Draco takes off with them] Hold on, fellas!"
    },
    {
        "character": "The Boys",
        "line": "Butters!!"
    },
    {
        "character": "General Deckter",
        "line": "Terrorists have just attacked... our imagination."
    },
    {
        "character": "Fanciful Mayor",
        "line": "[to Butters] If the terrorists blow that barrier, all the most evil things ever imagined are gonna pour out!"
    },
    {
        "character": "Terrorists",
        "line": "ALLAH!! [they charge forth with Rockety Rocket toward the door, then push him forward. Butters jumps out of the way.]"
    },
    {
        "character": "Rockety Rocket",
        "line": "No!! [reaches the door and blows up. The terrorists cheer and fire away into the air. Butters gets up near the survivors]"
    },
    {
        "character": "",
        "line": "EPISODE II"
    },
    {
        "character": "",
        "line": "The screen brightens, and a bedroom is shown. A music box plays as the camera pans to the left. The bed is shown, and Butters is asleep in it."
    },
    {
        "character": "",
        "line": "Butters' room, morning."
    },
    {
        "character": "Stephen",
        "line": "[voiceover] Butters, time for breakfast."
    },
    {
        "character": "Butters",
        "line": "Buh, huh, but... Oh jeez, it was just a dream."
    },
    {
        "character": "Stephen",
        "line": "[enters with Linda, who's holding a plate] Come on, Butters. Mom's cooked waffles and nanas for you."
    },
    {
        "character": "Butters",
        "line": "[chuckles with relief] Hoho! Mom, Dad, I dreamt I was in Imaginationland and, and terrorists attacked it."
    },
    {
        "character": "Stephen",
        "line": "You are in Imaginationland. This is a dream."
    },
    {
        "character": "Butters",
        "line": "Huh?"
    },
    {
        "character": "Fanciful Mayor",
        "line": "[breaking into the dream] Hey, wake up, stupid! [the bedroom transitions into Imaginationland] Come on, wake up, kid!"
    },
    {
        "character": "Butters",
        "line": "[wakes and stands up] No, wait! Uh I was back home in bed!"
    },
    {
        "character": "Fanciful Mayor",
        "line": "NO! You passed out and peed your pants!"
    },
    {
        "character": "Cinderella",
        "line": "Look! The evil of Imaginationland is coming out! [monsters from the evil side pour through the broken wall. The survivors from the terrorist attack turn and run away]"
    },
    {
        "character": "Butters",
        "line": "Oh hamburgers! [the terrorists fire off their guns, but a monster wipes them out]"
    },
    {
        "character": "Fanciful Mayor",
        "line": "Everyone! Fall back to the Gumdrop Forest! [catches up to Butters] Come with me, little boy! I'm going to get you home! [an Alien jumps into view and jumps around the Mayor]"
    },
    {
        "character": "Butters",
        "line": "WAAAA! It's Alien! [points to the Xenomorph, which grabs the Mayor, lifts him up, and attacks him from behind and pierces right through him, killing him instantly. Butters runs away, only to be spotted by a Predator with laser sights. Butters avoids the lasers] Predator! Wha? [an army of Imperial Stormtroopers head his way. A heavy footfall behind him alerts him to Jason Voorhees's presence. He jumps] Huh? [Jason takes out his machete and slashes at him, but Butters ducks it and runs away] WAAAAAH! HAAAAAAAA! [geometric shapes and Tribbles join the fray]"
    },
    {
        "character": "",
        "line": "The Pentagon, day. General Deckter and his specialist interrogate Stan and Kyle in the same room the directors were in previously. General Deckter paces back and forth."
    },
    {
        "character": "Stan",
        "line": "Look, we already told you everything we know. Some guy just showed up in a big balloon and took us into Imaginationland."
    },
    {
        "character": "General Deckter",
        "line": "[stops and places his hands on the table] What we want to know is how! We need to find a way into Imaginationland; you've been there! How did you do it?!"
    },
    {
        "character": "Kyle",
        "line": "We just... went on a balloon ride."
    },
    {
        "character": "Specialist",
        "line": "There must have been some kind of portal or doorway."
    },
    {
        "character": "Stan",
        "line": "Dude, we don't remember."
    },
    {
        "character": "General Deckter",
        "line": "Do you realize what's goin' on here?! Terrorists have attacked our imagination, and now our imaginations are running wild! [wags his left index finger at them] You'd better start remembering!"
    },
    {
        "character": "Specialist",
        "line": "It was the Chinese, wasn't it?"
    },
    {
        "character": "Kyle",
        "line": "...What?"
    },
    {
        "character": "Specialist",
        "line": "We've suspected that the Chinese government was working on a doorway to the imagination. [wags his right index finger at them] Is that where you were?!"
    },
    {
        "character": "Stan",
        "line": "No."
    },
    {
        "character": "General Deckter",
        "line": "That's it, isn't it?! Where do the Chinese keep this portal? How does it work?"
    },
    {
        "character": "Specialist",
        "line": "It is better than ours?"
    },
    {
        "character": "Stan",
        "line": "Your what?"
    },
    {
        "character": "Specialist",
        "line": "Our portal to the imagination built as a secret project back in 1962 to fight the Soviets-"
    },
    {
        "character": "General Deckter",
        "line": "[puts his hands on his hips] Shhh! Tom! That's super-secret."
    },
    {
        "character": "Tom",
        "line": "[a bit chagrined] Ohh, I'm sorry sir."
    },
    {
        "character": "Kyle",
        "line": "Wait. The U.S. Government has a portal to the imagination?"
    },
    {
        "character": "General Deckter",
        "line": "Aw, see? Good job, Tom! Why don't you just tell them everything about Project X?!"
    },
    {
        "character": "Tom",
        "line": "Yes sir. [to the boys] We built a portal to the imagination to use against the Russians during the Cold War, but we never got a-"
    },
    {
        "character": "General Deckter",
        "line": "THAT WAS SARCASM. I was being sarcastic, you fucking idiot!"
    },
    {
        "character": "Tom",
        "line": "[more chagrined] Aw jeez, I'm really sorry sir."
    },
    {
        "character": "Stan",
        "line": "If you already built a doorway to the imagination, then why do you need us?"
    },
    {
        "character": "General Deckter",
        "line": "[turns his back to the boys] All right, we might as well show it to them. [whispers] God-dammit, Tom."
    },
    {
        "character": "",
        "line": "Darkness."
    },
    {
        "character": "Cartman",
        "line": "[voiceover] Every night, the dream is the same. [a field of grain pops up with purple mountains in the background. Cartman walks in smiling and holding the contract] I'm on my way to visit my friend Kyle, because we had a bet that if I could prove leprechauns were real, he would suck my balls. [Kyle is standing in the field, and Cartman walks up to him] And it turns out I was right. \"Time to pay up, Kyle.\" [Kyle's name echoes into the distance] But then... [Kyle turns around with his mouth sewn shut] \"NO! NOOO!\" [Cartman rises into the air and the field fades to black] It's been taken from me. I have dry balls. Balls so dry they explode like dust. [he floats through the darkness. His right testicle pops and dissolves into the air. His left one does the same, and there's no penis left either.]"
    },
    {
        "character": "",
        "line": "In a bus. Cartman shakes himself awake"
    },
    {
        "character": "Elderly woman",
        "line": "You okay, kid?"
    },
    {
        "character": "Cartman",
        "line": "NO. I've got dry balls. And I'm running out of time."
    },
    {
        "character": "",
        "line": "The Pentagon, the portal. The technicians prepare the portal"
    },
    {
        "character": "General Deckter",
        "line": "Ever since the Cold War, the U.S. Government has been working on a secret project to build a doorway into the imagination. It is called \"Project Imagination Doorway.\""
    },
    {
        "character": "Stan",
        "line": "That's not very imaginative."
    },
    {
        "character": "General Deckter",
        "line": "According to all the tests and the data, the doorway should work, but... it never has."
    },
    {
        "character": "Lead tech",
        "line": "But we're close, sir. We're real close."
    },
    {
        "character": "General Deckter",
        "line": "They've been saying that for over forty years."
    },
    {
        "character": "Lead tech",
        "line": "[walks up and stands next to General Deckter] You're the ones, right? The kids who have been in the imagination."
    },
    {
        "character": "Kyle",
        "line": "Ah I guess."
    },
    {
        "character": "Lead tech",
        "line": "What was the sequence that got you inside? We know there's some kind of... resonance code, but we can't figure it out."
    },
    {
        "character": "Kyle",
        "line": "Look, we're sorry, you guys, but the balloon just went up in the air and the dude sang a song and we were suddenly there."
    },
    {
        "character": "General Deckter",
        "line": "Song? You didn't say anything about a song before."
    },
    {
        "character": "Lead tech",
        "line": "What song?"
    },
    {
        "character": "Stan",
        "line": "The Imagination song?"
    },
    {
        "character": "Lead tech",
        "line": "That could be it. The fractal converter has never worked because it was waiting for a multitonal code!"
    },
    {
        "character": "General Deckter",
        "line": "Quick boys: how does the Imagination Song go?"
    },
    {
        "character": "Stan, Kyle",
        "line": "[unsure of the notes] Imaginaaaation Imaginaaaation\n\n\n"
    },
    {
        "character": "Operator",
        "line": "Sir, uh I'm getting some electrofeedback from the gate. Ih it's weak, but it's nanoresponding to something."
    },
    {
        "character": "Lead tech",
        "line": "[urgently] Was there more to the Imagination Song? Ha, how does the rest of it go?"
    },
    {
        "character": "Stan, Kyle",
        "line": "Imaginaaaation. Imaginaaaa-\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "No, no dude, it went up there."
    },
    {
        "character": "Stan",
        "line": "Imagina-he-hey-\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "Imagina-eh\n\n\n"
    },
    {
        "character": "Stan",
        "line": "[to General Deckter] Dude, we don't remember. It was really long and stupid."
    },
    {
        "character": "General Deckter",
        "line": "I'm just about through playing with you boys! We're running out of time! You have to remember that song in its entirety! [Stan and Kyle look at each other.]"
    },
    {
        "character": "",
        "line": "The Gumdrop forest. The Mayor is flat on his back, still alive, but with heavy blood loss. He gargles in trying to move. The Lollipop King and Butters gather around him."
    },
    {
        "character": "Lollipop King",
        "line": "Mayor, Mayor, what are we supposed to do?"
    },
    {
        "character": "Butters",
        "line": "Please, sir. I have to get home to my world."
    },
    {
        "character": "Fanciful Mayor",
        "line": "Oh, well. All you have to do is tap your heels together three times."
    },
    {
        "character": "Butters",
        "line": "Really?"
    },
    {
        "character": "Fanciful Mayor",
        "line": "NO, you fucking dipshit, that was a joke! [groans for a few seconds more]"
    },
    {
        "character": "Snarf",
        "line": "Mayor, what are we supposed to do, shnarf shnarf?"
    },
    {
        "character": "Fanciful Mayor",
        "line": "Get to Castle Sunshine! It's your only hope!"
    },
    {
        "character": "Lollipop King",
        "line": "Castle Sunshine?"
    },
    {
        "character": "Fanciful Mayor",
        "line": "Through the Gumdrop Forest. Others will be hiding there; go, run! Look out for the evil characters! They're assembling on the Yum Yum mountain! [groans once more and dies]"
    },
    {
        "character": "",
        "line": "The evil characters have gathered in a clearing in the woods of Yum Yum mountain."
    },
    {
        "character": "Orc",
        "line": "We are free! Now all of Imaginationland is ours!"
    },
    {
        "character": "The Minotaur",
        "line": "Not all, foolish orc! There are still parts of Imaginationland we don't control."
    },
    {
        "character": "Freddy Krueger",
        "line": "Tomorrow, we shall build our own castle right on this spot!"
    },
    {
        "character": "The Minotaur",
        "line": "Who put you in charge, Krueger?! I am the most evil character here!"
    },
    {
        "character": "ManBearPig",
        "line": "[half bear, half manpig] Nonsense! [somehow, he's been spliced together and brought to life] Your evil is stale!"
    },
    {
        "character": "Headless Horseman",
        "line": "[holding a flaming jack-o-lantern on his left hand] I am the most evil imaginary character! [Krueger hisses]"
    },
    {
        "character": "Squirrelly Squirrel",
        "line": "[hops into view] Now come on y'all. We shouldn't be fightin', we're supposed to all be on the same side. [the rest of the Woodland Critters arrive]"
    },
    {
        "character": "Critter",
        "line": "Yeah. You're all right, Squirrelly Squirrel."
    },
    {
        "character": "Woodland Critters",
        "line": "Yaaaay!"
    },
    {
        "character": "The Minotaur",
        "line": "What evil imaginary characters are they?"
    },
    {
        "character": "Creature from the Black Lagoon",
        "line": "They were dreamt up by some fourth grade kid as part of his Christmas Story.."
    },
    {
        "character": "Squirrelly Squirrel",
        "line": "Now come on y'all. We can't waste time arguing, there could still be survivors out there. We need to hunt them down, and kill them."
    },
    {
        "character": "Rabbity Rabbit",
        "line": "And eat their flesh!"
    },
    {
        "character": "Beavery Beaver",
        "line": "B'hut first we should rape them!"
    },
    {
        "character": "Beary Bear",
        "line": "How about we kill them, and then rape their bodies so we can use their blood as lubricant?"
    },
    {
        "character": "Squirrelly Squirrel",
        "line": "Say, that's a great idea, Beary Bear. [the Critters cheer and jump for joy]"
    },
    {
        "character": "Jason Voorhees",
        "line": "[to Khan in a campish voice] Man, I do not want to meet the kid that dreamt THOSE things up."
    },
    {
        "character": "",
        "line": "The Mall at Washington D.C., Day. Cartman has arrived and is on a pay phone."
    },
    {
        "character": "Cartman",
        "line": "Look, I want some Goddamn answers! You brought my friend here to Washington! Where is he?! What is going on?!"
    },
    {
        "character": "Secretary",
        "line": "[at the Pentagon] I'm sorry, sir. That information is classified."
    },
    {
        "character": "Cartman",
        "line": "Something is going on, and I have a right to know where my friend is!!"
    },
    {
        "character": "Secretary",
        "line": "[sees Tom arriving] There's somebody asking a lot of questions about what's going on."
    },
    {
        "character": "Tom",
        "line": "Let me handle this! [takes the receiver] I'm sorry, but there is no such thing as Project Imagination Doorway! [listens] Imagination Doorway. It was started in the Sixties as a secret government project. Right."
    },
    {
        "character": "",
        "line": "The portal inside the Pentagon, day. Stan and Kyle rehearse the song, singing better on key than before."
    },
    {
        "character": "Stan, Kyle",
        "line": "Imagina-a-ation, Imagina-\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Waitwaitwait, maybe that's where he went really flat, like that half-step key change? Imagina-ation."
    },
    {
        "character": "Kyle",
        "line": "Right, then it was \"Imagina-ation, Imagina-ation. Imagina-atio-on\"\n\n [the lights dim and the portal begins to glow. The boys are confused for a moment, then face the portal with the other people present]\n"
    },
    {
        "character": "Lead tech",
        "line": "It's open! It's open!"
    },
    {
        "character": "Operator",
        "line": "Getting readings from the other side... the, that's it. We've made an opening to our imagination, sir! [the officers and techs all cheer and hug each other. Stan and Kyle stand there, awed]"
    },
    {
        "character": "General Deckter",
        "line": "All right, that's enough! We've still got a lot of work to do, people! Its time to go in and get our imaginations under control!"
    },
    {
        "character": "",
        "line": "The Gumdrop forest. Butters walks with Snarf and the Lollipop King along a multicolored road. Huge gumdrops line the road on either side"
    },
    {
        "character": "Butters",
        "line": "How much further to Castle Sunshine?"
    },
    {
        "character": "Snarf",
        "line": "Snarf, I'm not sure snarf snarf. I've never been. [a female scream stops them in their tracks]"
    },
    {
        "character": "Butters",
        "line": "What was that?"
    },
    {
        "character": "Lollipop King",
        "line": "[walks to his left into the woods] Over here. [the other two follow and peer over some bushes] Oh Christ. Its Strawberry Shortcake. [in a clearing, Strawberry Shortcake sits on a stump, tied up so she can't move. Many evil characters surround her, ready to do her great harm]"
    },
    {
        "character": "Strawberry Shortcake",
        "line": "Please, let me go. [the Headless Horseman kicks her] Wuh. [Frankenstein's Monster kicks her] Wuh! [an Imperial Stormtrooper smacks her around with his rifle] Dugh! [Jason walks up and put his knife under her eyes...]"
    },
    {
        "character": "Snarf",
        "line": "Oh my God! Snarf. [and scoops out her left eyeball.]"
    },
    {
        "character": "Strawberry Shortcake",
        "line": "Aaaaaaaaah! Aaaaaaaaah! Aaaaaaaaah!"
    },
    {
        "character": "The Minotaur",
        "line": "Now kill her!"
    },
    {
        "character": "Squirrelly Squirrel",
        "line": "[the Woodland Critters show up] Whoa whoa, hang on, y'all. You can't just kill her. That's not evil enough."
    },
    {
        "character": "Freddy Krueger",
        "line": "What do you mean? We cut out her eyeball."
    },
    {
        "character": "Jason Voorhees",
        "line": "Yeah, that's super hardcore."
    },
    {
        "character": "Squirrelly Squirrel",
        "line": "Now come on y'all. We can do better than that."
    },
    {
        "character": "Beavery Beaver",
        "line": "Hey! I know! Let's all pee in her empty eye socket!"
    },
    {
        "character": "Deery Deer",
        "line": "Let's make her eat her own eyeball, and then pee in her empty eyesocket."
    },
    {
        "character": "Beary Bear",
        "line": "How about we get someone with AIDS to pee in her eyesocket, so she dies all slowlike? [the other Critters cheer at the idea]"
    },
    {
        "character": "The Minotaur",
        "line": "Nobody here has AIDS!"
    },
    {
        "character": "Woodland Critters",
        "line": "Awwww!!"
    },
    {
        "character": "Beary Bear",
        "line": "But we've got to have AIDS before we pee in her eyesocket!"
    },
    {
        "character": "Squirrelly Squirrel",
        "line": "Now don't be down y'all. I bet we can find some AIDS out in the forest. [the Critters scatter in renewed enthusiasm]"
    },
    {
        "character": "Lollipop King",
        "line": "Dude, run, run, ruuun! [Butters and Snarf leave quickly, and he follows]"
    },
    {
        "character": "",
        "line": "The portal at the Pentagon. Some army troops in camouflage arrive and the techs finish up preparations. General Deckter paces in front of the soldiers."
    },
    {
        "character": "General Deckter",
        "line": "All right, men. We don't know what you'll experience on the other side of this doorway, but it will most likely be really weird. If you reach our imagination, you are to take every step necessary to get it under control! Are you ready?"
    },
    {
        "character": "Soldiers",
        "line": "Yes sir!"
    },
    {
        "character": "General Deckter",
        "line": "Are you ready, Kurt Russell?"
    },
    {
        "character": "Kurt Russell",
        "line": "[dressed in camouflage like the others] I... I don't understand why I'm here. I I'm just an actor."
    },
    {
        "character": "General Deckter",
        "line": "Yes, but you were in that one movie that was kinda like this. That gives you more experience than anybody. All right, here we go! Men! Forwaaard!"
    },
    {
        "character": "Tech 1",
        "line": "Sir, we have a security breach!"
    },
    {
        "character": "General Deckter",
        "line": "What?!"
    },
    {
        "character": "Tech ",
        "line": "There's an Unauthorized Entry Alert, sir-it's coming from Sector Two!"
    },
    {
        "character": "General Deckter",
        "line": "Sector Two?? [a large window at the far end of the room shatters as Cartman tumbles in, landing on his back. Everyone turns to see him]"
    },
    {
        "character": "Kyle",
        "line": "Cartman??"
    },
    {
        "character": "Cartman",
        "line": "[gets up quickly and marches towards Kyle] Hello Kyle! Thought you could get out of your responsibilities, huh?!"
    },
    {
        "character": "General Deckter",
        "line": "Who the hell are you?!"
    },
    {
        "character": "Cartman",
        "line": "That kid you have made a bet that if I could prove that I saw a leprechaun, he would suck my balls!"
    },
    {
        "character": "General Deckter",
        "line": "Get him out of here!"
    },
    {
        "character": "Cartman",
        "line": "[some guards seize him and begin to drag him away] No! Hold on a second! [they stop and let him go] I have a contract [holds it out] validated by the United States court system!"
    },
    {
        "character": "General Deckter",
        "line": "Let me see that! [a guard takes it from Cartman over to General Deckter, who reads it over] Why would you agree to suck someone's balls?"
    },
    {
        "character": "Kyle",
        "line": "I didn't think there was going to be a goddamned leperachaun!!!"
    },
    {
        "character": "General Deckter",
        "line": "All right, you two can go use the conference room. Go on, we have work to do here."
    },
    {
        "character": "Kyle",
        "line": "[stunned] Wha?! Well wait, ahah I wanna see what happens here!"
    },
    {
        "character": " Deckter",
        "line": "You signed an agreement, kid. We don't have time for this. Go on and do it."
    },
    {
        "character": "Kyle",
        "line": "[looks at General Deckter, than at Stan] Stan?"
    },
    {
        "character": "Stan",
        "line": "Dude, you did make a deal... [Kyle has run out of appeals and reluctantly follows Cartman out]"
    },
    {
        "character": "Cartman",
        "line": "Theee conference room is which way? [smiles]"
    },
    {
        "character": "",
        "line": "Conference room, later. Cartman and Kyle sit facing each other."
    },
    {
        "character": "Cartman",
        "line": "Here we are, Kyle. You tried to bail out on our agreement, but I found you."
    },
    {
        "character": "Kyle",
        "line": "I didn't \"bail,\" I got picked up by the government!"
    },
    {
        "character": "Cartman",
        "line": "Well we're here now, that's all that matters. [brings up a small cup of mixed nuts] Care for some nuts? Oh, that's right. I guess you'll be chock full of nuts in a few minutes."
    },
    {
        "character": "Kyle",
        "line": "Cartman, do you even know what's going on? We went to Imaginationland, terrorists attacked it, and now the government is about to-"
    },
    {
        "character": "Cartman",
        "line": "[cuts him off with a loud yawn and hops off his chair] Oh jeez, I'm sorry, Kyle. [walks towards a tripod and sets a camera on it] It's just that I'm so completely bored by this story. See, I'm really only interested in the part where the leprechaun was real, and so you have to suck my balls."
    },
    {
        "character": "Kyle",
        "line": "Okay, fine. You know what? Let's just get it over with!"
    },
    {
        "character": "Cartman",
        "line": "Oh nonono, nononot so fast, Kyle. [starts unzipping a duffle bag] I've waited a long time for this, and I intend to savor each and every second. [pulls out a purple robe]"
    },
    {
        "character": "Kyle",
        "line": "No, I'm serious! I wanna see what's happening downstairs, so let's just do it! [pounds the table with his left fist]"
    },
    {
        "character": "Cartman",
        "line": "[puts on the robe] Not... just yet, Kyle. There's still a few things I need to do. [pulls out a crown and turns to face Kyle] By the way, I should tell you that I haven't had a chance to shower while making my way up here. My balls are... [puts on the crown] extra vinegary..."
    },
    {
        "character": "Kyle",
        "line": "Just get to it already!"
    },
    {
        "character": "",
        "line": "The portal at the Pentagon. The soldiers move slowly towards the portal. General Deckter walks up to the lead tech"
    },
    {
        "character": "Lead tech",
        "line": "Entering the portal in five seconds."
    },
    {
        "character": "General Deckter",
        "line": "Kurt Russell, can I get a comm check?"
    },
    {
        "character": "Kurt Russell",
        "line": "Check 1, 2."
    },
    {
        "character": "General Deckter",
        "line": "Good luck men! Godspeed! [the soldiers walk up the ramp and through the portal] What do we have?! Kurt Russell, can you hear me?"
    },
    {
        "character": "Kurt Russell",
        "line": "[voice only] We're here. We're s-somewhere."
    },
    {
        "character": "Tech 3",
        "line": "They are inside the imagination, sir."
    },
    {
        "character": "General Deckter",
        "line": "What do you see in there?"
    },
    {
        "character": "Kurt Russell",
        "line": "There's lots of... big mushrooms, colorful grass, some castles in the distance, eh... Wait. Something's coming for us! It's coming out of the bushes and- [everyone braces for the worst] It's a-! ...Oh, Aw, it's just a cute little squirrel. [Everyone relaxes. Stan draws a sigh of relief] Hey, it talks, haha. The little squirrel talks."
    },
    {
        "character": "Lead tech",
        "line": "Awww, an imaginary talking squirrel."
    },
    {
        "character": "Techs",
        "line": "Awww."
    },
    {
        "character": "General Deckter",
        "line": "Ask the squirrel what it knows about the terrorist attack."
    },
    {
        "character": "Kurt Russell",
        "line": "Wait a minute, eh. The squirrel has friends. Oh why, why it's a whole bunch of woodland critters."
    },
    {
        "character": "Stan",
        "line": "Wait, woodland critters... [begins searching his memory]"
    },
    {
        "character": "Kurt Russell",
        "line": "There's a talking bear and a beaver, uh... the, they seem to be Christmas critters. Well hello. Yes, hi."
    },
    {
        "character": "Stan",
        "line": "Get them out of there!"
    },
    {
        "character": "General Deckter",
        "line": "What?"
    },
    {
        "character": "Stan",
        "line": "Tell them to get away now!"
    },
    {
        "character": "General Deckter",
        "line": "What's the matter?"
    },
    {
        "character": "Kurt Russell",
        "line": "Oh the... cute little bear's eyes are starting to glow red now... Uh hello there, little animals, do you happen to know how to huh? OW! AAAAAAAHHHH!"
    },
    {
        "character": "General Deckter",
        "line": "Kurt Russell, what's going on?!"
    },
    {
        "character": "Kurt Russell",
        "line": "They're raping mee!! They're raping meee!!!"
    },
    {
        "character": "General Deckter",
        "line": "Get out of there, Kurt Russell!"
    },
    {
        "character": "Kurt Russell",
        "line": "They're raping all of us! Whoaho! Oh it hurts! They're raping us and it huuurts! Waaagh!"
    },
    {
        "character": "",
        "line": "The conference room. Cartman fine-tunes the camera position."
    },
    {
        "character": "Cartman",
        "line": "I was thinking of using a high-speed shutter with a low depth of field. What do you think?"
    },
    {
        "character": "Kyle",
        "line": "Goddammit Cartman, will you stop wasting time? I wanna get this over with!"
    },
    {
        "character": "Cartman",
        "line": "No, you're right, Kyle. A higher depth of field will make sure everything stays in focus. [sets the depth] There we go. [smiles, then returns to his seat] Now, Kyle, when you're sucking my balls, are you gonna think about how right I was about the leprechaun, or are you just gonna try and focus on how rough and salty my balls feel in your mouth?"
    },
    {
        "character": "Kyle",
        "line": "Let's just do it!! [pounds the table with both fists]"
    },
    {
        "character": "Cartman",
        "line": "In time, Kyle. You certainly are eager for balls, aren't you? Are you ball-famished? Balls-starving? You see, Kyle, I wonder if at this moment you are actually- [a red alert interrupts him]"
    },
    {
        "character": "Guard",
        "line": "Everyone to the main hall now! Go!"
    },
    {
        "character": "Cartman",
        "line": "Uh, no, no, we're not done in here yet."
    },
    {
        "character": "Guard",
        "line": "Everyone to the main hall now!! [Kyle heads for the door and out behind the security guard]"
    },
    {
        "character": "Cartman",
        "line": "No! Goddammit, no!"
    },
    {
        "character": "",
        "line": "The Gumdrop Forest. Butters, the Lollipop King, and Snarf continue down the Rainbow Road."
    },
    {
        "character": "Snarf",
        "line": "Boy snarf snarf, my feet are really gettin' tired snarf."
    },
    {
        "character": "Butters",
        "line": "Aww, Sn-Snarf, could you maybe like sh-shut up for five minutes?"
    },
    {
        "character": "Lollipop King",
        "line": "Wait! There it is. We made it! [a rather impressive complex looms before them] Castle Sunshine! [they rejoice at the sight, but a hissing sound follows] Hurry! Get inside! [they run towards the castle]"
    },
    {
        "character": "Perseus",
        "line": "The evil imaginary characters are approaching! Lock down the gates! Prepare to fire the cannons! [more survivors walk in]"
    },
    {
        "character": "Butters",
        "line": "Wait! Waaait! [the trio reach the castle gate and Perseus stops them with his sword]"
    },
    {
        "character": "Perseus",
        "line": "What imaginary character are you?!"
    },
    {
        "character": "Lollipop King",
        "line": "The Lollipop King? From the Lollipop Forest?"
    },
    {
        "character": "Snarf",
        "line": "And I'm Snarf. Snarf, snarf snarf snarf."
    },
    {
        "character": "Perseus",
        "line": "[to Butters] And what imaginary character are you?"
    },
    {
        "character": "Butters",
        "line": "Oh, uhh, uh I'm not imaginary. Ah I'm Butters."
    },
    {
        "character": "Perseus",
        "line": "What's a \"Butters\"?"
    },
    {
        "character": "Snarf",
        "line": "The Mayor brought him and some other kids into Imaginationland just before the terrorist attack."
    },
    {
        "character": "Perseus",
        "line": "So YOU came from the real world at precisely the same time as the terrorists! That seems like quite a coincidence!"
    },
    {
        "character": "Butters",
        "line": "I, well I was just playin' with my friends, and then, wu-we caught a leprechaun, and then this guy-"
    },
    {
        "character": "Perseus",
        "line": "You caught the Leprechaun? Take him!"
    },
    {
        "character": "Snarf",
        "line": "Perseus! He's not against us snarf snarf!"
    },
    {
        "character": "",
        "line": "The portal at the Pentagon. The portal has begun to act violently. Lightning shoots out from the portal and it changes color frequently. Everyone backs away."
    },
    {
        "character": "General Deckter",
        "line": "Talk to me! What's going on?! [the guard comes in with Kyle and Cartman]"
    },
    {
        "character": "Lead tech",
        "line": "Something is... coming through the gate from the other side. [a few moments later, ManBearPig walks through]"
    },
    {
        "character": "Operator",
        "line": "What is it?!"
    },
    {
        "character": "Tech 4",
        "line": "Its like a... half man half bear!"
    },
    {
        "character": "Lead tech",
        "line": "And half pig! [ManBearPig grabs a tech and slams him against the portal's supporting wall]"
    },
    {
        "character": "Tech 5",
        "line": "Oh! No, no wait! It's like a half bear half manpig! [ManBearPig rips the tech's head off and tosses it towards General Deckter. Everyone scatters]"
    },
    {
        "character": "General Deckter",
        "line": "Look out! [ManBearPig jumps over and grabs the tech at both ends]"
    },
    {
        "character": "Lead tech",
        "line": "No! I think it's more like a half man, and half pigbear! [ManBearPig rips him in two at the waist]"
    },
    {
        "character": "General Deckter",
        "line": "Reverse the doorway! Send it back through!"
    },
    {
        "character": "Kyle",
        "line": "AAAHHH! [runs away, but ManBearPig scoops him up]"
    },
    {
        "character": "Stan",
        "line": "KYLE!! [a fading tech pushes the red button at his station as he drops to the floor. Lightning flashes into the room as a tractor beam pulls Stan into the portal. ManBearPig resists the pull, but crushes Kyle in its left hand for several seconds]"
    },
    {
        "character": "Kyle",
        "line": "AAAAAAAAAAAA- [ManBearPig lets go of Kyle as the tractor beam fiinally pulls it in. Kyle lays on the floor, blue in the face]"
    },
    {
        "character": "",
        "line": "Castle Sunshine, inside. Perseus leads Butters, Snarf, and the Lollipop King down the main hall as two Tron soldiers escort them."
    },
    {
        "character": "Butters",
        "line": "Please! I didn't help the terrorists get into Imaginationland! Honest!"
    },
    {
        "character": "Perseus",
        "line": "That is for the Council of Nine to decide!"
    },
    {
        "character": "Lollipop King",
        "line": "Don't worry, kid, the Council of Nine consists of some of the most highly-regarded imaginary characters in all Imaginationland"
    },
    {
        "character": "",
        "line": "The meeting room. At a triangular table sit nine imaginary characters. On the left side of the table are Gandalf the Grey, Glinda the Good Witch, and Morpheus. On the right side are Zeus, Luke Skywalker, and Popeye the Sailor. Sitting on the third side with their backs to us are Jesus and Wonder Woman. At the opposing vertex sits Aslan the Lion"
    },
    {
        "character": "Aslan",
        "line": "Fellow Council, these are indeed dark times. The evil forces amass at our gates as we speak. Zeus believes we should evacuate."
    },
    {
        "character": "Zeus",
        "line": "Yes. Their power outmatches ours. If they are giving us a chance to leave we must take it!"
    },
    {
        "character": "Aslan",
        "line": "And what say you, Morpheus?"
    },
    {
        "character": "Morpheus",
        "line": "How our we to know that they will let us go? Their offer could be a trap."
    },
    {
        "character": "Glinda",
        "line": "Perhaps we must flee to the Temple of Alderon. Surely they wouldn't chase us there."
    },
    {
        "character": "Jesus",
        "line": "[rises] No, we can't. Come on, you guys, this is our home. We have to fight, to keep it the way it was meant to be."
    },
    {
        "character": "Luke Skywalker",
        "line": "I'm with Jesus. The evil characters aren't going to just let us go."
    },
    {
        "character": "Popeye",
        "line": "[Says something, but it's unintelligible]"
    },
    {
        "character": "Jesus",
        "line": "That may be, Popeye, but we don't have a choice! [the doors open and the Council looks to see who's entering]"
    },
    {
        "character": "Perseus",
        "line": "Forgive my intrusion, Council of Nine, but this boy has infiltrated from the real world."
    },
    {
        "character": "Aslan",
        "line": "Bring him here!"
    },
    {
        "character": "",
        "line": "The portal at the Pentagon. Paramedics have arrived to check on Kyle. One of them tries to resuscitate him with a defibrillator."
    },
    {
        "character": "Paramedic",
        "line": "Clear! [sends power through the paddles. Kyle rises, then falls softly. No sign of life yet. The paramedic removes the paddles and announces] I'm sorry. He's gone."
    },
    {
        "character": "Cartman",
        "line": "No! Kyle can't die. [gets on his knees and checks various parts of his body for a pulse]"
    },
    {
        "character": "Paramedic",
        "line": "I'm sorry, young man."
    },
    {
        "character": "Cartman",
        "line": "Kyle?"
    },
    {
        "character": "Paramedic",
        "line": "Well... at least now he doesn't have to suck anyone's balls."
    },
    {
        "character": "Cartman",
        "line": "[enraged] NNNOOO! [begins giving Kyle CPR] No, he has a strong heart! He wants to live! Come on, Kyle! Come on, buddy!"
    },
    {
        "character": "General Deckter",
        "line": "He's gone, little boy."
    },
    {
        "character": "Cartman",
        "line": "[to the paramedic] Zap him again! [opens Kyle's coat and shirt for better contact] Do it!"
    },
    {
        "character": "Paramedic",
        "line": "Charging."
    },
    {
        "character": "Cartman",
        "line": "DO IT! [the paramedic places the paddles back on Kyle's body] Come on buddy."
    },
    {
        "character": "Paramedic",
        "line": "Clear."
    },
    {
        "character": "Cartman",
        "line": "Come on buddy. [the paramedic fires away. Kyle rises, then falls softly. No sign of life yet.] Get out of here! [goes back to giving Kyle CPR. A woman covers her eyes in despair] Godammit Kyle, you never walked away from anything in your life! Now fight! [smacks Kyle around] Fight! Fight! Right now! [begins to break down] Fu-hight! Fu-hu-hight! [pounds Kyle's chest hard] Fight! [Kyle coughs, then comes to. Cartman begins to weep happily.] Give him some air. [an oxygen mask appears and Cartman places it over Kyle's nose and mouth.] There, easy. Breathe easy. [weeps softly some more]"
    },
    {
        "character": "",
        "line": "The meeting room at Castle Sunshine. Butters now stands on a platform in the middle of the table"
    },
    {
        "character": "Aslan",
        "line": "I believe this child was brought into Imaginationland for a reason. Perhaps the Mayor knew something we don't."
    },
    {
        "character": "Zeus",
        "line": "What are you saying, Aslan? That if we are to take back control, we might-?"
    },
    {
        "character": "Morpheus",
        "line": "Yes. If we are to take back control from the evil forces, this little boy might be the key."
    },
    {
        "character": "Butters",
        "line": "Awww, I'm the key? Could I not be the key, Morpheus? I don't wanna be the key."
    },
    {
        "character": "Luke Skywalker",
        "line": "If you ever wanna see your home again, little boy, you'll have to rise to this challenge."
    },
    {
        "character": "Butters",
        "line": "But I, but I'm supposed to be at school right now, uh, and instead I got, I got Snarf and Popeye and Luke Skywalker all pissed off..."
    },
    {
        "character": "Aslan",
        "line": "It is a dark time for all of us, young boy. But know that if you believe in yourself, everything will turn out all right."
    },
    {
        "character": "",
        "line": "The portal at the Pentagon. A large missile is being wheeled into place."
    },
    {
        "character": "Tom",
        "line": "Sir? Are you sure about this?"
    },
    {
        "character": "General Deckter",
        "line": "We have no choice. Terrorists have attacked us where we are most vulnerable. There's no other option. [the missile is in place] We have to nuke our imagination. [the missile is lifted and tilted]"
    },
    {
        "character": "",
        "line": "A hospital room. Kyle is resting. A few gifts lie near him. Cartman rises from under the bed with his crown and robe on and contract in hand"
    },
    {
        "character": "Cartman",
        "line": "Wake up, Kyle. [Kyle wakes up to a smiling Cartman]"
    }
]