[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Imaginationland. Recaps from the other two episodes follow. First scene: Arrival at Imaginationland"
    },
    {
        "character": "Aslan",
        "line": "[voice only] Imaginationland... used to be a happy place. But then the terrorists attacked. [a shot of a terrorist blowing himself up, killing many imaginary creatures] And so many of us were killed. [a shot of Santa on fire, then a shot of the Barrier falling apart] The Barrier came down, and all the most evil imaginary characters were unleashed. [the evil characters pour through the Barrier. Next shot is Strawberry Shortcake being kicked by the Headless Horseman, then by Frankenstein's Monster. Aslan now appears] Now our final battle will take place. The evil characters are marching toward us with the intent to wipe us all out. [various shots of evil characters on the march]"
    },
    {
        "character": "Beavery Beaver",
        "line": "This is gonna be fun, huh? [the other Woodland Critters whoop and holler]"
    },
    {
        "character": "Aslan",
        "line": "We prepare for a battle we cannot win. [a shot of Popeye honing swords, then a shot of Luke Skywalker handing swards to imaginary creatures. Totoro gets one, then ROM the Space Knight] Sweet and cuddly imaginary characters, many who have never held a weapon, [Donatello puts a helmet on Snarf's head. Wonder Woman hands a sword to a doll character] must now fight for their very lives. We are too few in number, [Mario takes a full-sized sword and walks away with it without a problem. Superman walks off with a battle axe. A smurf tries to take a sword, but has trouble moving it once it's on the floor. Another character takes a spear] but we have one hope. That is where you come in, young boy. [walks over to Butters as other members of the Council look on] Only you can help us win this battle."
    },
    {
        "character": "Butters",
        "line": "Wuh, what can I do?"
    },
    {
        "character": "Aslan",
        "line": "You have a power here that you have yet to understand."
    },
    {
        "character": "",
        "line": "EPISODE III"
    },
    {
        "character": "",
        "line": "Static appears on screen, then clears up to a security camera clip of ManBearPig attacking Pentagon officials after entering the real world through the portal. After ManBearPig rips the lead tech in two, the tape is halted"
    },
    {
        "character": "Al Gore",
        "line": "[voice only] Back it up! [the footage is rewound to the part where ManBearPig attacks the tech in blue dress shirt, then stopped.] Look! [points to ManBearPig] Right there! [the tape plays normally] See that?! [the tape stops again where the lead tech is ripped in two] What does that look like to you?! It's ManBearPig! [now onscreen wearing his Nobel Prize medallion] I told you it was real! [three officials watch him from a table in his office] Look again! [fast forwards, then stops when ManBearPig picks up Kyle] There! half man, half bear, and half pig! Do you see it?!"
    },
    {
        "character": "Official 1",
        "line": "Yes, we see it, Mr. Gore."
    },
    {
        "character": "Al Gore",
        "line": "Something big is going on, and the American people need to know what! I'm off! [makes like he's flying away like Superman]"
    },
    {
        "character": "",
        "line": "Washington D.C. Memorial Hospital, day. Kyle is resting in a room, and his doctor is in the hallway talking to another doctor."
    },
    {
        "character": "Doctor",
        "line": "He's recovering, but there's been some trauma to his brain. The boy says he's been hearing imaginary voices."
    },
    {
        "character": "",
        "line": "Kyle's room. A closeup of him in bed"
    },
    {
        "character": "Stan",
        "line": "[in Kyle's head] Hello? [Kyle's eyes open and blink] Hello? Anybody? [Kyle's eyes dart around]"
    },
    {
        "character": "Kyle",
        "line": "Stan? [sits up and looks around]"
    },
    {
        "character": "Stan",
        "line": "Hello?"
    },
    {
        "character": "Kyle",
        "line": "Stan?"
    },
    {
        "character": "Cartman",
        "line": "[comes in smiling with a covered platter on a food cart] Good morning, Kyle. How are we feeling?"
    },
    {
        "character": "Kyle",
        "line": "Cartman, what's happened?"
    },
    {
        "character": "Cartman",
        "line": "What's happened? Well, let's see: You bet me that I couldn't prove that leprechauns were real. And if I could prove it, you had to suck my balls, I believe."
    },
    {
        "character": "Kyle",
        "line": "No, I mean what happened at the Pentagon?!"
    },
    {
        "character": "Cartman",
        "line": "[smiles] You just rest, Kyle. [takes the lid off the platter] Look what I made for you. A sundae. It has hot fudge and whipped cream and a cherry- [suddenly pondering] but... I feel like something is missing; don't you, Kyle? [taps his chin] What else belongs on a sundae besides hot fudge and whipped cream, [real softly] let's see"
    },
    {
        "character": "Kyle",
        "line": "Arh!"
    },
    {
        "character": "Cartman",
        "line": "Hot fudge, whipped cream, what else belongs on a sundae, Kyle? [turns towards the sundae] What else goes on a sundae besides hot fudge,whipped cream, and ...oh, that's right! [faces Kyle with a determined face] My balls!"
    },
    {
        "character": "Kyle",
        "line": "Cartman, what is going on out there?! What happened to Stan?!"
    },
    {
        "character": "Cartman",
        "line": "Oh, he got sucked through that portal thing and they're gonna nuke it now. [takes off his cap and begins to pull out yet another costume] So are you all set for your big photo shoot, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "Wwait, what do you mean? Stan's in danger?"
    },
    {
        "character": "Cartman",
        "line": "[now in papal robes] Don't try to change the subject, Kyle. [puts on the papal tiara and pulls the camera and its tripod into place] You've done a really good job of getting out of this bet, but it's finally time to settle. Get ready for your sundae, Kyle. With extra nuts. [closes his eyes and smiles]"
    },
    {
        "character": "",
        "line": "Castle Sunshine. Aslan stands guard on a bridge overlooking the fields outside the castle."
    },
    {
        "character": "Jesus",
        "line": "[arriving with Perseus and the Lollipop King] Aslan, the evil characters are almost here!"
    },
    {
        "character": "Aslan",
        "line": "Get everyone to the battlefield! Defend the castle walls! Quickly young boy, we need your powers now!"
    },
    {
        "character": "Butters",
        "line": "What powers? Ah I don't understand."
    },
    {
        "character": "Gandalf",
        "line": "You are real. You are a creator. That means you can imagine things into existence here."
    },
    {
        "character": "Butters",
        "line": "I c-I can?"
    },
    {
        "character": "Aslan",
        "line": "Santa Claus was killed in the terrorist attack. The first thing we need is for you to bring him back."
    },
    {
        "character": "Butters",
        "line": "How?"
    },
    {
        "character": "Glinda",
        "line": "You just have to focus your mind. Imagine Santa and nothing else."
    },
    {
        "character": "Butters",
        "line": "How am I supposed to focus with all this crap goin' on?!"
    },
    {
        "character": "Luke Skywalker",
        "line": "Think only of one thing. Imagine it. Believe in it."
    },
    {
        "character": "Gandalf",
        "line": "Whatever is most prominent in your mind will come to be. [Butters closes his eyes to focus, and soon something appears before him. He opens his eyes and sees his father]"
    },
    {
        "character": "Steven",
        "line": "[arms akimbo] Butters! [Butters cowers in fear] You are grounded, mister! You hear me?! [suddenly with a deformed leg, elfin ears, horns, and claws instead of fingers, and a deep voice] GROUNDED!"
    },
    {
        "character": "Butters",
        "line": "[runs around in circles and then shakes his head is disbelief] AAAAAAAAA! No, nonono, no no no! [Steven vanishes]"
    },
    {
        "character": "Aslan",
        "line": "[in Butters' face] What are you doing?! We need Santa!"
    },
    {
        "character": "Butters",
        "line": "I'm trying!"
    },
    {
        "character": "Wonder Woman",
        "line": "[arrives and kneels down next to him] Come on, kid, imagine Santa! Believe in Santa!"
    },
    {
        "character": "Zeus",
        "line": "You must believe in Santa!"
    },
    {
        "character": "Aslan",
        "line": "BELIEVE IN SANTA! RIGHT NOW!"
    },
    {
        "character": "Butters",
        "line": "GAA HAA!"
    },
    {
        "character": "",
        "line": "Kyle's hospital room. Cartman has called in some workers to install a photo studio, consisting of a blue background with clouds, and a small platform with a throne on it. On the right arm rest sits the sundae. Two spotlights and light reflectors round out the setup. Cartman tests a remote control for the camera, and it works."
    },
    {
        "character": "Cartman",
        "line": "Kevin, can I get some more bounce off that too, 'kay? Let's just go with a 5 6 8 split"
    },
    {
        "character": "Kyle",
        "line": "Cartman, will you shut up? I'm trying to find out what's going on."
    },
    {
        "character": "",
        "line": "Channel 5 Breaking News."
    },
    {
        "character": "Anchorman",
        "line": "A new terrorist attack seems to have taken place. This time, in our imagination. [the footage of ManBearPig's killer rampage is shown, with the dialog cut out] Al Gore brought this video to the public's attention, sparking demands by everyone who wants to know exactly what's going on."
    },
    {
        "character": "",
        "line": "Pentagon Press Conference."
    },
    {
        "character": "General Deckter",
        "line": "We were hoping to keep this quiet until it was all over, but, two days ago there was a terrorist attack on our imagination, and now our imaginations are running wild."
    },
    {
        "character": "Reporter 1",
        "line": "Our imaginations are running wild and we weren't told?!"
    },
    {
        "character": "General Deckter",
        "line": "By attacking our imagination the terrorists have found our most vulnerable spot. And we've determined that the best course of action is to nuke our imagination."
    },
    {
        "character": "Reporter 2",
        "line": "Is nuking our imagination really prudent?"
    },
    {
        "character": "Reporter 3",
        "line": "Aren't there other, more peaceful ways to get our imagination under control?"
    },
    {
        "character": "Reporter 4",
        "line": "Couldn't we trying sending Kurt Russell into a portal to our imagination to try and reason with the-"
    },
    {
        "character": "General Deckter",
        "line": "We tried that! And Kurt Russell was raped by Christmas Critters!"
    },
    {
        "character": "Reporter 5",
        "line": "...A-ooch"
    },
    {
        "character": "",
        "line": "Channel 5 Breaking News."
    },
    {
        "character": "Anchorman",
        "line": "The Pentagon claims that because imaginary things are not real, the military doesn't need Senate approval to nuke them."
    },
    {
        "character": "",
        "line": "A protest in Washington D.C.."
    },
    {
        "character": "Hippie 1",
        "line": "That's bullcrap, man! You can't nuke our imagination!"
    },
    {
        "character": "Hippie 2",
        "line": "Don't nuke our imagination bro! WOOO!"
    },
    {
        "character": "",
        "line": "Channel 5 Breaking News, commentary."
    },
    {
        "character": "Anchorman",
        "line": "Mike, does the military have the authority to nuke our imagination?"
    },
    {
        "character": "Mike",
        "line": "Uh clearly they don't, Steven, and they're gonna have a big problem because state government has already set a precedent that imaginary characters are real. I cite a famous case of Cartman v. Broflovski in which a U.S. court found for the plaintiff who saw a leprechaun."
    },
    {
        "character": "Anchorman",
        "line": "Yes, I believe the defendant had to suck the plaintiff's balls in that case."
    },
    {
        "character": "Mike",
        "line": "That's right, Steven, yeah."
    },
    {
        "character": "",
        "line": "Kyle's hospital room. Kyle keeps watching. Cartman continues his preparations"
    },
    {
        "character": "Kyle",
        "line": "Oh for the love of God!"
    },
    {
        "character": "Stan",
        "line": "Hello? Can anybody hear me?"
    },
    {
        "character": "Kyle",
        "line": "Stan! Dude, is that you?"
    },
    {
        "character": "Stan",
        "line": "Kyle? Where are you? I, I don't see you."
    },
    {
        "character": "Kyle",
        "line": "No, I'm not there. I'm at a hospital. I I'm hearing you in my imagination."
    },
    {
        "character": "Stan",
        "line": "...Oh that makes sense."
    },
    {
        "character": "Kyle",
        "line": "Dude, what's happening?"
    },
    {
        "character": "Stan",
        "line": "[walking down the rainbow road] I'm in like a gumdrop forest. I just saw Strawberry Shortcake tied up and dead with pee in her eye. [some moaning horns are heard] Ha-hang on. I think something really big is about to go down."
    },
    {
        "character": "",
        "line": "The battlefield. The two sides appear, approaching each other. A man in only striped pants and shoes plays a horn"
    },
    {
        "character": "Lollipop King",
        "line": "The evil characters are here. [Jesus and Robin Hood join him, Jesus ready to fight with his sword]"
    },
    {
        "character": "Jesus",
        "line": "There are so many of them. HAAAAA! [lifts his sword to strike position as the other good characters crowd in. The two sides start fighting, and Waldo is impaled by both sides]"
    },
    {
        "character": "",
        "line": "Jesus takes on Pinhead and decapitates him. As the battle rages, the six remaining Council members watch along with Butters"
    },
    {
        "character": "Aslan",
        "line": "There's no time left! You have to get control of your imagination and bring Santa back NOW!"
    },
    {
        "character": "Butters",
        "line": "Santa. Saaanta."
    },
    {
        "character": "Luke Skywalker",
        "line": "Think. Jolly old Santa. Red suit, white beard."
    },
    {
        "character": "Butters",
        "line": "Red suit, white beard... Ssssanta! [Poof! Santa appears, but he's horribly deformed. The toys in his toy sack are deformed as well. Butters screams and turns away]"
    },
    {
        "character": "",
        "line": "Kyle's hospital room. Cartman is now on the throne, and Kevin is behind the camera"
    },
    {
        "character": "Cartman",
        "line": "How does that look? Can you see my balls and the sundae in frame?"
    },
    {
        "character": "Anchorman",
        "line": "[everyone turns to watch the TV] A shocking new development in the nuking of imagination!"
    },
    {
        "character": "",
        "line": "The Supreme Court, outside."
    },
    {
        "character": "Chief Justice",
        "line": "The Supreme Court has ruled with the military that imaginary things are officially not real, and therefore no approval is needed to nuke them."
    },
    {
        "character": "General Deckter",
        "line": "Thank you."
    },
    {
        "character": "Kyle",
        "line": "Oh no."
    },
    {
        "character": "Chief Justice",
        "line": "This of course overturns any imagination-based verdicts in the past, including the famous Cartman v. Broflovski ballsucking case."
    },
    {
        "character": "Cartman",
        "line": "...What?"
    },
    {
        "character": "Steven",
        "line": "So it appears the military is ready to proceed with its operation, one they are calling \"Operation Nuke the Imagination Through the Imagination Doorway.\""
    },
    {
        "character": "Stan",
        "line": "Kyle? What's happening?"
    },
    {
        "character": "Kyle",
        "line": "The government is gonna nuke Imaginationland."
    },
    {
        "character": "Stan",
        "line": "What?! You can't let them do that!"
    },
    {
        "character": "Kyle",
        "line": "What am I supposed to do?"
    },
    {
        "character": "Stan",
        "line": "Dude you have to stall them! [Kyle doesn't look too sure] Uh- ...uh oh, what is that? Hey! G-get out of here! Leave me alone!"
    },
    {
        "character": "Kyle",
        "line": "Stan? Stan?? [gets out of bed and puts on his clothes]"
    },
    {
        "character": "Cartman",
        "line": "Where are you going?!"
    },
    {
        "character": "Kyle",
        "line": "I'm going to try to save Stan and Butters from getting nuked!"
    },
    {
        "character": "Cartman",
        "line": "Okay okay, but you you have to suck my balls first real quick."
    },
    {
        "character": "Kyle",
        "line": "No, I don't! The decision was overturned. [walks out of the room]"
    },
    {
        "character": "Cartman",
        "line": "[follows him out and watches him walk away] We had a DEAL KYLE!"
    },
    {
        "character": "Kyle",
        "line": "[walking towards the entrance] Yeah, that leprechauns were real! And the government just declared they AREN'T technically real, so I was right! It's over! I don't have to suck your balls!"
    },
    {
        "character": "Cartman",
        "line": "IT ISN'T OVER!! [Kyle turns to face him] It isn't over, Kyle! I have NOT waited this long to see you weasel your way out of this bet! Go ahead and go. But I swear on my life! Before this day is over! You, will, suck my balls! I SWEAR IT!!"
    },
    {
        "character": "",
        "line": "Castle Sunshine. The battle rages on. Popeye punches Akuma away, then punches Khan away. Darth Maul whips out his double-ended light saber, but Popeye disarms him and punches him away. Morpehus lands a kick on Freddy Krueger."
    },
    {
        "character": "Morpheus",
        "line": "[calling out to the Council members on the bridge] I need more spinach for Popeye! [Freddy gets up and swipes at him, sending him into the air and onto his back. A Tron soldier dispatches Jason Voorhees with a swing of his spear]"
    },
    {
        "character": "Tron Soldier",
        "line": "I-ee got one. I got him. [the Woodland Critters approach]"
    },
    {
        "character": "Beary Bear",
        "line": "Hey there. [the soldier turns around and Bear Bear blows his head apart with two laser beam blasts from his eyes. The Woodland Critters cheer him on. ]"
    },
    {
        "character": "Icarus",
        "line": "[flying in from the battlefield, lands on the bridge] We're losing the battle! There are simply too many of them!"
    },
    {
        "character": "Aslan",
        "line": "Then the day is lost."
    },
    {
        "character": "Wonder Woman",
        "line": "Wait! Aslan, look! [Aslan looks over. Butters is thinking hard again, and Santa returns, as normal as he ever was. The Council members draw closer to Butters]"
    },
    {
        "character": "Santa",
        "line": "What? What happened?"
    },
    {
        "character": "Luke Skywalker",
        "line": "You did it, kid!"
    },
    {
        "character": "Aslan",
        "line": "Quickly Santa! They need you on the battlefield!"
    },
    {
        "character": "Santa",
        "line": "Huh? [discerns the situation] Oh, all right. [grabs a golden axe and leaps over the wall] Make way for Santa! [lands on the field below, then swings the axe at the Minotaur, who falls down. The axe stays buried in the ribs]"
    },
    {
        "character": "Aslan",
        "line": "Now you see your potential, young creator. But there is still much more we need from you if we are to win this day!"
    },
    {
        "character": "",
        "line": "The Pentagon, day. Kyle arrives at a parking gate. Two armed guards are there, and three more guards are in the background in front of an entrance."
    },
    {
        "character": "Guard 2",
        "line": "[sees Kyle and aims his gun at him] This area is restricted, little boy."
    },
    {
        "character": "Kyle",
        "line": "Please, I need to talk to the people inside. They can't set off that nuke."
    },
    {
        "character": "Guard 2",
        "line": "Get behind the line with the other protesters! [Kyle looks, and it's the same group he saw on television moments before]"
    },
    {
        "character": "Hippie 3",
        "line": "No nukes in our imagination, bro! Wooo! [the other hippies cheer him on]"
    },
    {
        "character": "Kyle",
        "line": "Uhn, you don't understand! My friend is in Imaginationland! I can hear him in my head!"
    },
    {
        "character": "Guard 2",
        "line": "You pot-smokin' hippies aren't gettin' through here, so back off!"
    },
    {
        "character": "Hippie 4",
        "line": "Stop that nuke!"
    },
    {
        "character": "Hippies",
        "line": "Stop that nuke!"
    },
    {
        "character": "Hippies and Kyle",
        "line": "Stop that nuke! [Al Gore appears out of nowhere, making like he's Superman about to land]"
    },
    {
        "character": "Al Gore",
        "line": "What's going on here? [no one says a word, and he \"flies\" around a bit more] The military has to do this! It's their only way to kill ManBearPig. [\"flies\" off]"
    },
    {
        "character": "",
        "line": "Castle Sunshine. The battle continues. A pegasus fights a witch while a flying monkey does battle with the flying giraffe. On the bridge, Butters keeps imagining new characters into existence. A yellow furry archer appears and shoots an arrow right off the bat, then fires a second one"
    },
    {
        "character": "Aslan",
        "line": "Good, Butters. Now imagine some more archers on the castle walls!"
    },
    {
        "character": "Butters",
        "line": "Huwhoa! [Perseus appears on the bridge with a bad wound on his left arm]"
    },
    {
        "character": "Perseus",
        "line": "Aslan! We're losing the battle!"
    },
    {
        "character": "Robin Hood",
        "line": "[with a bleeding wound on his right arm] We managed to fight off the vampires and werewolves, but... now our troops are being shot down by the Cavity Creeps."
    },
    {
        "character": "Aslan",
        "line": "Cavity Creeps?"
    },
    {
        "character": "Cavity Creeps",
        "line": "[cutting through the field with their cavity drills] We make holes in teeth! We make holes in teeth!"
    },
    {
        "character": "Wonder Woman",
        "line": "What can destroy the Cavity Creeps?"
    },
    {
        "character": "Perseus",
        "line": "Only Crest Gel with Tartar Control."
    },
    {
        "character": "Aslan",
        "line": "[to Butters] Quickly! You must imagine a giant Crest Gel! [Butters thinks, and poof! There's a giant Crest Gel tube of toothpaste with arms and legs. Robin Hood and Perseus escort it to the battlefield]"
    },
    {
        "character": "Robin Hood",
        "line": "Yes!"
    },
    {
        "character": "Gandalf",
        "line": "His powers are getting stronger. We might just have a chance here."
    },
    {
        "character": "Archangel",
        "line": "Aslan, we've captured a spy! He was sneaking around the Gumdrop Forest! [down from above comes the archangel with Stan]"
    },
    {
        "character": "Butters",
        "line": "Stan! [points him out to Aslan and walks to him] Hey look, I imagined Stan here!"
    },
    {
        "character": "Stan",
        "line": "No, no! I got sucked through Operation Imagination Doorway at the Pentagon."
    },
    {
        "character": "Aslan",
        "line": "Project Imagination Doorway? [no one else has a clue either]"
    },
    {
        "character": "Gandalf",
        "line": "Never mind! The battle is almost won! We can deal with him later."
    },
    {
        "character": "Stan",
        "line": "[stands next to Butters] No, no, you don't understand. There's a nuke. The government is about to level this entire place."
    },
    {
        "character": "Luke Skywalker",
        "line": "What?"
    },
    {
        "character": "Butters",
        "line": "Wull why would they nuke Imaginationland?"
    },
    {
        "character": "Stan",
        "line": "So the terrorists can't ever use it against us again."
    },
    {
        "character": "Aslan",
        "line": "We can get Imaginationland under control; the Chosen One just needs more time!"
    },
    {
        "character": "Stan",
        "line": "The Chosen One?"
    },
    {
        "character": "Butters",
        "line": "Yeah, it turns out I'm the Key."
    },
    {
        "character": "",
        "line": "The portal at the Pentagon. The nuclear warhead is ready to be shot in."
    },
    {
        "character": "Computer",
        "line": "[a female voice] Missile launch sequence initiated."
    },
    {
        "character": "General Deckter",
        "line": "All right, people, I want this nuking done by the books."
    },
    {
        "character": "Tech 1",
        "line": "Sir, we have a security breach!"
    },
    {
        "character": "General Deckter",
        "line": "What?!"
    },
    {
        "character": "Tech 3",
        "line": "There's an Unauthorized Entry Alert, sir-it's coming from Sector Two!"
    },
    {
        "character": "General Deckter",
        "line": "Sector 2? [The large window opposite the portal had been patched up, but cracks remain. Cartman crashes through the large window again, reversing the patches, and again lands on his back.]"
    },
    {
        "character": "Cartman",
        "line": "[gets up] What the hell do you think you're doing declaring leprechauns aren't real?!"
    },
    {
        "character": "General Deckter",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "You just can't declare that imaginary things aren't real! Who are you to say what's real?! Think about it: is blue real? Is love really real?"
    },
    {
        "character": "Lab Tech",
        "line": "Imaginary things are things made up by people, like Santa and Rudolph."
    },
    {
        "character": "Tom",
        "line": "Yeah, and they detract from real things, like Jesus."
    },
    {
        "character": "Tech 1",
        "line": "Maybe Jesus is imaginary too."
    },
    {
        "character": "Tom",
        "line": "Ooooh, you'd better not say that! You'll go to hell!"
    },
    {
        "character": "Tech 7",
        "line": "It's possible that hell is also imaginary."
    },
    {
        "character": "Tech 2",
        "line": "Uh so then, we're about to nuke hell... that's a good thing, right?"
    },
    {
        "character": "Personnel",
        "line": "[not all at once] Hell yeah, that's a good thing, yeah."
    },
    {
        "character": "Lab Tech",
        "line": "What if heaven is imaginary? We'd be nuking heaven."
    },
    {
        "character": "Tech 3",
        "line": "Yeah, but it wouldn't be real."
    },
    {
        "character": "Lab Tech 2",
        "line": "So it'd be all right."
    },
    {
        "character": "Cartman",
        "line": "Look, maybe they're all part of the same thing. Santa and Jesus and hell and- leprechauns. Maybe they're all real in the same wway, right?"
    },
    {
        "character": "Tom",
        "line": "Santa Claus and leprechauns are imaginary, but Jesus and hell are real!"
    },
    {
        "character": "Tech 3",
        "line": "Well then, what about Buddha?"
    },
    {
        "character": "Tom",
        "line": "Well of course he's imaginary!"
    },
    {
        "character": "Lab Tech 3",
        "line": "Awww, see? Now you're being intolerant, Tom."
    },
    {
        "character": "Tech 7",
        "line": "Am I real?"
    },
    {
        "character": "General Deckter",
        "line": "All right, enough! Keep that kid out of the way and let's get back to the nuking at hand!"
    },
    {
        "character": "Cartman",
        "line": "[two guards haul him away] No! Leprechauns are real, Goddammit!"
    },
    {
        "character": "",
        "line": "The Mall, on the steps of the Lincoln Memorial, day. Kyle sits on some steps moping."
    },
    {
        "character": "Stan",
        "line": "[in Kyle's imagination] Kyle? Kyle, what happened?"
    },
    {
        "character": "Kyle",
        "line": "Nothing."
    },
    {
        "character": "Stan",
        "line": "What??"
    },
    {
        "character": "Kyle",
        "line": "[stands up and moves around] Nothing happened! There's nothing I can do! [a man walking by looks at him for a few seconds]"
    },
    {
        "character": "Stan",
        "line": "Dude, you can't let the government fire off that nuke!"
    },
    {
        "character": "Kyle",
        "line": "They say they can do whatever they want because imaginary things aren't real!"
    },
    {
        "character": "Stan",
        "line": "Well you have to convince them they are real!"
    },
    {
        "character": "Kyle",
        "line": "No way, dude, then I'd have to suck Cartman's balls"
    },
    {
        "character": "Stan",
        "line": "Whatever it takes, you have to do it, all right?! [Kyle sighs] Hang- hang on, Kyle, Jesus wants to talk to you."
    },
    {
        "character": "Kyle",
        "line": "Huh? [POV changes. The White House is seen in the distance]"
    },
    {
        "character": "Jesus",
        "line": "Hello, Kyle? This is Jesus."
    },
    {
        "character": "Kyle",
        "line": "Oh boy..."
    },
    {
        "character": "Jesus",
        "line": "What seems to be the problem, my child?"
    },
    {
        "character": "Kyle",
        "line": "Jesus, I can't do anything. [a man walking down the steps stops to look, then continues walking.] I'm just a fourth grader going against the entire government. [Jesus falls silent] Uh, hello? Jesus?"
    },
    {
        "character": "Luke Skywalker",
        "line": "No eh, hey Kyle, this is Luke Skywalker."
    },
    {
        "character": "Kyle",
        "line": "[dejected] Aah."
    },
    {
        "character": "Luke Skywalker",
        "line": "Look, I know this seems like an impossible task, but do you remember when I brought down the Death Star. I m, I mean, that seemed impossible too, right?"
    },
    {
        "character": "Kyle",
        "line": "Yeah, I guess."
    },
    {
        "character": "Luke Skywalker",
        "line": "Uh okay, now, now hold on, because Superman is here and he wants to say something. [Kyle rolls his eyes around]"
    },
    {
        "character": "Superman",
        "line": "Kyle, this is Superman."
    },
    {
        "character": "Kyle",
        "line": "Hi Superman."
    },
    {
        "character": "Superman",
        "line": "I know that saving people can be a big responsibility, but no matter what it takes, it's worth it."
    },
    {
        "character": "Kyle",
        "line": "[subdued] I know."
    },
    {
        "character": "Superman",
        "line": "You can do this, Kyle. How hang on, because Hercules wants to talk to you."
    },
    {
        "character": "Kyle",
        "line": "Oh God..."
    },
    {
        "character": "Superman",
        "line": "Yes, God is here too. He's gonna talk to you right after Captain Crunch."
    },
    {
        "character": "",
        "line": "Castle Sunshine. The battle rages on. Jesus fights a Xenomorph, but to no effect"
    },
    {
        "character": "Jesus",
        "line": "Popeye, I need some help here! [a donkey wearing a sombrero walks by shooting at the Pac-Man monsters]"
    },
    {
        "character": "Lollipop King",
        "line": "[being choked by an Imperial Stormtrooper] Popeye is being killed by Christmas Critters. [sure enough, the Critters hump on Popeye as Foxy Fox pisses on his face]"
    },
    {
        "character": "Popeye",
        "line": "Gaw guguh, getskug off of me!"
    },
    {
        "character": "Beary Bear",
        "line": "[sees something and leaves the other Critters] Hey, what is that?"
    },
    {
        "character": "",
        "line": "the battle ceases as Butters floats through inside a bubble, then resumes after he's gone"
    },
    {
        "character": "Butters",
        "line": "More spinach for Popeye! [ten cans of spinach appear before Popeye in a pyramid] Imagine an M60 for Jesus!"
    },
    {
        "character": "Jesus",
        "line": "[his sword turns into an M60 and the Xenomorph cowers] All right!"
    },
    {
        "character": "Aslan",
        "line": "[on the bridge] The boy is doing it! Everything is going to be okay!"
    },
    {
        "character": "",
        "line": "The portal at the Pentagon. Just a little longer..."
    },
    {
        "character": "Computer",
        "line": "Missile launch in one minute."
    },
    {
        "character": "Cartman",
        "line": "Goddamnit, you stupid assholes are going to ruin everything!"
    },
    {
        "character": "General Deckter",
        "line": "Prepare for launch..."
    },
    {
        "character": "Tech 1",
        "line": "Sir, we have a security breach!"
    },
    {
        "character": "General Deckter",
        "line": "What?!"
    },
    {
        "character": "Tech 3",
        "line": "There's an Unauthorized Entry Alert, sir-it's coming from Sector Two!"
    },
    {
        "character": "General Deckter",
        "line": "Sector 2? [Kyle crashes through the part of the large window that was left intact and lands on his back. Cartman turns around]"
    },
    {
        "character": "Cartman",
        "line": "Kyle?"
    },
    {
        "character": "General Deckter",
        "line": "The hell are you doing back here?!"
    },
    {
        "character": "Kyle",
        "line": "Listen, you don't have to do this! Our imaginations aren't running wild anymore."
    },
    {
        "character": "General Deckter",
        "line": "Why is it so easy for children to break into the Pentagon?!"
    },
    {
        "character": "Kyle",
        "line": "You have to stop!"
    },
    {
        "character": "General Deckter",
        "line": "If I'm not mistaken, you're the one who bet that leprechauns weren't real. So why do you care what happens?"
    },
    {
        "character": "Kyle",
        "line": "Because I- [catches himself] I... Um... because I think... they are real. It's all real. Think about it. Haven't Luke Skywalker and Santa Claus affected your lives more than most real people in this room? I mean, whether Jesus is real or not, he... he's had a bigger impact on the world than any of us have. And the same could be said of Bugs Bunny and, a-and Superman and Harry Potter. They've changed my life, changed the way I act on the Earth. Doesn't that make them kind of \"real.\" They might be imaginary, but, but they're more important than most of us here. And they're all gonna be around long after we're dead. So in a way, those things are more realer than any of us. [Cartman begins a slow clap, then speeds it up. The techs in the room join in and soon everyone is applauding Kyle's speech]"
    },
    {
        "character": "General Deckter",
        "line": "Abort the sequence. [a tech flips the switch and the power to the missile is cut. The missile lowers to a resting state]"
    },
    {
        "character": "Cartman",
        "line": "So Kyle, imaginary things are real, huh? Guess that means I did win the bet after all. And you know what that means, Kyle. [gloats]"
    },
    {
        "character": "Kyle",
        "line": "Just let it go with your fucking balls, you fucking asshole!! Your friends have been in danger and all you care about it this stupid bet! Well I've decided, Cartman, even if we had a bet, that I am never sucking your balls, [forces Cartman to face him] you got that?! They can throw me in jail for the rest of my life, but I am [jab] never going to suck your balls, [jab] never!! So [jab] there!!!"
    },
    {
        "character": "Al Gore",
        "line": "[walking through the sliding doors] What happened?! Why hasn't the missile gone off?!"
    },
    {
        "character": "General Deckter",
        "line": "There's been an abort, Mr. Gore."
    },
    {
        "character": "Al Gore",
        "line": "[moves towards the switch] No! ManBearPig has to die! [presses buttons randomly]"
    },
    {
        "character": "Tech 3",
        "line": "Oh Jesus no! [the portal activates and begins sucking everyone and everything into Imaginationland, including Cartman and Kyle... and the missile]"
    },
    {
        "character": "",
        "line": "Imaginationland, the battlefield outside Castle Sunshine."
    },
    {
        "character": "Lollipop King",
        "line": "That's it, Aslan! The evil characters have fled!"
    },
    {
        "character": "Aslan",
        "line": "The day is ours! [screams are heard and bodies fall from the sky. Aslan and the others look up. Many of them land on the battlefield. Kyle lands on the bridge, face down]"
    },
    {
        "character": "Stan",
        "line": "[approaches] Kyle!"
    },
    {
        "character": "Butters",
        "line": "[approaches Cartman on the battlefield] Fellas! Where'd you come from? [a whistling sound is heard and everyone looks up]"
    },
    {
        "character": "Zeus",
        "line": "What is that? [the missile comes down from the sky and blows up on the battlefield, killing everyone. The screen fills up with white ash. Moments later, Butters digs himself out of the ash and dusts himself off. He looks around and walks off to his left.]"
    },
    {
        "character": "Butters",
        "line": "Huh... [with nothing but white around, he concentrates real hard and soon Imaginationland returns. The Barrier repairs itself, and all the imaginary characters reappear]"
    },
    {
        "character": "Jesus",
        "line": "He did it!"
    },
    {
        "character": "Fanciful Mayor",
        "line": "[poof] Oh look, I'm back!"
    },
    {
        "character": "Luke Skywalker",
        "line": "Nice going, kid. [the other good imaginary characters congratulate him]"
    },
    {
        "character": "Fanciful Mayor",
        "line": "The evil characters! They're all behind the wall again."
    },
    {
        "character": "Stan",
        "line": "Dude! How did you do that, Butters?"
    },
    {
        "character": "Butters",
        "line": "Well I just... used my imagination."
    },
    {
        "character": "All",
        "line": "Awwww [everyone has a good laugh]"
    },
    {
        "character": "Cartman",
        "line": "You know, I really have learned a lot, you guys. What Kyle said about imaginary things being real and, Butters using his imagination? It makes me think that... well maybe we all have the power to make things a reality. [he begins to think hard, and an imaginary version of himself appears, wearing the crown and robe from before.] Why look, it's me. And... [thinks again, and an imaginary Kyle appears] And there's Kyle. And, what's Kyle about to do? [the imaginary Kyle drops out of view]"
    },
    {
        "character": "Kyle",
        "line": "Cartman, don't!"
    },
    {
        "character": "Cartman",
        "line": "O-hoo Kyle! What are you doing to my balls? OHO, look! It's Kyle sucking my balls! [the imaginary Cartman is a little shocked]"
    },
    {
        "character": "Stan",
        "line": "Dude."
    },
    {
        "character": "Lollipop King",
        "line": "Oh my God."
    },
    {
        "character": "Cartman",
        "line": "O-hoo Kyle, you are gobbling those balls, aren't you? I told you you would suck my balls before this was over, didn't I, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "I'm not sucking your balls; that's imaginary!"
    },
    {
        "character": "Cartman",
        "line": "No- Kyle, I believe you said that imaginary things are real."
    },
    {
        "character": "General Deckter",
        "line": "That's true. You did."
    },
    {
        "character": "Cartman",
        "line": "Oh, look at you go, Kyle! Oho, you dirty girl! You LOVE those balls. [everyone but Kyle laughs]"
    },
    {
        "character": "Santa",
        "line": "Okay, Kyle, that's enough ballsucking. We need to get you boys home."
    },
    {
        "character": "Kyle",
        "line": "I am not sucking Cartman's balls!"
    },
    {
        "character": "Fanciful Mayor",
        "line": "Whatever you imagine to be real, is real. [everyone cheers that remark]"
    },
    {
        "character": "",
        "line": "Butters' room, morning. He's asleep."
    },
    {
        "character": "Steven",
        "line": "Butters? [Butters opens his eyes] Butters!"
    },
    {
        "character": "Butters",
        "line": "[sits up] A-huh? What? Oh! It was all just a dream."
    },
    {
        "character": "Steven",
        "line": "Come on, Butters, time to get up. [walks in with newspaper in hand]"
    },
    {
        "character": "Butters",
        "line": "Oh Dad! I had the craziest dream! I, I saved all of Imaginationland from running wild after a terrorist attack!"
    },
    {
        "character": "Steven",
        "line": "You WERE in Imaginationland, Butters! We've read all about it in the paper! The question is, what were you doing in Imaginationland when you were supposed to be helping your mother clean up the basement?!"
    },
    {
        "character": "Linda",
        "line": "You are grounded, mister!"
    },
    {
        "character": "Butters",
        "line": "[dejected] Ohhh. [becomes determined] Wait, I'm not grounded."
    },
    {
        "character": "Steven",
        "line": "Oh yes you are!"
    },
    {
        "character": "Butters",
        "line": "Oh yeah? [focuses real hard, then opens his eyes]"
    },
    {
        "character": "Steven",
        "line": "That only works in Imaginationland! You're grounded! [backs out of the room. He and Linda leave, closing the door behind them]"
    },
    {
        "character": "Butters",
        "line": "[thinks a bit, then lies down again] Ahhh, shit."
    }
]