[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, out front. Garrison and the class stand next to a colorful bus."
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay, children. Each of you gets to choose two books from the Booktastic bus."
    },
    {
        "character": "Cartman",
        "line": "[To Kyle.] Reading sucks ass."
    },
    {
        "character": "Mr. Garrison",
        "line": "Eric, shut up! [Eric looks up.]"
    },
    {
        "character": "",
        "line": "Inside the bus. The kids mill around and start browsing."
    },
    {
        "character": "Kyle",
        "line": "Boring. Boring. Gay. Boring. Boring."
    },
    {
        "character": "Stan",
        "line": "[At the next stack.] Hey you guys. Check out these books. [They come over.] Sabrina Unchained."
    },
    {
        "character": "Kyle",
        "line": "Wow, these books look cool!"
    },
    {
        "character": "",
        "line": "Cartman smiles. They look at romance novels. Kyle takes \"Seduction\", Kenny takes \"Bound to Love\", Cartman takes \"Body to Body\"."
    },
    {
        "character": "Cartman",
        "line": "Hey, there's a lot of big words in these books."
    },
    {
        "character": "Kenny",
        "line": "(There's a lot of fuckin' vaginas and penises.)"
    },
    {
        "character": "Bus Driver",
        "line": "[Stops by.] Hello, kids. I see you're discovering the magic of reading."
    },
    {
        "character": "",
        "line": "He is wearing a blue suit, with rainbow shirt and cape."
    },
    {
        "character": "Kyle",
        "line": "Who are you?"
    },
    {
        "character": "Bus Driver",
        "line": "I drive the Booktastic bus, where magic begins. You see, reading opens up whole new worlds to you. You can take a canoe down the Amazon or go back in time to Camelot or become a race car driver, all by just opening a book. Just like magic. The magic of reading."
    },
    {
        "character": "Cartman",
        "line": "[Irritated.] God, shut up, dude."
    },
    {
        "character": "Bus Driver",
        "line": "Go ahead and pick any books you like. Then give in. Give in to the magic. [He floats away.]"
    },
    {
        "character": "Stan",
        "line": "[To Kyle.] If we read, are we gonna become like that guy?"
    },
    {
        "character": "Kyle",
        "line": "Yeah, this is stupid! Books aren't magical."
    },
    {
        "character": "",
        "line": "Kyle tosses his book away."
    },
    {
        "character": "Cartman",
        "line": "I don't know, I'm kinda getting a tingly feeling looking at these."
    },
    {
        "character": "",
        "line": "A man and woman are kissing on the cover of his chosen book. Off in the distance a chicken clucks and a woman shrieks."
    },
    {
        "character": "Kenny",
        "line": "(Hey, what's that?)"
    },
    {
        "character": "Stan",
        "line": "I don't know. Let's go see."
    },
    {
        "character": "",
        "line": "They drop their books and exit the bus. Cartman is glued to his."
    },
    {
        "character": "",
        "line": "Here's a show within a show: an episode of COPS shown in real time along with South Park."
    },
    {
        "character": "Officer Barbrady",
        "line": "Well, being an officer of the peace means a lot of things. It's a hard job, but then I'm a hard man. A lot of people think that in a small town there isn't a lot for the law to do. Well, they're wrong."
    },
    {
        "character": "Dispatcher 1",
        "line": "[Through intercom.] All units. All units. Report to 254 Avenue de los Mexicanos. Possible hostile situation."
    },
    {
        "character": "",
        "line": "Officer Barbrady puts his siren light up on the dashboard."
    },
    {
        "character": "Officer Barbrady",
        "line": "There, you see? This could be a bank robbery. Or possibly even a murder! This ain't no Podunk little town!"
    },
    {
        "character": "Dispatcher",
        "line": "And, Barbrady, your wife called. She wants you to get some pizza on the way home."
    },
    {
        "character": "Officer Barbrady",
        "line": "Goddammit!"
    },
    {
        "character": "",
        "line": "A crowd has gathered at the site of the incident, across the street from the school. The boys are there, front and center. Officer Barbrady pulls up with the COPS film crew, and his siren light is now on the car roof."
    },
    {
        "character": "Officer Barbrady",
        "line": "Okay, people, move along. There's nothing to see here. [To the rancher.] What's the trouble? Where's the body?"
    },
    {
        "character": "Rancher",
        "line": "Barbrady, I just caught some guy in here having sex with one of my chickens."
    },
    {
        "character": "",
        "line": "Barbrady says nothing as the crew films him for a long pause."
    },
    {
        "character": "Officer Barbrady",
        "line": "Uhhhh... oh."
    },
    {
        "character": "",
        "line": "The chicken doesn't seem traumatized one bit."
    },
    {
        "character": "Woman",
        "line": "My God, that's disgusting!"
    },
    {
        "character": "Stan",
        "line": "Whoa, dude! How do you have sex with a chicken?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Uhh, boys, you move along. This isn't for young eyes to see. [To the rancher.] Did you get a good look at the suspect?"
    },
    {
        "character": "Rancher",
        "line": "Naw, I didn't see anything. It just happened so fast."
    },
    {
        "character": "Officer Barbrady",
        "line": "Wellll uh, this is quite interesting, huh, guys?"
    },
    {
        "character": "Cameraman",
        "line": "Uhh, we're gonna go grab some lunch and maybe get some shots of those turtles down at the pond."
    },
    {
        "character": "",
        "line": "The crew leaves."
    },
    {
        "character": "Officer Barbrady",
        "line": "Haw, camel poo."
    },
    {
        "character": "Stan",
        "line": "Hey, what's this?"
    },
    {
        "character": "",
        "line": "Stan picks up a sheet of paper."
    },
    {
        "character": "Kyle",
        "line": "It looks like a note."
    },
    {
        "character": "Officer Barbrady",
        "line": "Give me that! [Takes the note.] That's a clue, and you'll get your stinking DNA all over it!"
    },
    {
        "character": "Rancher",
        "line": "[Coming over.] What does it say?"
    },
    {
        "character": "",
        "line": "The note reads: Another chicken gets it tomorrow!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Uhh... It says, uuh, \"Sorry I had sex with the chicken. I won't do it again. Bye-bye.\" Well, there you have it. Case closed."
    },
    {
        "character": "Rancher",
        "line": "Dammit, Barbrady, what the hell's wrong with you? Every time somethin' happens in this town, you say \"Nothin' to see here\", and \"Case closed.\" But we want justice. We have to find this sicko!"
    },
    {
        "character": "Officer Barbrady",
        "line": "I said, return to your homes before I start arresting people."
    },
    {
        "character": "Rancher",
        "line": "For what? Orderly conduct?"
    },
    {
        "character": "Officer Barbrady",
        "line": "How about fishing without a license?"
    },
    {
        "character": "Rancher",
        "line": "I'm not fishin'."
    },
    {
        "character": "Officer Barbrady",
        "line": "Whataya call this then?"
    },
    {
        "character": "",
        "line": "He pulls a fishing rod out from somewhere."
    },
    {
        "character": "Officer Barbrady",
        "line": "If you do not comply, I'll be forced to execute each and every one of you... [Pulls out his gun.] by gunshot to the head."
    },
    {
        "character": "",
        "line": "The crowd quickly disperses, the boys remain."
    },
    {
        "character": "Officer Barbrady",
        "line": "That's right, return to your simple lives. [Puts his gun away] Just forget this ever happened. Forget."
    },
    {
        "character": "",
        "line": "He moves off, leaving the boys with the chicken."
    },
    {
        "character": "Officer Barbrady",
        "line": "For-get."
    },
    {
        "character": "Kyle",
        "line": "Wow. Barbrady sure is acting weird."
    },
    {
        "character": "Stan",
        "line": "Yeah, I wonder what's wrong."
    },
    {
        "character": "",
        "line": "The patrol car. Barbrady gets in and looks at the note again. The letters become unintelligible symbols. He starts up the car and throws the note away. He stops at a stop sign, and its letters turn into Korean symbols. He drives on and ends up at Fran's."
    },
    {
        "character": "Teller",
        "line": "Welcome to Fran's. Can I help you?"
    },
    {
        "character": "",
        "line": "The letters in the board above the speaker are jumbled as they are, but they start whirling around, and Barbrady is speechless."
    },
    {
        "character": "Teller",
        "line": "Sir, can I help you?"
    },
    {
        "character": "",
        "line": "The letters A, C, K, R, and U stop whirling and start laughing at him."
    },
    {
        "character": "Officer Barbrady",
        "line": "Uhhh, just give me two cheeseburgers and some jalapeño poppers."
    },
    {
        "character": "Teller",
        "line": "Sure, there's just one problem."
    },
    {
        "character": "Officer Barbrady",
        "line": "What's that?"
    },
    {
        "character": "Teller",
        "line": "We're a bank."
    },
    {
        "character": "",
        "line": "The board is back to normal."
    },
    {
        "character": "Officer Barbrady",
        "line": "I know that, smarty-pants! What do you think, I'm some kinda idiot?"
    },
    {
        "character": "Teller",
        "line": "Yes."
    },
    {
        "character": "Officer Barbrady",
        "line": "Hmmm. [Drives away.] I can't go on living this lie!"
    },
    {
        "character": "",
        "line": "Channel 4 Breaking News."
    },
    {
        "character": "Anchor",
        "line": "With chicken after chicken being violated, the South Park police are under increasing pressure to solve the case of the Chickenfucker. We now go live to a press conference where Officer Barbrady and the Mayor are fielding questions."
    },
    {
        "character": "Reporter 1",
        "line": "Officer Barbrady, what would drive a man to such a disgusting act?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Well, nobody can say for sure; uh, no motive has yet been established."
    },
    {
        "character": "Reporter 2",
        "line": "Do the police have any leads?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Well, both 3D computer modeling and intensive seismology have not given us any leads as of yet."
    },
    {
        "character": "Reporter 3",
        "line": "But has Chickenfucker left any clues at the crime?"
    },
    {
        "character": "Officer Barbrady",
        "line": "All right, all right! I can't read!"
    },
    {
        "character": "",
        "line": "The room falls silent and the reporter sits down."
    },
    {
        "character": "Officer Barbrady",
        "line": "There, I said it! I can't read! Are you happy now? You pushed and you pushed, and now you all know my terrible secret! I'm illegitimate! I'm not fit to be a policeman! I retire!"
    },
    {
        "character": "",
        "line": "He removes his badge and leaves the room."
    },
    {
        "character": "Press Coordinator",
        "line": "Okay, thank you all for coming. There's uhh, coffee and brownies out front."
    },
    {
        "character": "Anchor",
        "line": "And so Officer Barbrady has taken a leave of absence, and South Park would have to manage without any police force for a while--"
    },
    {
        "character": "",
        "line": "A note wrapped around a brick crashes onto the anchor desk and the anchor gets the note."
    },
    {
        "character": "Anchor",
        "line": "This just in! South Park is plunged into total anarchy!"
    },
    {
        "character": "",
        "line": "A camera pans across the rioting."
    },
    {
        "character": "Anchor",
        "line": "Exactly two seconds after the retirement of Officer Barbrady, looting and pillaging erupted in the quiet mountain town!"
    },
    {
        "character": "",
        "line": "A man comes and takes away the symbol in the inset. Another man takes the 4."
    },
    {
        "character": "",
        "line": "On the street, two men use a third as a battering ram and throw him into the electronics store through the big display window. He gets up and helps the other two take the big-screen TV away. Several people have looted beer and drink as fast as they can. A red car crashes into a yellow building. Here and there people are screaming."
    },
    {
        "character": "Looter 1",
        "line": "Whoopee, this is killer!"
    },
    {
        "character": "Looter 2",
        "line": "With no cops around, we can do whatever we want!"
    },
    {
        "character": "",
        "line": "The boys are at a corner when someone runs by with a boom box. Kenny is closest to the corner."
    },
    {
        "character": "Kyle",
        "line": "Whoa, dude, what's going on?"
    },
    {
        "character": "Stan",
        "line": "I don't know."
    },
    {
        "character": "",
        "line": "Next to Kenny, two people are trying to turn car over, and..."
    },
    {
        "character": "Stan",
        "line": "Oh my God, they've killed--"
    },
    {
        "character": "",
        "line": "Kenny opens the door and steps out, dusting himself off."
    },
    {
        "character": "Stan",
        "line": "Oh, never mind."
    },
    {
        "character": "",
        "line": "The Mayor is watching all this from her office. Automatic weapons fire is heard as a woman screams, but the street before her window is clear of any commotion."
    },
    {
        "character": "Mayor McDaniels",
        "line": "I don't believe it. All this time, Barbrady actually did keep this town peaceful."
    },
    {
        "character": "Aide 1",
        "line": "Who knew? I always thought he was a complete idiot."
    },
    {
        "character": "Mayor McDaniels",
        "line": "He is."
    },
    {
        "character": "",
        "line": "The press breaks in and rushes the Mayor's desk. More questions, but one stands out."
    },
    {
        "character": "Reporter 3",
        "line": "What do you plan to do about the South Park riots?"
    },
    {
        "character": "Mayor McDaniels",
        "line": "No reason for concern. I want to assure all of you that Officer Barbrady is still our active police force."
    },
    {
        "character": "Reporter 3",
        "line": "But he's illiterate. What do you plan to do?"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Uhhhhh, plan? I don't actually uh--"
    },
    {
        "character": "Aide 2",
        "line": "Reading classes, plain and simple. By the mayor's order, Officer Barbrady is on temporary leave of absence to learn to read, effective immediately."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Yes, that's right. It's back to school with Officer Barbrady!"
    },
    {
        "character": "",
        "line": "Cameras snap away to South Park Elementary. There's someone new..."
    },
    {
        "character": "Mr. Garrison",
        "line": "Now, children, we have a new student joining us today. Please say 'hi' to Officer Barbrady."
    },
    {
        "character": "",
        "line": "Silence. Officer Barbrady dwarfs the children as he sits among them."
    },
    {
        "character": "Stan",
        "line": "I can't see, dude!"
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay now, since our focus has been on reading, let's review some of the basics."
    },
    {
        "character": "",
        "line": "Officer Barbrady raises his hand."
    },
    {
        "character": "Mr. Garrison",
        "line": "E-yes, what is it?"
    },
    {
        "character": "Officer Barbrady",
        "line": "I need to go poopies."
    },
    {
        "character": "Mr. Garrison",
        "line": "[Pause.] Officer Barbrady, in school we go to the bathroom before and after class."
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh, Christ. How do you kids do it?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Now, does anyone have any suggestions where we should begin with Officer Barbrady?"
    },
    {
        "character": "Kyle",
        "line": "How about a brain transplant?"
    },
    {
        "character": "",
        "line": "Barbrady raises his eyebrows."
    },
    {
        "character": "Mr. Garrison",
        "line": "Now, Kyle, let's be supportive of our new student, give him the nurturing environment he needs to thrive. Now, I'm gonna write a sentence and I want us all to help Officer Barbrady read it."
    },
    {
        "character": "",
        "line": "Stan struggles to see what Garrison is writing: Oprah Winfrey has huge knockers."
    },
    {
        "character": "Mr. Garrison",
        "line": "Give it a shot, Officer Barbrady."
    },
    {
        "character": "Officer Barbrady",
        "line": "Ahhh... O... O--"
    },
    {
        "character": "Mr. Garrison",
        "line": "Bzzzt! Wrong! Try again, dumbass! Hahahahahahaha [Slaps his thigh.] hahahaha! [Wipes his forehead.] Okay, okay. Maybe we should try something a little easier. We can work our way up to the hard ones."
    },
    {
        "character": "",
        "line": "Mr. Garrison turns around and writes something more on the board: The hat is red."
    },
    {
        "character": "Mr. Garrison",
        "line": "Go ahead, Barbrady, don't be scared."
    },
    {
        "character": "Officer Barbrady",
        "line": "Ahhh... O..."
    },
    {
        "character": "Mr. Garrison",
        "line": "Bzzzt drrrrr! Did you hear that, Mr. Hat?"
    },
    {
        "character": "Mr. Hat",
        "line": "I sure did, Mr. Garrison. What a retard!"
    },
    {
        "character": "",
        "line": "Mr. Garrison starts laughing uncontrollably."
    },
    {
        "character": "Officer Barbrady",
        "line": "[To the children] Did you kids actually learn how to read this way?"
    },
    {
        "character": "Stan",
        "line": "No, we just fake it to shut him up."
    },
    {
        "character": "Mr. Garrison",
        "line": "Okayheh, okay hi'm sohry. I'm sohry heh. Let's try again."
    },
    {
        "character": "",
        "line": "Chicken coop. The chickens are clucking away when the door creaks open. A silhouette appear."
    },
    {
        "character": "Intruder",
        "line": "So, what are nice chickens like you doing in a coop like this?"
    },
    {
        "character": "",
        "line": "He grabs a chicken and...Cut to South Park Elementary, back in class."
    },
    {
        "character": "Mr. Garrison",
        "line": "Now, children, I hope you all had a good time reading your books and are prepared for your book reports."
    },
    {
        "character": "",
        "line": "Cartman squirms in his seat and whispers."
    },
    {
        "character": "Mr. Garrison",
        "line": "Who should we have go first, Mr. Hat? Let's see..."
    },
    {
        "character": "Cartman",
        "line": "[In falsetto.] Oh, how about Stan? Or Kyle?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Eric, why don't you go first?"
    },
    {
        "character": "Cartman",
        "line": "Oooaaagh."
    },
    {
        "character": "Mr. Garrison",
        "line": "What's the matter, Eric? Are you not prepared again?"
    },
    {
        "character": "Cartman",
        "line": "I'm prepared!"
    },
    {
        "character": "",
        "line": "Cartman gets up and walks to the chalkboard, then faces the class."
    },
    {
        "character": "Cartman",
        "line": "For my book report, I read The Lion, The Witch and the Wardrobe. It was very, very good. Have you read it, Mr. Garrison?"
    },
    {
        "character": "Mr. Garrison",
        "line": "No, I can't say that I have."
    },
    {
        "character": "Cartman",
        "line": "Oh, good. In The Lion, The Witch, and the Wardrobe, a bunch of uh, hippies, walk around and paint stuff. They eat lunch, and then they find a magical... camel... which they have to eat to stay alive. And that's pretty much it; I give it a B-minus."
    },
    {
        "character": "Mr. Garrison",
        "line": "And I give you an F, Eric. Now sit down!"
    },
    {
        "character": "Cartman",
        "line": "God-dammit!"
    },
    {
        "character": "",
        "line": "The kids start laughing at him."
    },
    {
        "character": "Officer Barbrady",
        "line": "Haa haa. Ha ha ha."
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay, Officer Barbrady, why don't you give us your book report?"
    },
    {
        "character": "",
        "line": "Officer Barbrady rises and goes to the board then faces the class."
    },
    {
        "character": "Officer Barbrady",
        "line": "I've just finished reading the heartwarming novel, Go, Dog. Go!. I found it a compelling and disturbing look at the canine psyche. If I may read a passage: \"Big... dog..., little... dog. [Turns the page.] A red dog... on a...\" Well, anyway, I'm not one to give away the ending, but I will say that it spirals toward an incredible twist-turn that parallels my own life. "
    },
    {
        "character": "Mr. Garrison",
        "line": "Thank you, Officer Barbrady. That was a very good book report indeed. I'll give you an A."
    },
    {
        "character": "Officer Barbrady",
        "line": "Hooray!"
    },
    {
        "character": "Cartman",
        "line": "[Miffed.] Goody two-shoes."
    },
    {
        "character": "",
        "line": "The Playground. The camera pans across the playground. It passes Craig holding a Blue Mega Man, Bebe and Clyde on the hobby elephants, the boys passing a ball among themselves, and stops at the swings. Barbrady swings between Kenny and Red."
    },
    {
        "character": "Officer Barbrady",
        "line": "Swingset, swingset, up and down I go\n\"Whoosh!\" goes the willy-wind, flowing through my toes\n\n\n"
    },
    {
        "character": "",
        "line": "Kyle looks looks back at Barbrady."
    },
    {
        "character": "Stan",
        "line": "Dude, I think Barbrady enjoys being in school a little too much."
    },
    {
        "character": "Kyle",
        "line": "Yeah, isn't he just supposed to be learning how to read?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Swingset, swingset, up and down I go...\n\n\n"
    },
    {
        "character": "",
        "line": "Mayor McDaniels walks up with her aides."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Officer Barbrady, what are you doing?!"
    },
    {
        "character": "",
        "line": "He quickly gets off the swing, but in so doing he stresses the set and launches Kenny..."
    },
    {
        "character": "Kenny",
        "line": "(Daaarrrggghh--)"
    },
    {
        "character": "",
        "line": "Kenny flies into the brick wall at the other end of the yard."
    },
    {
        "character": "Kenny",
        "line": "(-ooggghhh...)"
    },
    {
        "character": "Stan",
        "line": "Oh, my God! They've killed--"
    },
    {
        "character": "Kenny",
        "line": "(Hey.)"
    },
    {
        "character": "Stan",
        "line": "Oh, never mind. [Smiles.]"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Well, how's the reading coming along?"
    },
    {
        "character": "Officer Barbrady",
        "line": "[Wringing his hands.] Oooh, pretty good."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Barbrady, we really need you to speed this up. The Chickenfucker struck again last night."
    },
    {
        "character": "Kyle",
        "line": "Oh no!."
    },
    {
        "character": "Officer Barbrady",
        "line": "Ah, Mayor, please, when we're around children we prefer to call him the Chickenlover."
    },
    {
        "character": "Aide 2",
        "line": "This time he made love to Carla Weathers' prize chicken. She's catatonic."
    },
    {
        "character": "Officer Barbrady",
        "line": "Who? Carla Weathers or the chicken?"
    },
    {
        "character": "Mayor McDaniels",
        "line": "The perpetrator left this clue at the crime scene."
    },
    {
        "character": "",
        "line": "She hands it to Barbrady, who looks it over."
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh, I can't read this. It has silent e's."
    },
    {
        "character": "Mayor McDaniels",
        "line": "[Throttling him.] You have to learn to read faster, Barbrady!"
    },
    {
        "character": "Officer Barbrady",
        "line": "I'm doing the best I can. I even got a A on my book report."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Listen, buddy! Either you learn to read quick, or else I'm gonna find a law officer to replace you forever!"
    },
    {
        "character": "",
        "line": "She leaves with her aides. Aide 1 takes the ball from the boys and pops it."
    },
    {
        "character": "Aide 2",
        "line": "Hey, what'd you do that for?"
    },
    {
        "character": "Aide 1",
        "line": "Uh, just dramatic effect, sorry. [They leave.]"
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh boy, I'm in big trouble."
    },
    {
        "character": "",
        "line": "The boys surround him."
    },
    {
        "character": "Officer Barbrady",
        "line": "I'll never learn to read fast enough, and the town is in chaos."
    },
    {
        "character": "Stan",
        "line": "It's cool, dude. We'll help you."
    },
    {
        "character": "Officer Barbrady",
        "line": "Hey, that's right. You can help me. Under article 39, section 2 of police code, I'm allowed to deputize citizens in a time of crisis."
    },
    {
        "character": "Cartman",
        "line": "Really? I wanna be a cop."
    },
    {
        "character": "Officer Barbrady",
        "line": "You boys will be my deputies; you can help me restore order, catch the Chickenlover, and swing me on the swingset."
    },
    {
        "character": "",
        "line": "This last idea he likes a lot."
    },
    {
        "character": "Cartman",
        "line": "Do I get a nightstick?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Sure, nightsticks for everybody!"
    },
    {
        "character": "",
        "line": "He hands his night stick to Cartman, who smiles."
    },
    {
        "character": "Officer Barbrady",
        "line": "You keep a tab on crime in the city, and we'll try to solve the Chickenlover case."
    },
    {
        "character": "Cartman",
        "line": "10-4, sergeant! [Walks off.]"
    },
    {
        "character": "Officer Barbrady",
        "line": "Now, what did that clue say again?"
    },
    {
        "character": "Stan",
        "line": "\"If you want to know where I'll strike next, read Bumbly Wumbly and the Spotted Spacecraft\"."
    },
    {
        "character": "Officer Barbrady",
        "line": "To the Booktastic bus, deputies! We haven't a moment to spare!"
    },
    {
        "character": "Stan, Kyle, Kenny",
        "line": "Hooray!"
    },
    {
        "character": "",
        "line": "Booktastic bus. Barbrady and his new deputies enter."
    },
    {
        "character": "Bus Driver",
        "line": "Good day, friends. Welcome to the magical world of reading."
    },
    {
        "character": "Officer Barbrady",
        "line": "We need a copy of Bumbly Wumbly and the Spotted Spacecraft right away!"
    },
    {
        "character": "Bus Driver",
        "line": "Oohhh, that's a very magical book, full of wondrous--"
    },
    {
        "character": "Officer Barbrady",
        "line": "Aw, just give us the damn book, fruitcake!"
    },
    {
        "character": "",
        "line": "The bus driver retrieves the book and hands it to Barbrady. He opens it."
    },
    {
        "character": "Kyle",
        "line": "What's it say?"
    },
    {
        "character": "Officer Barbrady",
        "line": "It says, \"Mmmuh mmmuuh...\" Uh, what's this word? [Points out to Stan.]"
    },
    {
        "character": "Stan",
        "line": "I."
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh, yeah. \"I... mmuh mmuh--\""
    },
    {
        "character": "Kyle",
        "line": "Here, give me that. [Takes the book.] \"I am Bumbly Wumbly. I live in the pond.\""
    },
    {
        "character": "Stan",
        "line": "A pond? Hey, maybe that means Stark's Pond."
    },
    {
        "character": "Officer Barbrady",
        "line": "That's quick thinking, deputy. Let's get to Stark's Pond immediately!"
    },
    {
        "character": "",
        "line": "Downtown South Park. The streets are desolate, and only the sound of squeaking pedals. Suddenly, Eric pops over a low hill on his Big Wheel tricycle and goes down Main Street. The bike has been souped up with a motorcycle windshield and signal lights. He's wearing aviator sunglasses. A car passes by him."
    },
    {
        "character": "Cartman",
        "line": "Ey!"
    },
    {
        "character": "",
        "line": "Cartman activates his siren, the driver sees him in the rear view mirror and pulls over. He gets off his trike, comes to the door, and taps the driver-side window with the night stick. The driver turns and lowers the window: it's Stan's father, Randy Marsh."
    },
    {
        "character": "Randy",
        "line": "Uhh, yes, Officer?"
    },
    {
        "character": "Cartman",
        "line": "I clocked you at 40 miles an hour back there. Do you know what the speed limit is heawh?"
    },
    {
        "character": "Randy",
        "line": "Well, according to that sign right there, it's 40 miles an hour."
    },
    {
        "character": "Cartman",
        "line": "Step out of the car, please, sir."
    },
    {
        "character": "Randy",
        "line": "Wait a second. Aren't you Stan's little friend?"
    },
    {
        "character": "Cartman",
        "line": "[Slower.] Sir, step out of the car, please."
    },
    {
        "character": "Randy",
        "line": "[Steps out.] Yeah. You're the one who always plugs up the toilet at our house."
    },
    {
        "character": "Cartman",
        "line": "Ey! I am a cop, and you will respect my authoritah!"
    },
    {
        "character": "Randy",
        "line": "Yeah, right. You'd better get back to school, little boy."
    },
    {
        "character": "",
        "line": "Cartman swings his nightstick at Randy's shins and connects."
    },
    {
        "character": "Randy",
        "line": "Ow!"
    },
    {
        "character": "Cartman",
        "line": "Get your ass to jail!"
    },
    {
        "character": "",
        "line": "He continues to swat him on the legs with the baton."
    },
    {
        "character": "Randy",
        "line": "Ow! Hey, what the hell are you doing? You can't do that! Ah-ow! Ah-ow! Ow!"
    },
    {
        "character": "Cartman",
        "line": "[Getting carried away.] Sweet."
    },
    {
        "character": "Randy",
        "line": "Ooww!"
    },
    {
        "character": "",
        "line": "Stark's Pond. A crowd is gathered at the crime scene. The chicken is fluttering about. Barbrady arrives with Stan and Kyle."
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh, weak, dude! We're too late!"
    },
    {
        "character": "Stan",
        "line": "Well, the chickens don't seem to really mind."
    },
    {
        "character": "Father Maxi",
        "line": "Well, this is terrible! Now, who would have sex with a chicken?"
    },
    {
        "character": "Halfy",
        "line": "[Mischievously.] I would. [Everyone looks at him.]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Aw, you couldn't screw anything, Halfy. You don't have any legs!"
    },
    {
        "character": "Halfy",
        "line": "Oh... yeah. [He moves away on his fists.]"
    },
    {
        "character": "Father Maxi",
        "line": "Have some respect for people's feelings, would you, Halfy?!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Come on, dudes. We need to look for another clue."
    },
    {
        "character": "",
        "line": "Kyle finds it and holds it up high in the air."
    },
    {
        "character": "Kyle",
        "line": "Here! Here, I found one!"
    },
    {
        "character": "Stan",
        "line": "What's it say? What's it say?"
    },
    {
        "character": "Kyle",
        "line": "It says, \"Read Teetle the Timid Ta-- Taa-- The Taxi--\" What's this word?"
    },
    {
        "character": "Stan",
        "line": "I dunno."
    },
    {
        "character": "Officer Barbrady",
        "line": "[Taking the note.] \"Ta... ta... Taaguh-- Taxi-dermist.\" [Everybody cheers.] I read it! I read it all by myself! [Grins.]"
    },
    {
        "character": "Halfy",
        "line": "[Doing flips.] Hooray, yeah! Whoo!"
    },
    {
        "character": "",
        "line": "South Park at night. Cartman is doing a segment for COPS."
    },
    {
        "character": "Dispatcher 2",
        "line": "Five George is en route to 496 Broad Wasteland..."
    },
    {
        "character": "Cartman",
        "line": "Yeah, I've been working this beat for about three days now. You definitely have to have pretty thick skin or else these people, they just walk all over you. [The camera checks out traffic.] Sometimes you have to go undercover to get the worst of them."
    },
    {
        "character": "",
        "line": "Cartman is working a street, dressed in a hot-pink dress and fishnets. A car stops."
    },
    {
        "character": "Driver",
        "line": "[Winking.] Hi there, little lady."
    },
    {
        "character": "Cartman",
        "line": "Well, hi there."
    },
    {
        "character": "",
        "line": "Cartman lowers his shades and bats his eyelids."
    },
    {
        "character": "Cartman",
        "line": "Uh, wha-what are you doing tonight?"
    },
    {
        "character": "Driver",
        "line": "Well, hopefully spending some time with you, gorgeous. Is $20 enough?"
    },
    {
        "character": "Cartman",
        "line": "Sir, step out of the car, please."
    },
    {
        "character": "Driver",
        "line": "[Stammers.] What? Oh-oh-uh, is this a bust?"
    },
    {
        "character": "Cartman",
        "line": "[Displays his badge.] Sir, step out of the car."
    },
    {
        "character": "Driver",
        "line": "[Stepping out.] Hey, wait a minute. You're just a kid!"
    },
    {
        "character": "Cartman",
        "line": "[Pulls out his baton.] Maybe this'll teach you to listen to authoritah."
    },
    {
        "character": "",
        "line": "Cartman starts beating him on the shins."
    },
    {
        "character": "Driver",
        "line": "Ow! Oo-uhow! Ow! Hey, man, what are you doing?! Ow, stop it!"
    },
    {
        "character": "Cartman",
        "line": "[Exhales.] Yeah... Sometimes upholding the law is messy. But you get by. One day at a time."
    },
    {
        "character": "",
        "line": "Outside South Park Library. Three people walk by with looted stuff."
    },
    {
        "character": "Looter 3",
        "line": "I got a TV."
    },
    {
        "character": "Looter 4",
        "line": "Shh. Come on!"
    },
    {
        "character": "",
        "line": "Inside, the camera zooms in on Barbrady."
    },
    {
        "character": "Officer Barbrady",
        "line": "[Reading from the book.] \"Tee-tle the timid taxidermist... loves..to...\" Oh, goddamn, reading is lame!"
    },
    {
        "character": "",
        "line": "Stan and Kyle arrive."
    },
    {
        "character": "Kyle",
        "line": "How's it goin', dude?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Terrible! I give up! I'm not fit to be a cop! Booohoohoohoohoo, booohoohoohoohoo."
    },
    {
        "character": "Stan",
        "line": "Come on, dude, it's not that hard!"
    },
    {
        "character": "Officer Barbrady",
        "line": "It is, too!"
    },
    {
        "character": "Kyle",
        "line": "Just read the sentence."
    },
    {
        "character": "Officer Barbrady",
        "line": "\"Teetle the timid taxidermist loves to go to the pet-pet--\""
    },
    {
        "character": "Kyle",
        "line": "Come on, dumbass, you can do it!"
    },
    {
        "character": "Officer Barbrady",
        "line": "\"Pet--\" Wait a minute. [Recalls Garrison.]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Conjugate the verb. Conjugate the verb."
    },
    {
        "character": "Mr. Hat",
        "line": "Yes, conjugate the verb."
    },
    {
        "character": "Officer Barbrady",
        "line": "Pet-ting. Petting zoo. He loved to go to the petting zoo! Boys, we're off!"
    },
    {
        "character": "",
        "line": "Downtown. In another segment of Cartman's for COPS..."
    },
    {
        "character": "Dispatcher 3",
        "line": "All units, all units. Five-twelve at 635 Avenue de los Mexicanos; request assistance."
    },
    {
        "character": "",
        "line": "The siren goes on. Cut to Kenny's house. Cartman arrives and jumps off the bike, makes his way to the front door, and knocks. Stuart opens the door."
    },
    {
        "character": "Cartman",
        "line": "Sir, could you step out of the car, please?"
    },
    {
        "character": "Stuart",
        "line": "We're fine, officer. [Sips his beer.]"
    },
    {
        "character": "Cartman",
        "line": "And-uhh who's, who's in here with you?"
    },
    {
        "character": "Stuart",
        "line": "Just me and my wife and my brother. And my wife's cousin and his son and my brother's girlfriend and our two kids--"
    },
    {
        "character": "",
        "line": "Kenny and Kevin come to view."
    },
    {
        "character": "Kenny",
        "line": "(Hi, Cartman.)"
    },
    {
        "character": "Stuart",
        "line": "--and my brother's girlfriend's mother, and this guy Bob, who I met last year."
    },
    {
        "character": "Cartman",
        "line": "[To the camera.] Poor people tend to live in clusters."
    },
    {
        "character": "Stuart",
        "line": "[Takes a swig of beer.] What—What did you say?"
    },
    {
        "character": "Cartman",
        "line": "Nothing. Now, sir, is there some kind of a..."
    },
    {
        "character": "Carol",
        "line": "I want him out of my house! He ain't worth a shit! He can't even hold a fuckin' job!"
    },
    {
        "character": "Stuart",
        "line": "Shut up, bitch!"
    },
    {
        "character": "Cartman",
        "line": "Okay, okay, let's try to watch the language; there's children present heuh."
    },
    {
        "character": "Carol",
        "line": "You lazy-ass motherfucker!"
    },
    {
        "character": "Stuart",
        "line": "Look what she did to my fuckin' eye."
    },
    {
        "character": "Carol",
        "line": "I'll do it again!"
    },
    {
        "character": "",
        "line": "She kicks him in the ass and continues hitting him. Kenny just laughs at the sight."
    },
    {
        "character": "Kevin",
        "line": "Mom hit Dad again!"
    },
    {
        "character": "",
        "line": "Both then continue laughing at them."
    },
    {
        "character": "Cartman",
        "line": "Now, the first thing to do in domestic disturbance calls like this one is to just calm everybody down. Respect my authoritah!"
    },
    {
        "character": "",
        "line": "He jumps up and knocks Carol down, then Stuart. He then concentrates on Stuart. Kenny and Kevin keep laughing."
    },
    {
        "character": "Stuart",
        "line": "Aagh!"
    },
    {
        "character": "Dispatcher 1",
        "line": "All units. All units. We have a 5-20 on the suspect. Report to the South Park petting zoo immediately!"
    },
    {
        "character": "Cartman",
        "line": "[Stops, gasps.] Chickenlover!"
    },
    {
        "character": "",
        "line": "The petting zoo. The school kids mill among the animals."
    },
    {
        "character": "Officer Barbrady",
        "line": "Keep your eyes peeled, boys. Somebody's gonna make love to this chicken any minute."
    },
    {
        "character": "",
        "line": "The chicken blushes."
    },
    {
        "character": "Stan",
        "line": "Maybe we were wrong about the clue."
    },
    {
        "character": "Kyle",
        "line": "Yeah, maybe you read it wrong."
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh, no!"
    },
    {
        "character": "",
        "line": "Rustling is heard."
    },
    {
        "character": "Officer Barbrady",
        "line": "Shhh!"
    },
    {
        "character": "",
        "line": "They turn around. A hand reaches down and plucks the bird away."
    },
    {
        "character": "Officer Barbrady",
        "line": "Keep your eyes peeled."
    },
    {
        "character": "",
        "line": "They turn around."
    },
    {
        "character": "Stan",
        "line": "Look!"
    },
    {
        "character": "",
        "line": "Feathers are flying out from behind a bush as the bush moves around."
    },
    {
        "character": "Kyle",
        "line": "He's here!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Grab him!"
    },
    {
        "character": "",
        "line": "All three rush the bush, meanwhile in Downtown South Park, Cartman is racing towards the zoo."
    },
    {
        "character": "Cartman",
        "line": "Dammit! Can't this thing go any faster?!"
    },
    {
        "character": "",
        "line": "Reaches for a doughnut and bites into it."
    },
    {
        "character": "",
        "line": "The petting zoo. Barbrady is wrestling the Chickenlover as Kenny arrives. Barbrady finally gets his man. It seems to be the Booktastic bus driver, and he pulls out a pistol. As Barbrady takes it from him, it fires and hits Kenny."
    },
    {
        "character": "Stan",
        "line": "[Gasps.] Oh my God, they've killed--"
    },
    {
        "character": "Kenny",
        "line": "[Gets up.] (Oh, it was only my jacket.)"
    },
    {
        "character": "Stan",
        "line": "Goddammit!"
    },
    {
        "character": "Officer Barbrady",
        "line": "I knew it was you all along, Richard Nixon!"
    },
    {
        "character": "Stan",
        "line": "Aw, I think that's a mask, dude."
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh."
    },
    {
        "character": "Kyle",
        "line": "Whoa, dude! It's the bookmobile driver!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Caught you red-handed!"
    },
    {
        "character": "Bus Driver",
        "line": "Indeed, you did. How did you know I would strike here?"
    },
    {
        "character": "Officer Barbrady",
        "line": "By reading Teetle the Timid Taxidermist."
    },
    {
        "character": "Bus Driver",
        "line": "You did?! Really?! Then it worked! My whole plan worked absolutely perfectly! [Pleased.]"
    },
    {
        "character": "Stan",
        "line": "What are you talking about, dude?!"
    },
    {
        "character": "Bus Driver",
        "line": "When I heard that Officer Barbrady couldn't read, I knew I had to motivate him somehow. So I formulated a plan to encourage him to learn the magic of reading!"
    },
    {
        "character": "Kyle",
        "line": "So you fucked a bunch of chickens?"
    },
    {
        "character": "Bus Driver",
        "line": "Yes! Yes, exactly! Don't you see? Only by fucking chickens could I get Officer Barbrady to become literate."
    },
    {
        "character": "Stan",
        "line": "That doesn't... make a whole..lot of sense, dude."
    },
    {
        "character": "Bus Driver",
        "line": "Oh, no? He who was blind can now see!"
    },
    {
        "character": "",
        "line": "No reaction from the kids."
    },
    {
        "character": "Bus Driver",
        "line": "I got Officer Brabrady to read. My plan worked perfectly."
    },
    {
        "character": "Officer Barbrady",
        "line": "Well, I guess I should say \"Thanks?\""
    },
    {
        "character": "Bus Driver",
        "line": "You're welcome. And now, my reading friend, you've proven that you are ready for the big time. I give you this hardback copy of Atlas Shrugged, by Ayn Rand."
    },
    {
        "character": "Cartman",
        "line": "[Rushing up.] Freeze! Put your hands in the air!"
    },
    {
        "character": "Kyle",
        "line": "Cartman!"
    },
    {
        "character": "Cartman",
        "line": "I got reports that the suspect is in this area!"
    },
    {
        "character": "Kyle",
        "line": "Well, he is. It turns out that the bookmobile driver here was the one making love to chickens."
    },
    {
        "character": "Cartman",
        "line": "A-ha!"
    },
    {
        "character": "",
        "line": "Cartman hits him with the baton."
    },
    {
        "character": "Bus Driver",
        "line": "Ow, that hurts!"
    },
    {
        "character": "Kyle",
        "line": "Whoa, dude!"
    },
    {
        "character": "Stan",
        "line": "Cartman!"
    },
    {
        "character": "",
        "line": "Officer Barbrady picks Cartman up and takes the baton from him."
    },
    {
        "character": "Officer Barbrady",
        "line": "No, no, that's not how you uphold the law! [He puts him down.]"
    },
    {
        "character": "Cartman",
        "line": "Well, he is not listening to my authoritah!"
    },
    {
        "character": "Barbrady",
        "line": "Oohhh, ohh, you've got it all wrong, my little friend. You do it like this: [Paf.]"
    },
    {
        "character": "Bus Driver",
        "line": "[Going down, squealing.] Heee--!"
    },
    {
        "character": "Barbrady",
        "line": "You've gotta get 'em in the head; they go down quicker."
    },
    {
        "character": "",
        "line": "Cartman looks at the driver and removes his shades."
    },
    {
        "character": "Cartman",
        "line": "Ooohhhh."
    },
    {
        "character": "Kyle",
        "line": "I guess you should leave police work to the professionals, huh, Cartman?"
    },
    {
        "character": "Barbrady",
        "line": "Well anyway, I'm relieving you of your duties. I've proved that I can read, and now I'm back on the job!"
    },
    {
        "character": "",
        "line": "He spins the cylinder on his pistol."
    },
    {
        "character": "Stan/Kyle",
        "line": "Hooray!"
    },
    {
        "character": "",
        "line": "Cartman watches as Barbrady leaves the petting zoo, Stan calls out to Barbrady."
    },
    {
        "character": "Stan",
        "line": "Hey! So what are you going to do now?"
    },
    {
        "character": "Barbrady",
        "line": "Now? [Turns around.] Well, I-ee uh... I think I'll get in the bathtub, and then curl up with a good book."
    },
    {
        "character": "",
        "line": "He displays the book for a moment, then holds up his right thumb for the camera to see. The end credits begin to roll, but only the executive producer is listed. The boys watch for a moment more, then walk off to the right. The chicken just walks around pecking at the straw. A bunny hops across the yard and Bebe chases after it."
    },
    {
        "character": "",
        "line": "Newscast."
    },
    {
        "character": "Anchor",
        "line": "And so today South Park held a parade to honor Officer Barbrady and his heroic work on the Chickenfucker case."
    },
    {
        "character": "",
        "line": "Tape is shown of the parade. Confetti is flying everywhere. The South Park High School band is marching before Barbrady's car. He is in the car with Stan, Kyle, and Cartman."
    },
    {
        "character": "Officer Barbrady",
        "line": "Thank you, everybody. Thank you."
    },
    {
        "character": "Man 1",
        "line": "Speech! Speech!"
    },
    {
        "character": "Officer Barbrady",
        "line": "[Lowers his arms.] What?"
    },
    {
        "character": "Stan",
        "line": "They want you to give a speech, Officer Barbrady; about the whole experience over the last couple of days."
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh. Okay, uh... Well, first of all I'd like to thank the town of South Park, the town that bore me and eventually will rob me of my life precious."
    },
    {
        "character": "",
        "line": "The town cheers."
    },
    {
        "character": "Man 2",
        "line": "Oh, yeah!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Second, I'd like to say to all those out there who think they can screw chickens just to teach people to read, your days are numbered! [More cheering.] And finally, I'd like to say that [Enunciating.] reading totally sucks ass!"
    },
    {
        "character": "Stan/Kyle",
        "line": "Hooray!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Yes, at first, I was happy to be learning how to read. It seemed exciting and magical. But then I read this: Atlas Shrugged, by Ayn Rand. I read every last word of this garbage, and because of this piece of sh-shit, I'm never reading again!"
    },
    {
        "character": "Stan, Kyle",
        "line": "Hooray for Barbrady!"
    },
    {
        "character": "",
        "line": "The crowd cheers again."
    },
    {
        "character": "Kyle",
        "line": "Wow! I guess reading really does suck ass!"
    },
    {
        "character": "Cartman",
        "line": "Ey, that's what I've been saying all along, you guys."
    },
    {
        "character": "Stan",
        "line": "I'm just glad everything turned out okay, and Barbrady got his job back."
    },
    {
        "character": "Kyle",
        "line": "It's poetic justice."
    },
    {
        "character": "Officer Barbrady",
        "line": "[Leaning forward.] Thanks, boys."
    },
    {
        "character": "",
        "line": "The end credits roll again, this time normally. When the producer is listed, Kenny is shown in a clear area behind the crowd. A tree falls, flattening him."
    },
    {
        "character": "Kenny",
        "line": "(Ow!)"
    },
    {
        "character": "",
        "line": "Blood oozes from under the tree. End credits continue, showing more scenes from the parade."
    }
]