[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Mrs. Garrison's classroom. She's seated behind the desk, crying and pulling out tissue after tissue, baring her soul to the class."
    },
    {
        "character": "Mrs. Garrison",
        "line": "It's like, my whole life has just been one big screw-up, you know? [wipes away tears, then throws the tissue away] I admit it, I was I was sexually lost. I was, and then I see this person on Oprah. She was a woman but then she got a sex change, became a man, but... then she got pregnant and is having a baby, which means she's still a woman all along. That means I'm really still a man, I'm... I still feel like a man"
    },
    {
        "character": "Butters",
        "line": "Are we gonna get tested on this?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "This sex change was a big mistake, okay? [blows her nose] I was on a lot of painkillers at the time and I thought it was what I wanted."
    },
    {
        "character": "Stan",
        "line": "[to Kyle] Dude, wanna do some math problems?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[tosses another tissue away, grabs another one] And then, I go to the doctor, right? And I say \"Doctor, I wanna go back to being a man,\" and he says \"There's been too much damage. You can't go back. Where are you going to find a penis?\" [gets up, and his chair topples over] Whattaya mean, where am I gonna find a penis?! [throws a bust] I'm a man! I deserve a God damned penis! [throws some tissues, some books, and an apple towards the class. Stan closes his eyes shut so nothing gets in them. Mrs. Garrison grabs her chair and crashes it through a window. Then he punches the wall, knocks the metal drawers over, and kicks the desk, grunting all the while]"
    },
    {
        "character": "Principal Victoria",
        "line": "[not seen] Mr. Gar- Mr. Garrison! [he stops and looks up. He sees Mr. Mackey and Principal Victoria, her arms crossed, at the door] Could we speak with you please?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[walks out of the classroom still sniffling] What do you want? I'm trying to teach."
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh, we think it's best you not teach until you get your personal life in order, m'kay? [Principal Victoria walks into the classroom and closes the door]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Ohhh it's so easy for you, Mackey! You have a penis! [walks away in a huff]"
    },
    {
        "character": "Principal Victoria",
        "line": "Ooookay students, um, obviously we've had a little emergency with your teacher, so uh, while we deal with this, we need one of you to lead the class and review for tomorrow's quiz."
    },
    {
        "character": "Cartman",
        "line": "[raises his hand] Oh! Me me, me. Me! Me me! Me! Right here! Right here right here."
    },
    {
        "character": "Principal Victoria",
        "line": "Uhh, who, who else would like to be teacher for the day? Anybody else? [no one else volunteers. Cartman stands on his chair and raises his left arm high]"
    },
    {
        "character": "Cartman",
        "line": "Principal Victoria. Right over here. Nnnnnh!"
    },
    {
        "character": "Principal Victoria",
        "line": "Any other volunteers, perhaps?"
    },
    {
        "character": "Cartman",
        "line": "[now on his desk and stretching that left arm up higher] Rrrrrrr! Principal Victoria. Principal."
    },
    {
        "character": "Principal Victoria",
        "line": "All right, all right, fine. Eric, you lead the class."
    },
    {
        "character": "Cartman",
        "line": "Yes! [walks up next to Garrison's desk]"
    },
    {
        "character": "Principal Victoria",
        "line": "Now, just lead a review over whatever Mr. Garrison's been teaching you, and I'll be back to check on you shortly. [leaves the classroom and closes the door.]"
    },
    {
        "character": "Cartman",
        "line": "[turns to the board and walks up to it. He grabs the wooden pointer and smacks it softly against his left palm] Well well well. Who's teacher now? [whips it against the floor] Yeahhh. Who's teacher?!"
    },
    {
        "character": "Kyle",
        "line": "You're not the teacher, fatass."
    },
    {
        "character": "Cartman",
        "line": "That's Mr. Cartman now, Kyle! And you will be wise not to interrupt my class unless you want to be suspended! [whips the pointer against the floor] Yeahhh. [whips the pointer against the floor again] Mmm yeah, you like that? [Kyle just rolls his eyes] All right, Clyde, you're first! Get up here! [whips the pointer against the floor again] Yeah, you're gonna take it, Clyde. [waves the pointer around a little and follows it with his eyes.]"
    },
    {
        "character": "",
        "line": "Mrs. Garrison's house, day. She's laying on her sofa with her tissues, crying."
    },
    {
        "character": "News Anchor",
        "line": "And so it appears that the local farmer's market could be soon facing complete closure. In other news tonight, a South Park bio company is coming under fire for genetically engineering body parts onto laboratory mice. This picture of a mouse [a picture of a mouse with a human ear growing on its back] genetically altered to grow a human ear has already sparked waves of protest."
    },
    {
        "character": "Mrs. Garrison",
        "line": "[now attentive] What?"
    },
    {
        "character": "News Anchor",
        "line": "But the scientists say the process could help thousands of people who've become disfigured and need ears or noses."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Holy Freaking Jesus."
    },
    {
        "character": "",
        "line": "Research Group Laboratories, day. \"Tomorrow's Fortune is Today\"."
    },
    {
        "character": "",
        "line": "Research Group Laboratories, inside. Researchers move around. One of them is talking to Mrs. Garrison"
    },
    {
        "character": "Researcher 1",
        "line": "Using common genetics and cartilage scaffolding, we can graft almost any body part onto a mouse and allow it to develop. Here's the mouse you saw on television. [Mrs. Garrison looks at the mouse] Once the ear fully forms, it can be transplanted onto a person."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Doctor, what about a penis?"
    },
    {
        "character": "Researcher 1",
        "line": "Well, a penis is something a man puts into a woman's vagina."
    },
    {
        "character": "Mrs. Garrison",
        "line": "No, no. If I gave you some of my DNA, could you grow a penis on a mouse for me?"
    },
    {
        "character": "Researcher 1",
        "line": "You don't understand: doing this stuff is very expensive. And we've never tried a penis before; there's no guarantee it would work."
    },
    {
        "character": "Mrs. Garrison",
        "line": "I will give you all the money I have to just try. Please. Doctor, I'm a man trapped in a woman's body. I need a penis."
    },
    {
        "character": "Researcher 1",
        "line": "All right. [Mrs. Garrison grins] All right, let's see what we can do."
    },
    {
        "character": "",
        "line": "South Park Elementary, day, Principal Victoria's office. Mr. Mackey is there, as well as two school officials"
    },
    {
        "character": "Principal Victoria",
        "line": "Eric, we've called you in to commend you for your role as student teacher."
    },
    {
        "character": "Cartman",
        "line": "Ey! Don't commend me! It's the students' fault for being so stupid!"
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh, \"commend\" means you've done a great job, Eric. Hm'kay?"
    },
    {
        "character": "Principal Victoria",
        "line": "[looks through some papers] After leading your class through review, your schoolmates scored higher than they ever had on their tests. Whatever you did really worked on them."
    },
    {
        "character": "Cartman",
        "line": "[at ease] Oh, well, thank you. I believe strict discipline along with compassion for my students is catamite to their learning."
    },
    {
        "character": "Principal Victoria",
        "line": "These gentlemen from the Denver County School Board have something they want to ask you."
    },
    {
        "character": "Board Rep 1",
        "line": "[a black man] Young man, word of your success as a student teacher has started the whole board thinking. We would like you to try your methods on one of our inner-city school classes."
    },
    {
        "character": "Board Rep 2",
        "line": "[a white man] These kids just won't listen to any adult teachers and, since you handled your class so well, how would you like to give it a shot?"
    },
    {
        "character": "Cartman",
        "line": "That sounds like a chance to really make an impact on some students who need it most. How much will you pay me?"
    },
    {
        "character": "",
        "line": "The neighborhood bus stop. The bus pulls up and opens its doors. The boys walk out and turn right"
    },
    {
        "character": "Cartman",
        "line": "Three hundred bucks! Did you hear what I said, you guys?! My awesome teaching skill is gonna earn me three. Hundred. Bucks."
    },
    {
        "character": "Kyle",
        "line": "You're not an awesome teacher!"
    },
    {
        "character": "Cartman",
        "line": "Whatever. The whole class scored super-high on the test."
    },
    {
        "character": "Kyle",
        "line": "The only reason we scored high was because we took the answers out of Garrison's desk! And you know it!"
    },
    {
        "character": "Cartman",
        "line": "Yes, but whose idea was it to take the answers out of Garrison's desk?"
    },
    {
        "character": "Kyle",
        "line": "Kenny's!"
    },
    {
        "character": "Kenny",
        "line": "(Yeah, that was my idea.)"
    },
    {
        "character": "Cartman",
        "line": "Oh yeah. But whatever, I'm gonna go teach those underprivileged inner-city students and really turns their lives around."
    },
    {
        "character": "Kyle",
        "line": "Do you know what those kids are going to do to you?! A little middle-class white boy telling them what to do? They are going to fucking murder you! [walks away. Stan and Kenny follow. Cartman is scared, then he starts thinking]"
    },
    {
        "character": "Cartman",
        "line": "Maybe he's right. I'd better be careful how I look."
    },
    {
        "character": "",
        "line": "Cartman's bathroom. He's standing on a stool checking himself out on the vanity's mirror. He whips out a partable hair trimmer and raises it to his hairline. He shaves his head down the middle..."
    },
    {
        "character": "",
        "line": "Jon Davis High School, day. Urban music plays as the establishing scenes go by. There are security scanners at the front door which all students pass through, and two security guards to go through their belongings if the students set off the scanners. The kids at this school are doing anything but studying: fighting, making out, smoking, throwing paper wads at each other..."
    },
    {
        "character": "",
        "line": "A classroom. The students there are quite rowdy"
    },
    {
        "character": "Principal",
        "line": "[enters] Students, quiet! Quiet please! [a wad of paper goes her way and hits] Give me your attention!"
    },
    {
        "character": "Teen boy 1",
        "line": "I'll give you my attention. All night long, Mrs. Miller. [the class laughs]"
    },
    {
        "character": "Mrs. Miller",
        "line": "[the principal] You're on thin ice, Rodriguez! Now listen up! The Denver County School Board has sent over a special guest teacher."
    },
    {
        "character": "Class",
        "line": "Ohhhhhhhhhhh."
    },
    {
        "character": "Mrs. Miller",
        "line": "This may be your last shot at graduating from high school at all! I want you to welcome... Eric Cartmanez"
    },
    {
        "character": "Cartman",
        "line": "[dressed as Jaime Escalante] Hello students. I'm Eric Cartmanez. [holds up his left thumb] Your new teacher."
    },
    {
        "character": "Teen boy 2",
        "line": "What the hell is thiiis?"
    },
    {
        "character": "Cartman",
        "line": "I am here... to teach you calculuuus."
    },
    {
        "character": "",
        "line": "Research Group Laboratories, day. \"Tomorrow's Fortune is Today\"."
    },
    {
        "character": "",
        "line": "Research Group Laboratories, inside. Researchers move around. One of them is talking to Mrs. Garrison"
    },
    {
        "character": "Researcher 1",
        "line": "Iii think you're going to be very pleased with the progress, Ms. Garrison."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Mr. Garrison! [they approach an incubator]"
    },
    {
        "character": "Researcher 1",
        "line": "Sorry, Mister Garrison. Your DNA has replicated and grafted very successfully with the mouse. And so... here's your penis. [Mr. Garrison gazes into the incubator. A mouse is wrapped in gauze all over, and a penis is riding on its back]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Wow! My penis looks great!"
    },
    {
        "character": "Researcher 1",
        "line": "Yes. It's a fantastic penis. Congratulations."
    },
    {
        "character": "Mrs. Garrison",
        "line": "How long before it's ready?"
    },
    {
        "character": "Researcher 1",
        "line": "Welll, it still has some forming to do, but fairly soon."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Let me see if it feels right in my hand. [opens the incubator door and reaches in...]"
    },
    {
        "character": "Researcher 1",
        "line": "No! Don't open the- [the mouse escapes]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Whoa no!"
    },
    {
        "character": "Researcher 2",
        "line": "Don't let it get out of the lab! [the mouse reaches the entrance and escapes when an unsuspecting researcher opens the door from outside]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Mah penis! [gives chase, and some researchers join him] Stop, penis! Come back here!"
    },
    {
        "character": "",
        "line": "The classroom at Jim Davis High. Cartman hands out syllabi"
    },
    {
        "character": "Cartman",
        "line": "Okay, everyone take a sillibus and pass it to the amigo behind youuu."
    },
    {
        "character": "Teen boy 3",
        "line": "Hey man, what the hell do you think you're doing?!"
    },
    {
        "character": "Teen boy 4",
        "line": "Yeahhhh."
    },
    {
        "character": "Cartman",
        "line": "Mr. Cartmanez is here to make sure you all get into collehhhge"
    },
    {
        "character": "Teen boy 5",
        "line": "Getting into college? Maaan, we ain't gettin' in no college! Fuck you! [the rest of the class voice their protests as well. Cartman turns his back to them and looks down]"
    },
    {
        "character": "Cartman",
        "line": "How do I reach these keeds? [faces the class, his left hand tucked under the left pant pocket] The reason that you think you can't get into college is because you haven't been taught... how to cheat properly! How do you think white people always get ahead? Because we cheat all the time- I mean because they cheat all the time. [holds up a picture] This is Bill Beelichick, coach of the New England Patriots He's won three Super Bowls. How? He cheated. He even got caught cheating, and nobody cared. Bill Beelichick proved that in America it's okay to cheat. As long as you cheat your way to the top."
    },
    {
        "character": "Teen Girl 1",
        "line": "Hey, I don't wanna be called a cheater!"
    },
    {
        "character": "Cartman",
        "line": "No no. If you cheat and fail, you're a cheater. If you cheat and succeed, you're savvyyy."
    },
    {
        "character": "Teen boy 6",
        "line": "This is bullshit. I don't wanna waste my time learning to cheat."
    },
    {
        "character": "Cartman",
        "line": "Go ahead, the door's right there. [turns left] Bye-bye, have fun, we will miss youuu. [the boy walks to the door and leaves. Cartman turns away from the class and sighs, dropping the photo] How do I reach these keeds?"
    },
    {
        "character": "",
        "line": "The community park. The boys are playing in the sand box, making a sand castle. They've brought their toy trucks along. Both Butters and Kenny are present. Mr. Garrison sees them and runs towards them."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Boys! Boys, have you seen my penis? [the boys can't figure out what he's talking about.]"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "My penis is on the loose! If you see it, just try to catch it with some cheese. [runs off]"
    },
    {
        "character": "Butters",
        "line": "[rubbing his temples] Ow. That hurt my brains. [the pain gets worse] Oww."
    },
    {
        "character": "",
        "line": "Jim Davis High, another smoggy day. The boy who walked out of class is playing basketball alone in the school yard. He shoots and misses, and goes for the ball, but it rolls towards Cartman, who picks it up."
    },
    {
        "character": "Cartman",
        "line": "Nice form, compadre. [walks towards the basket with the ball]"
    },
    {
        "character": "Teen boy 6",
        "line": "Hey, I walked out of your class, teacher. Look, I don't wanna argue with you about the merits of cheating."
    },
    {
        "character": "Cartman",
        "line": "Who wants to argue on a nice day like theees? How about a little pickup game? [whistles] Hey paisanoo, can you keep score for us? [a scoreboard is shown, and a boy on the platform looks over at him]"
    },
    {
        "character": "Teen boy 7",
        "line": "Sure thing, Mr. C."
    },
    {
        "character": "Cartman",
        "line": "[gets into position] Okay, you start on defense, amigo. [dribbles the ball for a few seconds, then whacks the boy on the right shin with a collapsible pointer]"
    },
    {
        "character": "Teen boy 6",
        "line": "[falls down and grabs his right leg] AAAAH! [Cartman continues towards the basket and scores. The score is now 1-0 Visitors]"
    },
    {
        "character": "Cartman",
        "line": "Ohoooh, that's one to nothing, amigo!"
    },
    {
        "character": "Teen boy 6",
        "line": "You cheated!"
    },
    {
        "character": "Cartman",
        "line": "What's the score, ese? Okay, let's go, your turn. [the boy is on offense. He dribbles for a few seconds and moves to the basket, but Cartman again takes out his pointer and whacks the boy's left shin. The boy falls again, and Cartman steals the ball and scores again. The boy at the scoreboard updates the score: 2-0 Visitors] That's two to nothing, amigoo. [his opponent stands up]"
    },
    {
        "character": "Teen boy 6",
        "line": "Fuck you, man, you can't do that!"
    },
    {
        "character": "Cartman",
        "line": "Look at the scoreboard, amigo. No matter how many times you say I cheated, the scoreboard says two, nothing. [throws the ball back at the boy]"
    },
    {
        "character": "Teen boy 6",
        "line": "I know what you're trying to say, but I still don't agree with it. [throws the ball away and limps off]"
    },
    {
        "character": "Cartman",
        "line": "Two to nothing, ese! Two to nothing! [sighs] How do I reach these keeds?"
    },
    {
        "character": "",
        "line": "Butters' house, day. Linda is washing dishes when she hears something squeak."
    },
    {
        "character": "Linda",
        "line": "What is that? [turns around and looks. The modified mouse runs across the kitchen floor; she screams and hops onto a footstool, then lifts up her skirt] Eeeek! Eeeek! [the mouse runs across the floor again, in the opposite direction] Eeeek! Eeeek! [hops off and runs to the living room entrance] Stephen! Stephen come quick!"
    },
    {
        "character": "Stephen",
        "line": "[reading the paper with a pipe in his hand] What is it, dear?"
    },
    {
        "character": "Linda",
        "line": "A penis is loose in our kitchen!"
    },
    {
        "character": "Stephen",
        "line": "A penis?"
    },
    {
        "character": "Linda",
        "line": "Yes! It just ran across the floor!"
    },
    {
        "character": "Stephen",
        "line": "Now darling, calm down."
    },
    {
        "character": "Linda",
        "line": "Calm down nothing! I don't want that penis running through my house!"
    },
    {
        "character": "Stephen",
        "line": "Hoh, women. Always afraid of penises. [Butters smiles. Stephen gets up from his armchair and walks to the kitchen. Butters joins him. The mouse runs across the floor again]"
    },
    {
        "character": "Linda",
        "line": "There! There, you see it?"
    },
    {
        "character": "Stephen",
        "line": "Oh, it's just a little penis, darling."
    },
    {
        "character": "Linda",
        "line": "I don't care. It's probably got all kinds of diseases. [the mouse runs across the floor again]"
    },
    {
        "character": "Butters",
        "line": "Hey wait! I think that's teacher's penis!"
    },
    {
        "character": "Stephen",
        "line": "Your teacher's penis?"
    },
    {
        "character": "Butters",
        "line": "Yeah, that must be his."
    },
    {
        "character": "Stephen",
        "line": "Butters, how do you know what your teacher's penis looks like?"
    },
    {
        "character": "Butters",
        "line": "[didn't quite get it until...] Huh?"
    },
    {
        "character": "",
        "line": "Jim Davis High School, day"
    },
    {
        "character": "Cartman",
        "line": "Today we will discuss one of the fundamental ways to cheat: getting material ahead of time. [hops onto a box so he could write on the chalkboard. He draws a video camera aimed at a box marked D] When Bill Beelichick cheated for the Patriots, what did he do? He videotaped the opposing team's defense. Think of the defense as your test. When taking a test you must also videotape the defense. Learn what's on the test before they give it to you. And that way you can- [the errant student returns]"
    },
    {
        "character": "Teen boy 6",
        "line": "I thought that... well maybe I can give cheating a try."
    },
    {
        "character": "Cartman",
        "line": "Have a seat, amigo. Good to have you baaack. [the student takes his seat] All right. Now, when Bill Beelichick got caught with his camera, he did not panic. He simply said what every good white cheater says when caught: \"I mis-interpreted the rules.\" It's what you must also say when caught cheating! \"I mis-interpreted the rules.\" Say it with me."
    },
    {
        "character": "Class",
        "line": "\"I mis-interpreted the rules.\""
    },
    {
        "character": "Cartman",
        "line": "Good. Again."
    },
    {
        "character": "Class",
        "line": "\"I mis-interpreted the rules.\""
    },
    {
        "character": "Cartman",
        "line": "Again!"
    },
    {
        "character": "Class",
        "line": "\"I mis-interpreted the rules.\""
    },
    {
        "character": "Cartman",
        "line": "Now you sound like white people!"
    },
    {
        "character": "Class",
        "line": "[now with pounding fists] \"I mis-interpreted the rules!\""
    },
    {
        "character": "",
        "line": "South Park Supermarket. Stephen and Butters have finished shopping and are packing the groceries into their car. Mr. Garrison is talking to them"
    },
    {
        "character": "Mrs. Garrison",
        "line": "What the hell do you mean you just put my penis outside?! Why didn't you call me?!"
    },
    {
        "character": "Stephen",
        "line": "Look Garrison, my wife didn't want a penis in the house. I had to get it out."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Well now how am I supposed to find it?! It could be anywhere!"
    },
    {
        "character": "A woman",
        "line": "EEEEEEEEEEEEEEEEEEEEK! [the three guys look up]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Holy Crap! [takes off after the sound.]"
    },
    {
        "character": "",
        "line": "The Komfort Inn. The screaming woman stands on a box while her husband looks at her annoyed"
    },
    {
        "character": "Woman",
        "line": "Eeeek! Eeeeeek!"
    },
    {
        "character": "Husband",
        "line": "Carole, get down from there!"
    },
    {
        "character": "Woman",
        "line": "Noo! Didn't you see that penis just now?! Eeeek!"
    },
    {
        "character": "Husband",
        "line": "I'm sure that penis is way more scared of you than you are of it."
    },
    {
        "character": "Mrs. Garrison",
        "line": "[pops into view] You saw a penis?!"
    },
    {
        "character": "Woman 2",
        "line": "[inside the Inn] Eeeeeeeek! [Mrs. Garrison rushes in]"
    },
    {
        "character": "",
        "line": "The Komfort Inn Fitness Room. Mrs. Garrison finds the woman standing on a chair with her legs crossed"
    },
    {
        "character": "Woman 2",
        "line": "Oh, it's so big and disguuusting. Eeek. [the mouse runs across the floor and Mrs. Garrison gives chase. The penis-mouse runs down the hall and into a steam room]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[runs down the hall] Come back here, penis! [enters the steam room and looks around] There you are! Got you! [backs out of the steam room holding a penis... which is attached to a man. Garrison looks at the penis more closely, then at the man's face] Hey, you're not my penis. [the man punches her across the face] Ogh! [the penis-mouse runs out. Garrison lets go and gives chase again] There it goes! Stop you!"
    },
    {
        "character": "",
        "line": "Cartmanez' class. He's giving the class the answers for the upcoming test"
    },
    {
        "character": "Cartman",
        "line": "The answer to #27 is 5."
    },
    {
        "character": "Class",
        "line": "[repeating] The answer to #27 is 5."
    },
    {
        "character": "Cartman",
        "line": "The answer to #28 is 14."
    },
    {
        "character": "Class",
        "line": "\"The answer to #28 is 14.\""
    },
    {
        "character": "Teen Girl 2",
        "line": "Man, what's the point? [grabs her books and heads for the door] What's the point of any of this? [cries and exits]"
    },
    {
        "character": "Cartman",
        "line": "All right, uh, everyone review the section on sportscasters forgiving the Patriots for cheating and saying it was no big deal; I'll be right back. [leaves the classroom and looks around for the girl] Melita! Melita, hold on. [walks up to her] You can't quit now. Come on, what's wrong with you?"
    },
    {
        "character": "Melita",
        "line": "There isn't any point to all this. I won't be going to college. I'm pregnant, all right? I just found out, and Eduardo isn't going to help me raise it."
    },
    {
        "character": "Cartman",
        "line": "[sighs] How do I reach these keeds? [turns around and faces her] All right, let's go get you an abortion."
    },
    {
        "character": "Melita",
        "line": "No. I'm Catholic. I think abortion is wrong."
    },
    {
        "character": "Cartman",
        "line": "Abortion isn't wrong! What's the one thing I've been teaching you?"
    },
    {
        "character": "Melita",
        "line": "That cheating is good?"
    },
    {
        "character": "Cartman",
        "line": "Yes! And abortion is the ultimate form of chea-ting! You're chea-ting nature itself. [Melita turns right and walks off a bit] Why do rich white girls get ahead in life? Because they get abortionnns when they're young. They get pregnant, but they still want to go to college, so, whatever, they just cheat. They cheat that little critter in their belly right out of a chance at life."
    },
    {
        "character": "Melita",
        "line": "I don't know, Mr. C."
    },
    {
        "character": "Cartman",
        "line": "Mexicans are told not to cheat. \"Don't cheat! You got pregnant? You have to raise the child.\" So then you have to raise the child while the white girls get to go to college and probably have a bunch more abortionnns. [walks around to face her] It is at our most challenging times that we must cheat... our very hardest."
    },
    {
        "character": "",
        "line": "Park County Police Station, day. Mr. Garrison files a police report"
    },
    {
        "character": "Sgt. Yates",
        "line": "[taking notes] And the last time you saw your penis was two days ago? [a police sketch artist works on a portrait]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "That's right."
    },
    {
        "character": "Officer Harris",
        "line": "Long whiskers or short?"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Short, and little fluffy ears."
    },
    {
        "character": "Officer Harris",
        "line": "Fluffy ears, okay."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Think you got it, Mitch?"
    },
    {
        "character": "Mitch Harris",
        "line": "I think so, sir. Is this pretty close? [shows his sketch to Garrison: it's Mickey Mouse with a giant boner under his shorts]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[disappointed] No, no, not like that! That's just silly. [an officer walks into view]"
    },
    {
        "character": "Officer",
        "line": "Sir, we might wanna get a unit down to the Italian restaurant on Kentner."
    },
    {
        "character": "Sgt. Yates",
        "line": "What is it?"
    },
    {
        "character": "Officer",
        "line": "Call just came through. Seems a penis broke in and tried to eat their cheese."
    },
    {
        "character": "Mrs. Garrison",
        "line": "Wall come on! [runs out. The two other officers follow him]"
    },
    {
        "character": "",
        "line": "Buca de Faggoncini Italian Restaurant, night. Diners are eating their meals, and a small penis-mouse appears on the floor"
    },
    {
        "character": "Woman 2",
        "line": "[quickly jumps onto her chair and lifts up her skirt] EEK!"
    },
    {
        "character": "Man 2",
        "line": "[looks around] What's the matter?"
    },
    {
        "character": "Woman 2",
        "line": "A penis!"
    },
    {
        "character": "Woman 3",
        "line": "[quickly jumps onto her table and lifts up her skirt] A penis? Where?"
    },
    {
        "character": "Woman 4",
        "line": "There it is! [quickly jumps onto the table at her booth and lifts up her skirt] Eek! [the other women at the restaurant do the same thing, and soon all you hear are \"Eek, a penis!\"]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[enters the restaurant followed by the three officers] Where is it?!"
    },
    {
        "character": "Mitch Harris",
        "line": "Look, there! [points to the mouse as it heads to the kitchen. A waiter doesn't notice the mouse passing by him]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "Come on! [he and the officers run to the kitchen]"
    },
    {
        "character": "Chef",
        "line": "What'sa that peenis doing ina myii kitchen? [wields a rolling pin]"
    },
    {
        "character": "Mrs. Garrison",
        "line": "[entering with the cops] Huy! Don't you dare kill my penis! [the mouse leaves through an open window] Crap! We've gotta go back around!"
    },
    {
        "character": "",
        "line": "Outside. The penis-mouse climbs along items behind the restaurant and runs along the top of a wooden fence. The camera follows it past the moon in the distance. The mouse stops and looks at the moon"
    },
    {
        "character": "Mouse",
        "line": "Someone somewhere is loving me tonightLooking at the same moon and seeing it so bright."
    },
    {
        "character": "Penis",
        "line": "Someone somewhere is feelin' my despair"
    },
    {
        "character": "Mouse",
        "line": "Feelin' my despair"
    },
    {
        "character": "Penis",
        "line": "And this same moon is"
    },
    {
        "character": "Penis, Mouse",
        "line": "[together] making them think of that-."
    },
    {
        "character": "Mrs. Garrison",
        "line": "There it is! [the mouse runs away. Garrison gives chase again, with the cops and the chef joining him. The mouse runs to the sewer and drops in] No! Nooo! [dives after it, but can't reach far enough in to get it] No! No!"
    },
    {
        "character": "Mitch Harris",
        "line": "There's not a chance now."
    },
    {
        "character": "Mrs. Garrison",
        "line": "No we, we can find it! [looks intensely down through the grate]"
    },
    {
        "character": "Sgt. Yates",
        "line": "Sorry Garrison, your penis is gone. Afraid there's nothing more we can do. You'll just have to live with being a woman. A very ugly one. Come on, men. [they leave. Garrison stands up, beat]"
    },
    {
        "character": "",
        "line": "Cartmanez's classroom. Mrs. Miller and Cartman stand before the class."
    },
    {
        "character": "Mrs. Miller",
        "line": "Students, I want to congratulate you on your amazing test scores. The school board is so impressed with your progress that they are going to let you take the standardized advanced placement test for college credit. [a quick cheer goes up] The test is going to be heavily monitored in a private room at their location to assure that there can be absolutely no cheating."
    },
    {
        "character": "Cartman",
        "line": "Uh what?"
    },
    {
        "character": "Mrs. Miller",
        "line": "The test will be tomorrow. Make us proud. [turns right and leaves the classroom]"
    },
    {
        "character": "Teen boy 8",
        "line": "Monitor us in a private room?"
    },
    {
        "character": "Teen boy 3",
        "line": "Now they're gonna know we've been cheating all along."
    },
    {
        "character": "Teen boy 2",
        "line": "I knew it man! You made us believe in your way and now it's all for nawthing!"
    },
    {
        "character": "Cartman",
        "line": "Ih it's not for nothing. Ih, if you're good enough, you can cheat right in front of them."
    },
    {
        "character": "Teen boy 8",
        "line": "[stands up] Shut up, man! You reyally screwed us all!"
    },
    {
        "character": "Cartman",
        "line": "How do I reeeach these keeeeds?! [the boy, cowed, slips back into his seat. Cartman faces the board] Just before the last Super Bowl, Bill Beelichick gathered his football players and said, \"Let's win this one for real. Just this one time. Let's not cheat.\" You know what happened? [dryly] They lost. [faces the class] Even if you feel all eyes are upon you, you cannot give up on chea-ting! Or else you can lose the biggest game of your lives."
    },
    {
        "character": "Teen Girl 1",
        "line": "Yeah, come on, we can do this, guys."
    },
    {
        "character": "Cartman",
        "line": "You are the true dreamers. Tomorrow you will prove it. We will begin by reviewing how to print out cheat sheets as labels for your bottled water."
    },
    {
        "character": "",
        "line": "A bus stop across the street from Buca de Faggoncini, night. Mrs. Garrison is on her back on the bench, crying"
    },
    {
        "character": "Mrs. Garrison",
        "line": "You did this to yourself, Garrison. Get your hopes up with a stupid genetic experiment and now all your money's gone along with your penis. [a squeaky thing is heard. Garrison notices and stops crying] Well what the? [raises her head and looks down, then looks towards her feet. The mouse that has been fleeing all night is now struggling to get on the bench] Why... it's my penis. [the mouse is now wholly on the bench] My penis came back. But why? [the mouse moves closer. Mrs. Garrison lowers her left hand to the bench. The mouse walks onto her hand, and she lifts it up] I guess it's true. What's that old saying? \"If you love your penis, let it go...\""
    },
    {
        "character": "",
        "line": "Jim Davis High School Auditorium. Mrs. Miller addresses the audience while Mr. Cartmanez' class stands behind and to the left of her"
    },
    {
        "character": "Mrs. Miller",
        "line": "The standardized advanced placement test is considered one of the most difficult and carefully monitored tests in the country. Twenty-four of our students took the test and all twenty-four scored 100% [their parents applaud. Melita and a short boy look at each other]"
    },
    {
        "character": "Teen boy 6",
        "line": "Uh, can we say something?"
    },
    {
        "character": "Mrs. Miller",
        "line": "Sure. [leaves the podium. The short boy reaches for a plaque and hands it to the taller boy, who now takes the mic]"
    },
    {
        "character": "Teen boy 6",
        "line": "We would like to present this plaque to the person who taught us the White People Method. Mr. Cartmanez! [Cartman, standing far from the podium and off to one side, walks up to the podium and reaches the mic. The students gather 'round him and clap as adults take pictures.]"
    },
    {
        "character": "Cartman",
        "line": "[basking in the success] I reeached these keeeds."
    },
    {
        "character": "",
        "line": "South Park Elementary, main entrance. Everyone is gathered there for a special occasion"
    },
    {
        "character": "Principal Victoria",
        "line": "Students and faculty, please put your hands together and help me in welcoming back, Mister Garrison. [everyone claps as Mr. Garrison makes his return]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Thanks everyone. It's great to be back. I'm a man again. Thanks to my very special new friend. [the mouse that grew his penis climbs onto his right shoulder, the penis having been removed from it and attached to Mr. Garrison. Garrison turns around] But you know, I've learned that I've really been a dude all along. Because the key difference between men and women is that women can have babies. If you can't have babies, then, you're a man."
    },
    {
        "character": "A Teacher",
        "line": "Whoa uh wait, uh, hang on a second. My wife had ovarian cancer, so she can't have babies."
    },
    {
        "character": "Mr. Garrison",
        "line": "Well then get an AIDS test, Thompson, 'cause your wife's a dude, faggot! [Thompson is dumbfounded. Garrison turns around and jumps up to click his heels] Yeah! I'm back!"
    }
]