[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "The Beijing Olympics Opening Ceremonies. The flag of the People's Republic of China flaps over the Bird's Nest, aka the National Stadium"
    },
    {
        "character": "Announcer",
        "line": "Welcome to the televised broadcast of the Olympic Opening Ceremonies from Beijing. [fireworks enter the stadium and the drum roll begins. The drummers are bent over their drums as lights in the drums flash on and off] Thousands of Chinese performers playing ancient Chinese drums. [the roll ends in a wave of drummers standing up straight and not drumming] The precision of their movements made even more impressive by their massive numbers. [all the drummers strike their drums at once and the light display resumes]"
    },
    {
        "character": "",
        "line": "Cartman's room, night. Cartman isn't having a peaceful dream"
    },
    {
        "character": "Cartman",
        "line": "[dreaming about being at the Opening Ceremonies] No! The Chinese, no! Somebody has to stop them! [The stadium lights come up and the drummers resume their drumming. Cartman is getting restless] No! No!"
    },
    {
        "character": "Liane",
        "line": "[knocks on his door] Eric? Sweetie, are you having nightmares about the Chinese again?"
    },
    {
        "character": "Cartman",
        "line": "[talking in his sleep] They're gonna... take over the world! HAA! [The drummers start up again] Too many of them. [Cartman now dreams of walking among the drummers] No! Leave us alone! [The drummers strike solidly on their drums, and Cartman now finds himself bouncing on the drums as they rise and fall under him] Nooo! [Four different groups of Chinese Olympians surround him. Cartman wakes from his nightmare and checks his face to be sure he's not dreaming] Damn it no! No!"
    },
    {
        "character": "Liane",
        "line": "[quickly enters the room, turns on the light and comes to his side] Sweetiekins, are you all right?"
    },
    {
        "character": "Cartman",
        "line": "Mom. Mom, the Chinese are gonna get me!"
    },
    {
        "character": "Liane",
        "line": "[consoles him] No, sweetie, the Chinese aren't going to get you."
    },
    {
        "character": "Cartman",
        "line": "[sobbing] They are so! There's two billion of them and their economy is getting better and with all their advances in technology they're gonna bring down America!"
    },
    {
        "character": "",
        "line": "The bus stop, day. Stan, Kyle, and Kenny await the bus. Cartman walks up and stands between Kyle and Kenny."
    },
    {
        "character": "Cartman",
        "line": "[being serious] All right. Guys, we need to talk. [no response from the other three] You know, uh we can all just pretend... that we didn't see those opening ceremonies but, the Chinese... are very real. We've gotta do something. [the other boys stay silent] Are we just gonna pretend America is going to be okay? Are we just going to... wait until they've taken over the world?"
    },
    {
        "character": "Kyle",
        "line": "[steps forward, away from the others] I'm sorry. [holds his palms up and out, then shakes them as if to hold off something] I I'm sorry, I can't do this. [then lowers them] I'm not doing this. [walks off to his right]"
    },
    {
        "character": "Stan",
        "line": "[stops Kyle in his tracks just by saying] Kyle, you're supposed to tell Cartman he's being racist or something?"
    },
    {
        "character": "Kyle",
        "line": "Yeah he's an idiot but uh I'm sorry, I just... I can't do this anymore, okay? I... I can't do this anymore! [walks away. The other boys look at him, Stan a bit shocked]"
    },
    {
        "character": "Kenny",
        "line": "(Damn.)"
    },
    {
        "character": "",
        "line": "'[Kyle's room, moments later. Kyle is at his desk moping, his arms crossed and his face buried in them. Someone knocks twice, then opens the door. It's Stan.]'"
    },
    {
        "character": "Stan",
        "line": "Kyle. [Kyle doesn't reply. Stan sighs, closes the door and approaches him] Kyle, you can't keep doing this. You know what, at some point, you've got to let this go."
    },
    {
        "character": "Kyle",
        "line": "Yeah? Well... maybe you can forget what happened, but I... can't."
    },
    {
        "character": "Stan",
        "line": "Look, what happened, happened. We can't change it now. We have to move on."
    },
    {
        "character": "Kyle",
        "line": "[leaves his desk angrily and faces Stan] Move on?! Our friend was raped, Stan! He was raped, and we all stood there and did [takes his hands, puts them side by side, and sweeps them out away from each other] nothing!"
    },
    {
        "character": "Stan",
        "line": "There was nothing we could do, Kyle! [Kyle walks away. Stan says softly] There was nothing we could do. We had to get out of there."
    },
    {
        "character": "Kyle",
        "line": "[turns around and faces Stan] Did we?! Maybe we could have stopped them!"
    },
    {
        "character": "Stan",
        "line": "How?"
    },
    {
        "character": "Kyle",
        "line": "[turns away again] I dream about it every night. Every time I close my eyes I see us just running away, running while they ray-rape him over and over again. [clenches his fists at the thought of it, then loosens the grips and turns around] And because we did nothing... they got away."
    },
    {
        "character": "Stan",
        "line": "You can't keep torturing yourself like this, Kyle. Let it... go."
    },
    {
        "character": "Kyle",
        "line": "[wipes something from his forehead] I'm... glad... that you guys can just keep living. I don't think I can. [walks out of the room. Stan watches him leave, then sighs]"
    },
    {
        "character": "Stan",
        "line": "[puts his hands in his jacket pockets] God damn it."
    },
    {
        "character": "",
        "line": "Butters' bathroom. Butters is taking a bubble bath with a rubber ducky and a toy submarine"
    },
    {
        "character": "Butters",
        "line": "Lu lu lu I've got some space flight. Lu lu lu space flights seem old... Lu lu lu-"
    },
    {
        "character": "Cartman",
        "line": "[bursts into the bathroom, startling Butters] There you are, Butters!"
    },
    {
        "character": "Butters",
        "line": "Uhuh, Eric."
    },
    {
        "character": "Cartman",
        "line": "Butters, I need your help."
    },
    {
        "character": "Butters",
        "line": "Not now, Eric, I'm ih I'm indecent."
    },
    {
        "character": "Cartman",
        "line": "The Chinese are gonna take us over, Butters! And we are the only people who seem to care!"
    },
    {
        "character": "Butters",
        "line": "The Chinese?"
    },
    {
        "character": "Cartman",
        "line": "I handed out fliers, called together meetings, but it's like... everyone's turning a blind eye. The Chinese are taking over the world and nobody's doing anything! It's up to you and me, Butters. We have to stop the Chinese now."
    },
    {
        "character": "Butters",
        "line": "Aw, I can't stop the Chinese tonight, Eric, uh I'm supposed to make a model car with my dad."
    },
    {
        "character": "Cartman",
        "line": "You don't get it Butters! Our lives are about to change! The Chinese outnumber us a million to one. And when their army gets here, they're gonna kill your parents!"
    },
    {
        "character": "Butters",
        "line": "Why are they gonna kill my parents?"
    },
    {
        "character": "Cartman",
        "line": "Because the Chinese hate Americans! That's why I've started: the American Liberation Front. A group dedicated to freeing American from Chinese tyranny. [with determination] Will you join me?"
    },
    {
        "character": "Butters",
        "line": "I don't want my parents to die."
    },
    {
        "character": "Cartman",
        "line": "[hops onto the stool] So you'll join the American Liberation Front?!"
    },
    {
        "character": "Butters",
        "line": "Well sure."
    },
    {
        "character": "Cartman",
        "line": "[cups Butters' right hand between his own two hands] You and me: we're going to be the brave little boys who fought back, Butters. We are not letting them take over our country. Fuck the Chinese."
    },
    {
        "character": "Butters",
        "line": "Yeah, [pounds his left fist into the water] fuck 'em."
    },
    {
        "character": "",
        "line": "Kyle's room, night. He's asleep"
    },
    {
        "character": "Kyle",
        "line": "No... No! [he's having a nightmare] No..."
    },
    {
        "character": "",
        "line": "In the dream. Only the voices are heard at first"
    },
    {
        "character": "Kyle",
        "line": "No, wait. No, we have to stop them! They're raping him. Rape!"
    },
    {
        "character": "Stan",
        "line": "Let's get out of here!"
    },
    {
        "character": "Kyle",
        "line": "We can't just leave!"
    },
    {
        "character": "Stan",
        "line": "Come on!"
    },
    {
        "character": "Kyle",
        "line": "Aw it's horrible! [we now join the dream already in progress]"
    },
    {
        "character": "",
        "line": "The setting is the Bijou theater, day. The movie playing is \"Indiana Jones and the Kingdom of the Crystal Skull\""
    },
    {
        "character": "Stan",
        "line": "Oh God!"
    },
    {
        "character": "Kyle",
        "line": "Somebody do something!"
    },
    {
        "character": "Clyde",
        "line": "Why are they doing this?!"
    },
    {
        "character": "",
        "line": "Inside the theater."
    },
    {
        "character": "Kyle",
        "line": "They're just taking Indiana Jones and they're... [blinks hard] they're raping him! [Stan quickly covers his eyes]"
    },
    {
        "character": "Stan",
        "line": "I can't watch! [uncovers his eyes and rises from his seat] Let's get out of here Kyle! [leaves. Kenny follows him out of the row, then Clyde, Butters, and Jimmy.]"
    },
    {
        "character": "Kyle",
        "line": "Why would Spielberg and Lucas do this?!"
    },
    {
        "character": "Stan",
        "line": "COME ON LET'S GO! [grabs Kyle by the right hand and drags him out]"
    },
    {
        "character": "Kyle",
        "line": "WHY ARE THEY DOING THIIIS?!"
    },
    {
        "character": "Stan",
        "line": "JUST RUN!! [the six boys run out of there.]"
    },
    {
        "character": "",
        "line": "Outside the theater."
    },
    {
        "character": "Stan",
        "line": "Why aliens? Aliens don't belong in an Indiana Jones movie? [Kyle throws up] Come on dude! There's nothing we can do!"
    },
    {
        "character": "Clyde",
        "line": "[in despair] Whyyy? Whyyy?? [Kenny runs around is disbelief]"
    },
    {
        "character": "Jimmy",
        "line": "We can't help him now."
    },
    {
        "character": "Butters",
        "line": "Well I thought it was pretty good."
    },
    {
        "character": "Stan",
        "line": "Let's just go, Let's just go! [grabs Kyle's right hand and pulls him away from the theater]"
    },
    {
        "character": "Kyle",
        "line": "[suddenly wakes up] NOO! [sits on the edge of his bed.] Noo. No. Awwh. [sobs softly in relief] Aw no..."
    },
    {
        "character": "",
        "line": "South Park, day. Cartman and Butters walk down the street and approach a corner. Cartman is carrying a duffle bag"
    },
    {
        "character": "Cartman",
        "line": "All right Butters, we're here. [sets the duffle bag down] Are you ready?"
    },
    {
        "character": "Butters",
        "line": "I'm scared, but I know my country needs me."
    },
    {
        "character": "Cartman",
        "line": "This is it, Butters. We have to be strong. We're taking down those God damned Chinese right now. [points at something across the street - a P.F. Chang's China Bistro] Things could get ugly in there, Butters. We've got to infiltrate, and find out the Chinese invasion plans. [opens the duffle bag and begins to search through it]"
    },
    {
        "character": "Butters",
        "line": "But Eric, wu-why would the, Chinese tell us their invasion plans?"
    },
    {
        "character": "Cartman",
        "line": "Because we're going to make them think... we're one of them. [pulls out a Chinese peasant hat] Here, put these teeth in! [hands him some buck teeth] And just say \"herro\" and \"prease\" a lot. [puts in his own buck teeth and squints his eyes] \"Oh, herro prease.\" Ping pong ching chong."
    },
    {
        "character": "Butters",
        "line": "Ping ping. Herro. ...Prease."
    },
    {
        "character": "",
        "line": "P.F. Chang's, moments later. Cartman and Butters enter in Chinese costumes. Cartman now has makeup on his eyes while Butters wears a fez and has drawn glasses around his eyes"
    },
    {
        "character": "Greeter",
        "line": "[a woman] Uhh welcome to P.F. Chang's. I'll be right with you. [turns to other guests]"
    },
    {
        "character": "Butters",
        "line": "[leans over] Hey, Eric, uh these people aren't Chinese."
    },
    {
        "character": "Cartman",
        "line": "[panics, voice rising] Oh my God! Oh my God! Oh my God!"
    },
    {
        "character": "Butters",
        "line": "[walks up to him] What?"
    },
    {
        "character": "Cartman",
        "line": "It's already started. White people in here working for the Chinese. They're selling out their own country!"
    },
    {
        "character": "Greeter",
        "line": "Uh, can I help you?"
    },
    {
        "character": "Cartman",
        "line": "Ah yes, herro prease. [puts his hands together and bows a bit] We are Chinese peopull."
    },
    {
        "character": "Butters",
        "line": "[also bows] Herro prease. Ting tao ding ling."
    },
    {
        "character": "Greeter",
        "line": "Uh yeah, why don't I seat you over here? [they follow her to their table and take their seats. She gives them their menus] Your waitress will be right with you."
    },
    {
        "character": "Cartman",
        "line": "Fruttar sheshar. [the greeter leaves] What the hell is going on here? We've gotta sneak our back into the back Butters- uh huck! [goes into hushed tones and points] There they are! Chinese people! There are Chinese people right over there! [Butters leans over and looks back. Sure enough, a Chinese family of five is looking at them] Do you see them?"
    },
    {
        "character": "Butters",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "Oh my God the Chinese are here. Okay, okay I'm freaked out. I'm freaking out."
    },
    {
        "character": "Butters",
        "line": "Stay calm, Eric."
    },
    {
        "character": "Cartman",
        "line": "They're right over there, and they're gonna start screaming and banging on those drums, and then they're go- [Butters smacks him, shutting him up] Thank you Butters. All right, we need to go over there and find out what we can from those Commie rats. [they make their way to the family's table] Oh, herro, prease, herro."
    },
    {
        "character": "Butters",
        "line": "[bows a bit] Herro, prease."
    },
    {
        "character": "Cartman",
        "line": "So nice to see othaa Chinese peopull heeh. As you can see, we are Chinese peopull ourselves."
    },
    {
        "character": "Butters",
        "line": "Fing fong ting tong."
    },
    {
        "character": "Cartman",
        "line": "Ting ton teetong."
    },
    {
        "character": "Mother",
        "line": "他们在干什么啊？[subtitled] What are they doing?"
    },
    {
        "character": "Father",
        "line": "诶，我真的不知道。[subtitled] I don't know."
    },
    {
        "character": "Cartman",
        "line": "Yeah, [gibberish] So, what are the plans to take over America again? I fohgot. [snickers. The family just stares at them]"
    },
    {
        "character": "",
        "line": "Stark's pond, evening. Jimmy sits on a bench staring out over the water as the sun sets. The lake looks more like a lake should look now"
    },
    {
        "character": "Stan",
        "line": "[walks into view] Jimmy? I don't know what to do about Kyle. [walks towards the shore] You know, I... I don't think he's ever going to be the same."
    },
    {
        "character": "Jimmy",
        "line": "And what about you, Stan? We were all in the theater that day. We all... saw it happen."
    },
    {
        "character": "Stan",
        "line": "Yeah well I, I just try not to think about it."
    },
    {
        "character": "Jimmy",
        "line": "I thought I could go on like before. But after seeing Indiana get raped... After seeing Indiana get raped I know I'll never be the sa-a-ame, the same? The same. [Stan turns right and sighs] Do you remember that scene with Indiana in the refrigerator? [Stan turns his head to look back] It didn't make any sense, Stan."
    },
    {
        "character": "Stan",
        "line": "[turns to face Jimmy] I don't need this now. [looks away and closes his eyes] I just want things to be the way they were! [runs off]"
    },
    {
        "character": "Jimmy",
        "line": "[turns left to follow Stan's path] You can't run away from it forever, [faces the lake again] Stan! Sooner or later, we all have to face what we fe-fe-fehh fehsow."
    },
    {
        "character": "",
        "line": "Stan wanders through town, but stops to remember something: he's in the movie theater watching a movie and eating popcorn"
    },
    {
        "character": "Stan",
        "line": "Indiana Jones! All right! [The screen is shown: Indy is at the foot of a long set of stairs]"
    },
    {
        "character": "Indy",
        "line": "[turns to face Stan] Hey there, Stan. All set to see my new adventure?"
    },
    {
        "character": "Stan",
        "line": "[happily] You bet, Indiana! [Stan's jaw drops. Steven Spielberg and George Lucas walk up behind Indy, smiling] No!... Look out Indy, it's... Steven Spielberg and George Lucas!"
    },
    {
        "character": "Spielberg",
        "line": "Well well hello there Indiana. [rubs Indy's left shoulder]"
    },
    {
        "character": "Lucas",
        "line": "[pats Indy's back lovingly] You're looking cute. [they begin to rough him up]"
    },
    {
        "character": "Stan",
        "line": "No! Uh what are you gonna do to him?! [they begin to disrobe Indy]"
    },
    {
        "character": "Spielberg",
        "line": "Oh yeah! [Spielberg rips Indy's shirt open]"
    },
    {
        "character": "Indy",
        "line": "No! [Stan covers his mouth in disbelief and alarm]"
    },
    {
        "character": "Stan",
        "line": "Indy! [Lucas and Spielberg now have Indy pinned to the ground]"
    },
    {
        "character": "Lucas",
        "line": "Yeah! Get his pants down! Get his pants down! [Spielberg pulls down Indy's pants as Indy wails]"
    },
    {
        "character": "Spielberg",
        "line": "Hold him, Lucas! Come on!"
    },
    {
        "character": "Lucas",
        "line": "[holding Indy down] Heheh! He-he ain't goin' nowhere!"
    },
    {
        "character": "Spielberg",
        "line": "[gets on top of Indy] Yeah!"
    },
    {
        "character": "Stan",
        "line": "No, stop! Raape!"
    },
    {
        "character": "Indy",
        "line": "HOOOOOOOOO! [the daydream ends and Stan has tears in his eyes. He breaks down and falls on all fours, weeping. He raises his face and fist to the sky and continues weeping]"
    },
    {
        "character": "",
        "line": "P.F. Chang's. Cartman and Butters are still there..."
    },
    {
        "character": "Cartman",
        "line": "All right, Butters, I think we've almost got the Chinese to trust us! Now as soon as they tell us their invasion plans, make a run for that door, okay?!"
    },
    {
        "character": "Butters",
        "line": "Okay, okay."
    },
    {
        "character": "Cartman",
        "line": "Ho ho, that's a good one, Ping Ling. Hoho. So ah where were we? Oh yes, the invasion pran."
    },
    {
        "character": "Butters",
        "line": "Huh, invasion pran."
    },
    {
        "character": "Cartman",
        "line": "What day is American invasion again? I fohget. [snickers]"
    },
    {
        "character": "Father",
        "line": "'Scuse me, miss?"
    },
    {
        "character": "Greeter",
        "line": "Yes sir?"
    },
    {
        "character": "Father",
        "line": "These people won't leave us alone."
    },
    {
        "character": "Cartman",
        "line": "[thinks a bit] ...No no, it's okay. We are Chinese peopull."
    },
    {
        "character": "Father",
        "line": "You aren't Chinese."
    },
    {
        "character": "Cartman",
        "line": "Oh my God..."
    },
    {
        "character": "Butters",
        "line": "We're busted! Uh what do we do??"
    },
    {
        "character": "Greeter",
        "line": "Okay, why don't we go..."
    },
    {
        "character": "Cartman",
        "line": "Stay- stay back! Nobody moves, you got that?! [moves into the main area of the restaurant] Don't... touch us! We know what the Chinese are up to! We saw the Olympic Opening Ceremonies! [a couple stops eating] The gig is up! Everyone just s-step over to that wall! [points to his right] I mean it! Butters, hold this gun on them. [pulls a gun from a pocket and hands it to Butters]"
    },
    {
        "character": "Butters",
        "line": "A gun?"
    },
    {
        "character": "Cartman",
        "line": "Hold the gun on them Butters!"
    },
    {
        "character": "Butters",
        "line": "I don't want a gun, Eric!"
    },
    {
        "character": "Cartman",
        "line": "They're taking over our country, Butters! This is life or death now! Help! Me!"
    },
    {
        "character": "Butters",
        "line": "Oh jeez..."
    },
    {
        "character": "Cartman",
        "line": "Everyone get up and go over to that wall! Do it! Move! [the guests rise from their seats with their hands up and move over to the wall Cartman pointed to] We, are the American Liberation Front! And you are ALL going to pay for betraying your country to the Chinese!"
    },
    {
        "character": "Patron",
        "line": "This is stupid. I'm leaving!"
    },
    {
        "character": "Cartman",
        "line": "Nobody is going anywhere until the police arrive!"
    },
    {
        "character": "Patron",
        "line": "[walks towards the front doors] Screw you!"
    },
    {
        "character": "Cartman",
        "line": "Shoot him, Butters!"
    },
    {
        "character": "Butters",
        "line": "No!"
    },
    {
        "character": "Cartman",
        "line": "You have to shoot him, Butters! He's gonna warn all the Chinese and they're gonna kill your parents! Do it! Do it!"
    },
    {
        "character": "Butters",
        "line": "Waah! [looks away with his eyes shut and shoots at the patron. The bullet hits the patron in the groin, which splatters all over his clothes. The patron puts his hands over his crotch in pain]"
    },
    {
        "character": "Patron",
        "line": "Ow! A-Ah! A-Ooowww!"
    },
    {
        "character": "Cartman",
        "line": "Aw dude, you shot him in the dick."
    },
    {
        "character": "Butters",
        "line": "Huh?"
    },
    {
        "character": "Cartman",
        "line": "That's not cool Butters. You don't shoot a guy in the dick."
    },
    {
        "character": "Butters",
        "line": "But I was just trying to stop him, and you said-"
    },
    {
        "character": "Cartman",
        "line": "[faces him] It doesn't matter, Butters! You never shoot a guy in the dick. Everyone knows that! Shooting a guy in the dick? That's just, that's just weak. I can't believe you, Butters."
    },
    {
        "character": "",
        "line": "Stormy Weathers's office. Kyle sits in a chair facing the Stormy, who's behind his desk."
    },
    {
        "character": "Kyle",
        "line": "My name is Kyle Broflovski. My friend was raped last Memorial Day weekend. And, and I [sniffs and wipes his nose with his right hand] I'm gonna help prosecute the men responsible."
    },
    {
        "character": "Stormy",
        "line": "[looking through the paperwork] You want to bring Steven Spielberg and George Lucas to trial for raping Indiana Jones."
    },
    {
        "character": "Kyle",
        "line": "I know that I'll have to testify, that I'll have to... relive what I saw that day. [sniffs and wipes his nose with his right hand] But I can't let Spielberg and Lucas get away with it. Not this time. Even if I have to do it alone."
    },
    {
        "character": "Stan",
        "line": "You aren't alone. [he enters the room with Kenny, Clyde, and Jimmy]"
    },
    {
        "character": "Kyle",
        "line": "[gets off the chair] Stan?"
    },
    {
        "character": "Stan",
        "line": "We'll all testify. We can't let them ever do this again. [begins to cry and leans into Kyle's shoulder. Kyle consoles him and begins to cry. The other boys cry as well] I love you."
    },
    {
        "character": "Kyle",
        "line": "I love you too."
    },
    {
        "character": "Stormy",
        "line": "[interrupts the crying] Uh kids, kids, I'm sorry, but this is ridiculous."
    },
    {
        "character": "Stan",
        "line": "Wh-why?"
    },
    {
        "character": "Stormy",
        "line": "You don't have a case here. You can't really say that Spielberg and Lucas raped Indiana Jones in the new film."
    },
    {
        "character": "Kyle",
        "line": "[points at him] Did you see it?"
    },
    {
        "character": "Stormy",
        "line": "Yes I saw it, but I- [his face drops and he turns away] But I just try not to think about it."
    },
    {
        "character": "Stan",
        "line": "Then you saw what Lucas and Spielberg did to him!"
    },
    {
        "character": "Stormy",
        "line": "I don't know what I saw! [crosses his arms] All right?! I mean, it wa-it was dark in the theater... I mean... yeah, things got a little out of hand with the plot... the third act took too long, uh-"
    },
    {
        "character": "Kyle",
        "line": "Indy deserved more than that!"
    },
    {
        "character": "Stormy",
        "line": "[wheels around] GET OUT! JUST GET THE HELL OUT OF HERE! [the boys leave, and the DA slams the door shut on them. The DA returns to his desk, sits in his chair, and begins to cry. He remembers the scene this way:] No, no... [pounds his desk]"
    },
    {
        "character": "",
        "line": "a bar, night. Indy is at a pinball machine playing away"
    },
    {
        "character": "Spielberg",
        "line": "Well well, Indiana Jones. [the Stormy is playing on a different arcade game] You're looking nice. [the pinball machine the Stormy is at has a Willow theme all over; the one Indy is at has a Howard the Duck theme. Lucas has Indy pinned on the machine with his pants down. Spielberg unbuttons Indy's shirt and starts licking his nipples.]"
    },
    {
        "character": "Indy",
        "line": "Hey. Hey! [begins to wail and moan]"
    },
    {
        "character": "Spielberg",
        "line": "There you go, Lucas! Dick him! [Indy struggles to get away, but Lucas is in full control] He's gonna do it right there! All right! All right Georgie!"
    },
    {
        "character": "Lucas",
        "line": "Grab his hands, heh. [Spielberg runs up and holds Indy's hands down on the pinball machine]"
    },
    {
        "character": "Stormy",
        "line": "Hey leave him alone! [Lucas now pulls down his pants and sticks his dick in Indy's ass, firmly covering Indy's mouth with his right hand to muffle the screams.]"
    },
    {
        "character": "Spielberg",
        "line": "COME ON BIG GUY!"
    },
    {
        "character": "Indy",
        "line": "NOOO! [three men approach to see what's happening. Indy looks at them and they quickly leave. The pinball machine moves violently. A glass of beer resting on it falls and shatters. Lucas comes to climax and the strain on his face is clearly shown. The Stormy covers his eyes, and his recollection ends]"
    },
    {
        "character": "Stormy",
        "line": "Nooo... Nohoho... [pounds his desk. Moments later he opens his window as the boys leave the courthouse] Waaait! [the boys stop and look up] Wait I... want to help! [begins to cry. The boys down below begin to cry also.]"
    },
    {
        "character": "",
        "line": "P.F. Chang's, night. The diners are all up against the wall."
    },
    {
        "character": "Father",
        "line": "Look, we don't know what you're talking about. There's no Chinese plan to take over America."
    },
    {
        "character": "Cartman",
        "line": "Shaddup! These American traitors might have bought your propaganda, but not us! [police sirens are heard approaching] Oh, thank God, the police are here! We're safe! [walks towards the front doors]"
    },
    {
        "character": "Captain",
        "line": "You with the gun, step out or we will fire upon you."
    },
    {
        "character": "Cartman",
        "line": "[walks outside] No no, you got it wrong. We aren't the Chinese, we're the good gu- [notices something different. The camera shows that one of the police officers is Chinese] AAH! [runs back inside and back to Butters] Oh my God! Oh my God! Oh my God!"
    },
    {
        "character": "Butters",
        "line": "Uhwhat?"
    },
    {
        "character": "Cartman",
        "line": "[quite agitated] One of the cops is Chinese! Son of a bitch, how high up does this thing go? We can't trust anybody here, Butters! [heads to a window with Butters in tow, and opens it] Don't come any closer! We have information that we will only trust with the President of the United States!"
    },
    {
        "character": "Officer",
        "line": "The President?"
    },
    {
        "character": "Captain",
        "line": "All right men, come on. We're going in."
    },
    {
        "character": "Cartman",
        "line": "No! God damn it we're serious! We'll only talk to the President! Stop! Fire a warning shot, Butters! [Butters shuts his eyes and shoots. The Chinese officer is struck in the groin and it explodes all over his clothes]"
    },
    {
        "character": "Chinese Officer",
        "line": "[puts his hands over his crotch] Ow! Ah, o-ow! [Cartman looks on in disbelief]"
    },
    {
        "character": "Cartman",
        "line": "Dude! What the fuck are you doing?!"
    },
    {
        "character": "Butters",
        "line": "What? What happened? [looks outside the window]"
    },
    {
        "character": "Cartman",
        "line": "God damn it Butters, what did I say about shooting guys in the dick?!"
    },
    {
        "character": "Butters",
        "line": "Aw, I did it again?"
    },
    {
        "character": "Cartman",
        "line": "What the hell is wrong with you?! That is not cool, Butters! That is not cool! [looks away for a few moments, but...] You don't fucking do that! You don't shoot a guy in the dick!"
    },
    {
        "character": "Butters",
        "line": "[finally speaks up] Well okay, I'm sorry!"
    },
    {
        "character": "Cartman",
        "line": "...It's not okay! Defeating the Chinese won't mean anything if we do it by going around shooting people in the dick! [walks away] God damn it!"
    },
    {
        "character": "",
        "line": "Park County Police Station, night. Stormy and the five boys are inside"
    },
    {
        "character": "Stormy",
        "line": "It's all right there in front of you, Detective. Five sworn statements from these... brave boys. It's now up to you."
    },
    {
        "character": "Det. Yates",
        "line": "Are you nuts?! I'm not going out and arresting Steven Spielberg and George Lucas!"
    },
    {
        "character": "Stan",
        "line": "But they raped Indiana Jones!"
    },
    {
        "character": "Kyle",
        "line": "I know it's hard to think about, but you have to be strong. Remember how that movie made you feel."
    },
    {
        "character": "Det. Yates",
        "line": "I didn't see it. [the boys stay silent]"
    },
    {
        "character": "Jimmy",
        "line": "...You didn't see the new Indiana Jones movie?"
    },
    {
        "character": "Det. Yates",
        "line": "No! I don't think anybody here saw it. Did you, Mitch? [Mitch is at the window looking outside through the glass] Mitch? Mitch? [close-up on Mitch, who begins to remember... Indiana is walking through some Southern woods when he encounters two men, one with a rifle, one with a knife.]"
    },
    {
        "character": "Spielberg",
        "line": "[holding the knife] Well well, Indiana Jones. What you doin' in our neck of the woods? [menacing] Now let's see you just drop them pants!"
    },
    {
        "character": "Indy",
        "line": "Drop?"
    },
    {
        "character": "Spielberg",
        "line": "Just take 'em right off."
    },
    {
        "character": "Indy",
        "line": "Uh what do you guys want?"
    },
    {
        "character": "Lucas",
        "line": "Don't say anything, just do it. And pull off that little ol' biddy. The shirt there, too. [Indy takes off his clothes]"
    },
    {
        "character": "Spielberg",
        "line": "Them panties. Take 'em off. [Indy reluctantly removes his briefs. Spielberg turns and throws his knife into a nearby tree and goes after Indy. Indy turns and runs, but Spielberg chases him down and tackles him.] There, boy! I bet you can squeal! I bet you can squeal like a pig! [twists Indy's left ear lobe] Come on, squeal. Squeal now. Squ-squeal! [Indy tries each time, but can't do it] Weeee! Squeal."
    },
    {
        "character": "Indy",
        "line": "We-eee!"
    },
    {
        "character": "Spielberg",
        "line": "Squeal louder. Weeee!"
    },
    {
        "character": "Indy",
        "line": "[at the same time] Weee!"
    },
    {
        "character": "Spielberg",
        "line": "Louder louder! Weeee!"
    },
    {
        "character": "Indy",
        "line": "[at the same time] Weee!"
    },
    {
        "character": "Spielberg",
        "line": "Louder! Get down there boy! [has Indy on his knees and mounts him. Lucas cackles softly] Get them britches down."
    },
    {
        "character": "Indy",
        "line": "No..."
    },
    {
        "character": "Spielberg",
        "line": "Yes, sir! Come on, squeal! Weeeeee!"
    },
    {
        "character": "Indy",
        "line": "[squeezes his eyes shut] Weee!"
    },
    {
        "character": "Spielberg",
        "line": "Weeeeee! [Lucas grunts excitedly] Weeee!"
    },
    {
        "character": "Indy",
        "line": "Hawwww! Hawwww! [Mitch's recollection end and he's crying. Kyle walks up to him and consoles him]"
    },
    {
        "character": "Kyle",
        "line": "It's okay. You don't have to feel alone anymore. [Mitch begins to bawl and that sends the boys to crying]"
    },
    {
        "character": "",
        "line": "P.F. Chang's, day. The police have fallen back to their original positions"
    },
    {
        "character": "",
        "line": "P.F. Chang's, inside. Cartman is pacing the floor talking to someone on a mobile phone. No one is near him"
    },
    {
        "character": "Cartman",
        "line": "No no! You listen to me! I have Chinese attackers here! And Chinese supporters! If I go outside, there are more Chinese ready to take me down! Defending America is all that matters, Mr. President! And I will stop at nothing! You understand that I [POP. Cartman looks around, then drops the phone and runs to the source of the pop. Butters has fired the gun again. Cartman runs up to him] What happened?!"
    },
    {
        "character": "Butters",
        "line": "They uh tr-tried to come in through the roof! They were gonna take the gun."
    },
    {
        "character": "Cartman",
        "line": "Good! Did you kill him? [grins in hope]"
    },
    {
        "character": "Butters",
        "line": "Uh, not exactly."
    },
    {
        "character": "SWAT Officer",
        "line": "[his hands over his bloodied crotch] Ow. Oh, it stings. Ohhhh. [Cartman's eyelids drop halfway and he looks at Butters. Butters looks back and Cartman glances away]"
    },
    {
        "character": "Butters",
        "line": "Well it's not where I aimed, honest."
    },
    {
        "character": "Cartman",
        "line": "Dude..."
    },
    {
        "character": "Butters",
        "line": "I seriously didn't mean it."
    },
    {
        "character": "Cartman",
        "line": "Dude! [Butters looks to his right and down] You know what, Butters? You know what? Forget it. [walks off]"
    },
    {
        "character": "Butters",
        "line": "What? Uh where are you going, Eric?"
    },
    {
        "character": "Cartman",
        "line": "[near the front doors, turns around and jabs a finger at Butters] You can just deal with the Chinese invasion yourself if that's how you're gonna do it, Butters! I'm out, man."
    },
    {
        "character": "Butters",
        "line": "By, by my, by myself?"
    },
    {
        "character": "Cartman",
        "line": "I didn't sign up for this! You take your American Liberation Front and you shove it up your ass. [walks out of the restaurant in defeat towards the waiting officers] That's it. Kill me. Do whatever. I can no longer conscionably be a part of the American Liberation Front."
    },
    {
        "character": "Captain",
        "line": "Go inside! Move! [the officers rush the restaurant]"
    },
    {
        "character": "",
        "line": "A camera pans from the sky down towards a mansion. Deputies drive up in their cruisers and run to the front door. One of them pounds on the front door"
    },
    {
        "character": "Deputy 1",
        "line": "George Lucas and Steven Spielberg! We have a warrant for your arrest! [there's no response. He looks at another deputy] Break it in! [the second deputy kicks the doors in and leads the other deputies inside. They search the mansion until they reach the library, where they enter and suddenly stop. They all gasp.]"
    },
    {
        "character": "Deputy 2",
        "line": "My God. [Lucas is raping a man dressed as a Stormtrooper]"
    },
    {
        "character": "Spielberg",
        "line": "Heey, what, what the hell are you doin' here?! [Lucas stops. Moments later, Spielberg and Lucas are led out of the mansion.] You've got nothin' on us! Seven hundred million box office!"
    },
    {
        "character": "Lucas",
        "line": "Hm this is bullshit!"
    },
    {
        "character": "Stormtrooper",
        "line": "[runs away like a chicken] Weeee! Weeee!"
    },
    {
        "character": "",
        "line": "Park County Police Station. The boys await any updates about the arrest of Spielberg and Lucas. Yates and Mitch enter the waiting room"
    },
    {
        "character": "Det. Yates",
        "line": "Boys, we got 'em."
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Det. Yates",
        "line": "[puts his hands on his hips] Spielberg and Lucas, they were... raping a Stormtrooper when the police broke in."
    },
    {
        "character": "Mitch",
        "line": "And they found the dead raped bodies of Yoda and Short Round in their closet. [crosses his arms] They'll never be free to do this again. [the boys gather around the officers]"
    },
    {
        "character": "Stan",
        "line": "So, what now?"
    },
    {
        "character": "Jimmy",
        "line": "Do you think things can ever go back to n-n-n, n-no, normal after this?"
    },
    {
        "character": "Clyde",
        "line": "What do we do?"
    },
    {
        "character": "Kyle",
        "line": "We live. That's what Indy would have wanted. We just try... to live."
    },
    {
        "character": "",
        "line": "P.F. Chang's, day. The diners are all out of the restaurant. Cartman and Butters are in the middle of the street. The police still have their weapons aimed at them"
    },
    {
        "character": "Captain",
        "line": "Everyone just stay where you are until we can sort this all out."
    },
    {
        "character": "Father",
        "line": "There's nothing to sort out! These kids need to be put in jail!"
    },
    {
        "character": "Captain",
        "line": "We're going to search everyone and get statements! And the-"
    },
    {
        "character": "Officer 1",
        "line": "Sir! Sir, it's over. They got 'em."
    },
    {
        "character": "Captain",
        "line": "Got who?"
    },
    {
        "character": "Officer 1",
        "line": "Spielberg and Lucas, they... finally got them for what they did to Indiana Jones, sir. [the captain lowers his gone and suddenly hugs the officer gratefully]"
    },
    {
        "character": "Captain",
        "line": "[softly] Hohhh, they got them."
    },
    {
        "character": "Officer 2",
        "line": "They got 'em. It's over."
    },
    {
        "character": "Officer 3",
        "line": "It's over. [they hug each other]"
    },
    {
        "character": "Father",
        "line": "That means... they'll never be free to rape again."
    },
    {
        "character": "Waiter",
        "line": "It's over its over. [everyone weeps in relief and cry out \"They got 'em.\" Most of them hug each other]"
    },
    {
        "character": "Officer 4",
        "line": "I love you."
    },
    {
        "character": "Officer 5",
        "line": "I love you too. [Cartman, with a cock of his head to the right, motions to Butters to move, and they walk away. As they walk, Cartman begins discarding his costume]"
    },
    {
        "character": "Butters",
        "line": "So wait. That's it? What about the Chinese invasion?"
    },
    {
        "character": "Cartman",
        "line": "I really don't care anymore, Butters. You see, I've learned something today. As Americans our fear of seeing another country become powerful can turn us into monsters. Watching how crazy you went. Watching you just... shoot people in the dick like that. It made me realize that I want America to be safe, but not at the cost of losing its dignity. I'd rather us be... Chinese... than a nation of unethical dickshooters. [turns aside] You think about it. [turns and walks away.]"
    },
    {
        "character": "Butters",
        "line": "[just stands there for a while] ...Can't believe they put 'em in jail. And I thought that movie was pretty good. [walks off in a different direction]"
    }
]