[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The kids are in class waiting for the bell to ring. Mr. Garrison enters with some books."
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay, children, let's all take our seats. [the kids take their seats as Mr. Garrison approaches his desk and puts the books away] Before we get started today, Wendy Testaburger has asked to share something with the class. Wendy? [Clyde, Kyle, and Bradley take their seats and Wendy walks up to the front of the class. She turns to face the class and looks over at Mr. Garrison]"
    },
    {
        "character": "Wendy",
        "line": "[clears her throat] Thank you, Mr. Garrison. [reads from her notes] Fellow students, October is Awareness Month for one of the leading causes of death among women. A terrible disease that takes the lives of American women every day. I'm talking, of course, about breast cancer. [Cartman tries to contain his laughter, but it comes out anyway. Wendy is mad, but resumes her report.] An estimated one in six women will deal with cancer in their lifetime, and breast cancer is the most common- [Cartman again tries to contain his laughter]"
    },
    {
        "character": "Cartman",
        "line": "She said it again. [laughs]"
    },
    {
        "character": "Wendy",
        "line": "Is there a problem?! Because breast cancer isn't funny! Breast cancer is killing people!"
    },
    {
        "character": "Cartman",
        "line": "[enjoying his distraction] Mr. Garrison, do we really need all this potty talk in the classroom?"
    },
    {
        "character": "Mr. Garrison",
        "line": "[lowers his head and rubs his right temple] Eric, for the love of Jesus..."
    },
    {
        "character": "Wendy",
        "line": "This is a serious issue, Eric! What you're doing is very offensive!"
    },
    {
        "character": "Cartman",
        "line": "Me? You're the one talking about killer titties. [Clyde contains a giggle] Watch out, guys. Wendy said boobs can kill people. [holds his hands out as if grabbing at people] Grrr. Gonna get you. Gonna get you, Wendy!"
    },
    {
        "character": "Butters",
        "line": "I don't wanna get killed by boobs."
    },
    {
        "character": "Wendy",
        "line": "Will somebody do something? Every week he gets worse and nobody does anything!"
    },
    {
        "character": "Mr. Garrison",
        "line": "[flatly] Eric, stop being offensive."
    },
    {
        "character": "Cartman",
        "line": "I'm just trying to engage Wendy in a constructive dialogue about breast cancer awareness, Mr. Garrison."
    },
    {
        "character": "Wendy",
        "line": "[irritated] No, you aren't!"
    },
    {
        "character": "Cartman",
        "line": "Wendy, you need to calm down. You're gonna get your boobs all angry and they're gonna start killing everyone. [the other boys laugh. He joins them] Dude, I'm on fire today!"
    },
    {
        "character": "",
        "line": "The school hallway, later. Wendy puts up a Breast Cancer Awareness poster up next to the drinking fountain. Other kids walk here and there, and Cartman appears"
    },
    {
        "character": "Cartman",
        "line": "Look out, everyone. There's some killer titties on the loose. [points to the ceiling] Could've swore I heard them coming through the roof. [Wendy turns and glares at him. Cartman talks into an imaginary walkie talkie] \"Pssht! Officer! We need to get an APB out on those titties! They're armed and dangerous!\" [Wendy suddenly gets in Cartman's face]"
    },
    {
        "character": "Wendy",
        "line": "What is your problem? Breast cancer isn't funny."
    },
    {
        "character": "Cartman",
        "line": "Not at all. [cups his hands again as if they're killer titties] \"Wendy, we're gonna get you, Wendy. We're your boobs, we're gonna kill you!\""
    },
    {
        "character": "Wendy",
        "line": "[points to him] You'd better shut up [lowers her right arm] or I'll make you shut up!"
    },
    {
        "character": "Cartman",
        "line": "Oho, really? What are you gonna do about it, Wendy?"
    },
    {
        "character": "Wendy",
        "line": "I'm gonna kick your ass! That's what I'm gonna do!"
    },
    {
        "character": "Cartman",
        "line": "Haha, you're gonna kick my ass?"
    },
    {
        "character": "Wendy",
        "line": "That's right, I'm gonna kick your ass!"
    },
    {
        "character": "Cartman",
        "line": "[begins to act like a gangbanger] You wanna throw down, dawg? I'll throw down."
    },
    {
        "character": "Wendy",
        "line": "You think you're tough?"
    },
    {
        "character": "Cartman",
        "line": "[takes what looks like a gang pose] Whassup? [takes another one] Whassup?"
    },
    {
        "character": "Wendy",
        "line": "I'll smack the shit out of you!"
    },
    {
        "character": "Cartman",
        "line": "Standing right here, let's go, bitch."
    },
    {
        "character": "Wendy",
        "line": "After school! We fight after school! You got that?!"
    },
    {
        "character": "Cartman",
        "line": "You're gonna fight me after school?"
    },
    {
        "character": "Wendy",
        "line": "That's right!"
    },
    {
        "character": "Cartman",
        "line": "You're a chick, dude."
    },
    {
        "character": "Wendy",
        "line": "As soon as that bell rings, we do it outside, you got that?! And you better be there."
    },
    {
        "character": "Cartman",
        "line": "[poses again] Oh, it's on, bitch!"
    },
    {
        "character": "Wendy",
        "line": "You're gonna [jabs at the floor for emphasis] fucking die! [turns and walks away. Cartman strikes a few more poses]"
    },
    {
        "character": "Butters",
        "line": "Wendy and Eric are fightin' after school! Hey, everybody! [goes forth to spread the news. He walks by Stan, Kyle, and Bebe] Wendy and Eric are fightin' after school!"
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Bebe",
        "line": "Wow. [goes forth to spread the news among the girls. She walks into the girls' bathroom and announces] Wendy and Cartman are gonna fight after school!"
    },
    {
        "character": "Girls",
        "line": "[separately] Really? Wow."
    },
    {
        "character": "",
        "line": "The kindergarten room. Kindergartners are playing with toys when Ike walks in"
    },
    {
        "character": "Ike",
        "line": "[faltering a bit] Wendy and Cartman are fighting after school. [the other kindergartners jump for joy]"
    },
    {
        "character": "Kindergartners",
        "line": "Yaaay!"
    },
    {
        "character": "",
        "line": "South Park Elementary, behind the cafeteria. The Goth kids are idling around. Henrietta is reading from her book"
    },
    {
        "character": "Red",
        "line": "[opens the door and says] Hey, emo kids, Cartman and Wendy are gonna fight after school. [goes back inside and closes the door]"
    },
    {
        "character": "Pete",
        "line": "[flips his hair out of his eyes] Did she just call us emos?"
    },
    {
        "character": "",
        "line": "The cafeteria. Most of the kids are eating lunch. At the center table are eight boys: Kenny, Clyde, Cartman, Butters, Jimmy, Tolkien, Craig, and Jason"
    },
    {
        "character": "Butters",
        "line": "Jeez, I can't believe Wendy's gonna fight you after school."
    },
    {
        "character": "Tolkien",
        "line": "She is pissed off."
    },
    {
        "character": "Cartman",
        "line": "She is not gonna show up to a fight, dawg. I'm sure she's already trying to figure a way to get out of it."
    },
    {
        "character": "Clyde",
        "line": "[taps Cartman twice on the right arm] Hey, check it out. She's totally staring you down. [Cartman leans to the right a bit to get a better view. Craig, Tolkien, and Jimmy look back at the table behind them. Wendy stares back. There are six other girls at her table: Bebe to her right, Lola and Heidi to her left, Esther opposite Bebe, Anne opposite Lola, and Millie opposite Heidi. There's no one seated opposite Wendy, so she has a clear view. Bebe leans over and whispers something to her. Cartman smiles, but the smile turns into worry] She sure seems confident. You should probably go easy on her, dude. You don't wanna put her in the hospital or anything."
    },
    {
        "character": "Cartman",
        "line": "Yeah, I'm just gonna teach her a lesson. I'm not gonna totally... kick her ass. [Cartman looks at Wendy again, and Wendy stares back. She makes a fist with her right hand and punches the open palm of her left hand.]"
    },
    {
        "character": "Jimmy",
        "line": "Can't go too easy on her though. God forbid she actually gets in a good good punch and... beats ya."
    },
    {
        "character": "Butters",
        "line": "Yeah, heh. [grabs his milk carton] If you got beat up by a girl, everyone would think you were a faggot. [takes a sip of milk through a straw and sets the carton down. Cartman begins to panic, looks around, and looks again at Wendy. Her face becomes the only thing he sees]"
    },
    {
        "character": "",
        "line": "South Park Elementary, after lunch. In the hallway, Wendy puts away her books. Cartman finds her and walks up to her"
    },
    {
        "character": "Cartman",
        "line": "Wendy, could I talk to you for a second?"
    },
    {
        "character": "Wendy",
        "line": "What?!"
    },
    {
        "character": "Cartman",
        "line": "[almost whispering] Wendy, I want to apologize, and, um, tell you that-"
    },
    {
        "character": "Wendy",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "[takes her aside and whispers] I want to apologize, and tell you that... I'm sorry for what I said. Okay? It was wrong of me, and I promise you that it won't happen again. I don't wanna fight you after school, all right? So, I'm sorry."
    },
    {
        "character": "Wendy",
        "line": "If you're really sorry, you can say it in front of everyone!"
    },
    {
        "character": "Cartman",
        "line": "[takes her aside further and whispers] Actually, I was thinking... let's just keep this between us. I was wrong to make fun of breast cancer, and I'm very remorsefulness."
    },
    {
        "character": "Wendy",
        "line": "No! If you're really sorry, and you wanna apologize to me, then do it in front of everyone."
    },
    {
        "character": "Cartman",
        "line": "[seeing the unwanted attention] Pfft, apologize?! [begins to strike poses] That's not what I said, you dumb bitch. Heheh, heheh."
    },
    {
        "character": "Wendy",
        "line": "Yes, you did! You just stood there and said you apologize and you don't want to fight!"
    },
    {
        "character": "Cartman",
        "line": "Oh, Wendy, such a desperate attempt to get out of it. These students are a little too smart to see you're just making excuses not to fight me."
    },
    {
        "character": "Wendy",
        "line": "I don't want an excuse! I'm going to beat the fucking shit out of you!"
    },
    {
        "character": "Cartman",
        "line": "[trying to put up a front] Ohhh, ahhhh... That's funny. You're gonna die, you lesbo. [Wendy goes back to her locker, the other kids go their separate ways. Wendy shuts her locker door and Cartman races up to her again. He whispers] Wendy, seriously though, I do want to apologize. I'm really sorry and I don't think we should fight."
    },
    {
        "character": "Wendy",
        "line": "Get away from me! [walks away]"
    },
    {
        "character": "",
        "line": "Another part of the hallway. The Goth kids are walking along and notice Stan at his locker. They approach him "
    },
    {
        "character": "Michael",
        "line": " So, everyone's saying there's gonna be a fight between Eric Cartman and your girlfriend."
    },
    {
        "character": "Stan",
        "line": "I guess so."
    },
    {
        "character": "Pete",
        "line": "And you're gonna... just let that guy... beat up on your woman? Doesn't that, like, go against your jockey man code or something? [flips his hair]"
    },
    {
        "character": "Michael",
        "line": "Yeah, I don't ever remember AC/DC singing about letting dudes beat up on their girlfriends."
    },
    {
        "character": "Stan",
        "line": "What am I supposed to do about it? [Craig and Jimmy walk up to him]"
    },
    {
        "character": "Craig",
        "line": "Don't worry, Stan, I don't think the fight's even gonna happen. Cartman said that Wendy's already begging him to call it off."
    },
    {
        "character": "Jimmy",
        "line": "I'll bet she is!"
    },
    {
        "character": "Butters",
        "line": "[walks into view] Ah, I hope not! I wanna see Eric kick the crap out of her! [performs some punching moves]"
    },
    {
        "character": "",
        "line": "Another part of the hallway. Wendy's walking along when a door opens to her left "
    },
    {
        "character": "Cartman",
        "line": "[peers out from the doorway] Wendy. Wendy, psst."
    },
    {
        "character": "Wendy",
        "line": "What?!"
    },
    {
        "character": "Cartman",
        "line": "Psst real, real quick. Just psst, real quick. [Wendy goes into the room Cartman was hiding in, which is a storage room. Once inside, she looks around, taking it all in.] Wendy, you're not gonna believe this. [She turns and glares at him] I just found out my mom has breast cancer. [she glares harder] Man, I sure got what was coming to me! I was a real jerk, and now they're gonna cut off my mom's boobs."
    },
    {
        "character": "Wendy",
        "line": "You really think that's gonna work on me?!"
    },
    {
        "character": "Cartman",
        "line": "Wendy, [pulls out a letter-sized envelope] I have here twenty-seven dollars in cash. If you just call off the fight, then I-"
    },
    {
        "character": "Wendy",
        "line": "You can't bribe your way out of this!"
    },
    {
        "character": "Cartman",
        "line": "[puts his left hand up to hold her back] Wendy, I have muscular dystrophy."
    },
    {
        "character": "Wendy",
        "line": "No, you don't."
    },
    {
        "character": "Cartman",
        "line": "[thinks for a moment] My mom has muscular dystrophy. In her boobs."
    },
    {
        "character": "Wendy",
        "line": "You don't get it, asshole! [shoves him back a bit] There is nothing you can do to stop this fight! I am going to wipe the playground with you right in front of everyone! I am going to shove your ass down your throat and make you eat your underwear!"
    },
    {
        "character": "Cartman",
        "line": "Eat my underwear?"
    },
    {
        "character": "Wendy",
        "line": "That's right."
    },
    {
        "character": "Cartman",
        "line": "[walks a few steps away] Okay. Okay, Wendy, I will eat my underwear. Right here, right now."
    },
    {
        "character": "Wendy",
        "line": "Jesus Christ, do you have no sense of self-respect?!"
    },
    {
        "character": "Cartman",
        "line": "No. U-unless you want me to. You want me to have self-respect, then I will."
    },
    {
        "character": "Wendy",
        "line": "You fucking suck so hard!"
    },
    {
        "character": "Cartman",
        "line": "I'll eat my underwear, Wendy. [unzips his pants.] And then you'll be satisfied. We can put this whole thing behind us."
    },
    {
        "character": "Wendy",
        "line": "What are you doing?! [Cartman takes off his underwear]"
    },
    {
        "character": "Cartman",
        "line": "I'm committed to peace, Wendy. [begins to swallow his underwear] I want you to see just how humbled I am... [gags]"
    },
    {
        "character": "Wendy",
        "line": " Ew! [looks away]"
    },
    {
        "character": "Cartman",
        "line": "[rather muffled] Euugh. Wendy? Look at me, Wendy. [tries one last swallow and succeeds] There. Yeahm."
    },
    {
        "character": "Wendy",
        "line": "Oh my God!"
    },
    {
        "character": "Cartman",
        "line": "So... [turns to face her] are we cool?"
    },
    {
        "character": "Wendy",
        "line": "No!"
    },
    {
        "character": "Cartamn",
        "line": "I ate my underwear! [advances. Wendy backs up] What the hell do you want from me?! [advances again. Wendy backs up, then runs around Cartman towards the door. He can't turn fast enough to match her] Weh-"
    },
    {
        "character": "Wendy",
        "line": "[opens the door] You are so pathetic!"
    },
    {
        "character": "Cartman",
        "line": "[throws himself at her mercy] Wendy it isn't fair! [she runs out of there quickly] I ate my underwear for you! Nooo! [Craig walks by and stops to look in] Yo, what's up dawg?"
    },
    {
        "character": "",
        "line": "The boys' bathroom. Stan enters. Cartman rushes in behind him"
    },
    {
        "character": "Cartman",
        "line": "Stan, Stan! Dude, we need to talk."
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "You know, Wendy and I are supposed to fight in like three hours."
    },
    {
        "character": "Stan",
        "line": "Yeah?"
    },
    {
        "character": "Cartman",
        "line": "Dude, aren't you worried? Wendy's a girl. She could end up getting really hurt, Stan. You're my bro and she's your bitch. I don't wanna hurt my bro's bitch."
    },
    {
        "character": "Stan",
        "line": "I can't do anything; she really wants to fight you. [moves towards the stalls, but Cartman runs up ahead of him and stops him]"
    },
    {
        "character": "Cartman",
        "line": "Nu-no, she doesn't. She told me she doesn't wanna fight. She's just stuck, Stan. Because she knows I'm gonna kick her ass, but she feels like if she doesn't fight me all the kids are gonna call her a chicken."
    },
    {
        "character": "Stan",
        "line": "Really?"
    },
    {
        "character": "Cartman",
        "line": "You know what she did? She apologized and begged me not to fight her. I said \"Well, Wendy, if you're so sorry, then say it in front of everyone.\", but she wouldn't. That's how desperate she is. Man, you have to do something, Stan. You have to be a fuckin' man and forbid her from fighting, so she has a way- [his gag reflex kicks in and his underwear comes back up his throat and out of his mouth. Stan looks on a bit stunned as Cartman pulls his underwear the rest of the way out, then glances back and forth at his underwear and at Stan] Oh, that's where I put those. [puts his underwear into a back pocket] Anyway, Stan, you've got to put a stop to this fight. Wendy's stuck and she needs you."
    },
    {
        "character": "Stan",
        "line": "Dude, there's nothing I can do about it."
    },
    {
        "character": "Cartman",
        "line": "[runs to Stan's left, by the sinks] God, you are such a pussy, Stan! You're such a pussy! When I hurt Wendy, it's gonna be on your fucking head! [his underwear is hanging from his right hand. Cartman notices, then runs out of the bathroom. Stan looks down helplessly]"
    },
    {
        "character": "",
        "line": "South Park Elementary, near the end of the school day. Garrison is at the front of the class giving a lecture"
    },
    {
        "character": "Mr. Garrison",
        "line": "And so you see, at this point Euripides knew he could not win the battle. [Cartman glances at the clock on the wall: 2:58 p.m. His fingers drum the desk softly as he looks ahead blankly remembering Wendy's words: \"I am going to wipe the playground with you right in front of everyone!\" Then Butters': \"If you got beat up by a girl, everyone would think you were a faggot.\"] All right kids, for your homework tonight I want you all to read chapters seven... [Cartman begins to block everything out except Wendy and the wall clock: 2:58 p.m. Wendy's ready to fight.]"
    },
    {
        "character": "Bebe",
        "line": "Kick the shit out of him, Wendy!"
    },
    {
        "character": "Jimmy",
        "line": "As soon as the bell rings, we've gotta get out there and find a good place to watch the fi-fufu-fight. [As the wall clock draws towards 3 p.m. Cartman thinks \"There's no way out. She's gonna kick my ass in front of everyone.\"]"
    },
    {
        "character": "Butters",
        "line": "Almost time. [smiles]"
    },
    {
        "character": "Mr. Garrison",
        "line": "And be ready for a quiz tomorrow morning."
    },
    {
        "character": "Clyde",
        "line": "I totally can't see the fight, dude. I have detention after school."
    },
    {
        "character": "Cartman",
        "line": "[a revelation] Detention! That's it! [begins to fidget: \"I've gotta get detention, fast!\" The minute hand hits 0 and Cartman runs out of his seat towards the front of the class. He gets on Mr. Garrison's desk, shoves the Homework Assignments holder off the desk, lowers his pants, and leaves a nice brown gift on the desk. Mr. Garrison looks at him. The class is stunned as Cartman looks back at Mr. Garrison]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Eric, did you just take a crap on my desk?"
    },
    {
        "character": "Cartman",
        "line": "[strikes some gang poses] Whassup? Whassup? Crapped on your desk, dawg. What's up with that? [Wendy's especially shocked. No one says a word until...]"
    },
    {
        "character": "Butters",
        "line": "[cocks his head to his right] Huh."
    },
    {
        "character": "",
        "line": "The school library. Five kids are in detention there, and Mr. Mackey is looking after them"
    },
    {
        "character": "Mr. Mackey",
        "line": "Welcome to detention, m'kay? You are here until your parents come and pick you up. Use your time to study. [walks away]"
    },
    {
        "character": "Cartman",
        "line": "[puts his feet up on the table and his hands behind his head, certain he's gotten out of the fight with Wendy] Ahhh, sweet."
    },
    {
        "character": "Butters",
        "line": "[a door opens and his voice is heard] Eric. Hey Eric. [the camera shows Butters motioning Cartman over. Craig and Jimmy are behind him. Cartman looks over at them, then leaves his seat and walks to the door] Eric, wha-what's goin' on? Everyone is startin' to say you got detention on purpose to get out of fightin' Wendy."
    },
    {
        "character": "Cartman",
        "line": "What?! That's ridiculous!"
    },
    {
        "character": "Butters",
        "line": "But some people think you crapped on Teacher's desk, uh, to get out of the fight."
    },
    {
        "character": "Cartman",
        "line": "That's not why I did it."
    },
    {
        "character": "Craig",
        "line": "Then why'd you crap on Garrison's desk?"
    },
    {
        "character": "Cartman",
        "line": "[begins to pose] Because I'm hardcore. You know, I'm I'm antiestablishment. That's how I roll, dawgs. I do hardcore stuff like that."
    },
    {
        "character": "Butters",
        "line": "That's what I said. I told everyone outside, \"Cartman ain't scared of fightin' Wendy! He'd do it if he could!\"."
    },
    {
        "character": "Cartman",
        "line": "Damned straight! I just got all punk rock and got detention, you know! I'm just a bad dude."
    },
    {
        "character": "Craig",
        "line": "Okay, that's good, because we moved the fight to first thing in the morning tomorrow."
    },
    {
        "character": "Jimmy",
        "line": "Before school starts. Everyone's gonna get there early."
    },
    {
        "character": "Cartman",
        "line": "[shocked] Huh?"
    },
    {
        "character": "Butters",
        "line": "That way it won't matter if you get detention."
    },
    {
        "character": "Mr. Mackey",
        "line": "[finds him] Eric, get your buns back over here, m'kay?!"
    },
    {
        "character": "Jimmy",
        "line": "Wendy said she'd be here an hour before school starts. See you in the morning, ch-ch-ch-champ! [they walk away and the doors close. Cartman stands there for a moment, then returns to his seat. There's a rapping at the window and Cartman looks over]"
    },
    {
        "character": "Wendy",
        "line": "[outside] Tomorrow morning! You fucking die tomorrow morning! [walks away. Cartman is truly scared]"
    },
    {
        "character": "",
        "line": "Wendy's room, night. She's doing math homework"
    },
    {
        "character": "Mrs. Testaburger",
        "line": "Wendy?"
    },
    {
        "character": "Wendy",
        "line": "Yeah?"
    },
    {
        "character": "Mrs. Testaburger",
        "line": "We need to talk to you, right now. [Wendy leaves her chair and her room, and goes downstairs. Her parents are waiting for her, quite displeased and upset as they confront their daughter] Wendy, have you been bullying kids at school?"
    },
    {
        "character": "Wendy",
        "line": "What? No!"
    },
    {
        "character": "Mrs. Testaburger",
        "line": "Well, do you want to explain why this little boy's mother had to come talk to us? [Wendy looks and sees Cartman and Liane seated on the sofa. Cartman is sobbing quietly]"
    },
    {
        "character": "Mr. Testaburger",
        "line": "Did you tell this little boy you were going to beat him up?"
    },
    {
        "character": "Wendy",
        "line": "You don't understand. He said horrible things."
    },
    {
        "character": "Cartman",
        "line": "[whining] The, the thing is, I totally said I was sorry, but she still wants to beat me up. [cries into Liane's sweater. She soothes him]"
    },
    {
        "character": "Mrs. Testaburger",
        "line": "Wendy, no matter what a person says, you don't respond with violence. Haven't we taught you that?"
    },
    {
        "character": "Cartman",
        "line": "The thing is, Wendy, I really think you're awesome, and I know I'm just a nerdy little weakling to you, but I want to be your friend because I don't have that many friends at schooooooooooool. [cries into Liane's sweater. She soothes him again]"
    },
    {
        "character": "Mrs. Testaburger",
        "line": "Wendy, you tell this little boy you aren't going to hurt him."
    },
    {
        "character": "Wendy",
        "line": "Mom, you don't-"
    },
    {
        "character": "Mrs. Testaburger",
        "line": "Now, young lady!"
    },
    {
        "character": "Wendy",
        "line": "I'm not going to hurt you."
    },
    {
        "character": "Mr. Testaburger",
        "line": "If there is any word of you fighting at school it is over for you, missy! Do you understand?!"
    },
    {
        "character": "Wendy",
        "line": "Yes, sir."
    },
    {
        "character": "Mrs. Testaburger",
        "line": "We're so sorry about this, Ms. Cartman."
    },
    {
        "character": "Liane",
        "line": "Oh no, thank you so much for your time. [Cartman looks at Wendy, then makes faces at her and sticks both middle fingers up at her. Wendy blushes with fury, but can't do anything now]"
    },
    {
        "character": "Mr. Testaburger",
        "line": "It really won't happen again."
    },
    {
        "character": "Liane",
        "line": "You're very sweet. Thank you again. Come on, muffin. [stops making faces and looks up at her, then joins her as she walks to the front door]"
    },
    {
        "character": "Cartman",
        "line": "Okay, Mommy. Mama, Mama."
    },
    {
        "character": "",
        "line": "South Park Elementary, before school. The fourth graders are all there, with Cartman front and center. Craig and Butters stand by his side as he faces the road"
    },
    {
        "character": "Butters",
        "line": "Man it's almost time for school to start an' Wendy still isn't here."
    },
    {
        "character": "Cartman",
        "line": "Yeah, I don't know what's going on. I mean, I showed up."
    },
    {
        "character": "Bebe",
        "line": "Where is she? How come Wendy's not showing up for the fight?"
    },
    {
        "character": "Stacy",
        "line": "Here she comes! [everyone looks to their right and see Wendy approaching.]"
    },
    {
        "character": "Cartman",
        "line": "[begins to strike poses as Wendy walks by] What's up, Wendy? I thought we were meeting early to fight."
    },
    {
        "character": "Wendy",
        "line": "[stops and looks at him] You know I can't fight you!"
    },
    {
        "character": "Cartman",
        "line": "Why not? You chicken? [begins to strut and cluck like a chicken]"
    },
    {
        "character": "Wendy",
        "line": "I can't fight you because you came crying to my house last night with your mom!"
    },
    {
        "character": "Cartman",
        "line": "Pfffft. Aw, that's a doozie, Wendy! You come up with that one on your own?!"
    },
    {
        "character": "Butters",
        "line": "Hehehe yeah, did you come up with that one on your own?!"
    },
    {
        "character": "Cartman",
        "line": "I ain't frontin' dawg! Let's do this! Let's do it right now, yo."
    },
    {
        "character": "Bebe",
        "line": "Come on, Wendy, kick his ass!"
    },
    {
        "character": "Wendy",
        "line": "I can't! [the school bell rings and she walks towards the building] God damn it!"
    },
    {
        "character": "Butters",
        "line": "She chickened out!"
    },
    {
        "character": "Other students",
        "line": "Aw, man. [they follow her into the building and towards class]"
    },
    {
        "character": "Cartman",
        "line": "Told you guys."
    },
    {
        "character": "Stan",
        "line": "Ugh, I'm glad that's over with."
    },
    {
        "character": "Pete",
        "line": "[walking by with the other Goths] Yeah, I guess you've dodged a bullet, Galahad."
    },
    {
        "character": "Jimmy",
        "line": "I always knew deep down that Wendy didn't have any ba-ba-balls."
    },
    {
        "character": "",
        "line": "Mr. Garrison's class, morning. Clyde is presenting his report before the class"
    },
    {
        "character": "Clyde",
        "line": "And so, we must all recycle. Every day. Recycling is important, and it will save our planet, Earth. The End. [the class applauds politely as he takes his seat. Wendy has her face buried in her arms]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Very nice, Clyde. Okay, we have time for one more report before recess. Who'd like to go? [Cartman smiles and silently raises his hand] Okay Eric. [Cartman happily gets out of his seat and goes to face the class]"
    },
    {
        "character": "Cartman",
        "line": "[clears his throat] Thank you. My report today is on breast cancer awareness. [Wendy lifts her head up in surprise] I do not believe enough is being done, and, like the victims of breast cancer, there's something I'd like to get off my chest. [stifles a laugh] We all must fight, and hopefully one day, titty cancer will be a distant mammary. [stifles a laugh again]"
    },
    {
        "character": "Wendy",
        "line": "[softly] You unbelievable bastard. You beat me but you won't stop."
    },
    {
        "character": "Cartman",
        "line": "What did the breast cancer say to the Polish monkey?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay, Eric, that's enough, you smartass!"
    },
    {
        "character": "Wendy",
        "line": "Why?! [leaves her seat and walks up to Cartman] Why are you doing this to me?! [grabs him by the collar and shakes him] Why won't you just stop?!"
    },
    {
        "character": "Cartman",
        "line": "[cautioning] Wendy, Wendy."
    },
    {
        "character": "Principal Victoria",
        "line": "[through the school's PA system] Wendy Testaburger to the principal's office please? Wendy Testaburger to the principal's office."
    },
    {
        "character": "Wendy",
        "line": "God! [Cartman cackles as she leaves]"
    },
    {
        "character": "",
        "line": "The Principal's office, moments later. Wendy stands before Principal Victoria"
    },
    {
        "character": "Principal Victoria",
        "line": "Wendy, I've been hearing rumors about a fight between you and Eric Cartman."
    },
    {
        "character": "Wendy",
        "line": "No, ma'am, there isn't going to be a fight."
    },
    {
        "character": "Principal Victoria",
        "line": "Oh no? Are you sure?"
    },
    {
        "character": "Wendy",
        "line": "Yes, ma'am."
    },
    {
        "character": "Principal Victoria",
        "line": "I see. [gets up and walks to the window and looks out] I've noticed all the things you've done for Breast Cancer Awareness Month. Did you know I'm a breast cancer survivor?"
    },
    {
        "character": "Wendy",
        "line": "Ma'am?"
    },
    {
        "character": "Principal Victoria",
        "line": "I was diagnosed seven years ago. Cancer is... pure evil. It is a fat little lump that needs to be... destroyed. [Faces Wendy] When there is a cancer, you have to \"fight\" it. You can't reason with cancer, you can't wish it away. Cancer doesn't play by the rules, so neither can you."
    },
    {
        "character": "Wendy",
        "line": "[thinks a moment] My... parents said that if I fight-"
    },
    {
        "character": "Principal Victoria",
        "line": "And you can't listen to what anybody else tells you. [turns back to the window] You have to be willing to give up everything, because the cancer will [turns back to Wendy] take everything. Do you understand?"
    },
    {
        "character": "Wendy",
        "line": "[the look of determination appears on her face and she makes her hands into fists] Yes, ma'am!"
    },
    {
        "character": "Principal Victoria",
        "line": "When you have cancer you fight, because it doesn't matter if you beat it or not. You refuse to let that fat little lump make you feel powerless!"
    },
    {
        "character": "",
        "line": "The hallway. Bebe bursts through some doors and walks down the hall"
    },
    {
        "character": "Bebe",
        "line": "She's gonna fight! Wendy's gonna fight Cartman right now!"
    },
    {
        "character": "Millie",
        "line": "What? [the other kids in the hall turn and everyone heads outside. Other classes hear about this and clear out, chattering all the while. Wendy leads the pack towards the playground. While still in the building she takes off her jacket and throws it aside. On her blouse is a purple prancing unicorn connected to some orange stars by a yellow rainbow]"
    },
    {
        "character": "",
        "line": "The playground. Cartman and the other boys toss the football at each other."
    },
    {
        "character": "Cartman",
        "line": "Go deep, Craig. [throws the football at Craig, who is off-screen] Not that deep, retard!"
    },
    {
        "character": "Butters",
        "line": "[runs up to Cartman smiling] She's coming! She's coming!"
    },
    {
        "character": "Cartman",
        "line": "Butters, get out of here!"
    },
    {
        "character": "Butters",
        "line": "But Wendy's coming to fight you."
    },
    {
        "character": "Cartman",
        "line": "[in disbelief] ...Huh? [Butters turns left and looks at the building, smiling. Cartman looks to his right. The side doors fly open and Wendy walks down the steps spoiling for a fight. The students cheer her on as she turns left and heads for the playground. Some girls trail behind her, Bebe being the first among them.]"
    },
    {
        "character": "Clyde",
        "line": "Oh boy here we go!"
    },
    {
        "character": "Butters",
        "line": "All right! [other kids chatter around them. The Goth kids find some good spots along the brick wall. Red Goth and Kindergoth sit atop the wall, Tall Goth and Henrietta remain on the ground next to it]"
    },
    {
        "character": "Pete",
        "line": "It's about freaking time. [Wendy walks up to Cartman and they face off]"
    },
    {
        "character": "Craig",
        "line": "All right, let's DO IT!"
    },
    {
        "character": "Cartman",
        "line": "[wavering] What- what's up? [begins posing] What what's up? [draws close to her and cautions in a whisper] Wendy, don't forget: I'll tell my mom on you."
    },
    {
        "character": "Wendy",
        "line": "I don't care! [Cartman looks around. Butters gleefully dances in place waiting for the fight to start]"
    },
    {
        "character": "Cartman",
        "line": "Um, recess is almost over, I don't I don't know if there's really time."
    },
    {
        "character": "A Girl",
        "line": "Shut up and fight! [everyone else joins in the demand. Wendy ties her hair up in a small bun behind her head]"
    },
    {
        "character": "Cartman",
        "line": "Alright, fine Wendy! I'll fight you, you big bully! [takes off his jacket and tosses it aside]"
    },
    {
        "character": "",
        "line": "The fighters dance around each other until Wendy lands a right cross. Cartman spins around and falls on his back. Wendy dances around and Cartman stands up, pulling up his pants in the process. Wendy lands two left jabs on Cartman's face, and Cartman finally responds with a right punch. It's strong enough to make Wendy stagger backwards"
    },
    {
        "character": "Kids",
        "line": "Ohhhhh!"
    },
    {
        "character": "",
        "line": "Cartman lands another punch on Wendy's face, then continues with a series of alternating punches, forcing Wendy backwards and into the crowd. Cartman lands a punch strong enough to send Wendy into the jungle gym, then continues punching her there. Wendy eventually catches one of his punches and outmuscles him, throwing Cartman into the jungle gym, then driving his face into one of the bars at least twice, and Cartman begins to bleed. The crowd is loving it, cheering her on. Wendy now delivers a long series of alternating punches, forcing Cartman back across the playground and into a hobby elephant. Cartman puts his arms up to deflect the punches, but it's ineffective."
    },
    {
        "character": "Butters",
        "line": "Fuck him up, Wendy!"
    },
    {
        "character": "",
        "line": "Cartman finally tosses Wendy off him and throws a punch at her, but she punches faster, making him miss. She then punches him on the right temple, and Cartman wobbles a bit. As he recovers, Wendy delivers the finishing blow: a fierce right cross that turns Cartman's head around and sends his body flying. The scene is frozen in time and the various reactions are shown: Stan, Kyle, Tweek, and Jimmy are cheering Wendy on. Jimmy has his right crutch up in the air, cheering. Butters is swooning while the boys around him just watch the fight. Time speeds up and Cartman falls to the ground, losing a tooth. Wendy kicks him a few times for good measure. She runs out of strength, staggers backwards, and drops down on her ass, exhausted."
    },
    {
        "character": "Mr. Mackey",
        "line": "[just arriving] Wendy?"
    },
    {
        "character": "Wendy",
        "line": "[pants and looks back at Mr. Mackey] I'm finished! [gets up and walks away. The girls look at her with astonishment]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Eh, somebod - somebody call the principal! [Cartman gets up, sniffling. Some of the kids begin to leave. Cartman looks around]"
    },
    {
        "character": "Cartman",
        "line": "[demoralized] You don't have to say anything. I know how it is. I'm no longer the cool kid. Now you all think I'm a fahahahahahag. [begins to wail] My school life is over 'cause now all the guys don't think I'm coooohoohoohoohoohooooool. [wails some more]"
    },
    {
        "character": "Stan",
        "line": "Dude, we never thought you were cool."
    },
    {
        "character": "Cartman",
        "line": "That's not true! You're just saying that!"
    },
    {
        "character": "Kyle",
        "line": "No, really. We've always thought you suck."
    },
    {
        "character": "Jimmy",
        "line": "Yeah, nothing's changed. Our opinion of you can't possible go any lower."
    },
    {
        "character": "Cartman",
        "line": "You're all just saying that to make me feel better."
    },
    {
        "character": "Craig",
        "line": "No, it's true. We've always hated you."
    },
    {
        "character": "Butters",
        "line": "Well, yeah."
    },
    {
        "character": "Cartman",
        "line": "Don't try and make me feel better, you guys, it isn't... Wait, wait a minute. Why would you guys be saying stuff to make me feel better? Unless... unless you do think I'm cool. [the guys look at each other, sure that Cartman misunderstood them]"
    },
    {
        "character": "Craig",
        "line": " [confused] What?"
    },
    {
        "character": "Cartman",
        "line": "[seeing a positive side to this somehow] If you're all trying to make me feel better, then you must still like me. Oh, oh phew! Oh, you had me so worried about what you guys were gonna think of me getting beat up by a girl and... it turns out you think I'm cool no matter what. Oh, oh, oh God, what a relief! [jumps up and clicks his feet up in the air] Oh, yay! [jumps up again]"
    }
]