[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Chicago, night. Barack Obama stands behind a podium facing two TelePrompTers, two glass walls, and a crowd of supporters. He has just won the Presidency."
    },
    {
        "character": "Obama",
        "line": "If there is anyone out there tonight who still doubts that America is a place where all things are possible, who still wonders if the dream of our founders is alive in our time, who still questions the power of our democracy, tonight is your answer. [a cheer goes up in the audience]"
    },
    {
        "character": "",
        "line": "The Marsh house. Randy jumps for joy while his family, including Grandpa Marsh, sits on the sofa behind him. Another couple stands behind the sofa. Gerald and Sheila sit on a second sofa. Randy and Gerald wear Obama shirts"
    },
    {
        "character": "Randy",
        "line": "Yyeeaahh!!!! [pumps his beer can up and down a couple of times] Obama! [runs around] WOOOOO! We did it! We F'in' did it!"
    },
    {
        "character": "Gerald",
        "line": "[stands up] Yyeeaahh!!!!"
    },
    {
        "character": "Obama",
        "line": "It's been a long time coming, but tonight, because of what we did on this date in this election at this defining moment, change has come to America."
    },
    {
        "character": "Randy",
        "line": "Yyeeaahh!!!! Yeah Obama! Chaaange! It's, it's chaaange!"
    },
    {
        "character": "Obama",
        "line": "Sasha and Malia, I love you both more than you can imagine, and you have earned the new puppy that's coming with us to the White House. We will name him \"Sparkles\"."
    },
    {
        "character": "Randy",
        "line": "[kneels before the TV] He's so awesome! [runs his hand over the screen a few times] He's so perfect and awesome!"
    },
    {
        "character": "Obama",
        "line": "Where we are met with cynicism, and doubt, and those who tell us that we can’t, we will respond with that timeless creed that sums up the spirit of a people: Yes We Can."
    },
    {
        "character": "Supporters",
        "line": "[in Chicago] Yes we can!"
    },
    {
        "character": "Randy",
        "line": "Yes I can! Yes I can! [the others watch him run out of the house]"
    },
    {
        "character": "",
        "line": "Outside the Marsh house. Randy opens the door and proclaims"
    },
    {
        "character": "Randy",
        "line": "Here comes the change everybody! WOOO! [people nearby gather around the front steps]"
    },
    {
        "character": "Mr. Harris",
        "line": "Did you see? Our man is in! [among the gathering crowd are Mr. Adler and the Blacks.]"
    },
    {
        "character": "Mrs. Harris",
        "line": "We did it!"
    },
    {
        "character": "Mr. Adler",
        "line": "Everything is going to be awesome now!"
    },
    {
        "character": "Randy",
        "line": "This is the greatest day of our lives! Yes we can!"
    },
    {
        "character": "Linda Black",
        "line": "I don't even know what to do now."
    },
    {
        "character": "Randy",
        "line": "I know what to do! [steps into the street and cups his hands on his cheeks so as to amplify his voice] Losers! Looosers!"
    },
    {
        "character": "",
        "line": "The Stotch house, living room. A \"Go McCain\" banner hangs over the sofa. Mr. Garrison sits on a chair, Stephen and Linda sit on the sofa with Mr. Mackey, Principal Victoria and her boyfriend sit on two chairs in front of Mr. Mackey. Most everyone there is wearing a McCain/Palin shirt or sweater"
    },
    {
        "character": "Crowd",
        "line": "[outside] Looosers! Looosers!"
    },
    {
        "character": "Stephen",
        "line": "Oh, shut up!"
    },
    {
        "character": "Crowd",
        "line": "Looosers!"
    },
    {
        "character": "Butters",
        "line": "We lost?"
    },
    {
        "character": "McCain",
        "line": "[giving his concession speech] It is natural. It's natural tonight to feel some disappointment. We fought as hard as we could, and though we fell short, the failure is mine, not yours."
    },
    {
        "character": "Supporters",
        "line": "No no! Noo nooo!"
    },
    {
        "character": "Butters",
        "line": "Aw, poor ol' John McCain. Well he looks real sad."
    },
    {
        "character": "Stephen",
        "line": "[gets up and walks to the TV] No. No, this can't happen! No! [kicks the TV screen, causing it to short and shatter]"
    },
    {
        "character": "Linda",
        "line": "Stephen!"
    },
    {
        "character": "Stephen",
        "line": "It's all over, Linda! The country as we know it is about to change. We're all dead."
    },
    {
        "character": "Linda",
        "line": "You don't know that, Stephen!"
    },
    {
        "character": "Mr. Mackey",
        "line": "With an inexperienced man as President, we do know it! He is right! Game over, man! Okay?!"
    },
    {
        "character": "Mr. Garrison",
        "line": "We'll probably be dead by sunrise!"
    },
    {
        "character": "Stephen",
        "line": "Butters, Daddy loves you. Just remember that... he always loved youuu... [someone pounds on the door. Stephen and Butters look over and the door opens. It's Randy]"
    },
    {
        "character": "Randy",
        "line": "WOOOO Obama!"
    },
    {
        "character": "Mr. Garrison",
        "line": "Get out o'here!"
    },
    {
        "character": "",
        "line": "The Marsh house. It's quiet there now. The doorbell rings and Stan answers it. He sees Kyle and Ike on the landing"
    },
    {
        "character": "Kyle",
        "line": "Dude, have you seen my parents? [Ike begins to cry]"
    },
    {
        "character": "Stan",
        "line": "No, everyone is out partying in the streets. What's wrong with your brother?"
    },
    {
        "character": "Kyle",
        "line": "He was a McCain supporter. [Ike cries harder] It's okay, Ike. Obama will do fine."
    },
    {
        "character": "",
        "line": "Chicago, Obama headquarters. It's 1:10 am and Obama steps through some double doors. The press awaits him."
    },
    {
        "character": "Reporter 1",
        "line": "Uh Mr. President, over here!"
    },
    {
        "character": "Reporter 2",
        "line": "Congratulations!"
    },
    {
        "character": "Reporter 3",
        "line": "Great start, great job!"
    },
    {
        "character": "Reporter 4",
        "line": "Change!"
    },
    {
        "character": "Reporter 5",
        "line": "Great job, Mr. President!"
    },
    {
        "character": "Reporter 6",
        "line": "Great job, Obama!"
    },
    {
        "character": "Obama",
        "line": "Thank you all for your support. If you don't mind, I'm gonna spend the rest of the evening getting some much needed rest. [steps through double doors at the other end of the hall and closes them behind him. A man walks out of the shadows as Obama turns away from the doors] Senator McCain."
    },
    {
        "character": "McCain",
        "line": "President Obama. [the two men step up and face each other, then start to giggle, then roar with laughter. They give each other a high-five and a low-five.]"
    },
    {
        "character": "McCain, Obama",
        "line": "Boom, baby!"
    },
    {
        "character": "Obama",
        "line": "Ohoh man that was perfect! [works on removing his jacket]"
    },
    {
        "character": "McCain",
        "line": "[pulls out a cell phone and starts calling someone] I almost thought we were gonna tie for a minute there. That would have screwed us."
    },
    {
        "character": "Obama",
        "line": "You played it perfectly, there was no way."
    },
    {
        "character": "McCain",
        "line": "It's McCain, we did it! Obama is President."
    },
    {
        "character": "Davis",
        "line": "Yeah, so I've heard. You guys are out of your freakin' minds, you know that?"
    },
    {
        "character": "McCain",
        "line": "Yes, we do. Assemble the rest of the team: we've only got ten hours."
    },
    {
        "character": "Davis",
        "line": "Sure. Hard part's over, right?"
    },
    {
        "character": "McCain",
        "line": "Actually, the hard part's just starting."
    },
    {
        "character": "",
        "line": "The streets of South Park. Two men set up a \"Obama for President 2008\" banner over the roof of a house. Down below are posters and banners for Obama plastered all over the houses and the crowd is partying to \"Celebration\". Randy rallies them on by blowing through a paper horn"
    },
    {
        "character": "Reveler 1",
        "line": "[gulps down a beer] Yoohoo!"
    },
    {
        "character": "Reveler 2",
        "line": "Obama yeah, I can't believe it!"
    },
    {
        "character": "Randy",
        "line": "O ba ma! O ba ma!"
    },
    {
        "character": "Revelers",
        "line": "O ba ma! O ba ma!"
    },
    {
        "character": "Randy",
        "line": "Cehhh-lebrate good Obama come on! [reaches a keg of beer and serves himself some into a mug] It's Obamobama! [someone walks by and just throws up]"
    },
    {
        "character": "",
        "line": "Stan's house. He and Kyle look at the partying going on outside. Stan is on the phone"
    },
    {
        "character": "Stan",
        "line": "Yes, I'd like to make a noise complaint. [outside the music changes to \"Who Let The Dogs Out?\" Someone swings from a traffic light and falls. A truck full of young adults rolls by]"
    },
    {
        "character": "Crowd",
        "line": "Obama!"
    },
    {
        "character": "Randy",
        "line": "Who let the Obama out? [moments later a police car rolls down the street, slowly going through the crowd] Ohoh, police are here. OooooOOOOooo!"
    },
    {
        "character": "Crowd",
        "line": "OooooOOOOooo! [Officer Barbrady stops the cruiser and hops out of it]"
    },
    {
        "character": "Barbrady",
        "line": "Okay people, time to disperse. Party's over!"
    },
    {
        "character": "Randy",
        "line": "BOOOO! [other people join in the booing]"
    },
    {
        "character": "Reveler",
        "line": "...party Obama!"
    },
    {
        "character": "Barbrady",
        "line": "Come on, time to go home."
    },
    {
        "character": "Randy",
        "line": "What are you? A McCain voter?"
    },
    {
        "character": "Crowd",
        "line": "Yeah!"
    },
    {
        "character": "Randy",
        "line": "Sorry pal, but Obama's President now! [walks towards Barbrady, and his pants begin to fall to his ankles] Obama! Obama! [walks past him and towards the police car]"
    },
    {
        "character": "Crowd",
        "line": "Obama! Obama!"
    },
    {
        "character": "Randy",
        "line": "Yeah yeah, flip the... Flip the cop car! Flip the cop car! [other revelers walk up and help out]"
    },
    {
        "character": "Barbrady",
        "line": "Ey, put down my car! [Randy and the revelers succeed in flipping the car over]"
    },
    {
        "character": "Revelers",
        "line": "Yes we can! [they move in and keep rocking the car as the music switches to \"Mickey\".]"
    },
    {
        "character": "Barbrady",
        "line": "No! No! Hey, stop it!"
    },
    {
        "character": "Stan",
        "line": "Jesus Christ..."
    },
    {
        "character": "Randy",
        "line": "O-bama you're so fine, you're so fine you blow my mind. Hey Obama! Hey Obama! [Cartman rolls by in his Big Wheels trike, pulling a cart full of TVs]"
    },
    {
        "character": "Cartman",
        "line": "Hey, you guys wanna buy a TV? [Stan and Kyle just look at each other.]"
    },
    {
        "character": "",
        "line": "Washington D.C., at the penthouse of a hotel. Obama and McCain enter a suite where the rest of their team is waiting for them. It's 2:15 am. The team members applaud them as they reach the middle of the room."
    },
    {
        "character": "Quincy",
        "line": "Bravo Obama and McCain. Ten years you two have been working on this plan and you've finally pulled it off!"
    },
    {
        "character": "McCain",
        "line": "Guys, we've all known each other a long time, had many incredible adventures, but this is going to be our greatest feat ever."
    },
    {
        "character": "Neely",
        "line": "I knew it! I knew when you two ran for President you were just working an angle."
    },
    {
        "character": "Obama",
        "line": "Always workin' the angles."
    },
    {
        "character": "McCain",
        "line": "My friends, while the entire country is busy reacting to the election, we are about to pull off the greatest heist in human history."
    },
    {
        "character": "Quincy",
        "line": "So, come on, enlighten us. What are we stealing this time? [Obama and McCain look at each other knowingly. The next scene shows a huge diamond necklace]"
    },
    {
        "character": "Obama",
        "line": "The Hope Diamond, rated #4 of the ten most precious diamonds in the world. Going street value, Middle-Eastern market, of course, two hundred and ten million dollars."
    },
    {
        "character": "Davis",
        "line": "Two hundred ten?"
    },
    {
        "character": "McCain",
        "line": "Million."
    },
    {
        "character": "Quincy",
        "line": "No no no, the Hope Diamond is ungettable. Every thief in the world knows that."
    },
    {
        "character": "Obama",
        "line": "Almost ungettable. The diamond is kept in the Smithsonian Natural History Museum, long considered to be the most thief-proof structure ever built. [Two security guards go around closing the exhibits for the night] The Diamond Wing Is protected by impenetrable walls of two-foot wide steel. On the northeast side, a seven-five laser system. [the guards walk out of a room and turn on the laser system as they exit] There's simply no side of the Smithsonian that can be breached."
    },
    {
        "character": "Davis",
        "line": "So you go in from the roof, drop into it from the top."
    },
    {
        "character": "Obama",
        "line": "Can't get it to from the top because a polymer shelf runs the entire expanse."
    },
    {
        "character": "Quincy",
        "line": "Okay, you can't get into the museum from any side and you can't drop in from above, so you can't get the diamond. [Obama walks over to the computer and turns it on, stepping aside for McCain]"
    },
    {
        "character": "McCain",
        "line": "Meet... the Presidential Escape Tunnel, [a simulation begins to play on the computer monitors] A two-mile long underground passage that runs from the White House to a location outside the city limits in case of an attack. The tunnel is only accessible from the Oval Office and just happens to travel right underneath the Smithsonian Natural History Museum."
    },
    {
        "character": "Neely, Davis",
        "line": "Boom, baby!"
    },
    {
        "character": "McCain",
        "line": "You get somebody into that tunnel, they can blast into the museum, let the others in, the heist is on."
    },
    {
        "character": "Quincy",
        "line": "So you both run for President because one of you has to win, and you've got your access to the tunnel."
    },
    {
        "character": "McCain",
        "line": "And we run on a particularly brutal campaign so that the nation is as distracted as possible over the next... eight hours."
    },
    {
        "character": "Quincy",
        "line": "This all sounds very risky."
    },
    {
        "character": "Obama",
        "line": "[walks across the floor] We've spent ten years putting this plan together. If we are indeed the greatest thief club in the world-"
    },
    {
        "character": "Neely",
        "line": "And we are."
    },
    {
        "character": "Obama",
        "line": "[turns around] -we won't get caught."
    },
    {
        "character": "",
        "line": "Stan's house, night. Kyle is in the kitchen, on the phone with 9-1-1."
    },
    {
        "character": "Kyle",
        "line": "Yes, ah I'm trying to locate my parents. M-my name is Kyle Broflovski. Yes, I know Obama won."
    },
    {
        "character": "Stan",
        "line": "[walks in from the dining room] Kyle, Kyle you gotta get out here."
    },
    {
        "character": "Kyle",
        "line": "What?!"
    },
    {
        "character": "Stan",
        "line": "Your little brother has climbed out of the window. I I think he's gonna jump!"
    },
    {
        "character": "Kyle",
        "line": "Oh my God! [drops the phone and follows Stan to Ike]"
    },
    {
        "character": "",
        "line": "Stan's house, one of the windows. Kyle is standing on a window sill in the den mumbling out loud. Stan and Kyle run outside and reach the window"
    },
    {
        "character": "Kyle",
        "line": "Ike, don't do it! There's still so much to live for! [Ike begins to cry] I know you really wanted McCain to win but, but it's going to be okay. [Ike mumbles something to him] No, that's not true, Ike. The economy could easily stabilize with Obama's plan. [Ike says something more] Ike, don't jump! You could really hurt your ankle or something. [The camera zooms out to show that the window is barely off the ground. Ike cries, Stan and Kyle look at each other] Really Ike, that's like five feet off the ground. Don't do it."
    },
    {
        "character": "Ike",
        "line": "Good-bye. [falls from the window sill and lands on the ground face down]"
    },
    {
        "character": "Stan, Kyle",
        "line": "NOO!"
    },
    {
        "character": "Kyle",
        "line": "Ike? [no response] Oh crap Ike?"
    },
    {
        "character": "",
        "line": "The White House, night"
    },
    {
        "character": "Chief of Security",
        "line": "All right, everyone, I'm turning in for the night. Go to standard security, team 3."
    },
    {
        "character": "SS agent 1",
        "line": "Sir! S-sir, we have a bit of a problem."
    },
    {
        "character": "Chief of Security",
        "line": "What?"
    },
    {
        "character": "SS agent 1",
        "line": "The new President-elect is here. Eh he wants into the Oval Office."
    },
    {
        "character": "Chief of Security",
        "line": "Barack Obama? [next scene shows Barack Obama walking through the White House]"
    },
    {
        "character": "SS agent 2",
        "line": "They're all, they're all right through here, sir."
    },
    {
        "character": "Chief of Security",
        "line": "[interrupting as Obama enters] Uh, hello, is there something we can do for you, Mr. Obama?"
    },
    {
        "character": "Obama",
        "line": "Just checking out the new digs. How are you guys?"
    },
    {
        "character": "Chief of Security",
        "line": "Good, sir."
    },
    {
        "character": "Obama",
        "line": "I'd like to see the Oval Office, please?"
    },
    {
        "character": "Chief of Security",
        "line": "Right now?"
    },
    {
        "character": "Obama",
        "line": "I don't waste time, gentlemen. I've only got two months to figure out how I wanna redecorate, if you know what I mean. You know, change the drapes and stuff."
    },
    {
        "character": "Chief of Security",
        "line": "[backs up towards the Oval Office] Sure, right this way, Mr... President. [opens the doors to the office]"
    },
    {
        "character": "Obama",
        "line": "[enters the office] I will need absolute privacy, is that understood?"
    },
    {
        "character": "Chief of Security",
        "line": "Yes sir. [Obama places a bill into the Chief's jacket breast pocket]"
    },
    {
        "character": "Obama",
        "line": "Thanks. [closes the doors]"
    },
    {
        "character": "Chief of Security",
        "line": "I got a hundred dollars. [grins]"
    },
    {
        "character": "",
        "line": "Inside the Oval Office."
    },
    {
        "character": "Obama",
        "line": "All right, McCain. I'm in."
    },
    {
        "character": "McCain",
        "line": "Nicely done, B. We're in position outside the Smithsonian. [he's with a construction team] You find the escape tunnel?"
    },
    {
        "character": "Obama",
        "line": "I'm already on it. [plugs a hacking device into an electronic lock hidden under a panel on the desktop; it quickly starts crunching numbers in trying to decode the password. Once it decodes the right password the desk moves to one side and the secret passage is revealed] Boom baby."
    },
    {
        "character": "",
        "line": "South Park, early early morning. The Obama supporters are still partying on the neighborhood streets. The music this time is \"Whoomp! (There it is)\""
    },
    {
        "character": "Reveler 3",
        "line": "Yehhheheah!"
    },
    {
        "character": "Randy",
        "line": "[even more drunk than before, serves himself more beer] Wooo, change."
    },
    {
        "character": "Reveler 4",
        "line": "Change."
    },
    {
        "character": "Reveler 5",
        "line": "Change."
    },
    {
        "character": "Stan",
        "line": "[running up to him with Kyle] Dad Dad, we have a problem."
    },
    {
        "character": "Randy",
        "line": "Not anymore we don't; everything's different now."
    },
    {
        "character": "Stan",
        "line": "No, Dad, we gotta take Kyle's brother to the hospital."
    },
    {
        "character": "Randy",
        "line": "We don't have to take... crap... from the fit- rich, fat cats anymore."
    },
    {
        "character": "Stan",
        "line": "Dude, he's wasted."
    },
    {
        "character": "Randy",
        "line": "Hey, it's my boss. Hey boss! [walks over]"
    },
    {
        "character": "Randy's boss",
        "line": "Oh, hello Marsh."
    },
    {
        "character": "Randy",
        "line": "Yeah, you know what? Fuck you! [Stan and Kyle are stunned]"
    },
    {
        "character": "Randy's boss",
        "line": "Huh?"
    },
    {
        "character": "Randy",
        "line": "You heard me, you fuckin' piece of shit! I can finally tell you what I think o'you, fuckin' asshole!"
    },
    {
        "character": "Stan",
        "line": "[quite concerned] Dad, what are you doing?!"
    },
    {
        "character": "Randy",
        "line": "It's okay, Stan, everything's changed. I don't need this stupid fuckin' job anymore! You lil fucking assfuck, piece of shit [gives him the finger again] You know what Obama said? Yes we can!"
    },
    {
        "character": "Randy's boss",
        "line": "Hey, I voted for Obama."
    },
    {
        "character": "Randy",
        "line": "Obama's not talkin' about you!"
    },
    {
        "character": "Kyle",
        "line": "[looks around] Can someone help us? My little brother fell out of a window. [Randy punches his boss in the face and his boss just leaves, holding his hands over his nose]"
    },
    {
        "character": "",
        "line": "McCain headquarters. Sarah Palin stands behind a podium. Photographers snap away at their cameras"
    },
    {
        "character": "Palin",
        "line": "I just wanna say to everyone who's a little disappointed that we lost the election that there's always next year. Maybe I'll run again for Vice President again in 2009. [the cameras die down and everyone is a bit aghast at her statement]"
    },
    {
        "character": "Reporter 1",
        "line": "Uh Mrs. Palin, have you seen or heard from John McCain?"
    },
    {
        "character": "Palin",
        "line": "Uh, uh, nnno, I don't really know where he went. Kinda seems a little odd, I guess, but [her cell phone begins to ring] Oh, my phone's going ringy. Ex-cuse me. [steps away from the podium and off the stage to her left. She answers the phone at a safe distance from the stage] Hello?"
    },
    {
        "character": "McCain",
        "line": "Hello Sarah, it's McCain."
    },
    {
        "character": "Palin",
        "line": "[switches to a British accent] I hope to God you're calling to tell me you're in position below the vault with the L7 charges."
    },
    {
        "character": "Obama",
        "line": "I'm in the tunnel now, Sarah. I should be almost below the museum."
    },
    {
        "character": "Palin",
        "line": "Just make sure you don't blow the transformers along with the tunnel because it will trigger the five-four laser system! And don't damage any coupling wires or it'll be worthless when Gary shuts down the grid. I'll be there in thirty."
    },
    {
        "character": "Obama",
        "line": "God she's awesome."
    },
    {
        "character": "Palin",
        "line": "[returns to the podium and a normal voice] Oh, I guess Senator McCain's gonna fly me back to Alaska now. He's got a private jet, you know? Okay, byebye then. [walks off to her right] Bloody idiots. [she walks out of the headquarters through a side door, tosses off her red business suit and walks towards the camera in a catsuit. She whips out some sais and spins them around like pistols]"
    },
    {
        "character": "McCain",
        "line": "All right, here we go. [a piledriver is turned on and a massive pile is lifted up, then dropped. Shockwaves spread out each time the pile hits the ground]"
    },
    {
        "character": "Guard 1",
        "line": "What's that noise?"
    },
    {
        "character": "Guard 2",
        "line": "It's okay, just some construction outside. [Obama prepares a charge and sets it off, and light enters the tunnel. Obama has broken into the Smithsonian. He pops his head through the hole]"
    },
    {
        "character": "",
        "line": "Inside the Smithsonian. Obama looks around and sees the laser system is on."
    },
    {
        "character": "Obama",
        "line": "Oh no. [presses a button on his headset] McCain? We've got a problem. [the lasers are now blue instead of red]"
    },
    {
        "character": "",
        "line": "South Park streets, night. Stan and Kyle have placed Ike in a red Radio Flier wagon and are pulling him along. Ike moans from time to time. They pass by a gas station]"
    },
    {
        "character": "Kyle",
        "line": "Hang in there, Ike. We're gonna get you help."
    },
    {
        "character": "Stan",
        "line": "[points ahead] Hey, there's some people. [ahead of them is a garage that has been converted into a cave. Stephen Stotch and the other McCain supporters are there putting stuff away. Stephen is holding a crowd of other McCain supporters at bay with a rifle.]"
    },
    {
        "character": "Stephen",
        "line": "Let's just stay back- STAY BACK! We don't have any more room in the Ark. [above the garage door is the work \"A.RK\"]"
    },
    {
        "character": "Man 1",
        "line": "You have to let us in! You know the country's doomed!"
    },
    {
        "character": "Woman 1",
        "line": "Who are you to turn us away?!"
    },
    {
        "character": "Stephen",
        "line": "I built this bunker in case McCain lost! There isn't enough room for everyone!"
    },
    {
        "character": "Kyle",
        "line": "Hey, excuse me, but we need some help."
    },
    {
        "character": "Stephen",
        "line": "I know you do, but there's no more room, I tell ya!"
    },
    {
        "character": "Man 2",
        "line": "You're going to deny them too?"
    },
    {
        "character": "Man 1",
        "line": "[throws down his sleeping bag] For God's sake, man, they're children! [kneels next to Stan] Look them in the eyes and tell them you won't take them in! [tugs on Stan's cheeks] Look at their little cheeks!"
    },
    {
        "character": "Stan",
        "line": "Let go of my face, asshole!"
    },
    {
        "character": "Stephen",
        "line": "All right, damn you! The children can come in!"
    },
    {
        "character": "Kyle",
        "line": "No, we don't want to enter any of your stupid shelter!"
    },
    {
        "character": "Man 3",
        "line": "Okay, then I want their place."
    },
    {
        "character": "Man 4",
        "line": "Me too."
    },
    {
        "character": "Kyle",
        "line": "We NEED a ride to the hospital!"
    },
    {
        "character": "Man 1",
        "line": "THERE ISN'T GONNA BE A HOSPITAL! DON'T YOU GET IT?!"
    },
    {
        "character": "Woman 2",
        "line": "Let us in now! [Stephen smacks her away, and a brawl follows]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Whoa, Jesus, it's already happening. Society's breaking down!"
    },
    {
        "character": "Man 5",
        "line": "Obama hasn't been elected four hours and already the country's going to hell! [another supporter smacks him down from behind. Stan and Kyle just leave and resume their walk]"
    },
    {
        "character": "",
        "line": "The Oval Office, outside. The Chief of Security knocks on the door]"
    },
    {
        "character": "Chief of Security",
        "line": "Mr. Obama? [tries to open it, but can't] Sir? [looks to another Secret Service agent] All right, give me the keys. [the door opens before the agent could reach for the keys. Barack Obama dusts himself off]"
    },
    {
        "character": "Obama",
        "line": "Is there a problem, gentlemen?"
    },
    {
        "character": "Chief of Security",
        "line": "Uh, no. No, sir. Everything okay in there?"
    },
    {
        "character": "Obama",
        "line": "Why wouldn't it be? I'm sorry, but I asked to be left alone?"
    },
    {
        "character": "Chief of Security",
        "line": "Yes, sir, it's, just that... your wife is here."
    },
    {
        "character": "Obama",
        "line": "My wife?"
    },
    {
        "character": "Michelle",
        "line": "[appears behind the agents] Barack, everyone's been looking for you. What on earth are you doing?"
    },
    {
        "character": "Obama",
        "line": "[pulls her into the Oval Office] Uh, c-c-come on in, darling. [appears at the doorway again] Thank, thank you boys. [closes and locks the doors]"
    },
    {
        "character": "",
        "line": "The Oval Office, inside. Barack and Michelle are alone now]"
    },
    {
        "character": "Michelle",
        "line": "Okay Barack, tell me what's going on?"
    },
    {
        "character": "Obama",
        "line": "Michelle, there's something I need to tell you."
    },
    {
        "character": "Michelle",
        "line": "What is it? [Obama stays quiet] Barack, what is it?!"
    },
    {
        "character": "Obama",
        "line": "The laser system guarding the diamond was replaced by an optical relay three days ago."
    },
    {
        "character": "Michelle",
        "line": "You gotta be kiddin' me. So the entire diamond vault is inaccessible?! Is McCain online?"
    },
    {
        "character": "McCain",
        "line": "[wearing a huge fake mustache] Hi, Michelle."
    },
    {
        "character": "Michelle",
        "line": "[removes the Bluetooth device from Obama's right ear and places it on her own] You guys weren't runnin' update checks on the security logs?!"
    },
    {
        "character": "McCain",
        "line": "Michelle, we need you to do a different scan hack through the vault relay."
    },
    {
        "character": "Michelle",
        "line": "On a new system, in an hour?! Are you nuts? My job was to pretend to be married to this bozo and get you three scan hacks into a laser system!"
    },
    {
        "character": "Sarah",
        "line": "Michelle, it's Sarah. They did replace the laser system, but the new one isn't brand-new. It's an old H-7 series. You can break this baby in 30 minutes."
    },
    {
        "character": "Michelle",
        "line": "Egh. Tell Davis to get me a fortrans emitter and enough pulse drives to light a spark."
    },
    {
        "character": "Obama",
        "line": "Did you catch that, Davis?"
    },
    {
        "character": "Davis",
        "line": "I'm on it."
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, night. Stan and Kyle finally make it to the emergency entrance]"
    },
    {
        "character": "Kyle",
        "line": "We made it, Ike. You're going to be okay. [they enter the ER and see a lot of patients in there. One man has an Obama flag stuck up his ass. The clock reads 9 p.m., so it must be broken]"
    },
    {
        "character": "Nurse",
        "line": "[showing an Obama patient where to wait] There, just take a seat over there."
    },
    {
        "character": "Kyle",
        "line": "[getting the nurse's attention] E-excuse me, my little brother needs medical attention."
    },
    {
        "character": "Nurse",
        "line": "Was he an Obama supporter or a McCain supporter?"
    },
    {
        "character": "Stan",
        "line": "Why does that matter?"
    },
    {
        "character": "Nurse",
        "line": "Because then I'll know if he partied too hard or if he tried to kill himself. [on one side of the ER are Obama supporters who are suffering the effects of too much partying, and on the other are McCain supporters who have more serious wounds]"
    },
    {
        "character": "Kyle",
        "line": "Ma'am, please, I think my little brother needs immediate help."
    },
    {
        "character": "Nurse",
        "line": "You don't understand, kid: there's only two doctors on call, and Dr. Wilson is out celebrating in the streets somewhere."
    },
    {
        "character": "Stan",
        "line": "So where's the other doctor? [the nurse opens a door behind her and the other doctor... is hanging from a noose attached to the ceiling]"
    },
    {
        "character": "Randy",
        "line": "[walking in suddenly towards the Obama side] Hey, come on people. We can keep partying, can't we? Yes we can! Come on, let's sing. O-bama. Well you came and you gave without taking. [moans come up from all over the ER as people cover their ears] And I sent you away, O-bama. When you kissed me and stopped me from shakin'. [a McCain supporter tries to hasten his death by smashing a corkscrew into his head]"
    },
    {
        "character": "",
        "line": "The Smithsonian. Michelle and Obama are at the tunnel's new entry point near the Hope Diamond. Michelle is still breaking the new laser system]"
    },
    {
        "character": "Michelle",
        "line": "I've almost got it. You're only going to have five minutes. Do you understand?"
    },
    {
        "character": "Obama",
        "line": "Did you really not like pretending to be married?"
    },
    {
        "character": "Michelle",
        "line": "Oh Jesus, now is not the time, B."
    },
    {
        "character": "Obama",
        "line": "Come on. You have to admit we had some fun."
    },
    {
        "character": "Michelle",
        "line": "My girls need somebody better than a world-class diamond thief. Woowait, there! I got it."
    },
    {
        "character": "Obama",
        "line": "[to everyone connected to his bluetooth unit] All right, everyone. We're about to go. So here's the revised schedule: 4:40 a.m., the team gathers at the northwest exit of the museum. [the heist is shown taking place as Obama goes through the schedule] 4:45 a.m., Michelle hacks the optical relay, allowing me access to the rear doors."
    },
    {
        "character": "Michelle",
        "line": "Go! [Obama takes off]"
    },
    {
        "character": "Obama",
        "line": "4:46, from inside I can open the doors and let in the rest of the crew. [Obama opens the vault door and McCain and the others walk in] 5:10 a.m., at the Department of Power Quincy shuts down the grid, disabling power to the vault room. 5:12, my grandmother who faked her death on Monday calls in a bomb threat to the museum."
    },
    {
        "character": "Grandma Obama",
        "line": "I said I put a bomb in your building, bitch."
    },
    {
        "character": "Obama",
        "line": "5:13, the guards open the southwest door, checking the museum for any bombs. [above them, Palin crawls across the ceiling like Spider-Man towards the entrance] 5:14, McCain, dressed as a football player, enters security and shuts off the diamond case alarm. [Palin drops down and hangs upside down. She lifts the glass display cover from the diamond and swipes the Hope Diamond from its display case. McCain is spotted and flees]"
    },
    {
        "character": "Smithsonian guard",
        "line": "Hey you! Stop!"
    },
    {
        "character": "Obama",
        "line": "Michelle and I head back into the tunnel and the hole is patched. [Davis and Neely act as repairmen and seal up the hole] 5:15 a.m., I walk out of the Oval Office with the diamond securely hidden in my anus."
    },
    {
        "character": "Obama",
        "line": "[to the Secret Service] All done. Thanks. [Barack and Michelle head outside, towards a limousine. The door opens and McCain is waiting for them. They enter and take their seats, and the limousine rolls off. The rest of the team looks at the three of them, and they all laugh. Obama takes the diamond out of his ass and displays it for all to see.]"
    },
    {
        "character": "",
        "line": "Boom, baby!"
    },
    {
        "character": "Quincy",
        "line": "There's just one thing: don't you think people are going to be suspicious when you disappear? Go looking for you?"
    },
    {
        "character": "Obama",
        "line": "We hired a guy for that a couple of months ago. [a plane sits all by itself in a field somewhere. The interior is full of dummies. Nearby, in a recovery room, Ike rises from his bed as Stan and Kyle look off into space. He presses a button and the plane blows up: the plane was landed near Hell's Pass Hospital. Stan and Kyle hear the explosion and quickly turn around and look outside]"
    },
    {
        "character": "Kyle",
        "line": "What the hell? [they observe the burning plane. Ike sneaks away while the boys are distracted. He dashes across the hall to the coroner's office and enters it. He hops onto a chair and attaches a USB stick to a computer, and begins typing. Dossiers of the heist team members pop up and Ike classifies each one as deceased. The door opens, and Kyle and Stan enter] Ike?"
    },
    {
        "character": "Ike",
        "line": "Boom, baby."
    },
    {
        "character": "",
        "line": "Dulles Airport, day. The heist team members are in the waiting room watching their plane, an Air Tahiti jet, taxi into position]"
    },
    {
        "character": "Flight attendant",
        "line": "Here are all the tickets for your group, Mr. Sanchez."
    },
    {
        "character": "McCain",
        "line": "Thank you very much."
    },
    {
        "character": "Quincy",
        "line": "Well friends, let us depart."
    },
    {
        "character": "Obama",
        "line": "Hey uh, you guys go ahead. I just came to say goodbye."
    },
    {
        "character": "Neely",
        "line": "Wha?"
    },
    {
        "character": "Obama",
        "line": "I decided to hang it up, maybe give this President thing a shot."
    },
    {
        "character": "McCain",
        "line": "B, you can't be serious."
    },
    {
        "character": "Quincy",
        "line": "Besides, you died in a jet in the Rocky Mountains, remember?"
    },
    {
        "character": "Obama",
        "line": "Could have been I didn't make that flight. [walks up to Michelle] What do you say, Michelle? Would you and your girls like to move into the White House with me? You know, settle down, just be President and First Lady for a while."
    },
    {
        "character": "Michelle",
        "line": "You're serious."
    },
    {
        "character": "Obama",
        "line": "Who knows? Maybe we could change a few things. What do you say?"
    },
    {
        "character": "Michelle",
        "line": "Aww, what the fuck. [they begin to kiss, and the other members of the team wave goodbye and head for the plane]"
    },
    {
        "character": "McCain",
        "line": "I just looove happy endings."
    },
    {
        "character": "",
        "line": "South Park, the A.RK, morning. The garage door goes up and the McCain supporters in the bunker look out into the same scene they'd seen countless times before.]"
    },
    {
        "character": "Stephen",
        "line": "It's still here, ih... it's all still here."
    },
    {
        "character": "Mr. Garrison",
        "line": "Does that mean... maybe we overreacted?"
    },
    {
        "character": "Stephen",
        "line": "No, no, I wouldn't say that. It's just maybe... well, uh... maybe Obama will be all right."
    },
    {
        "character": "",
        "line": "The Marsh house, living room. Randy wakes up from a drunken slumber, trash still strewn all over the living room.]"
    },
    {
        "character": "Randy",
        "line": "Uhh... [sits up and tries to rub his eyes, but he's got a headache] Oh ow. [walks forward...] Hey, where are my pants? [looks at the table the TV is missing from] Where's our TV?! Where are my pants and where's my TV?!"
    },
    {
        "character": "Stan",
        "line": "Dad, your boss called. He said you're fired."
    },
    {
        "character": "Randy",
        "line": "[surprised] Oh! [is pissed off again] Ugh, God damn it! Obama said things would be different! That sonofabitch lied to us! I knew I should have voted for McCain! [kicks a side table away and walks off]"
    }
]