[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary School Cafeteria, lunchtime. The boys are at the center table once again, with the girls off to screen right. This time there are ten boys present, five on each side. On the left are Butters, Kyle, Stan, Cartman, and Kenny. On the right are Clyde, Craig, Jimmy, Tolkien, and Jason"
    },
    {
        "character": "Cartman",
        "line": "Hahahahaha, look at Kenny's lunch, a baloney sandwich and water! Hahaha, Goddamn your family's poor, dude. [Kenny indeed has a plain bologna sandwich and a glass of water.]"
    },
    {
        "character": "Butters",
        "line": "Hey, you fellas wanna go see High School Musical 3 tonight? Bunch of kids from school are gonna see it again."
    },
    {
        "character": "Kyle",
        "line": "What's High School Musical 3?"
    },
    {
        "character": "Clyde",
        "line": "You know, the sequel to High School Musical 1 and 2."
    },
    {
        "character": "Stan",
        "line": "What's High School Musical 1 and 2?"
    },
    {
        "character": "Cartman",
        "line": "There's not- there's not even condiments on his baloney sandwich!"
    },
    {
        "character": "Jason",
        "line": "What's High School Musical 1 and... Dude, it's only the most popular thing with kids in our age group!"
    },
    {
        "character": "Jimmy",
        "line": "Yeah. Where the hell have you guys ...been?"
    },
    {
        "character": "Craig",
        "line": "Peru."
    },
    {
        "character": "",
        "line": "At the table behind the second row of boys, the girls begin to laugh"
    },
    {
        "character": "Bebe",
        "line": "And then I saw High School Musical 3 again on Friday, and guess who was there? Bridon Gueermo."
    },
    {
        "character": "Millie",
        "line": "Bridon Gueermo? Oh, he's such a dream!"
    },
    {
        "character": "Red",
        "line": "I'd give anything to be with Bridon Gueermo, but he'd never go for me. I'm nobody."
    },
    {
        "character": "Wendy",
        "line": "That's not true, Red. Everyone has something that makes them unique. [stands on the bench in place and sings]\nEveryone is special in their own way.\nMove to the beat and let your spirit out! [the girls begin to snap their fingers]\n\n\n"
    },
    {
        "character": "Bebe",
        "line": "As long as we've got each other, we'll never have any trouble.\n\n\n"
    },
    {
        "character": "Girls' Table",
        "line": "That's what bein' friends is about.\n[Cue full instrumentation]\n(Oh ye-ah)\n[the girls stand on the benches and face the boys]\nEveryone is special in their own way, and we'll always be together as one.\n\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[puzzled] What the hell are they doing?"
    },
    {
        "character": "Girls' Table",
        "line": "- Together as one -"
    },
    {
        "character": "Stan",
        "line": "I have no idea. [the other boys turn in their seats to get a better view]"
    },
    {
        "character": "Girls' Table",
        "line": "As long as we stick together, together we'll stay.\nAnd every kid in school is special in their own way.\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Dude, girls are such fags. [suddenly, Clyde, Craig, Jimmy, Tolkien, and Jason leave the table and join the girls]"
    },
    {
        "character": "Boys' table except for The Boys",
        "line": "Oh yeah, oh yeah!\n\n\n"
    },
    {
        "character": "Boys:",
        "line": "[Dancing] Boys... are special in their own way.\n\n\n"
    },
    {
        "character": "Girls:",
        "line": "[Dancing] Girls... are special like a birthday.\n\n\n"
    },
    {
        "character": "Kids:",
        "line": "We'll always be dancin' and singin' aloud. Ahh-ahh-ahh-ahh!\n\n\n"
    },
    {
        "character": "Heidi",
        "line": "Here he comes.\n\n [the kids make way for a new boy, Bridon Gueermo, who dances towards the camera]\n"
    },
    {
        "character": "Bridon Gueermo",
        "line": "I like havin' fun in the hot summer sun (wooo!)\nAn' groovin' to the beat when my homework is all done. (yeah!)\nIf you ask me what I know, then you know what I will say?\nThat every single body is special in their own way.\n\n\n"
    },
    {
        "character": "Stan",
        "line": "[while the boy is singing] Who the hell is that?"
    },
    {
        "character": "Butters",
        "line": "Why that's Bridon Gueermo. He's just a third grader, but he can sing and dance better than anybody."
    },
    {
        "character": "Bebe",
        "line": "[swooning, walks over to the boys] He's already seen High School Musical 3 over a hundred times."
    },
    {
        "character": "Kids",
        "line": "Everyone is special in their own way\n\n\n"
    },
    {
        "character": "Bridon",
        "line": "Special in their own way!\n\n\n"
    },
    {
        "character": "Kids:",
        "line": "Move to the beat and let your spirit out!\n\n\n"
    },
    {
        "character": "Bridon",
        "line": "Let it out! Party people!\n\n\n"
    },
    {
        "character": "Kids",
        "line": "As long as we have each other, we'll never have any trouble.\nThat's what bein' friends is about.\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "Are we the only ones here who are completely confused?"
    },
    {
        "character": "Stan",
        "line": "Yeah, I guess we'd better check that movie out..."
    },
    {
        "character": "",
        "line": "Stan's house. The boys are watching High School Musical. They're watching a musical sequence with all singing and dancing on tables and up and downstairs. It's quite an elaborate presentation"
    },
    {
        "character": "Singers",
        "line": "You've gotta go with the status quo. If you wanna be a regular Joe. (come on now)\nAnd your dreams are only a beat away; don't let 'em tell you no. (tell you no-o-o)\nYou've gotta go with the status quo. Keep singing 'bout the status quo (keep singing 'bout the status)\nThat's the place we know (get down now)\nWe're all in our high school dancing on tables singing 'bout what we know (singing 'bout what we know)\nWe've gotta go with the status quo, go with the status quo. (go with the status)\nGo with the status quo (go with the status quo). That's where we should go. (Go there now)\nCopies of pop songs packaged by Disney and turned into a show (into a show).\nThat's the status quo! That's the status quo (That's the status quo) That's the status quohh!\n\nThat's the place we know (get down now)\nWe're all in our high school dancing on tables singing 'bout what we know (singing 'bout what we know)\nWe've gotta go with the status quo, go with the status quo. (go with the status)\nGo with the status-\n\n\n"
    },
    {
        "character": "",
        "line": "During this number, the following conversation takes place. At first, the boys are silently watching the TV, then"
    },
    {
        "character": "Cartman",
        "line": "This... is cool? This... is cool. We are really gettin' old, you guys. [silence follows for a few seconds, then Stan holds up the DVD case]"
    },
    {
        "character": "Stan",
        "line": "Says this DVD sold more copies than any DVD ever made."
    },
    {
        "character": "Kyle",
        "line": "They just released part 3 in theaters and it made 80 million opening weekend."
    },
    {
        "character": "Cartman",
        "line": "Well, I'm out guys. [get up from the sofa, puts on his jacket, and heads for the front door] If this is what's cool now, I think I'm done. I no longer have any connection to this world. I'm gonna go home and kill myself. Goodbye, friends."
    },
    {
        "character": "Stan",
        "line": "I don't care how popular being like these kids becomes, I'm not doing it."
    },
    {
        "character": "Kyle",
        "line": "I'm not doing it either. Kenny?"
    },
    {
        "character": "Kenny",
        "line": "(No way in hell I'm doing it.)"
    },
    {
        "character": "Stan",
        "line": "All right, do we promise? We have to swear to each other right now we'll never become this. [holds up his right hand. Kyle holds his right hand up as well, and Kenny holds up his left]"
    },
    {
        "character": "Kyle",
        "line": "I swear"
    },
    {
        "character": "Kenny",
        "line": "(I swear too.)"
    },
    {
        "character": "Stan",
        "line": "Okay, good."
    },
    {
        "character": "",
        "line": "South Park Elementary, Garrison's class. Kids begin taking their seats. Stan is writing something as Cartman comes in and sits down"
    },
    {
        "character": "Cartman",
        "line": "Ehhhhhhh. [Stan stops writing]"
    },
    {
        "character": "Kyle",
        "line": "What happened? I thought you were gonna kill yourself."
    },
    {
        "character": "Cartman",
        "line": "I tried. Went to sleep in my mom's car in the garage with the engine turned on."
    },
    {
        "character": "Stan",
        "line": "But you didn't die?"
    },
    {
        "character": "Cartman",
        "line": "...Freakin' hybrids, man. They just don't do the trick anymore. [The bell rings and Mr. Garrison walks in with his books]"
    },
    {
        "character": "Mr. Garrison",
        "line": "All right, kids in seats, kids in seats. [the last few kids take their seats] Today we are going to discuss the Berlin Wall. [He writes \"Berlin Wall\" on the chalkboard] This was a wall in Germany that actually separated the Communist east side and the Democratic west side."
    },
    {
        "character": "Wendy",
        "line": "stands up on the seat of her desk] East side, west side, whatever side that you're on. [some kids begin to snap their fingers\n\n\n"
    },
    {
        "character": "Bebe",
        "line": "As long as we care about each other we can still have some fun.\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "Aw man."
    },
    {
        "character": "Class",
        "line": "Don't sweat what you might get by assuming the other side as a threat\n\n\n"
    },
    {
        "character": "Mr. Garrison",
        "line": "[beaming] Oh, you kids. [Stan buries his face in his hand]</poem>"
    },
    {
        "character": "Class",
        "line": "Each side is right or wrong, we've gotta learn to all get along.\n\n\n"
    },
    {
        "character": "Bridon",
        "line": "[enters the classroom]  East side, west side, doesn't matter to me.\nWe've gotta learn to power through, set each other free.\n\n\n"
    },
    {
        "character": "Wendy",
        "line": "We don't care what other people wear or the way they like to style their hair.\n\n [Stan looks at them both and begins to worry that Bridon might sweep her away]\n"
    },
    {
        "character": "Bridon, Wendy",
        "line": "Each side is right or wrong, we've gotta learn to all get along.\n\n\n"
    },
    {
        "character": "Class",
        "line": "East siiide, west siiide, east siiide...\n\n\n"
    },
    {
        "character": "Cartman:",
        "line": "[looking around and getting pissed off] God this sucks!"
    },
    {
        "character": "",
        "line": "The hallway, later on. Wendy's at her locker putting some books away. Stan is far enough away that she doesn't notice him, but he's watching her. Jimmy walks up to him"
    },
    {
        "character": "Jimmy",
        "line": "Do you feel like maybe you're l-l-losin' her, S-Stan?"
    },
    {
        "character": "Stan",
        "line": "I don't know. There's nothin' I can do about it anyway."
    },
    {
        "character": "Jimmy",
        "line": "M-Maybe you should just talk to her. You know, a little conversation. Tell her... what you feel.Sometimes you feel like there's a b-burnin' inside you, like a-\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Stop. [holds his left hand out, palm out, for emphasis, and walks away. Jimmy stops singing]"
    },
    {
        "character": "Jimmy",
        "line": "All righty then."
    },
    {
        "character": "Stan",
        "line": "[walks up to Wendy] Uh, Wendy?"
    },
    {
        "character": "Wendy",
        "line": "[looks at him] Hey Stan."
    },
    {
        "character": "Stan",
        "line": "Look, I just want you to know, if you want to, you know, be with that Bridon kid, then you should."
    },
    {
        "character": "Wendy",
        "line": "What?"
    },
    {
        "character": "Stan",
        "line": "I mean, I see the way you two are together and I don't wanna be in your way."
    },
    {
        "character": "Wendy",
        "line": "Stan, that's ridiculous."
    },
    {
        "character": "Stan",
        "line": "It is?"
    },
    {
        "character": "Wendy",
        "line": "I would never leave you for Bridon."
    },
    {
        "character": "Stan",
        "line": "[brightens up] Really?"
    },
    {
        "character": "Wendy",
        "line": "No way. That's stupid. I wouldn't have a chance with Bridon; he can be with any girl he wants. [shuts her locker and walks away, kissing Stan on the left cheek. Jimmy arrives two seconds later]"
    },
    {
        "character": "Jimmy",
        "line": "There you go. Feel better, p-pal? [Stan stays quiet]"
    },
    {
        "character": "",
        "line": "Stan walks through some double doors and continues down the hallway. The doors close behind him"
    },
    {
        "character": "Stan",
        "line": "What am I supposed to do? Can't just sit back and watch some kid steal my girlfriend away. [at an intersection he takes a left turn] I mean, Wendy said she'd never leave me for him. [kids appear behind him and follow him] But what if she just doesn't wanna hurt my feelings? She said he could get any girl he wants, and that means if he wanted, he could have my girl. [the kids begin to snap their fingers] This is all so crazy. I mean really, how could my day get any worse? [noticing the finger-snapping, he stops walking and looks around. The kids wait for him to start singing and dancing] No-no, no, I'm not doing it! I'm not doing it!"
    },
    {
        "character": "Kids",
        "line": "Awww. [murmurs follow]"
    },
    {
        "character": "Stan",
        "line": "No, fuck off. I'm not doing it."
    },
    {
        "character": "Kids",
        "line": "Awww. [more murmuring. As they disperse, Butters walks up to Stan]"
    },
    {
        "character": "Butters",
        "line": "Awww jeez, you're no fun. [turns right and walks away. At the other end of the hall, Bridon rounds a corner and dances down the hallway in Stan's direction]"
    },
    {
        "character": "Bebe",
        "line": "Hey Bridon."
    },
    {
        "character": "Bridon",
        "line": "Hey."
    },
    {
        "character": "Lola",
        "line": "Hi Bridon"
    },
    {
        "character": "Bridon",
        "line": "Hi."
    },
    {
        "character": "Heidi, Millie",
        "line": "Hey Bridon."
    },
    {
        "character": "Bridon",
        "line": "Hey."
    },
    {
        "character": "Stan",
        "line": "[now hiding behind a corner. Bridon passes by him unaware] Hey, kid, over here. [Bridon looks around and finds Stan, then walks over to him] Hey, uh, listen. You know this whole singing and dancing thing you do? I think you need to uh, ease off a little bit."
    },
    {
        "character": "Bridon",
        "line": "Huh?"
    },
    {
        "character": "Stan",
        "line": "Yeah, look, I-I know you think the kids in school like you, but, actually they're all getting really annoyed."
    },
    {
        "character": "Bridon",
        "line": "They are?"
    },
    {
        "character": "Stan",
        "line": "Yeah. You don't know 'cause you're just a third grader, but, take it from me, [gets stern] you're driving everyone crazy."
    },
    {
        "character": "Bridon",
        "line": "I don't blame 'em. All that singing and dancing? I can't stand it."
    },
    {
        "character": "Stan",
        "line": "You don't like doing it?"
    },
    {
        "character": "Bridon",
        "line": "It just isn't me. What I really wanna do is just... play basketball."
    },
    {
        "character": "Stan",
        "line": "Basketball?"
    },
    {
        "character": "Bridon",
        "line": "I love it! Always have. I never miss a game on TV ...when my dad isn't making me rehearse. I'd love to quit singing and dancing forever and just play ball."
    },
    {
        "character": "Stan",
        "line": "Dude, you should do that! You should join the basketball team, right now!"
    },
    {
        "character": "Bridon",
        "line": "I can't."
    },
    {
        "character": "Stan",
        "line": "[firmly] Yes, you can. What's stopping you?"
    },
    {
        "character": "Bridon",
        "line": "[sighs deeply] It's my dad. He thinks basketball is for sissies. If I don't do what he wants, he beats me."
    },
    {
        "character": "Stan",
        "line": "No, dude, listen, you need to take a stand and tell your dad what you want!"
    },
    {
        "character": "Bridon",
        "line": "Really?"
    },
    {
        "character": "Stan",
        "line": "When you grow up and you're a fourth grader, you'll understand that you have to be tough and direct with your parents. Go to your dad and tell him you wanna give up singing and dancing, and join the basketball team."
    },
    {
        "character": "Bridon",
        "line": "You know... you're right. I'm gonna talk to my old man tonight. [walks away]"
    },
    {
        "character": "Stan",
        "line": "[proud of himself] Sweet."
    },
    {
        "character": "",
        "line": "Bridon's house, night. He's seated at the table for dinner. His mom enters the dining room with the main dish, a casserole. The dining room is lined with posters from various musicals - Phantom of the Opera, Mamma Mia... Felines. A full-length mirror is also present"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "Sit up properly, Bridon. You know how strict your father is about posture. [serves out the casserole] All right dear, dinner's ready!"
    },
    {
        "character": "Mr. Gueermo",
        "line": "[struts in, checks himself out in the mirror, and takes his seat at the head of the table] Okay, let's eat!"
    },
    {
        "character": "Bridon",
        "line": "Dad, I need to talk to you about somethin'."
    },
    {
        "character": "Mr. Gueermo:",
        "line": "Ooo, that sounds emotional! [holds his hand against his ear to listen better] What is it son? What's on your mind? Whatever it is, you know your dad has the time.\n\n\n"
    },
    {
        "character": "Bridon",
        "line": "No, Dad, can we just talk?"
    },
    {
        "character": "Mr. Gueermo",
        "line": "If you can talk it, you can sing it. [gets up and dances to the mirror again] You can lay down the rhythm and bring it! Just put a melody to the words that you're sayin' and sing the beat-\n\n\n"
    },
    {
        "character": "Bridon",
        "line": "Dad, I want to join the basketball team. [his Dad is upset. He turns around and faces Bridon]"
    },
    {
        "character": "Mr. Gueermo",
        "line": "What did you say?"
    },
    {
        "character": "Bridon",
        "line": "This kid at school today told me I should do what I wanna do. That's what I really wanna do."
    },
    {
        "character": "Mr. Gueermo",
        "line": "Basketball? No son of mine is going to be a sweaty little jock!"
    },
    {
        "character": "Bridon",
        "line": "But Dad, it's what I really want."
    },
    {
        "character": "Mr. Gueermo",
        "line": "There's no singing and dancing in basketball!"
    },
    {
        "character": "Bridon",
        "line": "I know. That's kind of why I like it."
    },
    {
        "character": "Mr. Gueermo",
        "line": "Don't you even think about it! If I had a jock for a son, I'd be the laughingstock of the men's choir club."
    },
    {
        "character": "Bridon",
        "line": "It's my life, Dad!"
    },
    {
        "character": "Mr. Gueermo",
        "line": "Don't make me slap you! [raises his right hand, ready to slap] I will slap your face so super hard... [Bridon quickly leaves the table and his dad sits back down] I am the man of this house! You disrespect me and you're gonna get slapped!"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "Maybe you should let him try it."
    },
    {
        "character": "Mr. Gueermo",
        "line": "What did you say, woman?!"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "You aren't being fair."
    },
    {
        "character": "Mr. Gueermo",
        "line": "That's it! I'm gonna slap you!"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "No, please."
    },
    {
        "character": "Mr. Gueermo",
        "line": "[begins to sing and slap] I slap you!\n\n\n"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "Ahh!"
    },
    {
        "character": "Mr. Gueermo",
        "line": "I slap you!\n\n\n"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "Ohh!"
    },
    {
        "character": "Mr. Gueermo",
        "line": "I slap, slap, slap you!\n\n\n"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "Dohh!"
    },
    {
        "character": "Mr. Gueermo",
        "line": "Slapping you, slapping you, silly, 'cause you disrespected me.\n\n\n"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "Ooohohoo!"
    },
    {
        "character": "",
        "line": "South Park Elementary. The four boys approach the school"
    },
    {
        "character": "Cartman",
        "line": "You guys, I need to copy your math homework before class."
    },
    {
        "character": "Kyle",
        "line": "You're not copying my homework, you lazy turd."
    },
    {
        "character": "Cartman",
        "line": "Fuck you, Kyle! [upon entering the building, they are met by a pre-class musical production]"
    },
    {
        "character": "Kids",
        "line": "And you know, we're together at school again.\n\n\n"
    },
    {
        "character": "Jimmy",
        "line": "School again.\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Aww!"
    },
    {
        "character": "Kids",
        "line": "With all of our friends, and you know, we'll be doing this forever.\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Oh God, shut up!"
    },
    {
        "character": "Kids",
        "line": "Together at school again. What a special day.\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Shut. Up. Shut. Up. Shut. Uuup!"
    },
    {
        "character": "Kids",
        "line": "We could say that neverrrrrrrrrrr\nGoes away.\n\n\n"
    },
    {
        "character": "",
        "line": "The school bell rings and everyone goes to class. Stan catches up to Bridon"
    },
    {
        "character": "Stan",
        "line": "Hey kid, what happened?! I-I thought you didn't wanna sing and dance anymore?!"
    },
    {
        "character": "Bridon",
        "line": "Yeah, well, my dad blew a gasket when I told him and, then he beat my mom."
    },
    {
        "character": "Stan",
        "line": "Dude, what did I tell you?! You have to be tough and stand up for yourself! [sees someone down the hall] Mr. Garrett, Mr. Garrett. [Mr. Garrett, the school coach, is eating an apple] This kid wants to join the basketball team. He's really good."
    },
    {
        "character": "Mr. Garrett",
        "line": "Really?"
    },
    {
        "character": "Bridon",
        "line": "[looks down and away] Look, I should be getting to class."
    },
    {
        "character": "Mr. Garrett",
        "line": "Hey, we sure could use you, kid. I could never find enough kids that wanna play ball. All the kids and the school funding go to the theater department."
    },
    {
        "character": "Stan",
        "line": "You see? They need you. This is fate, kid, fate."
    },
    {
        "character": "Bridon",
        "line": "I don't know..."
    },
    {
        "character": "Mr. Garrett",
        "line": "Look, just come in at recess and shoot some ball with the team."
    },
    {
        "character": "Stan",
        "line": "Yeah, just go in at recess and shoot some ball with the team, God damn it!"
    },
    {
        "character": "Bridon",
        "line": "Okay."
    },
    {
        "character": "",
        "line": "Recess. The basketball team is assembled in the school gym. Bridon is at the free-throw line and shoots"
    },
    {
        "character": "Mr. Garrett",
        "line": "Aayy, that's great, Bridon."
    },
    {
        "character": "Bridon",
        "line": "Thanks."
    },
    {
        "character": "Jason",
        "line": "We might have a chance at winning now. [the doors open at the far end of the gym and Mr. Gueermo enters]"
    },
    {
        "character": "Mr. Gueermo",
        "line": "Bridon! What are you doing here? What are you doing here? Bupow! Bupow! Bupow!\n\n\n"
    },
    {
        "character": "Bridon",
        "line": "Dad, I was just messin' around."
    },
    {
        "character": "Mr. Gueermo",
        "line": "I drove by the school and saw kids on the playground doing a music number and you weren't there! You're here in the sports gym shooting basket hoops!"
    },
    {
        "character": "Mr. Garrett",
        "line": "Eh, your kid is really good at this."
    },
    {
        "character": "Mr. Gueermo",
        "line": "Don't talk to me, stupid jock asshole! [Bridon puts his arm up in self-defense]"
    },
    {
        "character": "Mr. Garrett",
        "line": "Just... go easy on him, huh?"
    },
    {
        "character": "Mr. Gueermo",
        "line": "[gasps, then raises his right hand up to strike] You know what this means? It means you're about to get slapped, so you'd better shut up!"
    },
    {
        "character": "Mr. Garrett",
        "line": "If he wants to play ball, you should let him."
    },
    {
        "character": "Mr. Gueermo",
        "line": "I'll do it! I'll slap the shit out of you!"
    },
    {
        "character": "Mr. Garrett",
        "line": "He's just a kid."
    },
    {
        "character": "Mr. Gueermo",
        "line": "[slap] You don't tell me how to raise my son! I'll slap it again. [slap]"
    },
    {
        "character": "Bridon",
        "line": "Dad, stop!"
    },
    {
        "character": "Mr. Gueermo",
        "line": "You're trying to turn my son into a little asshole sports person like yourself [slaps with his left hand this time] There, there's another slap! Maybe you'll think next time you act, you- [right-hand slap] Slap it, I'll slap it! [left-hand slap. He then pulls Bridon out of the gym.]"
    },
    {
        "character": "Bridon",
        "line": "Ow, Dad. Dad, you're hurting me."
    },
    {
        "character": "Mr. Gueermo",
        "line": "Shut up, Bridon! [as he reaches the doors, they open and Mr. Mackey appears]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh, what's going on here, Mr. Gueermo?"
    },
    {
        "character": "Mr. Gueermo",
        "line": "Get out of my way, Mackey. You wanna piece of this?! [Mackey doesn't reply, but he slaps him anyway] I'll slap everyone in this God damned school if I have to! [exits the gym, but returns to slap Mackey again, then leaves again]"
    },
    {
        "character": "",
        "line": "In the hallway, father and son hurry along."
    },
    {
        "character": "Mr. Gueermo",
        "line": "You are never going to play shooting hoops, do you understand?! [Stan watches them walk by, his plan dashed] You are going to sing and dance and be the best at it!"
    },
    {
        "character": "Bridon",
        "line": "You're hurting my arm."
    },
    {
        "character": "Mr. Gueermo",
        "line": "Stupid-ass boy!"
    },
    {
        "character": "Stan",
        "line": "[sighs deeply] Ah, shit."
    },
    {
        "character": "",
        "line": "Scott's house. Cartman, Kyle, and Kenny are playing a video game."
    },
    {
        "character": "Cartman",
        "line": "Oh that's good, that's good. Yeah. Shoot that guy in the face, Kyle. [Stan walks into the living room and stands to one side of the sofa] Yeah, nice."
    },
    {
        "character": "Stan",
        "line": "You guys, this High School Musical thing isn't gonna go away. I think we'd better just get on board with it."
    },
    {
        "character": "Kyle",
        "line": "What? Are you crazy?"
    },
    {
        "character": "Cartman",
        "line": "No way dude."
    },
    {
        "character": "Kyle",
        "line": "We promised each other we would never do that, remember?"
    },
    {
        "character": "Kenny",
        "line": "(Yeah.)"
    },
    {
        "character": "Stan",
        "line": "I know, but... I think we're really starting to become outcasts at school. We're losing all our credibility. I mean, look at who you guys are hanging out with now. Scott Malkinson, for Christ's sake."
    },
    {
        "character": "Scott Malkinson",
        "line": "What's so bad about hanging out with me?"
    },
    {
        "character": "Cartman",
        "line": "Shut up, Scott Malkinson. \"I'm Scott Malkinson. I've got a lisp and I've got diabetes.\""
    },
    {
        "character": "Scott",
        "line": "Hey, don't make fun of my diabetes!"
    },
    {
        "character": "Cartman",
        "line": "\"Don't make fun of my diabetes, I'm Scott Malkinson.\" [Kenny laughs]"
    },
    {
        "character": "Stan",
        "line": "You can rip on him, but you guys are hanging out with him. Doesn't that make you think maybe your clout at school has slipped a little?"
    },
    {
        "character": "Kyle",
        "line": "Stan, you're just jealous of that third grader and you think Wendy's gonna go for him unless you start singing and dancing too."
    },
    {
        "character": "Kenny",
        "line": "(Yeah!)"
    },
    {
        "character": "Stan",
        "line": "That isn't true! [no one challenges] Okay, that's totally true. But you guys, we are at risk of becoming the unpopular kids"
    },
    {
        "character": "Scott",
        "line": "Hey, that was supposed to be my power-up pack."
    },
    {
        "character": "Cartman",
        "line": "\"That was supposed to be my power-up pack, I'm Scott Malkinson and I have diabetes.\""
    },
    {
        "character": "",
        "line": "The Gueermo house, living room, night. Bridon looks out the window as his father dances to High School Musical on screen"
    },
    {
        "character": "Mr. Gueermo",
        "line": "Yadada yadada yadada dadadadada High School Musical is so awesome. [the doorbell rings and Mr. Gueermo pauses the video and prances to the door. He opens it and two adults appear]"
    },
    {
        "character": "Male CPS Agent",
        "line": "Mister... Gueermo?"
    },
    {
        "character": "Mr. Gueermo",
        "line": "[barks] What?"
    },
    {
        "character": "Male CPS Agent",
        "line": "[shows his official badge] We're from Child Protective Services. [puts it away] There's some concern you might be physically abusing your child?"
    },
    {
        "character": "Mr. Gueermo",
        "line": "What? Who the hell's been saying that?!"
    },
    {
        "character": "Female CPS Agent",
        "line": "We got a phone call from a concerned student who wishes to remain anonymous."
    },
    {
        "character": "Male CPS Agent",
        "line": "His name is Stan Marsh."
    },
    {
        "character": "Mr. Gueermo",
        "line": "You'd better just turn your asses around and get back in your little car, 'cause there's a world of hurt about to come your way!"
    },
    {
        "character": "Male CPS Agent",
        "line": "Mr. Gueermo, we need to come in and have a word with your son."
    },
    {
        "character": "Mr. Gueermo",
        "line": "[performs a sweeping gesture to usher them in] Oh, by all means. You got the balls to come in here?! Do it! Do it! [the agents enter and walk over to Bridon]"
    },
    {
        "character": "Male CPS Agent",
        "line": "Hello, Bridon, my name is Mr. Kelly. [Mr. Gueermo sneaks up behind him, ready to slap him at any moment] We just wanted to talk to you for a few minutes if that's okay and just maybe... [Mr. Gueermo whistles, Mr. Kelly turns around, and Mr. Gueermo slaps him]"
    },
    {
        "character": "Mr. Gueermo",
        "line": "Yeah! There it is! Slapped you! You probably think I'm finished, huh?! [slap] No, there's another one!"
    },
    {
        "character": "Female CPS Agent",
        "line": "Oh my God!"
    },
    {
        "character": "Mr. Gueermo",
        "line": "[moves over to the female agent] Don't worry, bitch, I didn't forget about you! [slaps her] There's a slap for you! [three slaps follow] Slap, slap, slap! [slaps Mr. Kelly three more times] Yeah, there you go! [slaps the female agent again] Here's a little reach around the back of the head slap! [slaps the female agent, then slaps Mr. Kelly. Mrs. Gueermo rushes in to intervene and take the slaps]"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "Oh God, please, you have to get away! He won't ever stop! [he slaps her seven times]"
    },
    {
        "character": "Mr. Gueermo",
        "line": "Awww. I'm going slap-happy! [chases after the agents and slaps them several more times before they finally reach their car] I'm going slap, slap-happy! Slappity slappin' you, teachin' you a lesson for coming in my house!\n\n [the agents pull away quickly. He notices his next-door neighbor looking on from his own doorway] What are you looking at, Robertson? [in a flash he slaps Robertson three times, and just as quickly he's back inside his house and closes the front door.]\n"
    },
    {
        "character": "",
        "line": "South Park Elementary, next day, hallway. Bebe has something to say."
    },
    {
        "character": "Bebe",
        "line": "They're here! The audition results for the school musical are in! [the kids react and gather round the results sheet on the bulletin board. Butters is on a stool checking out the results for everyone]"
    },
    {
        "character": "Butters",
        "line": "Hey, you got the lead, Wendy. [the girls congratulate her and Wendy says something in reply]"
    },
    {
        "character": "Clyde",
        "line": "Who's the male lead?"
    },
    {
        "character": "Butters",
        "line": "No surprise there. It's Bridon. [the boys and a few girls congratulate Bridon, who stays quiet] I get to be a stand-in! [moments later Wendy catches up to Bridon. Stan looks on from a distance]"
    },
    {
        "character": "Wendy",
        "line": "Congratulations, Bridon. Guess we'll be working a lot together."
    },
    {
        "character": "Bridon",
        "line": "[not enthused] Yeah, great."
    },
    {
        "character": "Stan",
        "line": "God damn it! [walks away. The next scene is him walking down the hall] No matter what I do, this kid just won't stop. [some kids look at him and decide to follow] And now they're gonna be in a show together? Jesus, it's all over for me. [the kids begin to snap their fingers] They'll probably even have a kissing scene. What did I do to deserve this? And what am I suppose to do now? [he stops, the kids stop walking but continue snapping their fingers. Soon they smile in anticipation...]\nSooooomeooooone's in the kitchen with Dinah,\n[the kids' anticipation fades. Stan isn't singing as they'd hope he would]\nSomeone's in the kitchen, I know.\nSomeone's in the kitchen with Dinah\nStrummin' on the old banjo and go and\nFee, fie, fiddle-e-i-o.\nFee, fie, fiddle-e-i-o-o-o-o.\n[Wendy, Bebe, and some other kids arrive]\nFee, fie, fiddle-e-i-o.\nStrumming on the old banjo jo jo...\nGo tell Aunt Rhodie\nGo tell Aunt Rhodie\nGo tell Aunt Rhodie\nThe old gray goose is...\nHappy Birthday to you\nHappy Birthday to...\n[no one is making a sound. Stan puts his hands in his pockets, hangs his head, then turns left and walks away]\n\n\n"
    },
    {
        "character": "",
        "line": "The Gueermo house, night. Mr. Gueermo is getting ready for bed... in an unusual way."
    },
    {
        "character": "Mr. Gueermo",
        "line": "You hear the rhythm. Now is the time, the tiiiiime. It's time to go to bed. It's time to call it a day. You can reach the stars and-\n\n\n"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "[enters in a panic] Oh please. You have to do something."
    },
    {
        "character": "Mr. Gueermo",
        "line": "What are you interrupting me for?!"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "It's our son, he's- he's running away."
    },
    {
        "character": "Mr. Gueermo",
        "line": "What?! [rushes downstairs and stops with flair behind Bridon, who's steps away from the front door] What's going on here, what's this all about?\n\n [brings his arms up and out, pointing to Bridon at the end with his left hand] \nWhat do you think you're doing?\n\n\n"
    },
    {
        "character": "Bridon",
        "line": "Dad, I'm sick of you trying to always-"
    },
    {
        "character": "Mr. Gueermo",
        "line": "Nono! Sing it!"
    },
    {
        "character": "Bridon",
        "line": "[throws his duffle bag down] No! I'm sick of singing!"
    },
    {
        "character": "Mr. Gueermo",
        "line": "Can you believe it? What'd he just say? What's the matter with kids these days?\n\n [fixes his gaze on his wife, who's terrified for a bit.]\n"
    },
    {
        "character": "Mrs. Gueermo",
        "line": "[slowly, carefully] Kids these days.\n\n\n"
    },
    {
        "character": "Mr. Gueermo",
        "line": "Kids these days!\n\n [Bridon ignores him and opens the door. His father flies through the air and slams the door shut with his body] \nUnh unh unh! Just go right back to your room and sing a ballad, mister!\n\n\n"
    },
    {
        "character": "Bridon",
        "line": "Just let me go."
    },
    {
        "character": "Mr. Gueermo",
        "line": "Go ahead. Make my day. [gets down on his left knee and threatens] You get upstairs, or I will slap you until there's little red handprints all over face! [Bridon punches him on the nose] Ow! [covers his nose and stands up] Oh my God, what was that? [runs to his wife] Did you see that?! Oh my God, it hurts so bad! [she punches him harder] Ow. What the \"H\" is going on?! [she punches him again, and he runs off, crying. Bridon looks on in awe] What are you doing?! Everyone's crazy!"
    },
    {
        "character": "",
        "line": "Stan's house, the same night. He's on the sofa immersing himself in the High School Musical movies. Kyle, Cartman, Kenny, and Scott enter."
    },
    {
        "character": "Kyle",
        "line": "Well, I had to see it to believe it!"
    },
    {
        "character": "Cartman",
        "line": "I told you guys. He's been watching High School Musical over and over again."
    },
    {
        "character": "Stan",
        "line": "Actually, this is High School Musical 2. It has a dance-along part."
    },
    {
        "character": "Kyle",
        "line": "We said we wouldn't be a part of this fad and look at you!"
    },
    {
        "character": "Kenny",
        "line": "(Yeah, look at yourself, dude.)"
    },
    {
        "character": "Stan",
        "line": "Look, you guys might be fine with being outcasts and hanging out with Scott Malkinson, but I'm not!"
    },
    {
        "character": "Kyle",
        "line": "You know what? At least Scott Malkinson has some self-respect! At least Scott Malkinson doesn't cave into peer pressure and start doing musicals!"
    },
    {
        "character": "Stan",
        "line": "Scott Malkinson has a lisp and diabetes! Nobody's gonna let him do a musical!"
    },
    {
        "character": "Scott",
        "line": "'At's enough, you guys, it's not cool. Lots of kids have diabetes, and you shouldn't be-"
    },
    {
        "character": "Cartman",
        "line": "You shouldn't pick on kids with diabetes, that's not cool. I'm Scott Malkinson."
    },
    {
        "character": "Stan",
        "line": "Look, guys. [gets off the sofa and walks away from the other boys] The world is changing. We can't fight it, we have to change with it. I've been watching these movies, and from the looks of it, there's gonna be a lot more singing and dancing when we get to high school. [turns around to face them] And if you think we'll gain any respect by ignoring this thing and being individuals, then think about this: right now, [points to them] everyone thinks Butters is way cooler than any of you."
    },
    {
        "character": "Cartman",
        "line": "That's a low blow, Stan."
    },
    {
        "character": "",
        "line": "South Park Elementary, day, the school gym. A basketball game is in progress, five on five. Mr. Mackey and Mr. Adler are doing play-by-play. \"Rock & Roll Part II\" plays from the speakers"
    },
    {
        "character": "Mr. Mackey",
        "line": "Third team foul on Westchester Bobcats, m'kay. Ball goes back over to the Cows."
    },
    {
        "character": "Mr. Garrett",
        "line": "All right, you ready to get in there, Bridon?"
    },
    {
        "character": "Bridon",
        "line": "[approaches wearing #11] I'm ready, coach."
    },
    {
        "character": "Mr. Garrett",
        "line": "Give 'em hell! [Bridon goes in and faces off against the Bobcats' #9. He tosses the ball over to #7, Bradley, and then notices his parents on the bleachers. His mom waves hi, his dad looks away displeased.]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Just a minute to go in the first quarter. [Bridon gets the ball back and shots from the top of the key for a 3 pointer. Everyone applauds him, but his father still isn't looking at him. Mr. Gueermo does, however, notice the crowd's excitement and soon gets into it himself. The song changes to \"We Will Rock You\" and the crowd gets into that with two stomps and a clap. Mr. Gueermo joins right in]"
    },
    {
        "character": "",
        "line": "South Park, next day. The kids are milling around the entrance, so classes haven't started yet."
    },
    {
        "character": "Bebe",
        "line": "Hey Bridon, how come you weren't at musical rehearsals last night?"
    },
    {
        "character": "Bridon",
        "line": "I joined the basketball team. I gave up singing and dancing forever. I'm just not into it."
    },
    {
        "character": "Wendy",
        "line": "You gave it up?"
    },
    {
        "character": "Stan",
        "line": "[walks into view with the other three boys] That's right. You know, sometimes you have to go with what your heart tells you. There's things we're all good at. And we just can't keep them bottled up inside. [music begins to play]\n\n'Cause you gotta do what you wanna do.\nDon't let nothin' get in your way, chase your dream every day. [walks up to a boy and girl]\nTrue, girl, you know it's true,\nthat if you really wanna be you, you've gotta do what you wanna do. [walks back to Bridon]\nHe was unhappy 'cause he just wanted to play ball\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[approaches two other kids] But he finally got the courage to answer his heart's call.\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Just like me, all I ever wanted was to sing and dance.\nAnd now that I stood up for my dream I finally have the chance.\n[the four boys form a chorus line and dance]\n\n\n"
    },
    {
        "character": "Boys",
        "line": "You've gotta do what you wanna do. Even if other people don't really want you to.\n[Kyle whips off his hat while approaching two girls]\nTrue, girl, you know it's true, [returns to the chorus line] that the thing you wanna do is the thing that you should do.\n[Kyle dances away to two other girls]\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "Some kids think I'm strange 'cause I like studying for an exam\nBut I don't let that bother me, because it's who I am. [Cartman dances over to two kids]\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "And I like nothin' better than makin' fun of Jews.\nAnd ripping on black people, though some people think it's rude, but you gotta- [rejoins the chorus line with Kyle]\n\n\n"
    },
    {
        "character": "Boys:",
        "line": "Do what you wanna do.\nJust make sure that what you're doing is what's cool and popular with everyone\nChew, baby, chew and chew.\nWhen you're eating jerky, if eating jerky is what you wanna do.\n\n\n"
    },
    {
        "character": "Bebe",
        "line": "[arrives with Wendy, Red, and another girl during the song] Hey Bridon, can we watch you practice basketball?"
    },
    {
        "character": "Bridon",
        "line": "Uhh, sure. [the girls follow him to the gym. The other students go their separate ways.]"
    },
    {
        "character": "Kyle",
        "line": "Do what you want, don't have restraint.\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Don't stress about it or you just might faint.\n\n\n"
    },
    {
        "character": "Kenny",
        "line": "(If you wanna get high and jack off, it's cool.)\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Try to do what you wanna do!\n\n\n"
    },
    {
        "character": "Boys",
        "line": "Do what you wanna do.\nAs long as what you wanna do is what everybody wants you to.\nGlue, baby, buy some glue\nJust in case if what you're doin' [Stan continues singing, they all keep dancing]\n\n\n"
    },
    {
        "character": "Stan",
        "line": "involves needing scissors and glue!\n\n\n"
    },
    {
        "character": "Scott",
        "line": "Hey guys. Hey guys! [all stop. Stan looks around and doesn't see anyone else]"
    },
    {
        "character": "Stan",
        "line": "Huh? [the other boys turn around]"
    },
    {
        "character": "Kyle",
        "line": "Where did everybody go?"
    },
    {
        "character": "Scott",
        "line": "The girls all wanted to go watch 'at Bridon kid practice basketball."
    },
    {
        "character": "Stan",
        "line": "But the girls like singing and dancing."
    },
    {
        "character": "Scott",
        "line": "No, I think the girls just like that Bridon kid, no matter what he does."
    },
    {
        "character": "Stan",
        "line": "But... No, we just... No, no wait. We just got good at this! Aw!."
    }
]