[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park, day. Cartman is walking over to Jimmy's house. He enters the house eating chips. Jimmy is working on new jokes."
    },
    {
        "character": "Cartman",
        "line": "Hey Jimmy, what are you up to? [closes the door and walks up to Jimmy]"
    },
    {
        "character": "Jimmy",
        "line": "Oh, hey Eric. I was just trying to write some new jokes for my comedy [chokes up] ...rou-routine."
    },
    {
        "character": "Cartman",
        "line": "Yeah well, ya wanna do somethin'? I wanted to hang out with Stan and Kyle, but they're all pissed off at me for somethin' so I have to hang out with you."
    },
    {
        "character": "Jimmy",
        "line": "Sorry Eric, but I really need to work, very much. I haven't written a good joke in over a week."
    },
    {
        "character": "Cartman",
        "line": "[heads to the sofa and lays down on his back] Alright, well maybe I can help you, you know, we can totally write some stuff together."
    },
    {
        "character": "Jimmy",
        "line": "Oh, well, sure. I've never really tried working with a partner, but let's give it a sho- a sh- a-sh, a-sh, shotaroosky. Let's see... I was workin' on this: Why does a squirrel swim on its back? To keep his -nuts dry."
    },
    {
        "character": "Cartman",
        "line": "[while munching] No, that's not that funny. Let's try something else."
    },
    {
        "character": "Jimmy",
        "line": "Ahb. A fireman and a p-p-Polack are eating marshmallows when-"
    },
    {
        "character": "Cartman",
        "line": "No, no. Polacks aren't that funny dude. Try somethin' else. [Jimmy sighs and throws away a sheet of jokes. Hours later there are many more sheets on the floor]"
    },
    {
        "character": "Jimmy",
        "line": "...So the Pope says, \"What are you, a stinking e-evolutionist?\""
    },
    {
        "character": "Cartman",
        "line": "Meh. [Jimmy tosses away another crumpled sheet]"
    },
    {
        "character": "Sarah",
        "line": "Here's some fruit, boys. [sets the plate down by Jimmy] Better for you than potato chips. Oh Jimmy, look out, there's a black widow! [pulls out a newspaper from under Jimmy's desk and smashes the spider with it]"
    },
    {
        "character": "Jimmy",
        "line": "Wow, thanks Mom. [she turns and walks away] You might have saved my life."
    },
    {
        "character": "Cartman",
        "line": "Dude, if I'm trying to be creative, I can't eat fruit. Doesn't your mom have something more substantial to eat?"
    },
    {
        "character": "Jimmy",
        "line": "You can check the freezer. There might be some frozen fishsticks or somethin', if you like fishsticks. [gets an idea, indicated by a small bell]"
    },
    {
        "character": "Cartman",
        "line": "Yeah, I like fishsticks."
    },
    {
        "character": "Jimmy",
        "line": "Wait a minute. Fishsticks... Fish. Dicks. [now he writes the joke excitedly] Ohmigod! It's so obvious. How did I never think of it before? [Cartman looks at him, then sits up]"
    },
    {
        "character": "Cartman",
        "line": "What, dude, you got something?"
    },
    {
        "character": "Jimmy",
        "line": "Alright, just run with me on this, Eric. Say Eric, do you like fishsticks?"
    },
    {
        "character": "Cartman",
        "line": "Yeah."
    },
    {
        "character": "Jimmy",
        "line": "You like putting fishsticks in your mouth?"
    },
    {
        "character": "Cartman",
        "line": "Yeah."
    },
    {
        "character": "Jimmy",
        "line": "Well what are you, Eric? A gay fish?"
    },
    {
        "character": "Cartman",
        "line": "[thinks through the joke] Fish dicks! Aw dude, that's funny as shit! I think we're really onto something here. Let's try it out on the guys."
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The bell rings and the boys are in the hall. Clyde is putting some books away in his locker when Cartman rounds the corner with three other guys: Jimmy, Kenny and Butters."
    },
    {
        "character": "Butters",
        "line": "Ohoho, there's Clyde. Do it to Clyde."
    },
    {
        "character": "Jimmy",
        "line": "Yeah yeah, let's do it to Clyde."
    },
    {
        "character": "Cartman",
        "line": "Okay okay, shushushuh, okay, shush, check it out. Uh hey there Clyde."
    },
    {
        "character": "Clyde",
        "line": "Hey."
    },
    {
        "character": "Stan",
        "line": "[walks up to the other guys] What's going on?"
    },
    {
        "character": "Butters",
        "line": "Eric and Jimmy came up with the funniest joke ever."
    },
    {
        "character": "Cartman",
        "line": "Say Clyde, do you like fishsticks?"
    },
    {
        "character": "Clyde",
        "line": "Yes. [Butters covers his mouth to stifle a laugh]"
    },
    {
        "character": "Cartman",
        "line": "Do you like to put fishsticks in your mouth?"
    },
    {
        "character": "Clyde",
        "line": "Yes. [Butters covers his mouth to stifle a laugh]"
    },
    {
        "character": "Cartman",
        "line": "[points to Clyde with both index fingers] What are you, Clyde? A gay fish?"
    },
    {
        "character": "Butters",
        "line": "[runs up to Cartman and Clyde] HA you said you like fishsticks in your mouth; that makes you a gay fish! [Cartman laughs. Butters soon joins him. Clyde just smiles sheepishly, knowing that's a good joke. Tolkien walks into view and Cartman runs to him. Clyde grins]"
    },
    {
        "character": "Cartman",
        "line": "Tolkien, Tolkien, got a question for you: [clears his throat] Tolkien, do you like fishsticks?"
    },
    {
        "character": "Tolkien",
        "line": "Fishsticks? Yeah, I guess so. [Butters begins to giggle]"
    },
    {
        "character": "Cartman",
        "line": "[motions to Butters to keep quiet for now] Shh shh shh shh Butters Butters. [back to Tolkien] You you like putting fishsticks in your mouth?"
    },
    {
        "character": "Tolkien",
        "line": "Yes."
    },
    {
        "character": "Cartman",
        "line": "What are you?"
    },
    {
        "character": "Butters, Cartman",
        "line": "A gay fish? [Cartman laughs first, then Butters]"
    },
    {
        "character": "Butters",
        "line": "Hey look, there's Kevin Stoley! [runs towards the unseen voice] Hey Kevin, do you like fishsticks? [A hot new joke is born.]"
    },
    {
        "character": "",
        "line": "Mr. Mackey's office. Garrison peeks in..."
    },
    {
        "character": "Mr. Garrison",
        "line": "Hey, hey Mackey? Do you like fishsticks?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Fishsticks? Yeah, I l- I like fishsticks, m'kay?"
    },
    {
        "character": "",
        "line": "At South Park Market."
    },
    {
        "character": "Stephen",
        "line": "Oh hey Peterson, buying fishsticks, I see."
    },
    {
        "character": "Peterson",
        "line": "Yeah, I like fishsticks."
    },
    {
        "character": "Stephen",
        "line": "What are you, Peterson? A gay fish? [everyone laughs]"
    },
    {
        "character": "",
        "line": "The Jimmy Kimmel Show."
    },
    {
        "character": "Announcer",
        "line": "And now, here he is! Jimmy Kimmel! [the studio audience cheers as he goes onstage]"
    },
    {
        "character": "Jimmy Kimmel",
        "line": "Alright, hey, how are we all feelin' tonight? [the audience quiets down] So uhhh, let me ask the guys in the audience a question. Do you like fishsticks?"
    },
    {
        "character": "The Guys",
        "line": "Yes."
    },
    {
        "character": "Jimmy Kimmel",
        "line": "Huh. What are you, a gay fish? [everyone laughs]"
    },
    {
        "character": "",
        "line": "The Late Show with David Letterman."
    },
    {
        "character": "David Letterman",
        "line": "And so uhhh, hey Paul, do you like fishsticks, Paul?"
    },
    {
        "character": "Paul Shaffer",
        "line": "Uhhh, sure?"
    },
    {
        "character": "David Letterman",
        "line": "What are you, Paul, a gay fish? [everyone cracks up over it. Someone in the audience keels over the balcony. Letterman tosses away his notes]"
    },
    {
        "character": "",
        "line": "The Tonight Show with Jay Leno."
    },
    {
        "character": "Jay Leno",
        "line": "So apparently more and more Americans are eating fishsticks. Have you seen this? Have you read about this? Loving fishsticks, kinda makes me wonder, you know? What is everybody, a gay fish? [the studio audience roars with laughter and two men in the front row fall off their chairs and throw up.]"
    },
    {
        "character": "",
        "line": "Another talk show, but without a studio audience."
    },
    {
        "character": "Anchor",
        "line": "It is quite possibly the funniest joke over conceived, and its origin is unknown. The fishsticks joke crosses all border, all races, all ages and ethnic groups and is slowly uniting our country. In fact, the only person who appears to not get the joke is rapper Kanye West, who becomes furious when people use the joke on him."
    },
    {
        "character": "Kanye",
        "line": "Yo, that is messed up, yo! I am not gay, and I sure as hell ain't no fish! Alright?!"
    },
    {
        "character": "Tom Snyder",
        "line": "You. Really. Don't. Get it."
    },
    {
        "character": "Kanye",
        "line": "Hey man, I'm a genius, alright?! I'm the most talented musician in the world! If I was a homosexual, or a fish, I would know!"
    },
    {
        "character": "Tom Snyder",
        "line": "You're a rapper."
    },
    {
        "character": "Kanye",
        "line": "Yes."
    },
    {
        "character": "Tom Snyder",
        "line": "An entrepreneur."
    },
    {
        "character": "Kanye",
        "line": "Yes."
    },
    {
        "character": "Tom Snyder",
        "line": "And you like fish dicks."
    },
    {
        "character": "Kanye",
        "line": "Yes."
    },
    {
        "character": "Tom Snyder",
        "line": "You're a gay fish."
    },
    {
        "character": "Kanye",
        "line": "No! I am not no gay fish!"
    },
    {
        "character": "Tom Snyder",
        "line": "Just gay?"
    },
    {
        "character": "Kanye",
        "line": "I'm not gay and I'm not a fish! Man!"
    },
    {
        "character": "Tom Snyder",
        "line": "[this time goes through joke one step at a time] You are male?"
    },
    {
        "character": "Kanye",
        "line": "Damn right I'm male."
    },
    {
        "character": "Tom Snyder",
        "line": "A male that likes fish dicks."
    },
    {
        "character": "Kanye",
        "line": "Yeah, I like fishsticks."
    },
    {
        "character": "Tom Snyder",
        "line": "You like to put fish dicks in your mouth."
    },
    {
        "character": "Kanye",
        "line": "Yeah."
    },
    {
        "character": "Tom Snyder",
        "line": "You're a gay fish."
    },
    {
        "character": "Kanye",
        "line": "Alright, that does it! I'm gonna kick your motherfuckin' ass! [stands up pushes him off his chair]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The kids are having lunch in the school cafeteria. Stan and Kyle sit opposite each other this time."
    },
    {
        "character": "Cartman",
        "line": "And then it was on Leno and the Jimmy Kimmel show! Dude, that's our joke on national television."
    },
    {
        "character": "Kyle",
        "line": "We know, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Nya nya nya nya nyaaa nya! We are comedy writers and you guys aren't! Ha ha ha ha haaa ha! Jimmy, I've been thinking: We've got to patent the fishsticks joke."
    },
    {
        "character": "Jimmy",
        "line": "P-patent?"
    },
    {
        "character": "Cartman",
        "line": "Yeah dude, there's lots of people out there using our joke on their shows. We should be getting compensated."
    },
    {
        "character": "Jimmy",
        "line": "Well, Eric, th-that's really not how jokes work. I mean, you know, we should just be... happy that the joke is so popular and made a lot of people laugh."
    },
    {
        "character": "Cartman",
        "line": "Dude, fuck that! Maybe you were writing jokes for people's amusement, but I don't work for free. I'm gonna talk to a lawyer so we get what's coming to us! [smiles, takes his tray and walks away]"
    },
    {
        "character": "Kyle",
        "line": "Jimmy, exactly what part of the fishsticks joke did Cartman write?"
    },
    {
        "character": "Jimmy",
        "line": "Well, he didn't actually... write any of it. He just uh..."
    },
    {
        "character": "Kyle",
        "line": "Let me guess: you wrote the joke, and Cartman just laid on the couch eating Twizzlers."
    },
    {
        "character": "Jimmy",
        "line": "Actually it was potato chips."
    },
    {
        "character": "Kyle",
        "line": "I knew it! Don't let that fat turd walk all over you, Jimmy! Stand up for yourself!"
    },
    {
        "character": "Jimmy",
        "line": "W-well, I-I mean he, he was in the room."
    },
    {
        "character": "Craig",
        "line": "Then just give him half."
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Craig",
        "line": "I like you Jimmy, but you're not gonna win this. Consider yourself lucky he's only asking for half."
    },
    {
        "character": "Kyle",
        "line": "Craig, if Cartman didn't do anything, then he doesn't deserve any of the credit!"
    },
    {
        "character": "Craig",
        "line": "Yep. And if I had wheels, I'd be a wagon."
    },
    {
        "character": "Kyle",
        "line": "No dude, screw that! Jimmy, if Cartman didn't write the joke, then definitely don't sign any patent papers with him! Just say \"Cartman, you didn't have anything to do with this joke and you know it!\""
    },
    {
        "character": "Craig",
        "line": "Just give him half."
    },
    {
        "character": "",
        "line": "Kanye speaks to a group of reporters at a conference somewhere."
    },
    {
        "character": "Kanye",
        "line": "There are a lot of people out there making up rumors about me that are malicious and untrue. But I'm going to prove once and for all: I'm not a fish. Because I am a genius, I've ascertained that fish have gills. [a doctor steps up next to him] Doctor, do I have gills?"
    },
    {
        "character": "Doctor",
        "line": "He does not have gills."
    },
    {
        "character": "Kanye",
        "line": "You hear that? No gills! So I can't be a fish. And I'm a genius voice of a generation so I'm not gay! So that is that! Alright?! It's over! Now are there any questions?"
    },
    {
        "character": "Reporter 1",
        "line": "Do you like fishsticks?"
    },
    {
        "character": "Kanye",
        "line": "Love 'em!"
    },
    {
        "character": "Reporter 2",
        "line": "You're a gay fish. [a third reporter laughs and soon the rest of the room is laughing]"
    },
    {
        "character": "Kanye",
        "line": "No I'm not- AAAARGH! [grabs the sides of the podium and shakes with anger]"
    },
    {
        "character": "",
        "line": "Late Night with Conan O'Brien."
    },
    {
        "character": "Conan O'Brien",
        "line": "Alright, recently... Recently we've all come to know the fishsticks joke as probably the funniest, most awesome joke ever, but who originally came up with it? Well here's your answer. Joining us tonight, the brains behind the incredible fishsticks joke, the one and only Carlos Mencia."
    },
    {
        "character": "Carlos Mencia",
        "line": "[dancing in his seat] Yeheah, Vive la Mexico!"
    },
    {
        "character": "Conan O'Brien",
        "line": "So Carlos, you've got a show on Comedy Central, a stand-up tour, where did you have time to come up with this classic joke?"
    },
    {
        "character": "Mencia",
        "line": "Well you know I just kicking it with my homies and my brain, you know, my brain is always so full of ideas 'cause I'm so fonny and stuff, so I was just all like, \"\"Hey, Papito, you like fishsticks?\" And my homeboy says \"Yeah Carlos\" you know, \"you're so funny!\" And then it just occurred to me. I said, \"Oh man, you must be a gay fish, homes!\" [the studio audience roars with laughter, and he begins to dance in his seat again] And this is how I came up with it, mi amigos! [Conan claps. Cartman, looking at the show on TV, is pissed off]"
    },
    {
        "character": "Cartman",
        "line": "[shakes with rage, then turns left and walks away] Motherfucker!"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Cartman runs up to Jimmy in the hallway."
    },
    {
        "character": "Cartman",
        "line": "Jimmy, dude, did you see?! Carlos Mencia is taking credit for our joke!"
    },
    {
        "character": "Jimmy",
        "line": "Really?"
    },
    {
        "character": "Cartman",
        "line": "Yeah dude. I told you this would happen. Now look, I got a lawyer to draw up some patent papers. We've got to sign these so that people know that the joke belongs to you and me!"
    },
    {
        "character": "Jimmy",
        "line": "Aahhm, I don't know, Eric. I really don't think I want to sign that very much."
    },
    {
        "character": "Cartman",
        "line": "But Jimmy, some fat turd is taking credit for something he didn't do!"
    },
    {
        "character": "Jimmy",
        "line": "Well, to be perfectly f-f-f-frank, Eric, I think I came up with a little bit more of the joke than you did."
    },
    {
        "character": "Cartman",
        "line": "What?!"
    },
    {
        "character": "Jimmy",
        "line": "Well, you know, I mean, I basically wrote the thing, and you just kind of ate chips."
    },
    {
        "character": "Cartman",
        "line": "Jimmy, that's messed up. We decided that day to write together. Don't you remember?"
    },
    {
        "character": "",
        "line": "Cartman remembers entering Jimmy's house."
    },
    {
        "character": "Cartman",
        "line": "Hey Jimmy, wanna hang out?"
    },
    {
        "character": "Jimmy",
        "line": "Sorry Eric, but I've gotta write some jokes. Unless you wanna team up or somethin'."
    },
    {
        "character": "Cartman",
        "line": "Team up? Okay, let's write some jokes together."
    },
    {
        "character": "Sarah",
        "line": "Here's some fishsticks guys. I hope you like fishsticks."
    },
    {
        "character": "Cartman",
        "line": "Do we like fishsticks? What does she think we are? Gay fish? [Jimmy and Cartman laugh, but Cartman notices something on Jimmy's desk.] Uh oh, look out, Jimmy, it's a black widow! [gets off the couch, gets a newspaper, walks over to the desk, and smashes the spider dead.]"
    },
    {
        "character": "Jimmy",
        "line": "Wow, thanks Eric."
    },
    {
        "character": "",
        "line": "Back to the present. Jimmy looks helpless."
    },
    {
        "character": "Jimmy",
        "line": "Is that... Is that how it happened?"
    },
    {
        "character": "Cartman",
        "line": "Look, exactly who came up with which part of the joke isn't even relevant. We had an agreement Jimmy. And if you wanna go back on that now, well then you're no better than a Jew."
    },
    {
        "character": "Jimmy",
        "line": "I'm... I'm sorry?"
    },
    {
        "character": "Cartman",
        "line": "It's cool man, it's cool. [turns around and walks away]"
    },
    {
        "character": "",
        "line": "Kanye West in Concert, night. at an indoor arena looking similar to Madison Square Garden"
    },
    {
        "character": "Announcer",
        "line": "Here he is, y'all! Give it up for Kanye West!"
    },
    {
        "character": "Kanye",
        "line": "[gets onstage] Yo. Ungh. Yo. [turns to look at the audience] Yo, whoa! Whoa, what the hell?! [a lot of audience members carry signs saying that Kanye is a gay fish and that he likes fishsticks]"
    },
    {
        "character": "Audience",
        "line": "Gay fish! Gay fish! Gay fish!"
    },
    {
        "character": "Kanye",
        "line": "Yo, fuck this noise, yo! [throws down his mic and storms offstage]"
    },
    {
        "character": "",
        "line": "Kanye's mansion, living room. He looks at a board while his entourage stands at the other end of the room looking at him."
    },
    {
        "character": "Kanye",
        "line": "Just doesn't make any sense, yo. Why is everyone calling me a gay fish?"
    },
    {
        "character": "House",
        "line": "Kanye, look, we all think it would be better if you would just drop it. Ya-you know, I mean, ih-if you don't get it, you don't get it."
    },
    {
        "character": "Kanye",
        "line": "What do you mean, I don't get it, House?! I'm a genius. I'll understand it, I just need to break it down is all. Now let's see... [he's writing on a whiteboard. So far he has \"Fishsticks plus Me equals Gayfish\"] Somethin' about fishsticks... interacting with me... makes me gay fish."
    },
    {
        "character": "Aide 1",
        "line": "Kanye, really..."
    },
    {
        "character": "Kanye",
        "line": "Shut up! [looks at the whiteboard again.] Alright, now what do we know about fishsticks? [adds more words to the board] They're breaded, they're fried, they're frozen. Then under me we have rapper, genius. And gay fish are homosexual. They swim. [begins connecting words] Is it because breaded has something to do with genius? Which swims?"
    },
    {
        "character": "House",
        "line": "No, because you said you like fish dicks, Kanye! Don't, don't you get it? You see, fish dicks is a is a play on words."
    },
    {
        "character": "Kanye",
        "line": "I don't need anyone tellin' me \"play on words\"! I'm a motherfuckin' lyrical wordsmith motherfuckin' genius!"
    },
    {
        "character": "",
        "line": "The boys' restroom at South Park Elementary, day. Kyle is at the urinal when Cartman walks in a few seconds later."
    },
    {
        "character": "Cartman",
        "line": "Hey Kyle, can I talk to you for a second?"
    },
    {
        "character": "Kyle",
        "line": "Dude, get out of here! I'm peeing."
    },
    {
        "character": "Cartman",
        "line": "[walks off a bit] It's just... I don't know what to do about Jimmy. I'm starting to think he might try and Jew me out of my half of the fishsticks joke. [Kyle zips up and goes to the sink to wash his hands] I just... need you to teach me some Jew defensive moves, Kyle. Because we really both did come up with it. [Kyle finishes up, grabs a paper towel, wipes his hands dry, and turns to Cartman]"
    },
    {
        "character": "Kyle",
        "line": "You know what, Cartman? I believe you."
    },
    {
        "character": "Cartman",
        "line": "You do?"
    },
    {
        "character": "Kyle",
        "line": "Yes, I believe that you believe you helped write that joke. That's how people like you work! Your ego is so out of whack that it will do whatever it can to protect itself. And people with a messed up ego can do these mental gymnastics to convince themselves they're awesome, when really, they're just douchebags! [turns and leaves the bathroom]"
    },
    {
        "character": "Cartman",
        "line": "[after some thought] But, I'm sure I helped come up with the joke. Didn't I?"
    },
    {
        "character": "",
        "line": "Cartman remembers entering Jimmy's house. This time things go by quickly."
    },
    {
        "character": "Cartman",
        "line": "Hey Jimmy, what's up dawg?"
    },
    {
        "character": "Jimmy",
        "line": "Oh hey Eric. Just workin' on some jokes."
    },
    {
        "character": "Cartman",
        "line": "That's cool. You wanna write some together? [walks out of view]"
    },
    {
        "character": "Jimmy",
        "line": "Hey, that'd be great! I've always wanted to work with you. You're really funny and you're totally not fat."
    },
    {
        "character": "Cartman",
        "line": "[pulls up a chair] Cool, thanks. Let's get to work! Now let's see... something that's a play on words, I don't know... fishsticks. You know, 'cause it, 'cause dicks."
    },
    {
        "character": "Jimmy",
        "line": "Hey, you're really onto something there."
    },
    {
        "character": "Sarah",
        "line": "Hello Eric. Have some chips, because you're totally not fat at all."
    },
    {
        "character": "Cartman",
        "line": "Oh thank you Mrs. Valmer. [she walks off] Now let's see... The setup could be... \"Do you like fishsticks?\""
    },
    {
        "character": "Jimmy",
        "line": "Right. And then I say, \"Yeah.\""
    },
    {
        "character": "Cartman",
        "line": "So then I can say, \"What are you, a gay fish?\""
    },
    {
        "character": "Jimmy",
        "line": "Oh wow, this is incredible! [something crashes into the house, making it shake violently. Jimmy and Cartman look at the source of the crash. A dragon wanders in]"
    },
    {
        "character": "Sarah",
        "line": "What is that?"
    },
    {
        "character": "Cartman",
        "line": "It's a dragon of some kind! Don't worry, I can save you all! [leaps out of his seat with a sword out of nowhere and slashes the dragon across the chest, making it bleed. It falls on its back all of a sudden. Eric leaps onto its body and stabs the sword into its chest. It dies.]"
    },
    {
        "character": "Butters",
        "line": "[looks through the window] Hey look, Eric killed a dragon."
    },
    {
        "character": "Clyde",
        "line": "[opens the front door] He's the most awesome kid in school!"
    },
    {
        "character": "Wendy",
        "line": "And he's not fat at all."
    },
    {
        "character": "Cartman",
        "line": "Thanks you guys!"
    },
    {
        "character": "",
        "line": "Back to the present."
    },
    {
        "character": "Cartman",
        "line": "Nnnope. No, I definitely helped write the joke. All I can hope is Jimmy doesn't try and Jew me over."
    },
    {
        "character": "",
        "line": "Kanye's mansion, living room. He's written down some more stuff and made more connections on the whiteboard."
    },
    {
        "character": "Kanye",
        "line": "Is it perhaps that I'm fashionable, and fishsticks are crunchy?"
    },
    {
        "character": "Aide 2",
        "line": "Yo Kanye, KANYE! We found him money."
    },
    {
        "character": "Kanye",
        "line": "Found who?"
    },
    {
        "character": "Aide 2",
        "line": "You told us to track down whoever started the whole fishstick thang. We found out who, dawg."
    },
    {
        "character": "Mencia",
        "line": "[tied down to a chair in Kanye's study, his voice shaking] Come on, maaaan. What is this, maaaan? What the fuck is goin' on maaaan? [Kanye enters the room. His entourage makes way] Oh fuck maaaan, Kanye Wehhst? Noo shiiit maaan, okay look it wasn't me. I didn't really start the fishstick thing, alriight?"
    },
    {
        "character": "Kanye",
        "line": "You're just sayin' that now 'cause you're scared."
    },
    {
        "character": "Mencia",
        "line": "No man it's truuue. I stole it maaan. I took credit for it 'cause I'm not actually funneee. Come on, maaan, do you know what it's like? Being a comedian but not being funneee? Come on, Kanye, I just take jokes and repackage them with a Mexican accent, maaan."
    },
    {
        "character": "Kanye",
        "line": "Think you can make fun of me? I'm a genius! I'm the voice of a generation! What are you?!"
    },
    {
        "character": "Mencia",
        "line": "Nothing! Look at me maaan. I'm not funny, I steal jokes, my dick don't work maaan. I got to piss in a plastic bag, man, I got no dick."
    },
    {
        "character": "Kanye",
        "line": "I ain't gonna hurt you. I pay people to do that for me."
    },
    {
        "character": "Mencia",
        "line": "Awww shih oh no man, come on, I got no dick, man! [Kanye's men whip out their own back and start whacking Mencia all over. His right hand gets broken, his left shin bleeds. The men stop as Kanye approaches him]"
    },
    {
        "character": "Kanye",
        "line": "[in Mencia's face] Now, explain it to me. Why do people think I'm a gay fish?"
    },
    {
        "character": "Mencia",
        "line": "'Cause... 'cause you like fish dicks, man. Come on, maaan. Don't you get it? Please, just get it, maaan."
    },
    {
        "character": "Kanye",
        "line": "Why- Look at me, look at me! [Mencia manages to look at him] I love fishsticks. I love putting fishsticks in my mouth. [waits a while for an answer]"
    },
    {
        "character": "Mencia",
        "line": "You're a- ...you're a gay fish, maaan. [Kanye backs up, swings at Mencia and decapitates him, leaving his head hanging from his body by some skin]"
    },
    {
        "character": "",
        "line": "Ellen."
    },
    {
        "character": "Ellen DeGeneres",
        "line": "Thank you, thank you very much. Well, about a week ago our country was blessed with the fishsticks joke. And ever since then us comedians have been kicking ourselves for not thinking of it. [the audience laughs] But today we have with us the true creators of the fishsticks joke. Please welcome the comedy team of Cartman and Valmer. [Cartman and Jimmy go onstage and sit on the couch facing Ellen] Hey guys!"
    },
    {
        "character": "Cartman",
        "line": "Hi Ellen. [to the audience] Do you guys like fishsticks? [the audience laughs] Thank you, thank you. No, really. Thank you."
    },
    {
        "character": "Ellen",
        "line": "So guys, I gotta ask: how did you come up with this incredible joke?"
    },
    {
        "character": "Jimmy",
        "line": "It was just a-"
    },
    {
        "character": "Cartman",
        "line": "Ellen, comedy is like a game of racquetball, you know? You serve, and the other person hits it back. It bounces off the wall, you backhand it. And it goes back and forth and back and forth and then hopefully you've got a good joke. Thank you."
    },
    {
        "character": "Ellen",
        "line": "But guys, this joke is so... perfect. Can you explain how nobody thought of it before?"
    },
    {
        "character": "Jimmy",
        "line": "Well Ellen, the tr- tr- tr-"
    },
    {
        "character": "Cartman",
        "line": "Truth of the matter is that there has never really been a team like us before. I mean let's be perfectly honest: a lot of people wouldn't work with someone who's disabled. But I see past that. I look beyond Jimmy's disabilities and find ...a bond which can unite us in comedy. Working with crippled people is really ...important. [the audience applauds and cheers]"
    },
    {
        "character": "Ellen",
        "line": "That's so great. And, and are you crying, Jimmy?"
    },
    {
        "character": "Jimmy",
        "line": "Yes Ma'am. [the best and worst of times for him]"
    },
    {
        "character": "Cartman",
        "line": "Ahaw don't cry, pal. You're gonna get me started. Anyway, what was really important for us as a team, Ellen, was to make sure that everyone knew that we came up with the joke, and not Carlos Butthole Mencia."
    },
    {
        "character": "Ellen",
        "line": "I see. And did you know that Carlos Mencia was found dead in his house this morning with fishsticks stuffed down his open neck hole? [Jimmy and Cartman are alarmed]"
    },
    {
        "character": "Cartman",
        "line": "Uhhh excuse me? [the crowd gets rowdy.]"
    },
    {
        "character": "",
        "line": "Kanye's mansion. He was looking at the show with bat in hand..."
    },
    {
        "character": "Kanye",
        "line": "Get my jet ready. Looks like we got another inning to play. [walks up to the wall-mounted TV and smashes it with the bat.]"
    },
    {
        "character": "",
        "line": "Jimmy's house, day, Jimmy's room. Cartman and Jimmy enter, with Jimmy still distraught."
    },
    {
        "character": "Cartman",
        "line": "Alright, so check it out: We've got offers from Van de Kamp's and Gorton's Fisherman to do commercials."
    },
    {
        "character": "Jimmy",
        "line": "It's always been my dream to go on a national TV show and talk about the c-c-craft of comedy."
    },
    {
        "character": "Cartman",
        "line": "Yeah, that was kewl huh?"
    },
    {
        "character": "Jimmy",
        "line": "Eric, there's something I really need to know."
    },
    {
        "character": "Cartman",
        "line": "Whassat?"
    },
    {
        "character": "Jimmy",
        "line": "How do you live with yourself? You know you had nothing to do with the fishsticks joke. [Cartman gets worried] But you just keep pretending. How do you look at yourself in the f-f-fucking mirror?! That's what I want to know!"
    },
    {
        "character": "Cartman",
        "line": "So... here it is."
    },
    {
        "character": "Jimmy",
        "line": "How do you take credit for something you didn't do?!"
    },
    {
        "character": "Cartman",
        "line": "That is bullcrap Jimmy, and you know it! I had just as much to do with the fishsticks joke as you did! [Kanye kicks the bedroom door open and enters the room. His men pour in and start smashing the furniture apart] Dude, it's Puff Daddy!"
    },
    {
        "character": "Kanye",
        "line": "Tie up these motherfuckers! [cut to the next scene, in which Kanye swings at a lamp and shatters it, then looks at his hostages] Now I'm gonna ask you motherfuckers one more time: why did you start these rumors about me?!"
    },
    {
        "character": "Jimmy",
        "line": "Please, I wasn't starting rumors about you. I don't even know who you are."
    },
    {
        "character": "Kanye",
        "line": "Aw right. Everyone knows who I am! I wanna know how this got started!"
    },
    {
        "character": "Jimmy",
        "line": "Well, we, we were just talking about ideas for jokes and then-"
    },
    {
        "character": "Cartman",
        "line": "Oh, so now it's we, huh Jimmy? A minute ago you said you did it all yourself!"
    },
    {
        "character": "Jimmy",
        "line": "Well I just but I buh I was, gonna ebeh-"
    },
    {
        "character": "Cartman",
        "line": "Abebeh, abebebebebeah! We both came up with it together! You wanna know how it happened?!"
    },
    {
        "character": "",
        "line": "The fourth recollection. Cartman enters Jimmy's house in a rather nice outfit and sunglasses."
    },
    {
        "character": "Cartman",
        "line": "Hello Jim."
    },
    {
        "character": "Jimmy",
        "line": "Oh boy! It's my best pal, Eric!"
    },
    {
        "character": "Cartman",
        "line": "[moves the glasses back over his cap] What are you up to?"
    },
    {
        "character": "Jimmy",
        "line": "I'm trying to write jokes. But I'm not as funny as you, so it's tough."
    },
    {
        "character": "Cartman",
        "line": "Well, maybe I can help you. We can team up. [goes for a chair]"
    },
    {
        "character": "Jimmy",
        "line": "Ruh really? Wow, you would help me even though I'm crippled. You are caring and not fat. [hands his joke sheet to Cartman as Cartman brings the chair over and sits next to him]"
    },
    {
        "character": "Cartman",
        "line": "Now let's see, how about a joke that has something to do with... fishsticks. You know, 'cause fishsticks sounds like fish dicks, Jimmy."
    },
    {
        "character": "Sarah",
        "line": "[brings in a plate of potato chips] Eric Cartman, you are handsome and not even remotely fat."
    },
    {
        "character": "Cartman",
        "line": "Thanks. [Sarah walks away] So, what I'm thinking is, \"Do you like fishsticks in your mouth?\" [something crashes into the house, making it shake violently. Jimmy and Cartman look around.]"
    },
    {
        "character": "Jimmy",
        "line": "What was that? [Butters opens the door and steps in]"
    },
    {
        "character": "Butters",
        "line": "Eric! Eric, you have to save us! An entire army of Jew robots! [outside, everyone scatters as robots march down the street firing off semiautomatic weapons. Cartman runs out to see what's happening. Butters and Jimmy follow right behind. Officer Barbrady and Mayor McDaniels look on helplessly]"
    },
    {
        "character": "Cartman",
        "line": "Oh my God, what are Jewbots doing here? [takes off his glasses] Flame on! [becomes engulfed in flames and flies into the air. He then sends streams of flames at the robots, destroying them instantly. He flies back down to his starting point] Flame off! [the flames disappear. Other fourth graders appear: Annie, Millie, Red, Clyde, Tolkien and Wendy]"
    },
    {
        "character": "Wendy",
        "line": "You saved everyone from the Jewbots, Cartman."
    },
    {
        "character": "Cartman",
        "line": "Come on, Jimmy, we gotta go back and finish that joke! [runs in and finishes the joke in a flourish. Jimmy walks in] \"Like fishsticks in your mouth? What are you a gay fish?\" There! [other kids look in]"
    },
    {
        "character": "Jimmy",
        "line": "Wow Eric, in-credible! Too bad I'm a dick and I'm gonna take all the credit. Su-su-suck it, bitch!"
    },
    {
        "character": "",
        "line": "Back to the present."
    },
    {
        "character": "Cartman",
        "line": "Aw dammit! I guess it really was all me who came up with it."
    },
    {
        "character": "Jimmy",
        "line": "What?!"
    },
    {
        "character": "Cartman",
        "line": "You've gotta let Jimmy go, it's all my fault."
    },
    {
        "character": "Jimmy",
        "line": "Jesus Eric, he's gonna kill you! You won't even admit it was just me, knowing you're gonna die?"
    },
    {
        "character": "Cartman",
        "line": "Jimmy, you really believe that you came up with it all on your own? Oh my God, wait. I totally get it now."
    },
    {
        "character": "Kanye",
        "line": "What? I, I still don't get anything."
    },
    {
        "character": "Cartman",
        "line": "All this time I've been mad at you, Jimmy, for trying to take all the credit, but, now I realize it's just that your ego has made you believe things happened differently. That's what Kyle was trying to tell me. That you have such a huge ego you do these mental gymnastics to make yourself a part of things."
    },
    {
        "character": "Jimmy",
        "line": "Rih, r-r-really?"
    },
    {
        "character": "Cartman",
        "line": "I thought you were just trying to Jew me out of my part of the credit, but now I realize that... some people just have egos that are so out of whack that no matter what people tell them, they can't accept the truth of who they are. [Kanye looks as if Cartman is talking about him] Jimmy, I owe you an apology. I realize now you can't help believing you created the entire joke, because your ego won't let you think otherwise. I just have to accept that."
    },
    {
        "character": "Jimmy",
        "line": "Thanks, Eric, for being so understanding."
    },
    {
        "character": "Kanye",
        "line": "He's right. For so long I've considered myself God's gift to the world that I couldn't take it when people made fun of me. But they weren't makin' fun of me. They were tryin' to help me. [walks up to the boys and genuflects before them] Boys I understand what you did now. [to his men] Untie them guys. I know what I have to do."
    },
    {
        "character": "",
        "line": "The Santa Monica Pier, furthest point from land. Kanye stands at the edge of the pier ready to jump in."
    },
    {
        "character": "Aide 2",
        "line": "Yo Kanye! You sure about this?"
    },
    {
        "character": "Kanye",
        "line": "It's time for me to stop runnin'. I need to believe what people tell me. [turns and faces his entourage.] Let all my fans know I love 'em, but a gay fish just can't live in the outside world forever. Don't be sad for me guys! [turns around, runs, and dives into the ocean below] I'm goin' home! [his crew looks down into the water as Kanye begins swimming in his new environment]"
    },
    {
        "character": "",
        "line": "The waters off Santa Monica Beach. Kanye is swimming among the fish as a song begins..."
    },
    {
        "character": "Kanye",
        "line": "(Uh. Come on.)\nI've been so lonely, girl, I've been so sad and down.\nCouldn't understand why haters joked around\nI wanted to be free with other creatures like me\nAnd now I got my wish...\n'Cuz I know that I'm a gay fish gay fish (Gay fish, yo)\nMotherfuckin' gay fish gay fish (I'm a fish, yo)\nGoing on a gay fish gay fish (it's alright, girl)\nMakin' love to other gay fish gay fish (Unh)\nAll those lonely nights at the grocery store\nIn the frozen fish aisle feeling like a whore\n 'Cuz I wasn't being true even though everyone said\nThat I had to make a switch (gay fish)...\nNow I know that I'm a gay fish gay fish (Gay fish, yo)\nMotherfuckin' gay fish gay fish (I'm a, I'm a fish, yo)\nGoing on a gay fish gay fish (Yes, now where I belong, girl)\nMaking love to other gay fish.\n\n\n\n"
    },
    {
        "character": "",
        "line": "During the song, the following happens: Kanye begins to swim like a fish. He spots a yellow fish and lets it circle him a few times. He then hugs it and takes it to the surface. He then gives it a French kiss, then flips backwards into the water with it. He swims again, alone, when a large fish begins to follow him. He notices, swims to it, and begins to rub against it. Then he just swims with it, hugging its belly."
    }
]