[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "A television is on, and a new show seems to be on the air."
    },
    {
        "character": "Announcer",
        "line": "And now back to Huntin' and Killin'  with South Park's favorite hunters, Jimbo and Ned!"
    },
    {
        "character": "",
        "line": "Jimbo and Ned are on a studio based on a hunting lodge. Jimbo and Ned each have weapons, Ned's flamethrower is even lit, ready to go."
    },
    {
        "character": "Jimbo",
        "line": "Hi, I'm Jimbo Kern, and this here is Ned. Say hi, Ned."
    },
    {
        "character": "Ned",
        "line": "M-hi, Ned."
    },
    {
        "character": "Jimbo",
        "line": "Arrgh-ha-ha-ha! Now, isn't that great?"
    },
    {
        "character": "",
        "line": "The cameraman give him a thumbs up."
    },
    {
        "character": "Jimbo",
        "line": "We have a terrific show for you today: we're gonna kill some elk, and we're gonna kill some mountain goats. Now, the new law passed by Colorado legislature, which Ned and I call \"Pussy Law #4\", states that we can no longer kill animals in defense.\"PUSSY LAW #4\"\nNO ANIMAL SHALL BE HARMED,\nEVEN IN SELF DEFENSE, UNLESS\nSPECIFIC LICENSE AND SEASON IS\nIN ORDER. SELF DEFENSE CAN ONLY\nBE JUSTIFIED BY EXTREME, PROVABLE\nPERIL AND OR DOCUMENTED VISIBLE\n\nBODILY HARM.\n\nIn other words, our old line of, \"It's comin' right for us\"--\n\n"
    },
    {
        "character": "Ned",
        "line": "It's comin' right for us."
    },
    {
        "character": "Jimbo",
        "line": " --no longer works. So now, we only kill animals to, quote, \"thin out their numbers\". If we don't hunt, then these animals will grow too big in number and they won't have enough food. So you see, we have to kill animals, or else they'll die."
    },
    {
        "character": "",
        "line": "An awkward moment. Jimbo, Ned and the cameraman look at each other."
    },
    {
        "character": "Jimbo",
        "line": "Uhh... So roll the tape."
    },
    {
        "character": "",
        "line": "A trill, and the tape shows a field into which Jimbo and Ned wander."
    },
    {
        "character": "Jimbo",
        "line": "Here we are at Schaefer's Crossing, lookin' for some animals."
    },
    {
        "character": "Jimbo",
        "line": "Lookie, Ned, there's some deers!"
    },
    {
        "character": "",
        "line": "A group of deer looks up and stares at them."
    },
    {
        "character": "Jimbo",
        "line": "Quick, Ned! Thin out their numbers!"
    },
    {
        "character": "Ned",
        "line": "Thin out their numbers!"
    },
    {
        "character": "",
        "line": "Walks up to the deer and fires up the flamethrower, producing a huge flame. The deer are incinerated where they stand, and their bones crumble."
    },
    {
        "character": "Jimbo",
        "line": "Good work, Ned. Now they won't starve."
    },
    {
        "character": "Jimbo",
        "line": "That sure was a great hunting trip. We saved those deer from extinction."
    },
    {
        "character": "Ned",
        "line": "Mmm-we're environmentalists."
    },
    {
        "character": "Jimbo",
        "line": "Comin' up next, we're gonna drop some napalm on an unsuspecting family of beavers. And also, try to thin out the numbers of some endangered species."
    },
    {
        "character": "",
        "line": "South Park Elementary. Class is in session. Mr. Garrison writes \"Vietnam\" on the blackboard."
    },
    {
        "character": "Cartman",
        "line": "Mr. Garrison, what's Vietnam?"
    },
    {
        "character": "Mr. Garrison",
        "line": "\"What's Vietnam?\" A question a child might ask, but not a childish question. Heheheheheheheheheh. Children, for the next few days, we'll be learning all about Vietnam. Chances are that somebody in your own lives was affected by this incredible war."
    },
    {
        "character": "Mr. Hat",
        "line": "That's right, Mr. Garrison. The Vietnam War was sticky and icky."
    },
    {
        "character": "",
        "line": "Kyle raises his hand."
    },
    {
        "character": "Kyle",
        "line": "Mr. Garrison, were you in Vietnam?"
    },
    {
        "character": "",
        "line": "Mr. Garrison frowns as he seems to recall an incident in that war. An injured man is dragged to a helicopter as fresh troops wait to replace him."
    },
    {
        "character": "Injured Man",
        "line": "Aaawwwgh... Aaawwwgh..."
    },
    {
        "character": "Leader",
        "line": "Come on, men! Let's go! Jump out of the chopper!"
    },
    {
        "character": "",
        "line": "The class is waiting. Now Mr. Garrison is smiling as the next scene begins. A group of men is seen disrobed and bathing. At the end of it, he laughs to himself."
    },
    {
        "character": "Man 1",
        "line": "Who's next to take a shower?"
    },
    {
        "character": "Man 2",
        "line": "Me-ee!"
    },
    {
        "character": "Man 3",
        "line": "I am."
    },
    {
        "character": "Man 1",
        "line": "You just took one last week, silly."
    },
    {
        "character": "Man 2",
        "line": "Oh, where can I hide this big pipe?"
    },
    {
        "character": "Mr. Garrison",
        "line": "No, I wasn't in Vietnam, but sometimes, I like to pretend I was. Anyway, children, I'm going to assign you all a paper."
    },
    {
        "character": "Class",
        "line": "Awww..!"
    },
    {
        "character": "Cartman",
        "line": "Son of a bitch."
    },
    {
        "character": "Mr. Garrison",
        "line": "I want you all to find somebody in your own life who was in Vietnam and interview them about it."
    },
    {
        "character": "Clyde",
        "line": "What if we don't know anybody who was in Vietnam?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Then you get an F, fail the third grade, and have to get a job cleaning septic tanks to support your drug habit."
    },
    {
        "character": "Clyde",
        "line": "Oh."
    },
    {
        "character": "Stan",
        "line": "Dude, my uncle Jimbo was in Vietnam."
    },
    {
        "character": "Kyle",
        "line": "Hey, yeah! He and Ned do that stupid TV show."
    },
    {
        "character": "",
        "line": "Back to Huntin' and Killin, in a special segment..."
    },
    {
        "character": "Jimbo",
        "line": "And now, time for Jimbo's Mysteries of the Unexplained."
    },
    {
        "character": "",
        "line": "The letters are wavy and uneven. The boys come to see the taping."
    },
    {
        "character": "Jimbo",
        "line": " One of our loyal viewers from South Park sent us some 8mm film of what he claims to be the Mexican Staring Frog of Southern Sri Lanka. Now, as you all know, the Mexican Staring Frog of Southern Sri Lanka can supposedly kill you with one horrid gaze. If a person even so much as looks into the frog's eyes, they can be paralyzed, or even die. And this film proves that that frog may very well exist."
    },
    {
        "character": "",
        "line": "The film plays. Shown is a snowy field, with the camera looking from behind some blades of grass."
    },
    {
        "character": "Jimbo",
        "line": "Now watch carefully, you're gonna see the Mexican staring frog."
    },
    {
        "character": "",
        "line": "Nothing seems to be happening."
    },
    {
        "character": "Jimbo",
        "line": "There! There, did you see it? Roll that back again!"
    },
    {
        "character": "",
        "line": "The film is replayed."
    },
    {
        "character": "Jimbo",
        "line": "Now, freeze it!"
    },
    {
        "character": "",
        "line": "The film is paused, and there is a very blurry object flying through the air."
    },
    {
        "character": "Jimbo",
        "line": "Well, I'd like to know what all you skeptics have to say now! What do you think, Ned?"
    },
    {
        "character": "Ned",
        "line": "M-whoa, I'm scared."
    },
    {
        "character": "Jimbo",
        "line": "Well, be sure to join us next time. Until then...\nWe're so glad you spent your time with us\nWhile we slaughtered our way through nature's guts\nCome again and stay a while\nWe'll kill a lot more living things to make them bleed\n\n\n"
    },
    {
        "character": "Ned",
        "line": "Mm-good night."
    },
    {
        "character": "Cameraman",
        "line": "A-and we're cut. Great show, guys."
    },
    {
        "character": "Jimbo",
        "line": "Oh, lookie who's here. My little nephew Stanley."
    },
    {
        "character": "",
        "line": "The boys approach him."
    },
    {
        "character": "Jimbo",
        "line": "So, you're interested in your Uncle Jimbo's big TV show, huh?"
    },
    {
        "character": "Stan",
        "line": "No. We have to do a stupid report on Vietnam. You and Ned are the only guys we know who were there."
    },
    {
        "character": "Jimbo",
        "line": "Oh. Yeah, we sure were."
    },
    {
        "character": "Cartman",
        "line": "Was it fun?"
    },
    {
        "character": "Kyle",
        "line": "Cartman! What kind of stupid-ass question is that?! Of course it was fun!"
    },
    {
        "character": "Jimbo",
        "line": "Well, sure, Vietnam was fun. But not like goin-to-the-circus fun, or fly-fishin-in-Montana fun. No, Vietnam was more like shovin' shards of broken glass up your ass and then sittin' in a tub of Tabasco sauce fun."
    },
    {
        "character": "Stan",
        "line": "Whoa!"
    },
    {
        "character": "Jimbo",
        "line": "Yepper, that's where me and Ned met."
    },
    {
        "character": "",
        "line": "Flashback to circa 1975, to a beach. A man write something on a notebook as helicopters take turns landing on a helipad below. An amusement park is just to the right, with a carousel and a log ride. A log comes into view with screaming riders. \"Time of the Season\" by The Zombies, plays."
    },
    {
        "character": "Jimbo",
        "line": "I remember I had just gotten off the Ferris wheel."
    },
    {
        "character": "Jimbo",
        "line": "Oh, boy, what a gorgeous day!"
    },
    {
        "character": "",
        "line": "A bird alights on his upper arm and sings to him. He whistles back."
    },
    {
        "character": "Sergeant",
        "line": "Kern, get over here! The new privates are here. I'm assigning one of them to you as a trainee. Ned Gerblansky."
    },
    {
        "character": "",
        "line": "The crowd parts to reveal him."
    },
    {
        "character": "Ned",
        "line": "Ned Gerblansky reporting, sir."
    },
    {
        "character": "Sergeant",
        "line": "Thanks, Ned. Now, the bad guys have been spotted about ten klicks north of here. I know that you and Kern are best suited to take them out. Are you up for it?"
    },
    {
        "character": "Jimbo, Ned",
        "line": "Sir, yes, sir!"
    },
    {
        "character": "",
        "line": "Actual footage of a helicopter flying off is shown."
    },
    {
        "character": "Jimbo",
        "line": "Soon it was all on just me and Ned to win the war for America."
    },
    {
        "character": "Jimbo",
        "line": "Pass me some more cocoa, will you, Ned?"
    },
    {
        "character": "Ned",
        "line": "Certainly. And would you like another muffin as well?"
    },
    {
        "character": "Jimbo",
        "line": "Why the hell not? We're at war."
    },
    {
        "character": "",
        "line": "Ned hands them over, then sits back, pulls out a cigarette and lighter, and lights the cigarette."
    },
    {
        "character": "Jimbo",
        "line": "Hey, you know those things are bad for your throat."
    },
    {
        "character": "Ned",
        "line": "No, that's all lies. I'll be fine. Charlies at 2 o'clock!"
    },
    {
        "character": "",
        "line": "Jimbo studies the troop movements on the ground."
    },
    {
        "character": "Jimbo",
        "line": "I see 'em! Drop the bomb!"
    },
    {
        "character": "",
        "line": "Ned pulls the trigger, but nothing happens."
    },
    {
        "character": "Ned",
        "line": "The bomb's not releasing!"
    },
    {
        "character": "Jimbo",
        "line": "Oh, no!"
    },
    {
        "character": "Ned",
        "line": "It won't budge."
    },
    {
        "character": "Jimbo",
        "line": "Then we only have one option."
    },
    {
        "character": "",
        "line": "Jimbo forces the plane down."
    },
    {
        "character": "Ned",
        "line": "What are you doing, man?!"
    },
    {
        "character": "Jimbo",
        "line": "We have to take 'em out, Ned! At all costs! Die, you red commie bastards!"
    },
    {
        "character": "",
        "line": "Comes in for a crash landing, and enemy troops are running out of their way. Jimbo and Ned come out and shoot everyone they can. The enemy soldiers die on the spot. Ned pulls out a grenade to activate and throw at other enemy troops, but it goes off prematurely and takes off his right arm."
    },
    {
        "character": "Ned",
        "line": "[His arm flies away.] Yaaarrrggghhh!!!"
    },
    {
        "character": "Jimbo",
        "line": "[Firing away.] Aaarrrggghh-- Oh no! Out of ammo!"
    },
    {
        "character": "",
        "line": "Jimbo reaches behind himself and pulls out a sword. A horse with golden mane and tail trots in. Ned fights off the enemy troops with his good arm and martial arts skill, and Jimbo flies onto the horse. He sallies forth and decapitates every soldier he comes across. When the enemy soldiers are all dead, Jimbo puts the sword away, and they look at the corpses around them."
    },
    {
        "character": "Jimbo",
        "line": "We did it, Ned! We killed the entire Vietcong Army!"
    },
    {
        "character": "Ned",
        "line": "Whoopie."
    },
    {
        "character": "",
        "line": "Ned brings out a cigarette and lights it with his good hand."
    },
    {
        "character": "Jimbo",
        "line": "Let's get back to base camp. We can ride the log ride before it closes!"
    },
    {
        "character": "",
        "line": "Ned flies onto the horse behind Jimbo, and horse and riders leap gracefully away, as we return to the present."
    },
    {
        "character": "Jimbo",
        "line": "And that's the way it happened, boys."
    },
    {
        "character": "Stan",
        "line": "Wow!"
    },
    {
        "character": "Cartman",
        "line": "Man, Vietnam was sweet!"
    },
    {
        "character": "Cameraman",
        "line": "[Reading a magazine.] Great news, guys. Your TV show ratings have doubled!"
    },
    {
        "character": "Jimbo",
        "line": "Wow!"
    },
    {
        "character": "Cameraman",
        "line": "They've gone from six people to twelve."
    },
    {
        "character": "Jimbo",
        "line": "Holy smokes! We could get an Emmy!"
    },
    {
        "character": "",
        "line": "South Park Public Access. The set of Jesus and Pals."
    },
    {
        "character": "Producer",
        "line": "We've got to do it, J. Your ratings are being killed by the Jimbo and Ned Hunting Show."
    },
    {
        "character": "Jesus",
        "line": "But I don't really care about that."
    },
    {
        "character": "Producer",
        "line": "Wuhell, you'd better care, Mr. Smarty Pants. No ratings means no show. If you want to keep reaching out to people, you have to keep up with the times."
    },
    {
        "character": "Jesus",
        "line": "[Reluctantly.] Ohh, alright."
    },
    {
        "character": "Cameraman",
        "line": "Alright, we're ten second to air, guys."
    },
    {
        "character": "Producer",
        "line": "Remember, big, big, big!."
    },
    {
        "character": "",
        "line": "She holds up her hands and moves them apart with each 'big.' Then she walks off."
    },
    {
        "character": "Cameraman",
        "line": "And five, four, three..."
    },
    {
        "character": "",
        "line": "Spotlight beams dance around the studio."
    },
    {
        "character": "Announcer",
        "line": "[Applause] It's your hour of power on midday Mountain Cable Access. Put your hands together and welcome the only man in town who always has a fully-stocked wine cellar, Jeeeeeeeeeeeeeeeeeeeeee-sus Christ!"
    },
    {
        "character": "",
        "line": "Jesus is caught off guard as a spotlight jumps to him."
    },
    {
        "character": "Jesus",
        "line": "Uhhh... Hi."
    },
    {
        "character": "",
        "line": "His producer signals him to build up his intro."
    },
    {
        "character": "Jesus",
        "line": "Uh, yeh-yeah, okay. Beginning today, we're taking the show in a new direction."
    },
    {
        "character": "",
        "line": "A stage hand guides him through with the cue cards."
    },
    {
        "character": "Jesus",
        "line": "We've got some very interesting people coming on the show this week for you, our viewers. Today's guest is: TV's Gilligan, Mr. Bob Denver."
    },
    {
        "character": "",
        "line": "Applause, as the curtains open."
    },
    {
        "character": "Announcer",
        "line": "Here's  Booooobbb Denver."
    },
    {
        "character": "",
        "line": "He makes his way to Jesus. They shake hands and sit down."
    },
    {
        "character": "Jesus",
        "line": "Hi, Bob Denver."
    },
    {
        "character": "Bob",
        "line": "Hi, Jesus. Great to be here."
    },
    {
        "character": "",
        "line": "His tongue is exposed. There is a pause as they look at each other."
    },
    {
        "character": "Jesus",
        "line": "So. Bob. So, yu-you just get in town?"
    },
    {
        "character": "Bob",
        "line": "Yup. Just got in."
    },
    {
        "character": "Jesus",
        "line": "[Pause.] So... Um... Su-so, wwhat have you been up to?"
    },
    {
        "character": "Bob",
        "line": "Nn-nothing. Nothing really at all."
    },
    {
        "character": "",
        "line": "The producer cues the studio and to play."
    },
    {
        "character": "Disciples vocalist",
        "line": "'Nothin' from nothin' leaves nothin'\nYou gotta have something\n\n\n"
    },
    {
        "character": "Jesus",
        "line": "[Cynically.] Oh boy."
    },
    {
        "character": "",
        "line": "South Park Elementary. Stan is presenting his group's report, reading from his notes."
    },
    {
        "character": "Stan",
        "line": "\"...and after killing the entire Vietcong Army, they returned to base camp.\""
    },
    {
        "character": "",
        "line": "Mr. Garrison is behind Clyde."
    },
    {
        "character": "Stan",
        "line": "\"Once there, they rode the Devil's Drop roller coaster.\""
    },
    {
        "character": "",
        "line": "Mr. Garrison gets a reaction."
    },
    {
        "character": "Stan",
        "line": "\"...and ate cotton candy. And ultimately, Ned got the Purple Heart for his courageous defense of the log ride.\""
    },
    {
        "character": "",
        "line": "Mr. Garrison is suspicious."
    },
    {
        "character": "Stan",
        "line": "\"So was the horror of Vietnam.\" The end."
    },
    {
        "character": "The Boys",
        "line": "The end."
    },
    {
        "character": "Kyle",
        "line": "Are there any questions?"
    },
    {
        "character": "",
        "line": "Mr. Garrison raises his hand."
    },
    {
        "character": "Kyle",
        "line": "Yes, Mr. Garrison?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Yes. [Suddenly angry.] Where the fuck did you hear this ridiculous load of bullshit?"
    },
    {
        "character": "",
        "line": "The boys' grins vanish."
    },
    {
        "character": "Stan",
        "line": "From Vietnam veterans."
    },
    {
        "character": "Mr. Garrison",
        "line": "Well, boys, it's obvious to me that you didn't do your work, and that you stayed up all night thinking up some ridiculous lie."
    },
    {
        "character": "Stan",
        "line": "No, no, we didn't--"
    },
    {
        "character": "Mr. Garrison",
        "line": "You all receive an F...minus."
    },
    {
        "character": "Kyle",
        "line": "F-minus? Can he do that?"
    },
    {
        "character": "Stan",
        "line": "Bu-but we're not making it up, it was--"
    },
    {
        "character": "Mr. Garrison",
        "line": "Stanley, the Vietnam War was war! There weren't galloping steeds or singing birds or log rides."
    },
    {
        "character": "Kyle",
        "line": "How do you know? You weren't even there."
    },
    {
        "character": "Mr. Garrison",
        "line": "Well, that's it! All of you have detention for the rest of the week!"
    },
    {
        "character": "Boys",
        "line": "Aawwww!"
    },
    {
        "character": "",
        "line": "South Park Elementary, cafeteria. Mr. Mackey is supervising detention."
    },
    {
        "character": "Cartman",
        "line": "Sweet."
    },
    {
        "character": "Mr. Mackey",
        "line": "Welcome to detention, m'kay? Mr. Garrison told me about your little joke. It's important for you all to know why you're in detention for you to obtain the full benefits from it."
    },
    {
        "character": "Cartman",
        "line": "You're dead, Stan."
    },
    {
        "character": "Stan",
        "line": "For what, dude?"
    },
    {
        "character": "Kenny",
        "line": "(Just face it, dude, your uncle's stupid!)"
    },
    {
        "character": "Mr. Mackey",
        "line": "[While the boys talk softly.] You're here because you are inferior, m'kay? You are here because you are awkward, m'kay?"
    },
    {
        "character": "Cartman",
        "line": "Well, Stan, thanks a lot for having such a cool uncle that got us all detention for a week."
    },
    {
        "character": "Kyle",
        "line": "Yeah, dude, your Uncle Jimbo sucks ass!"
    },
    {
        "character": "Mr. Mackey",
        "line": "Shh! M'kay?"
    },
    {
        "character": "Stan",
        "line": "Why would he just invent a story instead of telling us the truth?"
    },
    {
        "character": "Cartman",
        "line": "Well, let's see... Maybe 'cause he's an old, drunk hillbilly dick!"
    },
    {
        "character": "Mr. Mackey",
        "line": "Shh! M'kay?"
    },
    {
        "character": "Kyle",
        "line": "[Pounds the table.] We've got to get him back, dude."
    },
    {
        "character": "Cartman",
        "line": "Totally."
    },
    {
        "character": "Stan",
        "line": "How?"
    },
    {
        "character": "Kyle",
        "line": "Well, he screwed us by makin' something up; I say we do the same thing."
    },
    {
        "character": "Stan",
        "line": "Well, what do you mean?"
    },
    {
        "character": "Kyle",
        "line": "Did you guys ever see that one Brady Bunch where the guy... [Indistinct whisper.]"
    },
    {
        "character": "Cartman",
        "line": "[As Kyle whispers his plot.] Sweet. Oh, yeah, sweet. That's super sweet. Ah-yes!"
    },
    {
        "character": "",
        "line": "Jimbo and Ned back on the set."
    },
    {
        "character": "Announcer",
        "line": "And now back to Huntin' and Killin'  with South Park's favorite hunters, Jimbo and Ned!"
    },
    {
        "character": "Jimbo",
        "line": "Welcome, hunters. Boy, have we got a show for you today! We have just received a tape from another viewer who filmed the Mexican staring frog of Southern Sri Lanka right here in South Park."
    },
    {
        "character": "Ned",
        "line": "Aggghhh!"
    },
    {
        "character": "Jimbo",
        "line": "Yes, now we're about to roll the film, but remember: if you look the Mexican staring frog in the eyes, you could go catatonic. We don't know if this applies to pictures of the frog or not, but who wants to take chances? So when we roll this film, be sure to look away."
    },
    {
        "character": "",
        "line": "Jimbo looks away and shields his eyes with his arm. Ned does the same."
    },
    {
        "character": "Jimbo",
        "line": "Okay, roll the film, Tom."
    },
    {
        "character": "",
        "line": "Tom starts the film and looks away. The footage is that of a fake frog sitting on a doorstep motionless."
    },
    {
        "character": "Jimbo",
        "line": "Is it over? Okay, it's over."
    },
    {
        "character": "",
        "line": "They lower their arms and sit up."
    },
    {
        "character": "Jimbo",
        "line": "Well, there you have it. Undeniable proof that the Mexican staring frog of Southern Sri Lanka exists."
    },
    {
        "character": "",
        "line": "Cartman residence. The boys are watching the show."
    },
    {
        "character": "Jimbo",
        "line": "And you saw it here, on The Jimbo and Ned Show."
    },
    {
        "character": "Kyle",
        "line": "Dude, I can't believe they fell for it!"
    },
    {
        "character": "Stan",
        "line": "Yeah, what a couple of dumb-asses."
    },
    {
        "character": "Kenny",
        "line": "(Yeah, it's like killing a dead pig and a turkey.)"
    },
    {
        "character": "",
        "line": "They all laugh."
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Kyle",
        "line": "Come on! We've gotta make another one!"
    },
    {
        "character": "",
        "line": "The boys get off the couch and leave."
    },
    {
        "character": "Cartman",
        "line": "Lying kicks ass!"
    },
    {
        "character": "",
        "line": "South Park Public Access. Meanwhile..."
    },
    {
        "character": "Producer",
        "line": "Jesus!"
    },
    {
        "character": "Jesus",
        "line": "Yeah?"
    },
    {
        "character": "Producer",
        "line": "We're in trouble. The Jimbo and Ned Show made up some ridiculous staring frog story and jumped another two points in the ratings!"
    },
    {
        "character": "Jesus",
        "line": "Uh-oh, sssooo what are we supposed to do?"
    },
    {
        "character": "Producer",
        "line": "I don't know. We'll have to continue with the changes we've made, and then go even further."
    },
    {
        "character": "Stage hand",
        "line": "And we're back in five, four, three..."
    },
    {
        "character": "Producer",
        "line": "Remember, big, big, big!"
    },
    {
        "character": "",
        "line": "Jesus and Pals has a new opening sequence, with Jesus walking backwards into view and throwing his jacket over his shoulder. Meanwhile, 'Jesus and Pals' scrolls along the bottom as both his logo drops down from above. His signature blinks here and there. A montage follows with Jesus talking to a monkey in one screen and Jesus waiting for calls in another. The last thing you see is J&P."
    },
    {
        "character": "Jesus",
        "line": "If you're just joining us, we've been listening to Michelle's incredible story of survival. Go on, Michelle."
    },
    {
        "character": "Michelle",
        "line": "[Tearfully.] Well, as I was saying, I tried and tried, but my overturned car just won't budge. My husband was trapped for twelve hours."
    },
    {
        "character": "Jesus",
        "line": "And yet, somehow, he managed to survive."
    },
    {
        "character": "Michelle",
        "line": "That's right. He's a very brave man, and I love him very much."
    },
    {
        "character": "Husband",
        "line": "[In a wheelchair, head bandaged.] I love you, too."
    },
    {
        "character": "Jesus",
        "line": "W-well, let's see if the audience has any questions."
    },
    {
        "character": "",
        "line": "A large woman raises her hand."
    },
    {
        "character": "Jesus",
        "line": "Yes, uhh, you over there."
    },
    {
        "character": "",
        "line": "Jesus walks down to her."
    },
    {
        "character": "Large woman",
        "line": "I think she needs to kick him to the curb, baby!"
    },
    {
        "character": "",
        "line": "The audience applauds."
    },
    {
        "character": "Jesus",
        "line": "Kick who to the curb?"
    },
    {
        "character": "Large woman",
        "line": "Her no-good husband! She's got to lose that zero and get herself a hero!"
    },
    {
        "character": "",
        "line": "The audience applauds."
    },
    {
        "character": "Jesus",
        "line": "But--"
    },
    {
        "character": "Red-haired woman",
        "line": "He wants to have his cake and eat it, too. He's got to dump that trash girlfriend."
    },
    {
        "character": "",
        "line": "She grabs the mic."
    },
    {
        "character": "Red-haired woman",
        "line": "It's all about respect. You've gotta have respect for yourself."
    },
    {
        "character": "",
        "line": "The audience applauds. Michelle is shocked, and her husband drools a little blood."
    },
    {
        "character": "Jesus",
        "line": "Uuh-I think we've somewhat missed the point here. Let's go to somebody else."
    },
    {
        "character": "",
        "line": "Jesus backs up to an African American."
    },
    {
        "character": "Jesus",
        "line": "Yes, your comments."
    },
    {
        "character": "Michael Jackson fan",
        "line": "Montel, I think we're forgetting something very important in all of this. Okay, sure, he touched some children, but the man is a great singer and he has entertained us for so many years."
    },
    {
        "character": "Jesus",
        "line": "Wha-what are you talking about?"
    },
    {
        "character": "Michael Jackson fan",
        "line": "Michael Jackson. All this baad-mouthin' and puttin' the man down. Maybe he did touch some children now and then, but come on! It's Michael Jackson! Michael Jackson!"
    },
    {
        "character": "",
        "line": "The audience applauds."
    },
    {
        "character": "Jesus",
        "line": "Uhh, we'll be back right after these messages."
    },
    {
        "character": "",
        "line": "In the woods, the boys set up for another staring frog video. Cartman is behind some bushes and Kyle is in front of them. Stan and Kenny face them."
    },
    {
        "character": "Stan",
        "line": "Ready, you guys?"
    },
    {
        "character": "Kyle/Cartman",
        "line": "Ready."
    },
    {
        "character": "",
        "line": "Cartman is hiding behind the bush."
    },
    {
        "character": "Stan",
        "line": "Okay. Action!"
    },
    {
        "character": "",
        "line": "The camera rolls, and the frog is dangling from a fishing pole, jumping around. Cartman, holding the pole, speaks in a spooky voice."
    },
    {
        "character": "Cartman",
        "line": "Blululululululuh. I am the deadly Mexican staring frog of Southern Sri Lanka. I am very scary... And dangerous!"
    },
    {
        "character": "Stan",
        "line": "Cut! Cartman!"
    },
    {
        "character": "Cartman",
        "line": "[Popping up.] What?"
    },
    {
        "character": "Stan",
        "line": "It's supposed to be a frog!"
    },
    {
        "character": "Cartman",
        "line": "I know that!"
    },
    {
        "character": "Stan",
        "line": "Since when do frogs talk, Cartman?"
    },
    {
        "character": "Cartman",
        "line": "[Thinks.] It's a Sri Lanka frog!"
    },
    {
        "character": "Kyle",
        "line": "[Holding the camera.] Der, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Der yourself, hippie!"
    },
    {
        "character": "Kyle",
        "line": "Just do it again, Cartman, and don't make it talk! [Resumes filming.]"
    },
    {
        "character": "Stan",
        "line": "Okay. Here we go. Ready? Are you ready, Cartman?"
    },
    {
        "character": "Cartman",
        "line": "[Pops up.] I'm ready, Steven Spielberg! [Drops.]"
    },
    {
        "character": "Stan",
        "line": "Action!"
    },
    {
        "character": "Cartman",
        "line": "[Moves the frog around.] Blulululuh. Screw you guys."
    },
    {
        "character": "",
        "line": "Downtown. The boys have Cartman wearing a grey wig, a pink dress, and black high heels."
    },
    {
        "character": "Cartman",
        "line": "Well, why do I have to dress up like an old lady?"
    },
    {
        "character": "Kyle",
        "line": "'Cause old ladies are fat and you are, too!"
    },
    {
        "character": "Cartman",
        "line": "Ee-goddammit!"
    },
    {
        "character": "Stan",
        "line": "Come on, Cartman, the way we're filming this, nobody will even know it's you."
    },
    {
        "character": "Cartman",
        "line": "They better not!"
    },
    {
        "character": "Stan",
        "line": "Okay, when I yell \"action\", you start to walk this way, then Kenny's going to pull the plastic frog in front of you, and you have to be scared."
    },
    {
        "character": "Cartman",
        "line": "Scared of a plastic frog?"
    },
    {
        "character": "Stan",
        "line": "It's acting, Cartman. You have to pretend you're really scared, then the Mexican staring frog will look you in the eyes, then you fall down, like you're dead, okay? Ready?"
    },
    {
        "character": "Cartman",
        "line": "Man, this is stupid."
    },
    {
        "character": "Stan",
        "line": "Good. A-and action!"
    },
    {
        "character": "",
        "line": "Kenny walks in front of the camera with the frog, as Cartman screams and falls on his back."
    },
    {
        "character": "Cartman",
        "line": "Eee-ee-ee-ee!"
    },
    {
        "character": "",
        "line": "Jimbo and Ned back on the set."
    },
    {
        "character": "Jimbo",
        "line": "Well, it appears as though a lot of you \"skeptics\" thought that the film we showed of the Mexican staring frog of Southern Sri Lanka was a fake. That you say it didn't harm anybody. Well, it just so happens that we just received another film from another anonymous viewer. [Looks away.] Roll it!"
    },
    {
        "character": "",
        "line": "The two scenes have been spliced together, except that Cartman falls on his left side, and Kenny added his own touch by mooning the camera."
    },
    {
        "character": "Jimbo",
        "line": "There you go! Proof that not only is this frog real, but it is doing harm to the people of South Park as we speak!"
    },
    {
        "character": "Ned",
        "line": "Mmmm-damn that frog."
    },
    {
        "character": "Jimbo",
        "line": "Well, that does it! All this week, Ned and I will be--"
    },
    {
        "character": "",
        "line": "South Park Public Access. His producer is watching Huntin' and Killin'."
    },
    {
        "character": "Jimbo",
        "line": "--risking life and limb as we go on location to hunt the Mexican staring frog of Southern Sri Lanka. Join us, won't ya?"
    },
    {
        "character": "Producer",
        "line": "Ooh, no, no, no, no!"
    },
    {
        "character": "",
        "line": "Jesus walks up behind her."
    },
    {
        "character": "Producer",
        "line": "This is the biggest publicity stunt I've ever seen! Damn, those hunters are clever!"
    },
    {
        "character": "Jesus",
        "line": "Uhhh, clever?"
    },
    {
        "character": "Producer",
        "line": "It's genius, it really is. Hell, I even want to watch them hunt the Mexican staring frog. Unless... "
    },
    {
        "character": "Jesus",
        "line": "Unless what?"
    },
    {
        "character": "Producer",
        "line": "Unless we can prove to the City world that the whole thing is a sham. If we prove that the Mexican staring frog of Southern Sri Lanka is just something..made up by Jimbo and Ned, we can have them taken off the air. Perhaps even killed!"
    },
    {
        "character": "Jesus",
        "line": "Look, why don't we just stick to our own show? People will watch again."
    },
    {
        "character": "Producer",
        "line": "[Wearily.] Oh, J. You are so omnipotent, and yet so naive. We'll launch a full investigation, and in the meantime, we can cash in on the video tapes."
    },
    {
        "character": "Jesus",
        "line": "What video tapes?"
    },
    {
        "character": "",
        "line": "A commercial begins."
    },
    {
        "character": "Jesus",
        "line": "Yea, children. I am the way and the light..."
    },
    {
        "character": "Announcer",
        "line": "You've seen Jesus and Pals. Now you've got to get the video!"
    },
    {
        "character": "",
        "line": "Jesus and Pals: Too Hot for TV!A man pours some whipped cream on the chest of a topless bikini-clad woman wearing a cowboy hat.\n\n"
    },
    {
        "character": "Announcer",
        "line": "Things get a little out of control!"
    },
    {
        "character": "",
        "line": "Another guest yells obscenities at another guest, but his mouth is censored."
    },
    {
        "character": "Announcer",
        "line": "You won't believe your eyes!"
    },
    {
        "character": "",
        "line": "Jesus is flanked by two Klansmen as he interviews them."
    },
    {
        "character": "Announcer",
        "line": "Order now, only $19.95!"
    },
    {
        "character": "",
        "line": "Jesus is Lord!!! Visa, MC, and AmEx accepted."
    },
    {
        "character": "Announcer",
        "line": "Remember, this is stuff you can't see on TV!"
    },
    {
        "character": "",
        "line": "Two other women in bikinis take off their tops and dance around. Their breasts are censored with bars saying \"TOO HOT!!!\""
    },
    {
        "character": "",
        "line": "Next day. Jimbo and Ned with cameraman Tom and producer drive through the town."
    },
    {
        "character": "Jimbo",
        "line": "Anonymous tip?"
    },
    {
        "character": "Tom",
        "line": "Yeah, it was left on our answering machine. All it said was that they saw the Mexican staring frog just south of Stark's Pond this morning."
    },
    {
        "character": "Jimbo",
        "line": "Hey, Ned. Remember that time when we got the anonymous tip back in 'Nam?"
    },
    {
        "character": "Tom",
        "line": "You were in 'Nam? Where were you stationed?"
    },
    {
        "character": "Ned",
        "line": "Mmm-Da Nang."
    },
    {
        "character": "Cameraman",
        "line": "With the log ride?"
    },
    {
        "character": "Jimbo",
        "line": "Yep."
    },
    {
        "character": "Tom",
        "line": "Man, I was in Tet. We had a bad-ass roller coaster, but... all we ever wanted was a log ride. We waited and we waited, but... they never built us one. I think..Danforth wanted the log ride more than anybody, but he... he had to settle with that lame dinosaur water adventure ride."
    },
    {
        "character": "Jimbo",
        "line": "That war was hell on everybody."
    },
    {
        "character": "",
        "line": "Tom starts sobbing."
    },
    {
        "character": "Producer",
        "line": "Good. Okay. Okay, bye! Good news, everybody. This week's ratings are through the roof! We're up to twenty people!"
    },
    {
        "character": "Jimbo",
        "line": "Wow! Do we got more money?"
    },
    {
        "character": "Producer",
        "line": "No, but I do. We're now the highest-rated show on Mountain Cable Access! God bless the Mexican staring frog!"
    },
    {
        "character": "",
        "line": "The boys are back in the woods, and their frog is on a small boulder."
    },
    {
        "character": "Kyle",
        "line": "Dude, they're gonna look so stupid."
    },
    {
        "character": "Cartman",
        "line": "Dude, totally."
    },
    {
        "character": "Stan",
        "line": "They deserve it for lying to us, dude."
    },
    {
        "character": "Cartman",
        "line": "[Relishing the moment.] Revenge is so very, very sweet."
    },
    {
        "character": "Stan",
        "line": "They're here! Hurry and hide!"
    },
    {
        "character": "",
        "line": "They run for cover in a patch of shrubs. Jimbo stops his hummer and the men get out."
    },
    {
        "character": "Jimbo",
        "line": "Let's hunt!"
    },
    {
        "character": "Producer",
        "line": "We'll start with a two-shot of you and Ned getting your equipment together and--"
    },
    {
        "character": "Ned",
        "line": "Mm-Jimbo, look!"
    },
    {
        "character": "Jimbo",
        "line": "Hit the deck!"
    },
    {
        "character": "",
        "line": "They hide behind a snow drift."
    },
    {
        "character": "Producer",
        "line": "What is it?"
    },
    {
        "character": "Jimbo",
        "line": "It's him! The Mexican staring frog of Southern Sri Lanka. He's right over there on that rock."
    },
    {
        "character": "Producer",
        "line": "He is?"
    },
    {
        "character": "Jimbo",
        "line": "Dumb-ass! You've got to keep your eyes away from him!"
    },
    {
        "character": "",
        "line": "The producer tries to sneak a peek, but Jimbo forces him down again."
    },
    {
        "character": "Jimbo",
        "line": "Stay down. Ned, you take flight position; I'll try and keep it turned away from you."
    },
    {
        "character": "Ned",
        "line": "Mm-roger that."
    },
    {
        "character": "",
        "line": "Ned leaves the drift, as Jimbo stands, facing the camera."
    },
    {
        "character": "Jimbo",
        "line": "Hello, fellow hunters. Have we got a show for you today."
    },
    {
        "character": "",
        "line": "Ned moves behind the cameraman and begins his assault."
    },
    {
        "character": "Jimbo",
        "line": "The Mexican staring frog is sunning itself on a rock directly behind us."
    },
    {
        "character": "",
        "line": "Ned jumps from behind one tree to behind another."
    },
    {
        "character": "Jimbo",
        "line": " We've got to take the frog by surprise. I'm gonna create a diversion using this incendiary device, while Ned will ambush him from the rear."
    },
    {
        "character": "",
        "line": "Jimbo pulls the pin out and throws the grenade behind him. It hits the rock, but the plastic frog simply went about face."
    },
    {
        "character": "Jimbo",
        "line": "Now, Ned! He's not looking!"
    },
    {
        "character": "",
        "line": "Ned advances quickly."
    },
    {
        "character": "Jimbo",
        "line": "Quick, Ned, hit him with the shotgun! Now, Ned!"
    },
    {
        "character": "",
        "line": "Silence."
    },
    {
        "character": "Jimbo",
        "line": "Ned. Ne-ed?"
    },
    {
        "character": "",
        "line": "He turns around and draws closer to the rock. He sees Ned, now catatonic, looking at the frog."
    },
    {
        "character": "Jimbo",
        "line": "Oh, no!"
    },
    {
        "character": "",
        "line": "Close-up. Ned's hair stands on end."
    },
    {
        "character": "Jimbo",
        "line": "Come on, Ned, buddy, snap out of it!"
    },
    {
        "character": "",
        "line": "Ned's gun drops from his good arm."
    },
    {
        "character": "Jimbo",
        "line": "Come back to me, buddy."
    },
    {
        "character": "Producer",
        "line": "You getting all this?"
    },
    {
        "character": "",
        "line": "The cameraman smiles and gives a thumbs up."
    },
    {
        "character": "Jimbo",
        "line": "Hold onto your butts."
    },
    {
        "character": "",
        "line": "Jimbo fires away at the frog with his shotgun."
    },
    {
        "character": "Jimbo",
        "line": "Take that, you demon frog!"
    },
    {
        "character": "",
        "line": "Jimbo rushes up to Ned."
    },
    {
        "character": "Jimbo",
        "line": "Ned, Ned? Can you hear me?"
    },
    {
        "character": "",
        "line": "He turns to his crew."
    },
    {
        "character": "Jimbo",
        "line": "Quick! Somebody, call an ambulance! This man is catatonic!"
    },
    {
        "character": "Producer",
        "line": "Get the Flight for Life helicopter!"
    },
    {
        "character": "",
        "line": "The boys rise out of the shrubs."
    },
    {
        "character": "Stan",
        "line": "Holy crap, dude."
    },
    {
        "character": "",
        "line": "Hells Pass Hospital. Jimbo is at Ned's bedside reading to him."
    },
    {
        "character": "Jimbo",
        "line": "...\"but Ponyboy was beat up pretty bad. He kept saying, 'stay gold.'\""
    },
    {
        "character": "",
        "line": "Jimbo closes the book and watches Ned."
    },
    {
        "character": "Jimbo",
        "line": "Aw, Ned. If you can hear me, y-you've got to snap out of it, 'cause if you don't, uh-I'll never forgive myself."
    },
    {
        "character": "",
        "line": "The boys enter the room."
    },
    {
        "character": "Jimbo",
        "line": "Aw, Stanley, he's gone! My only friend in the world is gone!"
    },
    {
        "character": "Stan",
        "line": "Dude, he's okay. That frog wasn't even real!"
    },
    {
        "character": "Kyle",
        "line": "Look!"
    },
    {
        "character": "",
        "line": "Kyle holds up the plastic frog, which puts Jimbo on guard."
    },
    {
        "character": "Jimbo",
        "line": "Aghh! What the hell are you doing? I almost looked right at it!"
    },
    {
        "character": "Stan",
        "line": "Dude, it's just a plastic frog; it's not real. Check it out!"
    },
    {
        "character": "",
        "line": "Jimbo drops his guard and inspects the frog."
    },
    {
        "character": "Jimbo",
        "line": "What..?"
    },
    {
        "character": "Stan",
        "line": "We shot all those videos and sent them in."
    },
    {
        "character": "Kyle",
        "line": "Yeah, we made the whole thing up. It was all just a really, really funny joke! [Grins.]"
    },
    {
        "character": "Jimbo",
        "line": "You sent in those videos?!"
    },
    {
        "character": "Producer",
        "line": "[On the phone.] Oh, this is not good."
    },
    {
        "character": "Jimbo",
        "line": "My best friend is a vegetable, and I'm gonna be the laughingstock of South Park!"
    },
    {
        "character": "Kyle",
        "line": "Aw, come on. Ned's faking it. That frog was just a piece of plastic!"
    },
    {
        "character": "Stan",
        "line": "Yeah. Come on, Ned. Quit fakin'."
    },
    {
        "character": "",
        "line": "No response from Ned."
    },
    {
        "character": "Jimbo",
        "line": "You boys don't understand. Ned was so freaked out by the idea of the Mexican staring frog that he must have sent himself into a deep coma."
    },
    {
        "character": "",
        "line": "Jesus' producer is suddenly at the doorway with a satellite listening device."
    },
    {
        "character": "Jesus' producer",
        "line": "It's a psychosomatic response. [Entering.] I couldn't help overhearing your conversation just now."
    },
    {
        "character": "Kyle",
        "line": "Who are you?"
    },
    {
        "character": "Jesus' producer",
        "line": "I produce a little TV show called Jesus and Pals, you might have heard of it. Your story is amazing; full of jealousy, duplicity, backstabbing and bitterness."
    },
    {
        "character": "Jimbo",
        "line": "Uhhhh... Thanks?"
    },
    {
        "character": "Jesus' producer",
        "line": "How would you like to share your remarkable story with us on tomorrow's show?"
    },
    {
        "character": "",
        "line": "Jesus and Pals, after a commercial break. Today's topic: Tots in Trouble."
    },
    {
        "character": "Jesus",
        "line": "We're back with Jimbo and his nephew, Stan. These kids can't stop lying, can't they?"
    },
    {
        "character": "Jimbo",
        "line": "That's right, Jesus. No respect for their elders. As some of you may know, I host a local show on hunting."
    },
    {
        "character": "",
        "line": "A woman claps."
    },
    {
        "character": "Jimbo",
        "line": "Thanks. We've been hunting the Mexican staring frog for a week based on some video footage we received from a viewer. Well, it turns out that these kids faked the footage!"
    },
    {
        "character": "Jesus",
        "line": "Is that true, Stan?"
    },
    {
        "character": "Stan",
        "line": "It was just a joke; we didn't think it would hurt anybody."
    },
    {
        "character": "",
        "line": "Jesus looks over to see his producer signaling him to call for a break."
    },
    {
        "character": "Jesus",
        "line": "Uhh, we'll find out more about this debauchery when we return."
    },
    {
        "character": "Cameraman",
        "line": "A-and we're out."
    },
    {
        "character": "",
        "line": "Jesus walks off the stage, as the producer walks on."
    },
    {
        "character": "Producer",
        "line": "You're corpses out here! We need a lot more action from everybody!"
    },
    {
        "character": "Jimbo",
        "line": "Like what?"
    },
    {
        "character": "Producer",
        "line": "Like, go ahead and tell how your nephew Stan takes drugs and worships Satan."
    },
    {
        "character": "Jimbo",
        "line": "Satan. Got it."
    },
    {
        "character": "Stan",
        "line": "Whoa, I don't take drugs and worship Satan! That's lying!"
    },
    {
        "character": "Jimbo",
        "line": "Give you a taste of your own medicine, you little fibber!"
    },
    {
        "character": "Producer",
        "line": "And you kids! I didn't bring you on this show to be boring. Somebody get pissed off and throw a chair at Ned here."
    },
    {
        "character": "",
        "line": "Cartman raises his hand."
    },
    {
        "character": "Cartman",
        "line": "Dibs!"
    },
    {
        "character": "Producer",
        "line": "Remember, you all start to fight after the chair is thrown. That's your cue."
    },
    {
        "character": "Jimbo",
        "line": "Roger."
    },
    {
        "character": "",
        "line": "The theme music plays again and the crowd applauds for the next segment. Action."
    },
    {
        "character": "Jesus",
        "line": "Welcome back to Jesus and Pals. Jimbo, why do you think little Stanley lies?"
    },
    {
        "character": "Jimbo",
        "line": "I'll tell you why. Because he's on drugs and worships the devil!"
    },
    {
        "character": "",
        "line": "The audience and Stan gasp."
    },
    {
        "character": "Audience",
        "line": "Jeesus! Jeesus! Jeesus!"
    },
    {
        "character": "Jesus",
        "line": "Wow. Now, Stanley, it sound like your uncle is really worried about you."
    },
    {
        "character": "Stan",
        "line": "Well, I only..did it 'cause... he..molested me."
    },
    {
        "character": "",
        "line": "Jesus' jaw drops. The audience boos, and the sound man and the director high-five each other."
    },
    {
        "character": "Jimbo",
        "line": "Why, you little piece of crap!"
    },
    {
        "character": "Stan",
        "line": "You big piece of crap!"
    },
    {
        "character": "Cartman",
        "line": "That's it! Now I'm all pissed off!"
    },
    {
        "character": "",
        "line": "Cartman takes his chair and throws it at Ned."
    },
    {
        "character": "Cartman",
        "line": "Take that, hippie!"
    },
    {
        "character": "",
        "line": "The chair hits Ned, who continues to just sit there."
    },
    {
        "character": "Jimbo",
        "line": "Hey! "
    },
    {
        "character": "Audience",
        "line": "Jeesus! Jeesus!"
    },
    {
        "character": "",
        "line": "Jimbo picks up his chair and throws it at Cartman. The chair hits a woman in the right side of her head in the audience and she gets up angry. She heads for the stage."
    },
    {
        "character": "",
        "line": "Jesus tries to calm things down."
    },
    {
        "character": "Jesus",
        "line": "O-okay, okay, that's enough."
    },
    {
        "character": "woman",
        "line": "[Slugs Jimbo.] Take that, you asshole!"
    },
    {
        "character": "",
        "line": "Jimbo falls. She jumps on him and strikes again."
    },
    {
        "character": "woman",
        "line": "What the fuck was that?"
    },
    {
        "character": "Jesus",
        "line": "Uh, let's watch the language, people."
    },
    {
        "character": "Jimbo",
        "line": "Bring it on, you bitch!"
    },
    {
        "character": "",
        "line": "She hits him again."
    },
    {
        "character": "Cartman",
        "line": "Ey, get off of him, you fuckin' nutsack!"
    },
    {
        "character": "Audience",
        "line": "Jeesus! Jeesus! Jeesus!"
    },
    {
        "character": "",
        "line": "A blond man pushes Jesus out of the way as he heads for the stage. The rest of the audience follow suit, and soon everyone is fighting."
    },
    {
        "character": "Jesus",
        "line": "Let's all just..make our way back to our seats."
    },
    {
        "character": "",
        "line": "Kenny is being pulled apart by two men."
    },
    {
        "character": "Kenny",
        "line": "(Nononono-yikes!)"
    },
    {
        "character": "",
        "line": "A man in a green shirt hits Kenny in the face with a chair."
    },
    {
        "character": "",
        "line": "Kenny is ripped in half."
    },
    {
        "character": "Man in green shirt pulling Kenny",
        "line": "Yeah, yeah, yeh... [Gasps.]"
    },
    {
        "character": "Man in blue shirt pulling Kenny",
        "line": "Yeah, yeah, yeh-oh?"
    },
    {
        "character": "Man with chair hitting Kenny",
        "line": "Oh, Oh! Aah! AAAAGGHH!!! [Gasps.] Ooh.. Ew [Shrieks.]"
    },
    {
        "character": "",
        "line": "Kenny begins crying."
    },
    {
        "character": "Kenny",
        "line": "[Sobbing.] (OW! OW! DUDE, PLEASE STOP!! OH, FUCK! YIKES!!!!!)"
    },
    {
        "character": "",
        "line": "The 3 men, Stan, & Kyle gasp in horror to see what happened."
    },
    {
        "character": "Stan",
        "line": "Oh, my God! They've killed Kenny!"
    },
    {
        "character": "Kyle",
        "line": "You bastards!"
    },
    {
        "character": "",
        "line": "Cartman comes flying across the stage."
    },
    {
        "character": "Cartman",
        "line": "Ey, you guys!"
    },
    {
        "character": "",
        "line": "Two men just sitting in the audience start to fight for no reason."
    },
    {
        "character": "Jesus",
        "line": "Let's all just..make our way back to our seats."
    },
    {
        "character": "woman",
        "line": "Oh, my God!"
    },
    {
        "character": "",
        "line": "A man walks by with a chainsaw."
    },
    {
        "character": "Jesus",
        "line": "Shut the fuck up!"
    },
    {
        "character": "",
        "line": "The audience members stop and gasp at him. Cartman was biting at the leg of a man onstage."
    },
    {
        "character": "Jesus",
        "line": "Jesus, what is wrong with you people?! Look around you, Stanley. Look at all the pain and suffering your lie has caused."
    },
    {
        "character": "",
        "line": "The audience members slowly return to their seats."
    },
    {
        "character": "Stan",
        "line": "W-we only did it because Jimbo lied to us first. We had this report on the Vietnam War for school, and we interviewed Jimbo about it and he made up all this stuff about Vietnam, and he got us in trouble."
    },
    {
        "character": "",
        "line": "A couple of rats come by and drag Kenny's upper half away."
    },
    {
        "character": "Jimbo",
        "line": "Hey, now. Everything I told you boys about the war actually happened."
    },
    {
        "character": "Stan",
        "line": "Mr. Garrison said that there was no way that you could have defeated the entire Vietcong Army by yourself."
    },
    {
        "character": "Jesus",
        "line": "The entire Vietcong Army?"
    },
    {
        "character": "Jimbo",
        "line": "I uh... Well, okay, I might have embellished the truth a little, but that's different."
    },
    {
        "character": "Jesus",
        "line": "Is it?"
    },
    {
        "character": "Jimbo",
        "line": "Well, sure. I mean, eh... [Pinned.] Well, no uh, I guess not."
    },
    {
        "character": "Jesus",
        "line": "And as for you, Stan uh, I think you need to kick your drug habit and--"
    },
    {
        "character": "Stan",
        "line": "Wait a second, I don't take drugs! That was a lie!"
    },
    {
        "character": "Jesus",
        "line": "Wait. Jimbo made that up?"
    },
    {
        "character": "Stan",
        "line": "No, your producer did."
    },
    {
        "character": "",
        "line": "This gets the producer's attention."
    },
    {
        "character": "Stan",
        "line": "She made Jimbo tell everybody that I did drugs."
    },
    {
        "character": "Jesus",
        "line": "What?"
    },
    {
        "character": "Stan",
        "line": "During the break. Your producer came over, and told Jimbo what to say about me. She told him to lie!"
    },
    {
        "character": "Jimbo",
        "line": "It's true, she did. Hu-I'm such a tool."
    },
    {
        "character": "Jesus",
        "line": "Oh, really?"
    },
    {
        "character": "",
        "line": "The producer is now trying to hide behind a potted plant."
    },
    {
        "character": "Kyle",
        "line": "Yeah! Then she told us to throw a chair at Ned!"
    },
    {
        "character": "Cartman",
        "line": "Yeah. I didn't wanna do it, Jesus. They made me do that."
    },
    {
        "character": "Man in Brown Shirt",
        "line": "Screw this show. I thought this was all real."
    },
    {
        "character": "",
        "line": "The audience members begin to leave."
    },
    {
        "character": "Jesus",
        "line": "W-wait, everybody. Come back."
    },
    {
        "character": "Michael Jackson fan",
        "line": "[Pats Jesus on the shoulder.] Don't feel too bad, Montel. We all want to touch children sometimes; it's only natural."
    },
    {
        "character": "",
        "line": "South Park Public Access, outside. Later..."
    },
    {
        "character": "Jimbo",
        "line": "I'm sorry, Stan. I was just trying to tell a good story. I never meant for you boys to get in trouble."
    },
    {
        "character": "Stan",
        "line": "W-we're sorry, too, Uncle Jimbo. We're sorry for making you look stupid in front of the whole world."
    },
    {
        "character": "Kyle",
        "line": "Yeah. And we're sorry for turning Ned into a vegetable."
    },
    {
        "character": "Jimbo",
        "line": "Aw, he'll be fine. I'll just take him home and show him some good hard-core porn, he'll snap right out of it. Won't you, Ned?"
    },
    {
        "character": "",
        "line": "Jimbo slaps him on the shoulder, and Ned falls like a statue. A door opens."
    },
    {
        "character": "Jesus",
        "line": "I want to apologize to all of you for what happened in there. In our competition for ratings we lost sight of why we got into show business in the first place."
    },
    {
        "character": "Jimbo",
        "line": "Yeah. Titties and beer."
    },
    {
        "character": "Jesus",
        "line": "Actually, I was referring more to the pursuit of truth, butWell, anyway, I can't wait to get back to my old show without all the glitz and the ratings and producers and--"
    },
    {
        "character": "Kyle",
        "line": "Wait a sec. Where is your producer?"
    },
    {
        "character": "Jesus",
        "line": "[Upset.] I sent her away."
    },
    {
        "character": "Cartman",
        "line": "Sent her away where?"
    },
    {
        "character": "",
        "line": "Hell. She enters Satan's lair with phone in hand. Pitchforks rise and begin poking her."
    },
    {
        "character": "Producer",
        "line": "What is this? What's happening?!"
    },
    {
        "character": "Satan",
        "line": "Welcome to my dominion."
    },
    {
        "character": "Producer",
        "line": "[Retreating.] Oooooohhhh!"
    },
    {
        "character": "Saddam Hussein",
        "line": "[Comes up behind Satan and stands next to him.] Hey. Take a load off. Put your feet up. Me and Satan were just aboot to go shopping for furniture. Come on, Satan."
    },
    {
        "character": "Satan",
        "line": "Okay, honey."
    },
    {
        "character": "",
        "line": "They turn around and walk away, the camera enters her mouth as she screams."
    },
    {
        "character": "Producer",
        "line": "Noooooo!"
    },
    {
        "character": "",
        "line": "End of The Mexican Staring Frog of Southern Sri Lanka.\nWar is hell\nMy brother's a dirty mess\nIn war, war is hell\nIt's hell for you and me\n\n\n\n"
    }
]