[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "A professional wrestling ring. John Cena and Edge are in the ring with two lady wrestlers. One of them wears a pink bra, the other a black one."
    },
    {
        "character": "John Cena",
        "line": "Say that again, Edge! You think you're better than me?!"
    },
    {
        "character": "Edge",
        "line": "Cena, your mouth has gotten you in trouble for the last time! I'm gonna shut it up for you!"
    },
    {
        "character": "Spectators",
        "line": "Oooooooooooooooooooooo!"
    },
    {
        "character": "Darryl",
        "line": "Mess him up, Edge!"
    },
    {
        "character": "Obese woman",
        "line": "Kick his ass! WOO!"
    },
    {
        "character": "John Cena",
        "line": "Oh yeah?! I've got somethin' else to tell you, Edge! I slept with Vanessa last night. [everyone boos. Vanessa, the one with the pink bra, is embarrassed and tries to hide her face]"
    },
    {
        "character": "Redneck 1",
        "line": "[his vest has a tag that says \"Eddie\" on it] Cena slept with Edge's girlfriend?"
    },
    {
        "character": "Cartman",
        "line": "Oh my God, dude, this is sooo awesome!"
    },
    {
        "character": "Stan",
        "line": "I'm having the best time!"
    },
    {
        "character": "Edge",
        "line": "[a huge image of himself is on a massive TV screen behind him] You cheated, and took my belt from me, and now I can't hardly get work wrestling! You took muh girl AND you took my job! [all gasp]"
    },
    {
        "character": "Darryl",
        "line": "He took his job!"
    },
    {
        "character": "Redneck 2",
        "line": "He took his jrrr?"
    },
    {
        "character": "Redneck 3",
        "line": "Took hid drrr! [Edge throws down the mic and prepares to attack Cena. Edge slaps Cena hard enough that Cena falls to the ground, then does a victory pose. The ladies begin to wrestle]"
    },
    {
        "character": "Cartman",
        "line": "Oh, sweet! [the woman in black bra pulls on the other woman's arm using her right leg as leverage, then begins pummeling her. Cena throws Edge against the ropes]"
    },
    {
        "character": "Edge",
        "line": "Whoa... [flies off the ropes and into Cena's clothesline, which sends him to the floor on his back.]"
    },
    {
        "character": "Butters",
        "line": "Yes! Yehhehehes!"
    },
    {
        "character": "Cartman",
        "line": "This is awesome!"
    },
    {
        "character": "",
        "line": "The Pepsi Center, night. The show has ended and the fans are pouring out of the center towards their cars. The boys come out as well: Stan, Kyle, Cartman, Kenny, Butters, Jimmy, and Tolkien."
    },
    {
        "character": "Cartman",
        "line": "Dude! That was so badass!"
    },
    {
        "character": "Kyle",
        "line": "Wrestling is awesome!"
    },
    {
        "character": "Stan",
        "line": "This is it you guys! We know what our calling in life is now. Tomorrow we are signing up for wrestling class! [the other boys cheer this decision.]"
    },
    {
        "character": "",
        "line": "South Park Elementary, after school, gym. A sign on the gym door says the junior wrestling club is meeting at 4:15. The gym has new windows. The seven boys are present, all wearing protective gear and wrestling uniforms. They look down at their uniforms."
    },
    {
        "character": "Cartman",
        "line": "The fuck is this?!"
    },
    {
        "character": "Stan",
        "line": "[a couple of seconds later] Why did they have us put on long underwear."
    },
    {
        "character": "Kyle",
        "line": "Well ah I guess in wrestling we're supposed to make our own outfit, and then wear it over this."
    },
    {
        "character": "Butters",
        "line": "Ohhh. Yeah, that makes sense."
    },
    {
        "character": "Kyle",
        "line": "Alright, so did everyone settle on their wrestling names?"
    },
    {
        "character": "Cartman",
        "line": "I did. I'm the Rad Russian. [affects a fake Russian accent] I come from Russian to crush your puny capitalist heads!"
    },
    {
        "character": "Coach",
        "line": "[arriving] Alright boys! I'm really glad to see we have some new recruits interested in the fine sport of wrassling."
    },
    {
        "character": "Kyle",
        "line": "Cool!"
    },
    {
        "character": "Stan",
        "line": "Yeah!"
    },
    {
        "character": "Butters",
        "line": "Let's do this!"
    },
    {
        "character": "Cartman",
        "line": "All right!"
    },
    {
        "character": "Coach",
        "line": "Now, the first thing we're gonna learn today are the fundamental wrassling holds. Let's get some volunteers. Uh why don't come over here young man? What's your name?"
    },
    {
        "character": "Cartman",
        "line": "The Rad Russian."
    },
    {
        "character": "Coach",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "You capitalist swine, I'll crush you!"
    },
    {
        "character": "Coach",
        "line": "Okay uh, just go ahead and get on your hands and knees."
    },
    {
        "character": "Cartman",
        "line": "Huh?"
    },
    {
        "character": "Coach",
        "line": "Just, down on, down on the floor. [Cartman bends over a bit, unsure of how to do this, given his girth] Hands and knees. [the coach helps him out in getting into position.]"
    },
    {
        "character": "Cartman",
        "line": "Okay..."
    },
    {
        "character": "Coach",
        "line": "Alright and now how about you. Your name is?"
    },
    {
        "character": "Butters",
        "line": "Triceratops!"
    },
    {
        "character": "Coach",
        "line": "Uh, all right, uh cu, come on over here. I'm gonna position you in the official wrassling starting position. [drapes Butters over Cartman] Here- we- go."
    },
    {
        "character": "Cartman",
        "line": "The fuck is this?!"
    },
    {
        "character": "Coach",
        "line": "Now just reach around him here. Good."
    },
    {
        "character": "Cartman",
        "line": "Dude! Dude! DUDE! [jumps to his feet] The fuck are you doing?!"
    },
    {
        "character": "Coach",
        "line": "Get back on the floor! I'm teaching the starting position of wrassling!"
    },
    {
        "character": "Cartman",
        "line": "That's not wrestling, dude, that's fucking gay!"
    },
    {
        "character": "Stan",
        "line": "Yeah, what are you? A child molester?"
    },
    {
        "character": "Kyle",
        "line": "Where's all the cool costumes and jumping off ropes and stuff?!"
    },
    {
        "character": "Coach",
        "line": "Oh, not this again! Let me guess: you just went to that stupid WWE show in Denver last night!"
    },
    {
        "character": "The boys",
        "line": "Yeah! [all smiles]"
    },
    {
        "character": "Coach",
        "line": "Ugh. [the boys frown at this] The WWE is not wrassling! That's a bunch of fake bullcrap! How stupid are you! Real wrassling, boys, is this! [spreads his arms out to indicate the floor and their uniforms - practice, practice, practice]"
    },
    {
        "character": "Cartman",
        "line": "Well this is fucking lame dude! Let's get the hell out of here, guys. [they all take off their headgear and walk away]"
    },
    {
        "character": "Stan",
        "line": "Yeah, this guy probably wants to take pictures of us naked."
    },
    {
        "character": "Butters",
        "line": "I got, half a mind to report, r-report you to the police, sir! [throws his headgear on the floor and walks away glaring back at the coach]"
    },
    {
        "character": "Coach",
        "line": "Rrrgh!"
    },
    {
        "character": "",
        "line": "Cartman's house, day. He holds up a program written in crayon."
    },
    {
        "character": "Cartman",
        "line": "The Wrestling Takedown Federation has several matches planned today. Alright, sooo, here's how we'll do this, guys. I'll come out to the ring first and then Jimmy, you come in and tell me you're gonna kick my ass. Then I'm gonna say \"You slept with my girlfriend,\" and I'll charge you into a head slap."
    },
    {
        "character": "Jimmy",
        "line": "Sounds good."
    },
    {
        "character": "Cartman",
        "line": "Then Butters, you come in as the ref all like \"No no, the fight hasn't started yet,\" and that's when Jimmy sneaks up from behind and hits me over the head with a foldaway chair."
    },
    {
        "character": "Butters",
        "line": "Okey doke."
    },
    {
        "character": "Jimmy",
        "line": "So is that when I t- tell you that your girlfriend is a whore?"
    },
    {
        "character": "Cartman",
        "line": "Noo, let's save the \"girlfriend is a whore\" line until after Stan headbutts Butters for trying to stop the fight again."
    },
    {
        "character": "Butters",
        "line": "Hmboy, wrestling sure is fun!"
    },
    {
        "character": "Cartman",
        "line": "Alright are you ready to try this, guys?"
    },
    {
        "character": "Stan",
        "line": "Yup."
    },
    {
        "character": "Cartman",
        "line": "Alright, let's start wrestlin'. [the boys take their starting positions]"
    },
    {
        "character": "Jimmy",
        "line": "I am gonna k-kick your ass!"
    },
    {
        "character": "Cartman",
        "line": "You slept with my girlfriend, Hammerclaw! [Cartman slaps him hard, and Jimmy falls. Butters intervenes.]"
    },
    {
        "character": "Butters",
        "line": "Hey! No! No, the fight hasn't started yet. No, bad."
    },
    {
        "character": "Cartman",
        "line": "Hey! He slept with my girlfriend, referee! In my country we don't wait for a bell, miste-[Jimmy sneaks up behind him with a folding chair and smashes it into the back of his head, making him fall forward] ah!"
    },
    {
        "character": "Jimmy",
        "line": "Your girlfriend is a whore!"
    },
    {
        "character": "Cartman",
        "line": "[whispers aloud] Wait for it, wait for the whore line."
    },
    {
        "character": "Jimmy",
        "line": "[softly] Oh, I'm sorry."
    },
    {
        "character": "Tolkien",
        "line": "You're gonna get it now, Hammerclaw!"
    },
    {
        "character": "Stan",
        "line": "We'll see about that!"
    },
    {
        "character": "Butters",
        "line": "Now hold on! I am stopping the fight! [Stan headbutts him] Eoh!"
    },
    {
        "character": "",
        "line": "A park behind the Cartman house. The wall separating the backyard from the field is gone."
    },
    {
        "character": "Redneck 4",
        "line": "What's goin' on?"
    },
    {
        "character": "Redneck 5",
        "line": "Apparently that crippled kid slept with that Russian kid's girlfriend."
    },
    {
        "character": "Redneck 4",
        "line": "Jeez they're so young."
    },
    {
        "character": "",
        "line": "First match."
    },
    {
        "character": "Kyle",
        "line": "I'll kill you, Triceratops! You made fun of my crippled mother!"
    },
    {
        "character": "Butters",
        "line": "That's because your mother betrayed my mother, Juggernaut!"
    },
    {
        "character": "",
        "line": "Second match."
    },
    {
        "character": "Stan",
        "line": "You don't come to this country and make fun of it!"
    },
    {
        "character": "Cartman",
        "line": "And just what do you care about your pitiful country?!"
    },
    {
        "character": "Stan",
        "line": "I served my country! I fought for two years in Vietnam."
    },
    {
        "character": "",
        "line": "From the seats in the backyard."
    },
    {
        "character": "Redneck 6",
        "line": "That kid was in 'Nam? Man, that's incredible!"
    },
    {
        "character": "Redneck 7",
        "line": "Good for you for serving your country!"
    },
    {
        "character": "",
        "line": "Out on the street, a redneck runs to tell the rednecks haning out on a truck."
    },
    {
        "character": "Redneck 8",
        "line": "Guys, check this out! There's this little kid from the Congo, who was raised by panthers!"
    },
    {
        "character": "Redneck 9",
        "line": "Are you serious?"
    },
    {
        "character": "",
        "line": "Third match."
    },
    {
        "character": "Kyle",
        "line": "Just admit it, Congo! Admit that you lied about me to Irene!"
    },
    {
        "character": "Tolkien",
        "line": "I admit nothing! Maybe Irene lied to you!"
    },
    {
        "character": "",
        "line": "From the seats in the backyard. There are more chairs present."
    },
    {
        "character": "Redneck 10",
        "line": "That kid in the hat is havin' sex with two different girls?"
    },
    {
        "character": "Redneck 11",
        "line": "Naw, that little kid from the Congo lied about one of them to try and get the kid in the hat in trouble with his wife."
    },
    {
        "character": "Redneck 12",
        "line": "They're married?"
    },
    {
        "character": "",
        "line": "Fourth match intro."
    },
    {
        "character": "Jimmy",
        "line": "You have to forfeit the fight, Rad Russian! You cannot fight until your test results come ba-back!"
    },
    {
        "character": "Cartman",
        "line": "I might have to wait for my hepatitis test, but in the mean time, I have brought my comrade from Mexico to wrestle against you!"
    },
    {
        "character": "",
        "line": "From the seats in the backyard."
    },
    {
        "character": "Redneck 9",
        "line": "That Russian kid's got hepatitis?"
    },
    {
        "character": "",
        "line": "Fourth match."
    },
    {
        "character": "Announcer",
        "line": "And here he comes now, the cold-blooded wrestler from Mexico, El Pollo Loco! [Kenny, dressed as a masked luchador, comes out to mariachi fanfare and sparklers. The spectators clap and cheer him on]"
    },
    {
        "character": "Jimmy",
        "line": "What are you doing here, El, El Pollo Loco?"
    },
    {
        "character": "Kenny",
        "line": "(I came here to kick your ass once and for all!)"
    },
    {
        "character": "",
        "line": "Nighttime. The wrestling matches are coming one after the other, connected by convoluted plot lines and story arcs."
    },
    {
        "character": "Kyle",
        "line": "Your girlfriend doesn't even like you, Stan the Man! She likes me!"
    },
    {
        "character": "Stan",
        "line": "You have no idea what you're saying Juggernaut! Irene loves me and I'm gonna marry her!"
    },
    {
        "character": "Kyle",
        "line": "If she wants to be with you, how about you have her tell all these people here?"
    },
    {
        "character": "Announcer",
        "line": "Uh oh, here she comes now! It's Bad Irene! [Cartman, dressed as a diva, walks out of the dressing room and towards the ring. The crowd hoots and hollers. She climbs right in and takes the mic from Stan's hand]"
    },
    {
        "character": "Cartman",
        "line": "Let me tell you something! Let me tell you something! It's true, I love Stan the Man with all my heart, but... I want to be with Juggernaut now."
    },
    {
        "character": "Stan",
        "line": "What?!"
    },
    {
        "character": "Redneck 13",
        "line": "No! No! What are you doing?! Stan the Man loves you!"
    },
    {
        "character": "Redneck 14",
        "line": "Don't break his heart!"
    },
    {
        "character": "Stan",
        "line": "If you love Juggernaut, Irene, then tell him what you did two years ago! How you killed his child!"
    },
    {
        "character": "Cartman",
        "line": "It's true. I was pregnant with your child and aborted it. [the crowd boos and expresses its disapproval]"
    },
    {
        "character": "Kyle",
        "line": "Irene, no! Why?"
    },
    {
        "character": "Cartman",
        "line": "Do you know what it's like to have an abortion at seven years old? DO YOU? I've had so many abortions. I just... got addicted to them."
    },
    {
        "character": "Redneck 15",
        "line": "Whoa, did you hear that?"
    },
    {
        "character": "Redneck 16",
        "line": "Shh!"
    },
    {
        "character": "Stan",
        "line": "Irene, you said you loved me!"
    },
    {
        "character": "Cartman",
        "line": "I'm not in love with you, I'm in love with abortions. Don't you undestand?! [screams, runs up to Stan with a steel chair, and smashes him with it, knocking him down]"
    },
    {
        "character": "Spectators",
        "line": "Ohhhh! [Kyle runs up to Cartman and knocks him down with a flying kick] Ahhhh!"
    },
    {
        "character": "",
        "line": "Skeeter's Bar, night. A bunch of men are gathered at the bar chatting."
    },
    {
        "character": "Darryl",
        "line": "I'm telling you guys, you've got to see this. These kids ain't more than eight or nine years old an' they got more problems than you can imagine."
    },
    {
        "character": "Redneck 13",
        "line": "There's this one kid, he saw his father get murdered. And yesterday he finds the killer, and it's this other kid whose an ex-cop. Needless to say, he whupped his ass good."
    },
    {
        "character": "Darryl",
        "line": "Yup, and there's this little girl, she's actually addicted to gettin' abortions. Got pregnant by nearly every boy there."
    },
    {
        "character": "Redneck 17",
        "line": "You're shittin' me!"
    },
    {
        "character": "Redneck 13",
        "line": "No! We're telling you these kids are fucking crazy! You gotta check it out! [the wrestling coach is sitting nearby, stewing at the conversation]"
    },
    {
        "character": "Darryl",
        "line": "You can watch 'em almost every afternoon. It's some of the greatest wrestlin' we ever seen."
    },
    {
        "character": "Coach",
        "line": "[rises from his seat and approaches the men at he bar] It isn't real! Don't you people understand that stuff isn't real?! None of it! How stupid are you?! [Skeeter and another bar patron look at each other]"
    },
    {
        "character": "Redneck 13",
        "line": "[strokes his chin thoughtfully] What do you mean, it ain't real?"
    },
    {
        "character": "Coach",
        "line": "It's all made up! Fiction! Real wrassling is a serious and respectable sport! Why can't you people understand that that kind of wrestling isn't real?!"
    },
    {
        "character": "Darryl",
        "line": "[walks up to the coach] Mister, there's a little girl out there who's had fourteen abortions, an' she ain't even ten yet. But I guess that's just [holds up two fingers on each hand in a quote gesture] \"not real\" to you! [turns and walks back to the bar, saying under his breath] Son of a bitch."
    },
    {
        "character": "Coach",
        "line": "Look look look! [whips out his iPhone to show them] THIS is wrestling. THIS. [two men are shown wrestling in Greco-Roman style. There's a lot of grunting in the match. The bar patrons watch the little screen for a few seconds]"
    },
    {
        "character": "Darryl",
        "line": "Mister, you'd better take your gay porn an' walk right out of this bar."
    },
    {
        "character": "",
        "line": "Cartman's backyard, a new dressing room. The boys prepare for their matches. Stan looks out through the curtains."
    },
    {
        "character": "Stan",
        "line": "Holy crap dude, there's a huge turnout tonight."
    },
    {
        "character": "Kyle",
        "line": "Good thing we made those changes to the seating."
    },
    {
        "character": "Cartman",
        "line": "Alright you guys, let's bring it in. [the boys huddle and hold hands] I think we've done a really great job and let's just keep the energy up, you know, have a good flow, and have fun out there, okay?"
    },
    {
        "character": "Butters",
        "line": "Yeah!"
    },
    {
        "character": "Kyle",
        "line": "Let's do this! One! Two!"
    },
    {
        "character": "Boys",
        "line": "Backyard wrestling!"
    },
    {
        "character": "",
        "line": "Cartman's backyard, moments later. The yard has been transformed into a Greek amphitheater. A façade now covers the back side of the house and a wrestling ring is in the amphitheater's pit. The place looks filled to capacity with people chattering, waiting for the matches to begin. The amphitheater lights dim and the crowd cheers as the wrestlers come out."
    },
    {
        "character": "Cartman",
        "line": "Oh what a perfect night for fighting. Lo, the moon sets upon the tips of the trees and I, the man known as the Rad Russian, start to stir with the excitement of violence."
    },
    {
        "character": "Stan",
        "line": "Only a country like yours can breed men of such discontent, Rad Russian. But you don't know what real pain is! PAIN! Like I've known. Abandoned when I was four years old by my parents. Left to die in a cold and dark sewage tunnel!"
    },
    {
        "character": "Redneck 13",
        "line": "Gee, I didn't know his parents did that."
    },
    {
        "character": "Redneck 18",
        "line": "Shhh."
    },
    {
        "character": "",
        "line": "South Park Elementary, principal's office, day. Principal Victoria is talking with the wrestling coach."
    },
    {
        "character": "Principal Victoria",
        "line": "I'm very sorry, but I'm afraid we have to terminate your employment here at South Park Elementary."
    },
    {
        "character": "Coach",
        "line": "You're firing me? Why?!"
    },
    {
        "character": "Principal Victoria",
        "line": "The school board has decided to discontinue the wrestling program. Wrestling simply involves too much adult subject matter, like murder and abortion. [shows him the South Park Gazette, which has the headline \"Kids Wrestle with Adult Issues\"]"
    },
    {
        "character": "Coach",
        "line": "No, this isn't wrassling! THIS ISN'T WRASSLING! Principal Victoria, just let me stay on and I can teach kids what real wrassling is!"
    },
    {
        "character": "Principal Victoria",
        "line": "I'm sorry, the board has made up their minds."
    },
    {
        "character": "Coach",
        "line": "You can't fire me for what these kids do!"
    },
    {
        "character": "Principal Victoria",
        "line": "That isn't the only reason you're being let go."
    },
    {
        "character": "Coach",
        "line": "What do you mean?"
    },
    {
        "character": "Principal Victoria",
        "line": "[sighs] We... found all the gay porn on your iPhone, Mr. Conners."
    },
    {
        "character": "",
        "line": "The wrestling dressing room, day. The boys are dressing up for another round of wrestling matches. Kyle and Tolkien are talking."
    },
    {
        "character": "Kyle",
        "line": "So I'm thinking we do the part about Jimmy's relationship with his alcoholic father after you smash Butters onto the table."
    },
    {
        "character": "Tolkien",
        "line": "Oh! Sure, that works."
    },
    {
        "character": "Cartman",
        "line": "[rushing in with a letter] You guys! You guys, listen to this! It's amazing!"
    },
    {
        "character": "Kyle",
        "line": "What dude? [the other boys gather 'round]"
    },
    {
        "character": "Cartman",
        "line": "We just received a letter from the WWE."
    },
    {
        "character": "Stan",
        "line": "From the professional wrestlers we saw in Denver?"
    },
    {
        "character": "Butters",
        "line": "No way!"
    },
    {
        "character": "Cartman",
        "line": "\"Gentlemen, We have heard of your wrestling organization and are quite interested in its popularity. The WWE is delighted to inform you that it will be sending a talent scout, President Vince McMahon to view your wrestling event this Saturday the twenty-fourth.\""
    },
    {
        "character": "Stan",
        "line": "Vince McMahon is coming to see us?"
    },
    {
        "character": "Kyle",
        "line": "This is our shot at making it into the WWE. To be real wrestlers. [Stan and Kyle begin chanting \"Omigod!\" repeatedly]"
    },
    {
        "character": "Stan",
        "line": "Omigod! Omigod! Omigod! Omigod! Omigod! Omigod! Omigod! Omigod! Omigod! Omigod! Omigod!.."
    },
    {
        "character": "Kyle",
        "line": "Oh my God... Oh my God..."
    },
    {
        "character": "Tolkien",
        "line": "I can't believe it's him."
    },
    {
        "character": "Butters",
        "line": "I'm freaking out..."
    },
    {
        "character": "Kyle",
        "line": "[fans himself] Omigod! Omigod! Omigod!"
    },
    {
        "character": "Cartman",
        "line": "Okay guys! Guys, listen! We seriously have to focus here! We have exactly three days before the scout is here to see us wrestle. We gotta step it up and work it like never before."
    },
    {
        "character": "Stan",
        "line": "Alright it's time to start the second act. Let's bring the crowd back in from intermission and then improvise some stuff for Saturday!"
    },
    {
        "character": "",
        "line": "Intermission. The crowd is milling around in the front lawn, and the darkened amphitheater is visible behind the fence."
    },
    {
        "character": "Darryl",
        "line": "Yeah, no I I think Congo is a great wrestler; I just think Rad Russian has his number."
    },
    {
        "character": "Redneck 19",
        "line": "Yeah, but Rad Russian has a lot of abandonment issues. [a chime sounds, indicating the start of the second act]"
    },
    {
        "character": "Darryl",
        "line": "Uh oh, it looks like the intermission is over, better head back."
    },
    {
        "character": "",
        "line": "The amphitheater. The lights come up on Kyle in the ring, who begins to speak."
    },
    {
        "character": "Kyle",
        "line": "I left my wife today. Walked out of the apartment without saying a word. I ran away from my responsibilities... just like I always do. [an elderly fan holds up a sign: \"STOP RUNNING JUGGERNAUT\"] And I, again, am alone. [Stan, Butters, and Tolkien climb into the ring behind him]"
    },
    {
        "character": "Stan",
        "line": "Here he is, hiding in the forest as I told you. [Kyle turns to see the other three boys]"
    },
    {
        "character": "Butters",
        "line": "Juggernaut! There is to be an Ultimate Smackdown this Saturday! Are you going to run from that as well?"
    },
    {
        "character": "Kyle",
        "line": "I'll fight anytime, anywhere!"
    },
    {
        "character": "Redneck 20",
        "line": "He don't run from fights, just from responsibilities. [Tolkien swings a chair into the back of Kyle's head, and Kyle falls to the floor]"
    },
    {
        "character": "Crowd",
        "line": "Oohhhhh! [Tolkien begins to twist Kyle's arm] Boooooooo!"
    },
    {
        "character": "Stan",
        "line": "What do I do? Juggernaut is my long lost brother. [Kenny climbs into the ring as El Pollo Loco] And yet Congo saved my life in Nam. [Kenny picks up the chair and swings it into Tolkien, and Stan turns to see him]"
    },
    {
        "character": "Announcer",
        "line": "It's El Pollo Loco! [a section full of Mexican fans hold up a Mexican flag and two banners: \"Viva El Pollo Loco\" and \"Me Gusta El Pollo Loco\"]"
    },
    {
        "character": "",
        "line": "Sizzler, Thursday. The four boys are seated at a table."
    },
    {
        "character": "Cartman",
        "line": "Thanks for coming, guys. I'm sure you're wondering why I've called you here to Sizzler."
    },
    {
        "character": "Kyle",
        "line": "Yeah, what's this about? We should be writing our monologues for Smackdown."
    },
    {
        "character": "Cartman",
        "line": "Well guys, Kenny and I have been talking."
    },
    {
        "character": "Kenny",
        "line": "(Yeah, we've been talking.)"
    },
    {
        "character": "Cartman",
        "line": "And, I mean, Smackdown might be our one shot at making it into the WWE, right? I mean a shot like this might never come again."
    },
    {
        "character": "Stan",
        "line": "Yeah?"
    },
    {
        "character": "Cartman",
        "line": "Well, the way we see it, we have three primary obstacles in making Smackdown a great show: Tolkien, Butters, Jimmy."
    },
    {
        "character": "Kenny",
        "line": "(Yep.)"
    },
    {
        "character": "Kyle",
        "line": "What are you talking about?"
    },
    {
        "character": "Cartman",
        "line": "Guys, let's face it: they can't wrestle for crap! I mean, every time I wrestle with one of them, they flub a line or blow their monologue. And Tolkien? He has no emotion, no timing, he's the worst wrestler I've ever seen!"
    },
    {
        "character": "Stan",
        "line": "He's right."
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Stan",
        "line": "Dude, it's really hard to do your best wrestling when you're up against Tolkien."
    },
    {
        "character": "Cartman",
        "line": "Right?"
    },
    {
        "character": "Stan",
        "line": "And Butters and Jimmy I mean, they're okay but, they're never gonna make it as professional wrestlers."
    },
    {
        "character": "Kyle",
        "line": "Well, so then WWE will recruit us and not them."
    },
    {
        "character": "Cartman",
        "line": "No dude, they're gonna hurt our chances."
    },
    {
        "character": "Kenny",
        "line": "(They're gonna hurt our chances.)"
    },
    {
        "character": "Cartman",
        "line": "Because we all know that the new material I've written is stuff those guys can't handle, and we'll suffer from it!"
    },
    {
        "character": "Kyle",
        "line": "So what do we do?"
    },
    {
        "character": "Kenny",
        "line": "(We've gotta bring somebody else on.)"
    },
    {
        "character": "Cartman",
        "line": "Yep. We've gotta bring somebody else on who can handle the more difficult roles that we can wrestle against instead of those guys."
    },
    {
        "character": "Stan",
        "line": "Somebody who can do the harder stuff we've written so that Tolkien, Butters, and Jimmy can have smaller parts."
    },
    {
        "character": "Kyle",
        "line": "How do we find somebody who can wrestle that well?"
    },
    {
        "character": "Cartman",
        "line": "It's simple. We just gotta hold tryouts."
    },
    {
        "character": "",
        "line": "Tryouts, later on. Syncopated music plays, similar to \"All That Jazz.\" The four boys are seated at a table a few rows up in the amphitheater."
    },
    {
        "character": "Cartman",
        "line": "Number seventeen step forward, please? [a man steps forward shielding his eyes from the glare of the spotlights] You're wrestling a Muslim immigrant. You suspect he could be a terrorist and your parents died in the 9/11 attacks. Go!"
    },
    {
        "character": "Number 17",
        "line": "[gets into a slight crouch] You dirty Muslim bastard! I don't trust you, and I never will! Do you know how it feels to lose your parents?! No you wouldn't, you smelly brown Middle Eastern piece of sh-"
    },
    {
        "character": "Cartman",
        "line": "Thank you! Number twenty-four? [another man steps forth as Number 17 returns to his place] You're wrestling for the right to marry Mackenzie Phillips, but just learned that she had sex with her father uh, go!"
    },
    {
        "character": "Number 24",
        "line": "Your father! Your own father! [slaps himself four times] I don't care if you were on drugs, you sick! Whore!"
    },
    {
        "character": "Cartman",
        "line": "Thank you. [Number 24 returns to his place]"
    },
    {
        "character": "Kyle",
        "line": "That guy's a pretty good wrestler."
    },
    {
        "character": "Kenny",
        "line": "(Mhm.)"
    },
    {
        "character": "Stan",
        "line": "Yeah yeah, not bad."
    },
    {
        "character": "Cartman",
        "line": "Let's see uh, can we get number thirty seven to step forward again. [Number 37 steps forward] We just wanna get to know you all a little better. What can you tell us about yourself?"
    },
    {
        "character": "Number 37",
        "line": "Not a whole lot to tell, really. Was born in Fort Collins, started watching wrestling when I was four years old. My father... he liked it too. Until he died. [stirring music begins to play] Sometimes I think it's 'cause of him I followed this dream. [breaks into song]\nAll my life, all I ever wanted was to\nBeeeee a wrestler\nFiiiiighting in the ring\nWinning that belt.\nAnd so I dreamed every night that I was the\nUuuuundertaaker\nSmaaaaashing skulls in\nBreaking arms.\nBut I'm so worked up. This is something I can do.\nDo I have what it takes inside?\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Damn dude, that is some badass wrestling."
    },
    {
        "character": "Cartman",
        "line": "Yeah, this guy crushes."
    },
    {
        "character": "",
        "line": "The coach's trophy room. A whole bunch of wrestling trophies and awards are shown as the camera pans to the right. The coach is seated in his armchair."
    },
    {
        "character": "Mr. Conners",
        "line": "It isn't fair. All my hard work. [he's reading Saturday's Gazette, which has Vince McMahon's picture and name under the headline \"Wrestling Smackdown Brings WWE President\"] I'm not going to take it anymore. [he throws the paper to the floor, gets up from the chair, and walks over to a mirror.] That wrestling show is in for a big surprise. [grabs his headgear and puts it on] I'm putting an end to this once and for all! [gets into a wrestling stance] Hyaaaaa!"
    },
    {
        "character": "",
        "line": "Cartman's house, Saturday night. A banner under the second-floor windows reads \"ULTIMATE SMACKDOWN TONIGHT!!!\" People from all over South Park gather on the front lawn. A white limo with the WWE logo emblazened on it comes to a stop in front of the house."
    },
    {
        "character": "Kyle",
        "line": "[standing on a stool by the front window] He's here! Vince McMahon is here! [the other boys arrive. An assistant opens the back door and Vince steps out and surveys the front yard.]"
    },
    {
        "character": "Jimmy",
        "line": "Oowow, it's really him."
    },
    {
        "character": "Stan",
        "line": "He's here, Ohh my God [Kyle hops off the stool and joins Stan in the chant] Omigod omigod omigod omigod omigod omigod omigod omigod omigod o-"
    },
    {
        "character": "Cartman",
        "line": "[preparing to dress as Irene] Alright, places everyone."
    },
    {
        "character": "",
        "line": "The backyard amphitheater. The lights go out and two spotlights light up the ring."
    },
    {
        "character": "Cartman",
        "line": "[over the speakers] Welcome to this performance of Wrestling Takedown Federation: Smackdown. [An opera box has been built to accommodate McMahon. It has four seats, and an usher takes McMahon and assistant to their seats. Vince has his own personal Playbill with \"WTF\" on the cover]"
    },
    {
        "character": "Stan",
        "line": "Juggernaut? Juggernaut, hey, what's goin' on?"
    },
    {
        "character": "Kyle",
        "line": "You know what's goin' on. It's Smackdown tonight. Which means we might have to fight each other."
    },
    {
        "character": "Stan",
        "line": "Heyhey whoa, you shouldn't be fighting anybody. What about your cancer?"
    },
    {
        "character": "Kyle",
        "line": "Wait a minute. Who is that?"
    },
    {
        "character": "Stan",
        "line": "It's Triceratops, and he's with Irene. [Coach Connors sneaks up to the side of Cartman's house with a briefcase and puts his back up against the wall]"
    },
    {
        "character": "Kyle",
        "line": "You aren't welcome here, Triceratops!"
    },
    {
        "character": "Cartman",
        "line": "My man can do whatever he wants."
    },
    {
        "character": "Mr. Conners",
        "line": "Stay calm, you know what you have to do."
    },
    {
        "character": "Cartman",
        "line": "You're just gonna have to deal with that."
    },
    {
        "character": "Mr. Conners",
        "line": "For the good of real wrassling. [quickly moves away and out of sight]"
    },
    {
        "character": "Butters",
        "line": "No Irene, please! Just this once, do not abort this baby!"
    },
    {
        "character": "Cartman",
        "line": "My body, my rights! In fact, I'm jonesing for the rush so badly, I don't think I'll make it to the clinic."
    },
    {
        "character": "Stan",
        "line": "No, you can't possibly mean that-!"
    },
    {
        "character": "Cartman",
        "line": "Yes! I think maybe I'll have another abortion! Right here, right now!"
    },
    {
        "character": "Crowd",
        "line": "Awwwww!"
    },
    {
        "character": "Kyle",
        "line": "There's someone here to wrestle you, Irene! A baby you aborted many years ago survived! And he's here now!"
    },
    {
        "character": "Number 37",
        "line": "[leaps into view in yellow tights and red boots] Mother! Why did you abort me? Why?"
    },
    {
        "character": "Redneck 21",
        "line": "He's alive!"
    },
    {
        "character": "Cartman",
        "line": "You! Get back in the trashcan where you belong!"
    },
    {
        "character": "",
        "line": "The opera box."
    },
    {
        "character": "Assistant",
        "line": "What do you think?"
    },
    {
        "character": "Stan",
        "line": "Irene, there's no way we could let you here, and I'd let you do something informal like that."
    },
    {
        "character": "Vince",
        "line": "They are decent wrestlers. We'll see how they develop their through lines in the second act. [whips out some opera glasses and puts them on]"
    },
    {
        "character": "",
        "line": "Under the bleachers. Coach Connors is sneaking around, occasionally going into a wrestling stance."
    },
    {
        "character": "Jimmy",
        "line": "Aha! I thought I would find you here, Triceratops!"
    },
    {
        "character": "Butters",
        "line": "Stay out of my business Sergeant Hammerclaw! You just stay out of my way!"
    },
    {
        "character": "Guard",
        "line": "[catching up to the coach] Excuse me. I'm sorry, I'm afraid this area is off limits."
    },
    {
        "character": "Butters",
        "line": "[after Jimmy says something] Are you sure?"
    },
    {
        "character": "Mr. Conners",
        "line": "Oh don't mind me. [puts down his briefcase] I was just about to- [quickly gets the guard to the ground and takes up the starting position of wrassling.]"
    },
    {
        "character": "Guard",
        "line": "[seems to be enjoying all the moves and grunts the coach is making] Heh whoa-ho! Heh hey! Whoawhoawhoa. Whoahoho. Eheheh. The fuck is this?"
    },
    {
        "character": "",
        "line": "The backyard amphitheater. The next segment begins with the Rad Russian holding court while the other wrestlers sway to the music behind him."
    },
    {
        "character": "Cartman",
        "line": "O, how I long for the spring meadows of Russia! The soft Russian sky!"
    },
    {
        "character": "",
        "line": "An upper floor under the bleachers. The coach climbs up a ladder to this floor and sets his briefcase down. He opens the case and assembles the rocket-propeled grenade launcher inside it."
    },
    {
        "character": "Stan",
        "line": "When are you going to face reality, Congo? Just because you were raised by panthers doesn't mean you are one!"
    },
    {
        "character": "Butters",
        "line": "He's closer to a panther than you'll ever be!"
    },
    {
        "character": "Jimmy",
        "line": "Lies! These are all a bunch of lies! [back to the ring. Kenny has a bloody baby doll under his left arm. A fake umbilical cord is attached to it] Now you listen here, El, Pollo Loco! It doesn't matter if your wife was killed, you cannot keep Irene's aborted baby!"
    },
    {
        "character": "Kenny",
        "line": "(I can keep the baby...)"
    },
    {
        "character": "",
        "line": "The railing at the very top of the amphitheater, behind the topmost seats. The coach climbs up and over it with his RPGL."
    },
    {
        "character": "Cartman",
        "line": "Just let them crawl back to Mexico Sergeant Hammerclaw. [The coach picks up the RPGL, puts it on his shoulder, and takes aim] We can't... might as well go back to your land of burritos, tacos, and take this aborted baby where it will fit in right with all the other aborted babies in Mexico!"
    },
    {
        "character": "Mr. Conners",
        "line": "[while Cartman speaks] Only one shot. [moves his aim from the ring to the opera box] Maximum damage. [zooms in on McMahon] This is all your fault, you WWE president asshole! Your fault we all die here. Right. Now. FOR WRASSLING! [fires the launcher and the rocket takes off. It goes towards the façade, but stops and drops harmlessly into the ring] NO! [Kenny picks it up. It comes back to life and takes off with him holding on. They go all over the place, but finally take off into the sky, where the grenade blows up and releases fireworks. Below, Mexican fans of El Pollo Loco hold up banners: \"Viva El Pollo Loco\" \"Me Gusta El Pollo Loco\"]"
    },
    {
        "character": "Fan 1",
        "line": "O dios mio, mataron al Pollo Loco!"
    },
    {
        "character": "Fan 2",
        "line": "Bastardos! [Kenny's theme music comes up as the fireworks continue coming down. Vince and his assistant stand up and applaud the performance]"
    },
    {
        "character": "Mr. Conners",
        "line": "[coming down the bleachers towards the ring] No! No, shut up! [steps into the ring] You idiots want wrassling?! This is wrassling! [performs some wrestling stances and grunts, but gets booed]"
    },
    {
        "character": "Redneck 22",
        "line": "We want some real wrestlers!"
    },
    {
        "character": "Mr. Conners",
        "line": "This is just a bunch of garbage! And you are all ruining the good name of wrassling! [the boos continue] Wrassling is from ancient Greece! It's in the Olympics!"
    },
    {
        "character": "Darryl",
        "line": "What the hell do you care?! Get off the wrestlin' mat! Boo!"
    },
    {
        "character": "Mr. Conners",
        "line": "Why do I care? These kids made it so real wrassling is gone from schools! It's practically gone from the culture. Damn it they took my job!"
    },
    {
        "character": "Crowd",
        "line": "[suddenly confused] Huh? What?"
    },
    {
        "character": "Redneck 5",
        "line": "They took his job."
    },
    {
        "character": "Redneck 23",
        "line": "I know. Sshh. [the crowd falls silent, waiting for his next words]"
    },
    {
        "character": "Mr. Conners",
        "line": "You want to know pain? Pain is dedicating your entire life to a sport, to a career, and then having it all ripped away from you like a babe from its mother."
    },
    {
        "character": "Darryl",
        "line": "Oh man, they took his job?"
    },
    {
        "character": "Redneck 13",
        "line": "They took hid-drr."
    },
    {
        "character": "Mr. Conners",
        "line": "Lost everything! Couldn't even afford to pay for my... little retriever Rex anymore! Animal Control came and got him!"
    },
    {
        "character": "Redneck 24",
        "line": "They took his dog!"
    },
    {
        "character": "Redneck 25",
        "line": "They tok hid-drr!"
    },
    {
        "character": "Redneck 5",
        "line": "Took hid-drrr!"
    },
    {
        "character": "Mr. Conners",
        "line": "I ended up on the streets, stealing! Got busted by the police and had to spend the night in jail! The other inmates, they all beat me up and fractured my jaw to where I couldn't eat!"
    },
    {
        "character": "Redneck 26",
        "line": "They broke his jaw!"
    },
    {
        "character": "Redneck 22",
        "line": "Theeyy broke his jaw!"
    },
    {
        "character": "Redneck 27",
        "line": "Brk hij-jrr! [a rooster in a cage crows]"
    },
    {
        "character": "Mr. Conners",
        "line": "So you see I have nothing left. Nothing! Not even the will to live. [He closes his eyes. The crowd takes it in, applauds, then gives him a standing ovation. He opens his eyes, surprised at the reaction. Flowers begin falling at his feet, and Vince McMahon steps into the ring to approach him]"
    },
    {
        "character": "Vince",
        "line": "Sir, that was one of the finest wrestling performances I have ever seen."
    },
    {
        "character": "Mr. Conners",
        "line": "What?"
    },
    {
        "character": "Vince",
        "line": "Will you not join our wrestling organization? I promise to make you our leading act."
    },
    {
        "character": "Mr. Conners",
        "line": "You, you mean it?"
    },
    {
        "character": "Vince",
        "line": "Come! I want to get you in rehearsals right away! [leaves the ring with the coach]"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Stan",
        "line": "Dude."
    },
    {
        "character": "Cartman",
        "line": "Hey, what about us? Our show? [the coach is now grinning as the two men walk away]"
    },
    {
        "character": "Vince",
        "line": "Sorry boys. You are decent wrestlers, but lack the raw wrestling talent this man has."
    },
    {
        "character": "The boys",
        "line": "Aaaaah."
    },
    {
        "character": "Cartman",
        "line": "This is all your fault, Kyle! You screwed up the second act!"
    },
    {
        "character": "Kyle",
        "line": "Me?! It was your stupid-ass writing!"
    },
    {
        "character": "Jimmy",
        "line": "Face it: Stan's crappy singing is what sssunk us!"
    },
    {
        "character": "Stan",
        "line": "What?? [three fights break out in the ring: Cartman vs. Kyle, Jimmy vs. Stan, and Tolkien vs. Butters]"
    },
    {
        "character": "Jimmy",
        "line": "You can s-, you can suck, suck my balls!"
    },
    {
        "character": "Stan",
        "line": "Don't go pointing fingers at me, Cartman! You have no idea what you're talking about, and it wasn't... [the fighting continues. The crowd gets bored of this unscripted fight]"
    },
    {
        "character": "Redneck 28",
        "line": "What the hell's this?"
    },
    {
        "character": "Redneck 29",
        "line": "This is Goddamned fake!"
    },
    {
        "character": "Darryl",
        "line": "Screw this, this is just stupid. [leaves his seat. Other spectators leave their seats as the boys continue to fight in the ring]"
    },
    {
        "character": "Cartman",
        "line": "Oh, don't start with me, Kenny!"
    },
    {
        "character": "Redneck 30",
        "line": "FAKE!"
    },
    {
        "character": "Cartman",
        "line": "Kenny! I'm-"
    }
]