[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Denver Aquarium, day. A group of people are wading around in a dolphin pool. Among them are the Marshes."
    },
    {
        "character": "Chet",
        "line": "All right, everyone, welcome to the Dolphin Encounter here at the Denver Aquarium. [a woman behind him waves at everyone. Randy takes a picture of the trainers] My name is Chet and I'll be your guide and trainer as you meet these intelligent and truly magical creatures. [several dolphins swim in from another part of the pool] And here they come: this is Trigger and Dolly, uh there's Bubbles."
    },
    {
        "character": "Stan",
        "line": "[happily] Wow cool."
    },
    {
        "character": "Randy",
        "line": "Pretty neat birthday, huh Stan?"
    },
    {
        "character": "Stan",
        "line": "Yeah, this is gonna be awesome."
    },
    {
        "character": "Chet",
        "line": "If they come near you you can touch their back just no grabbing please. What whimsical creatures aren't they? All the dolphins you will be encountering today are Atlantic bottlenose dolphins. Now who would like to get a kiss from one?"
    },
    {
        "character": "Girl",
        "line": "I would like to-"
    },
    {
        "character": "Randy",
        "line": "[barging in] MEMEME. I wanna kiss it! I wanna kiss it!"
    },
    {
        "character": "Chet",
        "line": "Uh all right, let's just uh, get you to put your hands, palms down, on the water. [a dolphin swims by] The- [a rumble is heard, and then gets louder]"
    },
    {
        "character": "Stan",
        "line": "What the hell is that? [the trainer turns around. A group of Japanese men in kimonos run towards the pool with harpoons in hand.]"
    },
    {
        "character": "Trainer 2",
        "line": "Oh no it's the Japanese! [The group jumps in and proceeds to stab every dolphin in there repeatedly until the dolphins bleed to death, then jumps out of the pool and runs back towards the way it came from.]"
    },
    {
        "character": "Japanese Man 1",
        "line": "(In Japanese Accent) Fuck youuu dofiiin!"
    },
    {
        "character": "Japanese Man 2",
        "line": "(In Japanese Accent) Fuck you dofiiin! [they leave behind a pool of dead dolphins and bewildered guests. The girl begins to cry.]"
    },
    {
        "character": "",
        "line": "Another location. The guide here is in front of a huge tank with a thick glass wall through which sea life can be seen."
    },
    {
        "character": "Guide",
        "line": "These are our favorite animals here at the Atlanta Zoo. It's Dolly and Seymour. They are beluga whales. These whales live mostly in the Arctic region- [the Japanese men strike again, making everyone else run out of the area, breaking the wall with their harpoons.]"
    },
    {
        "character": "Japanese Man 3",
        "line": "(In Japanese Accent) Fuck you, whaaales!"
    },
    {
        "character": "",
        "line": "The Baltimore Aquarium. Some dolphins are performing tricks when the Japanese men strike a third time."
    },
    {
        "character": "Trainer 3",
        "line": "All right Jessica, now put your arms out like this. [little Jessica lifts her arms out and open] Great job, Jessica!"
    },
    {
        "character": "Japanese Man 4",
        "line": "Fuck you, whaaale! [jumps onto the platform and harpoons the whale, then runs off without taking the harpoon]"
    },
    {
        "character": "Jessica",
        "line": "AAAAAAAA!"
    },
    {
        "character": "",
        "line": "Stan's house, night, Stan's bedroom. He's moping on his bed. Randy peeks in to see how Stan is doing, then walks in and goes to Stan's bed."
    },
    {
        "character": "Randy",
        "line": "[sigh] Hey pal. [sits by him] Sorry your birthday got a little ruined by the Japanese."
    },
    {
        "character": "Stan",
        "line": "Dad, why did they do that?"
    },
    {
        "character": "Randy",
        "line": "Well Stan, the Japanese just... don't really like dolphins very much. Certainly not as much as us normal people do. But hey, at least you still got your T-shirt! [Stan moves his arms out of the way and looks at the shirt - a white \"I swam with the dolphins\" T-shirt with blood splattered on it.] And you always have your neat picture. [hands Stan the framed picture on the nightstand, which Stan opens and looks at. It's of Stan and a dead dolphin, with the caption \"My New Friend!\" underneath]"
    },
    {
        "character": "",
        "line": "The Miami Dolphins home field, Land Shark Stadium, day."
    },
    {
        "character": "Commentator 1",
        "line": "Dan Dierdorf here, welcoming you to this great football matchup between the Kansas City Chiefs and the Miami Dolphins. We're all set for kickoff and- [the Japanese men strike again]"
    },
    {
        "character": "Commentator 2",
        "line": "Oh Dan it looks like Japanese people are now rushing onto the field. [the Japanese men stab and kill all the Dolphin players] This is not the kind of thing you want happening during kickoff. [the Japanese men run off]"
    },
    {
        "character": "Japanese Man 5",
        "line": "(In Japanese Accent) Fuck you, dofiiin!"
    },
    {
        "character": "",
        "line": "Channel 9 News."
    },
    {
        "character": "News Anchor",
        "line": "Several whales and dolphins were again slaughtered by the Japanese today, this time at the Six Flags Discovery Kingdom near San Francisco. [a shot of the Japanese killing the dolphins there] Aquariums had been experimenting with methods to keep the Japanese out, but so far nothing seems to stop them. When asked if all of Japan supported the slaughtering of whales and dolphins, the current Prime Minister of Japan, Yukio Hatoyama, had this to say:"
    },
    {
        "character": "Hatoyama",
        "line": "[clears his throat] (In Japanese Accent) Fuck you weiru [gives the finger with his right hand], anda fuck you dohfiiin! [gives the finger with his left hand]"
    },
    {
        "character": "",
        "line": "Cartman's house, day. Cartman is singing Lady Gaga's \"Poker Face\". He's at the chorus while Kenny is on a Rock Band drum set. Kyle is on a Rock Band guitar."
    },
    {
        "character": "Cartman",
        "line": "Can't read my, can't read my, \nNo he can't read my poker face. \nShe's got to love nobody. \nCan't read my, can't read my, \nNo he can't read my poker face. \nShe's got to love nobody. \nPapapa poker face papa poker face. \nMumumumuh. \nPapapa poker face papa poker face. \nMumumumuh.\n\n\n"
    },
    {
        "character": "Stan",
        "line": "[as Cartman finishes the chorus] Guys... guys... [Cartman turns off the mic] Look, I really think it's time for us to do something. This is all getting way out of hand."
    },
    {
        "character": "Cartman",
        "line": "What do you mean? This song is sweet."
    },
    {
        "character": "Stan",
        "line": "No, not the song. I'm talking about the Japanese killing whales and dolphins."
    },
    {
        "character": "Kyle",
        "line": "Dude, they've been doing that for a long time."
    },
    {
        "character": "Stan",
        "line": "So? Dude, don't you guys care? We have to do something."
    },
    {
        "character": "Kyle",
        "line": "What are we gonna do, Stan? It's, it's not like we can change the way an entire country thinks. I don't like it, but it's just the way they are."
    },
    {
        "character": "Stan",
        "line": "It seems like everyone has an attitude of \"that's just the way they are\" or \"that's just the way it is\"! Nobody likes it, but everybody's too busy to do anything about it!"
    },
    {
        "character": "Cartman",
        "line": "I'm not too busy, Stan."
    },
    {
        "character": "Stan",
        "line": "You're not?"
    },
    {
        "character": "Cartman",
        "line": "No, I just don't care. At all."
    },
    {
        "character": "Kenny",
        "line": "(Yeah, me neither.)"
    },
    {
        "character": "Stan",
        "line": "Kenny? You don't care about whales and dolphins being slaughtered?"
    },
    {
        "character": "Cartman",
        "line": "[speaking into the mic] Stan, me and Kenny don't give two shits about stupid-ass whaaales!"
    },
    {
        "character": "Stan",
        "line": "You know, when all the whales and dolphins in the world are gone, people are gonna wish that at some point they had taken a little time to care just a little goddamn bit! [turns and walks out the front door. The boys don't move for a few seconds, then Cartman launches back into \"Poker Face\".]"
    },
    {
        "character": "Cartman",
        "line": "I wanna roll with him a hard pair we will be.\nI don't give a crap 'bout whales so go and hug a tree.\n\n\n"
    },
    {
        "character": "",
        "line": "Stan's room, sometime later. He's at his desk, pissed off that Cartman and the others don't seem moved by the slaughter. Butters peeks in, then approaches Stan."
    },
    {
        "character": "Butters",
        "line": "Hey Stan! I heard you were looking for people who care about the Japanese slaughterin' whales."
    },
    {
        "character": "Stan",
        "line": "[lights up] Yeah. Butters, do you wanna help?"
    },
    {
        "character": "Butters",
        "line": "Nononono, I got stuff to do. But I wanted to tell you there's these fellers on TV. They go out in the ocean an' try to stop the Japanese wherever they are."
    },
    {
        "character": "Stan",
        "line": "[turns to look at Butters] Really? [gets off his chair] People who are doing something?"
    },
    {
        "character": "Butters",
        "line": "I watch their show all the time. And, they take volunteers."
    },
    {
        "character": "Stan",
        "line": "[determined] Then that's where I belong."
    },
    {
        "character": "",
        "line": "OP for Whale Wars, a montage of scenes from that show."
    },
    {
        "character": "Singer",
        "line": "The world is a vampire, sent to drain."
    },
    {
        "character": "Captain Paul Watson",
        "line": "Yeah, we're badass."
    },
    {
        "character": "Singer",
        "line": "Despite all my rage I am still just a rat in a cage."
    },
    {
        "character": "Male Crew 1",
        "line": "Any means necessary! We're not protesters, we're pirates! [\"Whale Wars\" shows up onscreen]"
    },
    {
        "character": "",
        "line": "Whale Wars. The Sea Shepherd is shown floating in the middle of the ocean. In the bridge the Shepherd's crew is gathered."
    },
    {
        "character": "Captain",
        "line": "That's definitely a Japanese boat. [looks through his binoculars] Looks like they're whaling now. [sure enough, the Japanese, on the Herro Maru No. 3, are throwing harpoons at the whales. Random cries of \"Gojira\" come forth]"
    },
    {
        "character": "Japanese Sailor",
        "line": "Fuck youuu, weiruu!"
    },
    {
        "character": "First Mate",
        "line": "Oh my God, they're gonna kill those humpbacks!"
    },
    {
        "character": "Woman",
        "line": "We've gotta do something!"
    },
    {
        "character": "Captain",
        "line": "Pull up next to them. The fight is on!"
    },
    {
        "character": "Stan",
        "line": "Sweet! [the Sea Shepherd pulls up alongside the Herro Maru. The whalers gather at the railings and razz the Sea Shepherd]"
    },
    {
        "character": "Captain",
        "line": "[taking his crew out to the deck] Are we ready to do this?"
    },
    {
        "character": "Crew",
        "line": "Yeah!"
    },
    {
        "character": "Stan",
        "line": "Yeah. Hell yeah! Let's do it!"
    },
    {
        "character": "Captain",
        "line": "Are we badasses?"
    },
    {
        "character": "Crew, Stan",
        "line": "Yeah!"
    },
    {
        "character": "Captain",
        "line": "Are we badasses?"
    },
    {
        "character": "Crew, Stan",
        "line": "Yeah!"
    },
    {
        "character": "Captain",
        "line": "All right, so... what do we do? [the Japanese continue razzing them] Wait, I know. How about we go on their ship, and then beat ourselves up? And then we can tell the media they did it?"
    },
    {
        "character": "Crewman",
        "line": "[masked] Great idea, Captain!"
    },
    {
        "character": "Aussie Crewman",
        "line": "I'll start right now. [begins punching himself on the cheek]"
    },
    {
        "character": "Woman",
        "line": "\"Oh my God, Luke's been hurt trying to save whales.\""
    },
    {
        "character": "Captain",
        "line": "Wait, wait wait. I've got a better idea. How about I pretend to be shot? Then we can tell the media the Japanese shot me, a-and start an international c-crisis?"
    },
    {
        "character": "Stan",
        "line": "Whoa, wait wait, we don't wanna just lie about stuff."
    },
    {
        "character": "Captain",
        "line": "Why not?"
    },
    {
        "character": "Stan",
        "line": "Well, 'cause then we're just douchebags, dude. Come on, they're right here. Let, let's get hardcore!"
    },
    {
        "character": "Captain",
        "line": "You know what? He's right. It's time to bring out the big guns! You guys ready? [the crewmen hold up sticks of something...] Ready? And... throw the stinky butter at them! [they throw the sticks at the Herro Maru and hit it, leaving blotches in various places. One explodes next to two sailors, who just look at the mess it leaves]"
    },
    {
        "character": "Luke",
        "line": "Haha, you stink now! Haha!"
    },
    {
        "character": "Stan",
        "line": "Wait, that's it?"
    },
    {
        "character": "Captain",
        "line": "Yeah, we make 'em stink. Haha your boat is stinky! Here, th- here, throw one."
    },
    {
        "character": "Stan",
        "line": "Those guys are always covered in dolphin and whale guts. They don't care if they stink. Come on, let's break their boat."
    },
    {
        "character": "Captain",
        "line": "Well no, that'd be illegal."
    },
    {
        "character": "Crewman 2",
        "line": "Yeah."
    },
    {
        "character": "Stan",
        "line": "[can't believe how toothless their threats are] I thought you guys were pirates in a war!"
    },
    {
        "character": "Woman",
        "line": "I'm a pirate in a war."
    },
    {
        "character": "Stan",
        "line": "Pirates don't worry about the law! You guys said you were badasses!"
    },
    {
        "character": "Captain",
        "line": "We are. People think our methods are extreme. But we'll keep making their boats stink as long as they're killing whales and dolphins!"
    },
    {
        "character": "Luke",
        "line": "The Japanese are scared of how hardcore we are. [a Japanese gunner prepares a large harpoon in a cannon and fires it off. It strikes the Shepherd's captain's head, goes through it, and pins him on the wall, killing him instantly. Blood comes out everywhere]"
    },
    {
        "character": "Woman",
        "line": "Paul! [the Japanese sailors cheer this small victory]"
    },
    {
        "character": "Crewman",
        "line": "Paul?"
    },
    {
        "character": "Crewman 2",
        "line": "What do we do?"
    },
    {
        "character": "Woman",
        "line": "We don't have a captain!"
    },
    {
        "character": "Crewman",
        "line": "Oh my God, oh my God!"
    },
    {
        "character": "Woman 2",
        "line": "[masked] Maybe he's okay."
    },
    {
        "character": "",
        "line": "Stan turns and goes towards a utility box. He opens it, rifles through it and finds a flare gun. He takes it, goes to the railing, and fires a flare at the Herro Maru. It finds the fuel storage area, lights up, and soon the barrels and boxes in that area begin to burn and explode. The Japanese try to put out the fire, but it's no use."
    },
    {
        "character": "Crewman 2",
        "line": "Oh my God."
    },
    {
        "character": "Luke",
        "line": "What did you do?"
    },
    {
        "character": "Stan",
        "line": "What you assholes acted like you were doing? [cries of \"ikaban\" come from the Herro Maru as it slowly sinks in the ocean and Japanese sailors jump off the ship]"
    },
    {
        "character": "",
        "line": "Montage as Cartman sings \"Poker Face\". An Entertainment Weekly cover with Captain Stan on it and the lead story \"'Whale Wars' Gets Better. Things Actually Happen Now.\" The crewmen are now throwing Molotov cocktails at the ships, and the Japanese run for cover. Next, Stan steers the Sea Shepherd. Next, Stan is shown with a large new cannon, having just fired a grenade at a whaling ship with it. The crew dances with joy. Next, a Variety cover with the new captain and the headline, \"Whale Wars Ratings Skyrocket. New Captain Not A Fat Liar Like The Old One.\" Next, Stan leads the crew as they act as a volunteer security force at aquariums across the country. Next, a People cover with Captain Stan and his crew, and the cover story, \"WHALE WARS New Cast Member Turns Vegan Pussies Into Actual Pirates. 19-page exclusive article.\" Finally, Stan and crew stand before a covered statue at Sea World. The Japanese head their way to get into the park."
    },
    {
        "character": "Stan",
        "line": "Wait for it... wait for it... NOW! [the crew pulls at the ropes, and the covers comes off the statue - it's Godzilla.]"
    },
    {
        "character": "The Japanese",
        "line": "Ohhhh Gojira! Gojira! [they turn and run away]"
    },
    {
        "character": "",
        "line": "Someone is reading a newspaper, the World News, on which is the headline \"LITTLE BOY SINKS ANOTHER JAPANESE BOAT!\" and a picture of Stan on the Sea Shepherd pointing at another sinking Japanese ship."
    },
    {
        "character": "Hatoyama",
        "line": "Nippon no gaijin! [\"Stranger to Japan!\" He looks at the paper again] Kuso, taberu na! [\"Eat shit!\" Crumples up the paper and throws it down.]"
    },
    {
        "character": "",
        "line": "Larry King Live."
    },
    {
        "character": "Announcer",
        "line": "And now, Larry King, live."
    },
    {
        "character": "Larry King",
        "line": "My guest tonight is the little boy who took over the Whale Wars reality show and turned it into a big hit. Please welcome Stan Marsh and his crew."
    },
    {
        "character": "Luke",
        "line": "'Ey Jordan! I'm on Larry King, mate!"
    },
    {
        "character": "Larry King",
        "line": "So Stan, what motivated you, what... inspired you to get out there and make a hit TV show?"
    },
    {
        "character": "Stan",
        "line": "No I, I don't really care about the TV show, I'm just trying to stop the Japanese from killing dolphins and whales."
    },
    {
        "character": "Larry King",
        "line": "Once you became captain the methods used to stop the Japanese definitely became more aggressive. Was that the key to help boost your ratings?"
    },
    {
        "character": "Stan",
        "line": "...No, I don't care about the show."
    },
    {
        "character": "Woman 2",
        "line": "We're pirates."
    },
    {
        "character": "Stan",
        "line": "I just want people to know that you can stop the Japanese if you have some real goddamned balls!"
    },
    {
        "character": "Woman 2",
        "line": "I've got balls! [Stan looks at her a bit annoyed]"
    },
    {
        "character": "Larry King",
        "line": "Well there are many people who see what you're doing as a positive thing, and of course, many that see problems with it. Joining us now is one of those people and... [goes into split screen, with another guest speaking via satellite] You say Stan's methods are unethical."
    },
    {
        "character": "Sid",
        "line": "Larry, you can't just go out and take matters into your own hands like this. If you want a hit TV show you have to go through producers, directors, people that are in unions."
    },
    {
        "character": "Larry King",
        "line": "But Sid, you saw the show before Stan took it over; you have to admit that it was nothing but incompetent vegan pussies doing absolutely nothing and trying to turn it into drama."
    },
    {
        "character": "Sid",
        "line": "Yes, but it doesn't justify changing the entire show structure that their old captain had pitched to the network."
    },
    {
        "character": "Stan",
        "line": "Can we please just talk about the actual whaling problem for a second?!"
    },
    {
        "character": "Larry King",
        "line": "But their old captain, Paul Watson [a real-life photo of him is shown], was an unorganized incompetent media whore who thought lying to everyone was okay as long as it served his cause."
    },
    {
        "character": "Sid",
        "line": "He yes, of course, everyone knows that Paul Watson was a smug, narcoleptic liar with no credibility, but we must-"
    },
    {
        "character": "Stan",
        "line": "Screw this, I gotta get back to work!"
    },
    {
        "character": "",
        "line": "The rechristened Real Whale Wars."
    },
    {
        "character": "Announcer",
        "line": "On this episode of Real Actual Whale Wars, Captain Marsh searches for the Japanese fleet, knowing they could be absolutely anywhere. [Stan is shown on the bridge planning their next move with Crewman 2]"
    },
    {
        "character": "Stan",
        "line": "Would you mind stepping back a little?"
    },
    {
        "character": "Luke",
        "line": "Captain! Captain, some new volunteers showed up to help us in our crusade! [the cameraman and boom mic operator take a few steps back]"
    },
    {
        "character": "Stan",
        "line": "No- Dude, we really can't take any more volunteers."
    },
    {
        "character": "Luke",
        "line": "But they say you know them. [Cartman and Kenny walk through the door]"
    },
    {
        "character": "Cartman",
        "line": "Ahall right dude, this is pretty sweet! [his sweater has \"SAVE THE WHALES\" on it, while Kenny's parka now has \"DOLPHIN LOVER\" on it]."
    },
    {
        "character": "Stan",
        "line": "Oh no, no, NO."
    },
    {
        "character": "Cartman",
        "line": "What dude?"
    },
    {
        "character": "Stan",
        "line": "Oh what? So now that I have a hit TV show you guys care about dolphins and whales?"
    },
    {
        "character": "Cartman",
        "line": "We always have."
    },
    {
        "character": "Kenny",
        "line": "(Yeah, totally!)"
    },
    {
        "character": "Stan",
        "line": "I asked you guys to help me and you said no!"
    },
    {
        "character": "Cartman",
        "line": "That's not what we said."
    },
    {
        "character": "Stan",
        "line": "You said \"Stan, me and Kenny don't give two shits about stupid-ass whales!\""
    },
    {
        "character": "Cartman",
        "line": "We were talking about Wales the country."
    },
    {
        "character": "Stan",
        "line": "Look, if you admit that you're only doing this because you wanna be on TV, then I'll consider it! Admit you just wanna be on TV!"
    },
    {
        "character": "Kenny",
        "line": "(I just want to be on TV.)"
    },
    {
        "character": "Cartman",
        "line": "[under his breath] Kenny! [to Stan] I deserve to be on TV."
    },
    {
        "character": "Crewman 2",
        "line": "Captain! Captain, the Japanese have been spotted near buoy 24!"
    },
    {
        "character": "Stan",
        "line": "Take us out of port! All hands to stations!"
    },
    {
        "character": "Cartman",
        "line": "[popping up in front of the camera] All right! Let's go save those whales, you guys! [grins and pumps a fist]"
    },
    {
        "character": "Announcer",
        "line": "[an aerial view of the Sea Shepherd is shown] Captain Marsh races his boat to the last known location of the Japanese whalers. If he doesn't get there in time, hundreds of dolphins or whales could die."
    },
    {
        "character": "Stan",
        "line": "As soon as we get there, we've gotta deploy the tracking device! We can't let those whales get hurt! [the Sea Shepherd lurches all of a sudden.]"
    },
    {
        "character": "Crewman 2",
        "line": "What the hell was that?!"
    },
    {
        "character": "Crewman 3",
        "line": "We just got rammed."
    },
    {
        "character": "Stan",
        "line": "Oh the Japanese wanna play that way, huh?!"
    },
    {
        "character": "Crewman 4",
        "line": "It's not the Japanese."
    },
    {
        "character": "Stan",
        "line": "What? [goes outside with the crew]"
    },
    {
        "character": "Announcer",
        "line": "On deck the crew is surprised at what they see. The other boat is from Deadliest Catch, a crab-fishing reality show."
    },
    {
        "character": "DC Captain",
        "line": "You think you're so cool, don'tcha?! You think you're big boat reality show on the block?! [goes to a cage and pulls out a crab from it] You're taking away men's livelihoods!"
    },
    {
        "character": "Stan",
        "line": "What? Dude, we're trying to get to some whales."
    },
    {
        "character": "DC Captain",
        "line": "You're taking viewers away from our show, you stupid ass!"
    },
    {
        "character": "Cartman",
        "line": "Your show is fuckin' gay, dude!"
    },
    {
        "character": "DC Crewman",
        "line": "Your show is fuckin' gay!"
    },
    {
        "character": "Stan",
        "line": "Screw this! Turn hard to port! [takes the wheel and starts turning left]"
    },
    {
        "character": "Announcer",
        "line": "But everywhere his reality show's boat turns, the crab fishing reality boat blocks its path. [the crab boat, being smaller and faster, blocks the Sea Shepherd's path quickly]"
    },
    {
        "character": "Stan",
        "line": "Dude, fuck you!"
    },
    {
        "character": "DC Captain",
        "line": "Fuck you!"
    },
    {
        "character": "Announcer",
        "line": "It's been three hours and the crab fishing reality show isn't budging. [Stan is in the captain's quarters, sitting behind a desk, his face buried in his arms] Captain Marsh's boat is dead in the water. He can't go after the Japanese, he can't help the whales or dolphins. Once again on Whale Wars, nothing is happening."
    },
    {
        "character": "Crewman 3",
        "line": "[name: Benjamin Potts] It's pretty difficult times because uh, we know that every minute we're sitting here stopped, a, another whale is dying."
    },
    {
        "character": "Cartman",
        "line": "[gets emotional] Really tough, you know. It's... really hard. It's like [sniff], we've dedicated all this time and all our lives to saving these majestic creatures."
    },
    {
        "character": "Kenny",
        "line": "(And they're all shot.) [cries]"
    },
    {
        "character": "Cartman",
        "line": "Shhh, Kenny... [the camera zooms in on Kenny, who's got his face in his hands] Old Ken is taking it especially hard. He's always loved dolphins so much that he- [flashes an angry look at the camera] Yeah yeah but, but keep it in a two-shot, though. [The camera pulls back to its previous position] Yeah, keep it there. [Cartman resumes his tale] He's always loved dolphins so much that he would do anything."
    },
    {
        "character": "Kenny",
        "line": "(I would do anything!) [puts his face back in his hands and cries.]"
    },
    {
        "character": "Announcer",
        "line": "The crab-fishing reality show is doing just fine. [the crewmen celebrate another great catch.]"
    },
    {
        "character": "DC Crew",
        "line": "Yeah! Woohoo! Alright! [Stan is again shown in the captain's quarters, his face still buried in his arms on the desk]"
    },
    {
        "character": "Announcer",
        "line": "But for the Whale Wars crew, it appears the show is over. Until... a sound is heard. [whale sounds. Stan lifts his head up]"
    },
    {
        "character": "Stan",
        "line": "What was that? [moments later the crew goes on deck. Stan is with them]"
    },
    {
        "character": "Benjamin",
        "line": "Captain, look!"
    },
    {
        "character": "The Crew",
        "line": "Wow. Whoa. [before them are a bunch of whales. One of them rams the crab fishing reality show boat]"
    },
    {
        "character": "Woman 2",
        "line": "The whales are taking out the crab fisherman reality show!"
    },
    {
        "character": "Stan",
        "line": "It's like... they know. [two whales latch onto buoys at either end of a net and begin to haul away the crab fishing boat.]"
    },
    {
        "character": "DC Crewmen",
        "line": "Hey. Heeey. Noo! Stop! [the Sea Shepherd crew begin to cheer and jump for joy]"
    },
    {
        "character": "Stan",
        "line": "They do know. They know everything I've been trying to do for them."
    },
    {
        "character": "Cartman",
        "line": "Our gentle friends of the sea have saved the day. Because they know that only we can save them from the Japanese. [small plane engines are now heard. Cartman, Stan, and the others begin to look around]"
    },
    {
        "character": "Japanese Pilot",
        "line": "Bonzaaaaaaaai! [flies his plane right into a whale and blows up]"
    },
    {
        "character": "Stan",
        "line": "Jesus Christ! [Everyone looks around as more planes come in and take out the whales surrounding the boat. Two whales take a dive to deeper water, but two planes follow them under and blow up. The whales' corpses float up onto the water's surface.] We've gotta get something to shoot 'em with!"
    },
    {
        "character": "Woman 2",
        "line": "Look out! [four Japanes planes crash into the boat and blow it and themselves up. Once the smoke clears, the ocean is shown, filled with debris and carcasses. The crew of the Sea Shepherd is dead... Except for Cartman, Stan, and Kenny, who swim towards a piece of wood.]"
    },
    {
        "character": "Stan",
        "line": "[catching his breath] I, I can't, I can't believe it."
    },
    {
        "character": "Cartman",
        "line": "Dude, you know what? Japanese people really do not like whales. [the Japanese boats pulls up to the boys' location and stops.] Uh oh."
    },
    {
        "character": "",
        "line": "Tokyo, day. The boys are in a prison cell. Cartman brings out a harmonica and starts playing it."
    },
    {
        "character": "Cartman",
        "line": "Well I'm in Japanese prison Lawd\nJapanese prison got me down\nSaid I'm in Japanese prison Lawd\nDon't belong here, my eyes are round.\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Will you stop that?"
    },
    {
        "character": "Cartman",
        "line": "Oh, I'm sorry. Am I making things uncomfortable for you Stan? It's your fault me and Kenny are in this mess!"
    },
    {
        "character": "Stan",
        "line": "Things are bad enough without you being a smartass! There's whales out there being slaughtered right now and I can't do anything about it, so just keep quiet!"
    },
    {
        "character": "Cartman",
        "line": "You don't have a TV show anymore, Captain, so you can just suck my Japanese-imprisoned balls! [goes back to his song. Stan goes to the cell door and looks out]\nI'm in a Japanese prison Lawd. \nJapanese balls got me down.\n[a door opens somewhere and two prison guards walk towards the boys' cell]\n\n\n"
    },
    {
        "character": "Guard",
        "line": "Itte kure 'Akihito-sama irashaimasu!' [\"... 'Welcome, Lord Akihito'!\" The boys, not knowing Japanese, say nothing. The guards bow to the emperor]"
    },
    {
        "character": "Emperor Akihito",
        "line": "So, you are the ones who have been-a sinking our boats!"
    },
    {
        "character": "Stan",
        "line": "You speak English."
    },
    {
        "character": "Emperor Akihito",
        "line": "You have caused us many problems, set us back many months!"
    },
    {
        "character": "Cartman",
        "line": "Sir, we actually don't give two shits about you killing whales. Can we go?"
    },
    {
        "character": "Kenny",
        "line": "(Yeah, can we go?)"
    },
    {
        "character": "Emperor Akihito",
        "line": "[steps closer to the door] Why have you done this? Why do you insist on-a making trouble for the Japanese?!"
    },
    {
        "character": "Stan",
        "line": "Why do you do what you do?! Do you know that ninety eight percent of the world is against whaling?! Why can't you just stop?!"
    },
    {
        "character": "Emperor Akihito",
        "line": "[turns his back on the boys] You think you have the right to tell us what is okay?! I have-a something to show you!"
    },
    {
        "character": "",
        "line": "The Hiroshima Peace Memorial, day. Emperor Akihito takes the boys on a tour of the memorial."
    },
    {
        "character": "Emperor Akihito",
        "line": "This is Hiroshima. Over fifty years ago this entire city was-a destroyed by nuclear bomb. We built this museum so that we never forget what-a happened. [Cartman yawns, Stan punches him on the right shoulder]"
    },
    {
        "character": "Cartman",
        "line": "What dude?"
    },
    {
        "character": "",
        "line": "Inside the Memorial."
    },
    {
        "character": "Emperor Akihito",
        "line": "At-a 8:15 a.m. the people of Hiroshima were just minding their own business when out of nowhere a frash devastated them all. [an atomic bomb is detonated] Women and children who died in the frash simply evaporated. [footage of bomb victims appears] Those reft arrive suffered the worst pain of all. Burns, radiation poisoning. For generations the radiation affected the victims. Japanese babies born without rimbs. Without eyes! [Cartman snickers. The emperor turns, folds his arms over his chest, and glares at him]"
    },
    {
        "character": "Cartman",
        "line": "Sorry. [clears his throat.] A little gassy. 'Scuse me."
    },
    {
        "character": "Emperor Akihito",
        "line": "One hundred and forty thousand Japanese were killed by atom bomb. We have never recovered from the memory of that day. It is impossible for a nation to ever forgive an act so horrible. This-a picture shows the prane that dropped the bomb. [shows it to the boys] It was called the Enora Gay. And it was frown by the monsters who dropped the bomb that day. Dohfin, and Weiru! [the pilots are shown to be a dolphin and a whale. The emperor shakes with anger]"
    },
    {
        "character": "Stan",
        "line": "Ummm, where did you get that picture?"
    },
    {
        "character": "Emperor Akihito",
        "line": "The Americans were nice enough to give it to us the day after the bombing. We were so-a thankful for the picture that the next day we ended our war with America. We will never forgive, never rest until they are all wiped out! Fuck you. Fuck you dohfin and-a weiru!"
    },
    {
        "character": "Cartman",
        "line": "So that's what this has all been about?"
    },
    {
        "character": "Stan",
        "line": "Dude, it wasn't actually and dolphin and a whale who bombed Hiroshima. It was the-"
    },
    {
        "character": "Cartman",
        "line": "Zzzzt zzzzsssht! [whispers aloud] Dude, they won't rest until whoever is responsible is completely wiped out."
    },
    {
        "character": "Stan",
        "line": "Oh, right. Look, I... I think I can make everything okay here. Can I just use a phone?"
    },
    {
        "character": "",
        "line": "Kyle's bedroom. He's working at his computer when the phone rings. He picks up his cell phone and answers."
    },
    {
        "character": "Kyle",
        "line": "Hello? Stan?"
    },
    {
        "character": "Stan",
        "line": "Dude, are you sitting at your computer? I need you to do something for me."
    },
    {
        "character": "",
        "line": "At the Prime Minister's office, later."
    },
    {
        "character": "Stan",
        "line": "Mister Prime Minister, Japanese officials, there's something you need to know. The photo you were given of the Enola Gay was doctored. Because the real bombers feared retaliation so badly that they... simply pointed the finger at somebody else. My government has authorized me to give you the original photo, unaltered, so you can finally know the truth. [pulls out a manila envelope and walks to the Prime Minister's desk] Dolphins and whales were just framed by the real bombers. [hands the envelope to the Prime Minister, who opens it and pulls out the \"unaltered\" photo. The Prime Minister and the officials crowd in to look at the photo.] A chicken and a cow."
    },
    {
        "character": "Emperor Akihito",
        "line": "Chicken and-a cow? Chicken and-a cow?!"
    },
    {
        "character": "Hatoyama",
        "line": "Chicken and cow use poor dohfin and weiru as-a scapegoat?! This is outrage! [pounds his desk]"
    },
    {
        "character": "",
        "line": "A cow pasture. Cows go about grazing, minding their own business, when the Japanese return to the U.S., only now they're killing cows."
    },
    {
        "character": "The Japanese",
        "line": "Fuck you cows!"
    },
    {
        "character": "",
        "line": "A chicken coop. The Japanese converge on it and kill the chickens inside."
    },
    {
        "character": "The Japanese",
        "line": "Teikara chickens!"
    },
    {
        "character": "Randy",
        "line": "[watches all this with Stan] Great job, son. Now the Japanese are normal, like us."
    }
]