[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Windermere Florida, Thanksgiving night, 2009, 2:15 am. There's fighting inside a mansion as a couple screams at each other"
    },
    {
        "character": "Man",
        "line": "Put it down, you bitch!"
    },
    {
        "character": "",
        "line": "Mansion, inside. The camera is focused on the dining room table and slowly pulls back. A golf club strikes a dirty dish and smashes it apart"
    },
    {
        "character": "Man",
        "line": "Put the golf club down, you crazy bitch! [it's Tiger Woods, cowering behind a chair]"
    },
    {
        "character": "Woman",
        "line": "[smashes some more dishes] You motherfucker! I never should have married you! [Elin, with a bad Swedish accent]"
    },
    {
        "character": "Tiger",
        "line": "You're overreacting, you stupid Swedish cow!"
    },
    {
        "character": "Elin",
        "line": "Then why-a the fuck are you getting a text-a message from some-a low-life-a hooker on Thanksgiving?!"
    },
    {
        "character": "Tiger",
        "line": "God, shut up! [runs out of the dining room] Shut! Up! [enters his den and starts rummaging through a drawer] Where are my fucking pills?! [finds them, takes a bunch, and swallows them]"
    },
    {
        "character": "Elin",
        "line": "Oh yeah! Take more vitamins, Tiger! That'll help!!"
    },
    {
        "character": "Tiger",
        "line": "Will you just listen to me?!"
    },
    {
        "character": "Elin",
        "line": "Listen to this-a! [runs up to him and whacks him across the face as he turns to face her, leaving a bleeding gash across his right cheek]"
    },
    {
        "character": "Tiger",
        "line": "[winces] Aaaah! [looks at her] You fucking whore!"
    },
    {
        "character": "",
        "line": "Outside the front door. Tiger leaves the house and goes to his SUV, wiping himself clean. Elin follows him to the front door"
    },
    {
        "character": "Elin",
        "line": "Oh where the fuck do ya think-a you're going?!"
    },
    {
        "character": "Tiger",
        "line": "I'm getting the fuck away from you! [opens the drivers' side door and gets in the SUV. Elin approaches that door with the club. Tiger starts the engine, and Elin starts swinging at the left rear door]"
    },
    {
        "character": "Elin",
        "line": "Open the door, you motherfucker! [Tiger peels away]"
    },
    {
        "character": "",
        "line": "A videogame store. Cartman and Kenny are playing a golf game featuring Tiger and Elin. The preceding scenes were from that game"
    },
    {
        "character": "Cartman",
        "line": "[playing as Tiger] Ooo yeah, take that from me in the car, Kenny! [Stan and Kyle walk into the store and spot the other two boys]"
    },
    {
        "character": "Stan",
        "line": "What are you guys doing?"
    },
    {
        "character": "Cartman",
        "line": "Dude, check it out! It's EA Sports Tiger Woods PGA Tour '11 for Xbox. [onscreen, Elin is chasing the SUV and leaving cracks in the rear windows with each swing of the club]"
    },
    {
        "character": "Tiger",
        "line": "D'Aaaah! Fuck you, cunt!"
    },
    {
        "character": "Cartman",
        "line": "Stop breaking through the window, Kenny! Whoa, I'm gonna crash I'm gonna crash! [Cartman loses control of the SUV, which hits a fire hydrant, then a tree. Elin catches up to the SUV as Tiger opens the door and staggers out, a bit dazed. The radiator is letting out steam]"
    },
    {
        "character": "Tiger",
        "line": "Aw, look what you did, you crazy bitch!"
    },
    {
        "character": "Elin",
        "line": "It serves you right, you cheating turd! [swings at him and misses]"
    },
    {
        "character": "Cartman",
        "line": "Oh dude, was that a combo move?"
    },
    {
        "character": "Kenny",
        "line": "(Yeah dude, I fucked you up.)"
    },
    {
        "character": "Cartman",
        "line": "Dude, here come the cops! We've gotta lie to them. Hit X to lie."
    },
    {
        "character": "Kyle",
        "line": "Wow, I didn't know golf games were this cool."
    },
    {
        "character": "Cartman",
        "line": "Yeah dude, EA Sports outdid themselves this time."
    },
    {
        "character": "",
        "line": "Center for Disease Control and Prevention - the CDC - day. A table full of experts and doctors is assembled on the top floor"
    },
    {
        "character": "Chairman",
        "line": "I've gathered you together here because you are the best minds our country has to offer. As you've all seen on the news, our country is facing a major crisis, and we need to find out what's causing it. [the men glance at each other] Why? Why are rich successful men suddenly going out and trying to have sex with lots of women?"
    },
    {
        "character": "Expert 1",
        "line": "[with mustache and black coat] Tiger Woods was only the most prevalent, but our data shows that the numbers are growing. David Letterman and before that, Bill Clinton. There's a pattern here, people."
    },
    {
        "character": "Expert 2",
        "line": "[with mustache and midnight blue coat] Why would a man who's famous and makes tons of money use that and have sex with lots of different women? [glances at the woman to his left, then looks ahead again]"
    },
    {
        "character": "Chairman",
        "line": "[stands up] Aand these rich celebrities have perfectly good wives at home. Why would they even think of sex with others? Dammit! [pounds the table with his right fist, but manages only a soft blow] I want answers!"
    },
    {
        "character": "Expert 3",
        "line": "[balding, with lab coat] We believe that it may be an outbreak of sex addiction, sir."
    },
    {
        "character": "Chairman",
        "line": "[sits down] Sex awhowho?"
    },
    {
        "character": "Expert 4",
        "line": "[glasses and lab coat] It's a new phenomena we don't completely understand yet, but it... seems to make people... different. Of course, we all know the normal healthy male thinks only of sex occasionally and has no desire for sex with multiple partners. [the other men murmur in agreement]"
    },
    {
        "character": "Expert 5",
        "line": "Definitely true."
    },
    {
        "character": "Chairman",
        "line": "Yes, we all know that, go on."
    },
    {
        "character": "Expert 4",
        "line": "But in the sex addict, their entire lives are consumed with thoughts of wanting more and more. The mere sight of an attractive woman could... can make them think about sex with her."
    },
    {
        "character": "Expert 6",
        "line": "[with fat cheeks] But what about love? How could tons of fame and money make you forget about love? [looks at the woman to his right]"
    },
    {
        "character": "Chairman",
        "line": "What could be causing this outbreak of sexual addiction?"
    },
    {
        "character": "Expert 7",
        "line": "[black] It could be caused by something in the water supply. Uh, perhaps even by - global warming."
    },
    {
        "character": "Expert 8",
        "line": "[Japanese ancestry] Or cooling."
    },
    {
        "character": "Expert 9",
        "line": "Yes"
    },
    {
        "character": "Expert 7",
        "line": "If.so, then the disease could start to affect our children"
    },
    {
        "character": "Chairman",
        "line": "That does it! [pounds the table softly] I want health screening at all our nation's schools! We need to find out if any young people might be carrying this disease."
    },
    {
        "character": "",
        "line": "South Park Elementary, day, 4th Grade classroom. A researcher stands before the class with a clipboard"
    },
    {
        "character": "Expert 9",
        "line": "Good afternoon, students. We are going to be a doing a health screening today. It won't take long, it'll be relatively painless, but we need to see if any students are showing... symptoms. [to his left is a cart with two beakers, a tray, and a picture resting against the legs] I'n a moment, I'm going to show you a suggestive picture. [puts the tray on the middle shelf of the cart and picks up the picture] And then I'm going to ask you a question about that picture. Alright, ready? Here we go. [turns the picture around and a naked couple appears, caressing. The class gasps]"
    },
    {
        "character": "The class",
        "line": "Oh! Wow. Ohhh."
    },
    {
        "character": "Kenny",
        "line": "[cheering] (Woo hoo!)"
    },
    {
        "character": "Kyle",
        "line": "Jesus, dude."
    },
    {
        "character": "Butters",
        "line": "Holy moly, what's that between the lady's legs? It's all bushy."
    },
    {
        "character": "Expert 9",
        "line": "Please just study the picture the best you can, students. I'll then ask you the question which you'll answer on the paper provided."
    },
    {
        "character": "Butters",
        "line": "[pointing] I've never seen that part of a lady! Do they all got a hedge like that? Do they??"
    },
    {
        "character": "Expert 9",
        "line": "Okay, very good. [sets the picture down against the cart again] Now, what color... was the handkerchief in the nice lady's hand? Write down your answer, please: what color was the handkerchief... in the nice lady's hand?"
    },
    {
        "character": "Butters",
        "line": "[to Clyde] Did you see that bush on that lady?? What the heck was that??"
    },
    {
        "character": "Expert 9",
        "line": "Very good, turn your answers over please. [the students turn their sheets over]"
    },
    {
        "character": "Butters",
        "line": "Gee whiz, it was like almost up to her belly button!"
    },
    {
        "character": "Expert 9",
        "line": "Alright, now, who answered that the handkerchief was... yellow? [most of the kids raise their hands] Very good, very good indeed. Now I'd like to see who answered \"What handkerchief?\" [Kenny is the first to raise his hand. Kyle is nervous and looks around, but then raises his left hand. Butters looks over at them and then raises his left hand] A-ha! You three boys, please come with me. [heads for the door as Kyle, Kenny, and Butters leave their seats]"
    },
    {
        "character": "Kyle",
        "line": "I didn't see a handkerchief. Did you see a handkerchief, Kenny?"
    },
    {
        "character": "Kenny",
        "line": "(Fuck no, I wasn't looking at a handkerchief!)"
    },
    {
        "character": "",
        "line": "a small unused office at school. The researcher takes the boys into the office, has them sit at a table, and sits opposite them"
    },
    {
        "character": "Expert 9",
        "line": "I'm sorry boys, but I'm afraid you three have tested positive for sex addiction."
    },
    {
        "character": "Kyle",
        "line": "What?!"
    },
    {
        "character": "Butters",
        "line": "Oh no!"
    },
    {
        "character": "Kenny",
        "line": "[annoyed] (Who fuckin' cares?)"
    },
    {
        "character": "Expert 9",
        "line": "We're gonna have to send you home, I'm afraid."
    },
    {
        "character": "Kyle",
        "line": "Wait, we're sex addicts? Uh-are you sure?"
    },
    {
        "character": "Expert 9",
        "line": "Our nice-lady-with-the-handkerchief test is extremely comprehensive and thorough. I'm sorry, but you're simply too dangerous to have around normal, well-adjusted students."
    },
    {
        "character": "Butters",
        "line": "It was just... so big and bushy sir. Why does it look like that?"
    },
    {
        "character": "Kyle",
        "line": "So what happens to us now?"
    },
    {
        "character": "Expert 9",
        "line": "[sighs and rises from his chair, walking off] A life of desperation and anguish, I'm afraid. Your addiction will start off slowly - magazines, Internet sites - but then, as you keep chasing your high your tastes will get more and more dangerous. Most likely you'll end up going the way of David Carradine and Michael Hutchence: autoerotic asphyxiation."
    },
    {
        "character": "Kenny",
        "line": "(Autoerotic asphyxiation? What's that?)"
    },
    {
        "character": "Expert 9",
        "line": "I don't want to go into too much detail but... you choke yourself with a belt around your neck while masturbating dressed up like Batman or something, then you pass out from lack of air and apparently it makes your orgasm super awesome."
    },
    {
        "character": "Kenny",
        "line": "(Really??)"
    },
    {
        "character": "Butters",
        "line": "Oh no. I don't wanna have to buy a Batman costume."
    },
    {
        "character": "",
        "line": "CDC Headquarters, day. The chairman and his board address the public"
    },
    {
        "character": "Chairman",
        "line": "Ladies and gentlemen, for the past several days we've been screening our nation's schools for signs of sex addiction. The results of our tests are troubling to say the least. Dr. Tonton?"
    },
    {
        "character": "Dr. Tonton",
        "line": "[expert 9, as it turns out. He heads to a chart] In fourth graders, five percent of male students were found to be sex addicts. By sixth grade the number goes up to thirty percent. At high schools, nearly ninety-one percent of male students answered, \"What handkerchief?\""
    },
    {
        "character": "Chairman",
        "line": "We're facing a sex addiction epidemic in our country. Young people all over America are infected, and at extreme risk to themselves and to the people around them. [Kyle watches this on TV from his bed] They're leading lives of secret pain."
    },
    {
        "character": "Reporter 1",
        "line": "And so these infected boys will soon be secretly wishing they could be having sex all the time with lots of different people?"
    },
    {
        "character": "Chairman",
        "line": "It appears so."
    },
    {
        "character": "Reporter 1",
        "line": "The poor bastards!"
    },
    {
        "character": "Reporter 2",
        "line": "But what about us normal healthy adults? Are we at risk of exposure?"
    },
    {
        "character": "Chairman",
        "line": "We don't believe so. In adult males, for whatever reason, sex addiction only seems to be problematic amongst rich successful celebrities. [Randy watches this on TV from bed. Sharon is beside him reading a book instead] However, we are still collecting data, and all-"
    },
    {
        "character": "Randy",
        "line": "Why would wealth and success cause a man to go out and have sex with everyone he could?"
    },
    {
        "character": "Chairman",
        "line": " -answers which we all desire. [next scene is the McCormick living room] Whatever is causing this outbreak, we guarantee we will find it! [Mrs. McCormick comes out with a pizza]"
    },
    {
        "character": "Mrs. McCormick",
        "line": "Kenny, it's time for dinner! [goes upstairs to Kenny's room and looks inside] Kenny? [turns around and gasps. Kenny had hanged himself from his closet door with a belt while dressed in a Batman suit and masturbating to a magazine. His left hand is tucked inside the tights, around the genitals] AAAA!"
    },
    {
        "character": "",
        "line": "Kenny's funeral, day."
    },
    {
        "character": "Priest",
        "line": "Sunset and Evening Star, and one clear call for me, and may their be no moaning of the bar when I put out to sea."
    },
    {
        "character": "Kyle",
        "line": "Oh God, it's true."
    },
    {
        "character": "Priest",
        "line": "But such a tide as moving seems asleep, too full for sound and foam, when that which drew from out the boundless deep t-"
    },
    {
        "character": "Butters",
        "line": "There! It was like that! It looked just like that! [stands on his chair and points to a bush, then walks over to it] Just like this, buh, but smaller, and right in the place where her underwear should've been. If I trim it down, it'll look right.."
    },
    {
        "character": "Kyle",
        "line": "[reaching him] Butters! Butters, stop it!"
    },
    {
        "character": "Butters",
        "line": "[fights Kyle off] But this is what I keep seeing in my head!"
    },
    {
        "character": "Kyle",
        "line": "[pulls him away from the bush] Butters, we are sick! Don't you get it?! We're gonna end up just like Kenny!"
    },
    {
        "character": "Butters",
        "line": "[fights Kyle off again] No, uh, if I can just see it again, I, I'll be fine."
    },
    {
        "character": "Kyle",
        "line": "No! Butters, stop! [slaps him]"
    },
    {
        "character": "Butters",
        "line": "Haah! Leave me alone! [reaches for the bush again]"
    },
    {
        "character": "Kyle",
        "line": "Stop it! Stop! [pulls him back and flings him to the ground. They fight for a few seconds, then break down and cry out] Oh God! Oh God, help us!"
    },
    {
        "character": "",
        "line": "EA Sports Tiger Woods PGA Tour '11. Tiger is about to tee off."
    },
    {
        "character": "Commentator",
        "line": "Tiger... lines up his drive. He'll be hoping for a birdie here. Concentration is key."
    },
    {
        "character": "Elin",
        "line": "[runs into the scene from screen right with her own golf club] You motherfucker! I never should have married you! [starts hitting him with it]"
    },
    {
        "character": "Tiger",
        "line": "Aaagh! Goddamnit, stop it! [blocks her club with his, as in a sword fight, and now they trade blows]"
    },
    {
        "character": "Elin",
        "line": "How many women did you fuck-a?! How many?!"
    },
    {
        "character": "Stan",
        "line": "Aw dude, I clocked you!"
    },
    {
        "character": "Cartman",
        "line": "I told you this game was sweet, dude."
    },
    {
        "character": "Stan",
        "line": "Hang on, hang on, I'm switching to a 7-iron. [Elin gets a new club and her swings get faster]"
    },
    {
        "character": "Cartman",
        "line": "Oh! O-oh! Oh man, I lost another endorsement! How'd you do that?"
    },
    {
        "character": "Stan",
        "line": "Hit A and X together."
    },
    {
        "character": "Announcer",
        "line": "Round 2. Fight!! [Tiger and Elin face off again and start swinging]"
    },
    {
        "character": "Cartman",
        "line": "Oh, you're going down, Elin!"
    },
    {
        "character": "Stan",
        "line": "I don't think so dude, I got the pre-nup power-up."
    },
    {
        "character": "Announcer",
        "line": "Pre-nup power-up. [a pre-nuptial agreement appears onscreen and then flies off. Elin swings and Tiger a few more times and he's on the grass on his back]"
    },
    {
        "character": "Cartman",
        "line": "Oh no! [Elin continues beating up Tiger] Pre-nup? Weak. When'd you get that power-up?"
    },
    {
        "character": "",
        "line": "Karne Institute for Sexual Addiction, day. \"A New Tomorrow, Yesterday.\""
    },
    {
        "character": "Therapist",
        "line": "All right, sex addicts. What other destructive behaviors that we engaged in that led to our ultimate downfall? [on the dry-erase board are three examples: \"Sex Shop Visits, Sex With Hookers, Going To Strip Clubs\"] Anyone have another example? Let's see, how about... David!"
    },
    {
        "character": "David Letterman",
        "line": "Haha, Oh, ahh, having sex with employees."
    },
    {
        "character": "Therapist",
        "line": "[writing on the board] \"Sex with employees.\" Definitely a danger there. What else? Uh, Mr. Clinton."
    },
    {
        "character": "Bill Clinton",
        "line": "Putting cigars in girls' vaginas?"
    },
    {
        "character": "Therapist",
        "line": "Very good, Billy. [writing on the board] \"cigars in vaginas.\" Not the best idea there."
    },
    {
        "character": "Charlie Sheen",
        "line": "Watching Internet porn all day every day?"
    },
    {
        "character": "Therapist",
        "line": "Spot on, Charlie Sheen! Excessive [writing on the board] \"Internet porn.\" Now, the reason we are making this list is that we have new members today. I want you all to welcome Kyle and Bummers. The men all turn to look at the boys, who are seated in the last row."
    },
    {
        "character": "Kyle",
        "line": "Hello?"
    },
    {
        "character": "The men",
        "line": "Hey Kyle, hi Kyle."
    },
    {
        "character": "Therapist",
        "line": "And would you care to share your stories with us, boys?"
    },
    {
        "character": "Kyle",
        "line": "Well, I just found out I'm a sex addict. I'm so scared, I haven't even told my mom yet."
    },
    {
        "character": "Bill Clinton",
        "line": "Does your mom have big tits?"
    },
    {
        "character": "Therapist",
        "line": "Billy!"
    },
    {
        "character": "Bill Clinton",
        "line": "[sheepishly] Sorry..."
    },
    {
        "character": "Butters",
        "line": "Me, I just... Well I just can't stop thinking about bush."
    },
    {
        "character": "Ben Roethlisberger",
        "line": "I heard that."
    },
    {
        "character": "Butters",
        "line": "I mean it's like, what is it? What does it mean? Why would there be a bush right there? Is it a live bush? Are there berries?"
    },
    {
        "character": "Therapist",
        "line": "Mr. Duchovny, please stop jerking off!"
    },
    {
        "character": "David Duchovny",
        "line": "[stops] Aw, gee whiz!"
    },
    {
        "character": "",
        "line": "CDC labs, day."
    },
    {
        "character": "Expert 4",
        "line": "To better understand the sex addiction outbreak, we've been running tests on chimpanzees. [an enclosure full of chimps is shown] You can see that this entire community of specimens are getting along normally, some pairing off, others on their own, but now see this chimp here. [a chimp is shown sitting peacefully scratching himself here and there] An average adult normal male blending in seamlessly with the others. Now watch. We're going to give it a lot of money. [presses a button and speaks into a mic] Go ahead. [two researchers walk into the enclosure and dump lots of dollar bills on the peaceful chimp and walk out. The chimp looks at the money and starts getting excited. He stands up and grins widely, then walks around with dollars bills in his hands. He walks up to a chimp with a baby chimp in her hands and bangs her from behind. She lets the baby go. The male chimp moves on to the next female and bangs her face to face, then he moves to the third female and bangs her from behind. ]"
    },
    {
        "character": "Chairman",
        "line": "My God..."
    },
    {
        "character": "Expert 4",
        "line": "Yes... [the chimp goes on to bang two other females and an angry chimp is heard in the background. She comes out in curlers, robe, and slippers, and wields a rolling pin. She approaches the male chimp and beats him up with the rolling pin, then walks away as he writhes on the ground. The other chimps hoot and holler, and one of them throws feces at him] The subject is now isolated and shunned."
    },
    {
        "character": "Chairman",
        "line": "Incredible. And, and what's it doing now?"
    },
    {
        "character": "Expert 4",
        "line": "Making a public apology on its talk show. [and so it is]"
    },
    {
        "character": "",
        "line": "Karne Institute for Sexual Addiction, day."
    },
    {
        "character": "Therapist",
        "line": "Alrighty. Now, we all know the destructive behaviors that got us into this predicament, don't we? What is the main thing we've all learned to avoid? [Tiger raises his hand] Yes, Tiger?"
    },
    {
        "character": "Tiger Woods",
        "line": "Avoid drugs? And alcohol?"
    },
    {
        "character": "The other men",
        "line": "Auugh!"
    },
    {
        "character": "Therapist",
        "line": "No, no, Tiger, you still aren't getting it. [Kyle has a memo pad and pen, Butters is trimming a small bonsai tree] In order to make sure we are no longer destroying our lives with any of these behaviors, we must avoid... anyone? Avoid getting... anyone?"
    },
    {
        "character": "Michael Douglas",
        "line": "Caught."
    },
    {
        "character": "Therapist",
        "line": "Yes, Michael Douglas! Everyone!"
    },
    {
        "character": "The Men",
        "line": "Getting caught."
    },
    {
        "character": "Therapist",
        "line": "Very good! You are all here in therapy [draws a big circle around the destructive behaviors and writes \"CAUGHT\" over them] because you got caught! So how do we avoid getting caught? Ben Rothlisberger?"
    },
    {
        "character": "Ben Rothlisberger",
        "line": "Don't screw girls in the public bathrooms?"
    },
    {
        "character": "David Letterman",
        "line": "When they uh ask you for money, pay them."
    },
    {
        "character": "Therapist",
        "line": "Good, yes!"
    },
    {
        "character": "Kyle",
        "line": "Whoa, hang on! We shouldn't be learning how not to get caught. We have to take responsibility for our actions. [Butters stops trimming the tree, the men all look at Kyle]"
    },
    {
        "character": "Bill Clinton",
        "line": "[breaks the silence] What the fuck are you talkin' about?"
    },
    {
        "character": "Kyle",
        "line": "Well, ah I mean, we have to accept that we have a problem, and put the blame completely on ourselves. I mean, maybe this isn't really even a disease. [the therapist turns around and walks away from the group, then places a call]"
    },
    {
        "character": "Therapist",
        "line": "Yeah, it's me. We've got a turd in the punch bowl. I repeat, we have a turd in the punch bowl."
    },
    {
        "character": "",
        "line": "The White House, Oval Office, day. The chairman of the CDC and a researcher are talking to President Obama"
    },
    {
        "character": "Chairman",
        "line": "Mr. President, in every test the results were the same. The monkeys who were given cash always acted out their sexual addiction to dangerous levels. It appears that money has a direct effect on the virus's ability to develop."
    },
    {
        "character": "Obama",
        "line": "So we must keep our nation's youth away from money and success."
    },
    {
        "character": "Chairman",
        "line": "No good, Mr. President. Because we've learned that sex addicts will find ways to make money and become successful in order to feed their addiction."
    },
    {
        "character": "Obama",
        "line": "You mean boys will start working towards being rich and successful just so they can one day have sex with lots of women??"
    },
    {
        "character": "Chairman",
        "line": "Yes. That's why we decided to look at the cash itself for clues! We tried to find something in the hundred dollar bill that could explain why this is happening now. Then we looked at the backside, and found this. [points to the picture of Independence Hall on the back of the bill] Independence Hall."
    },
    {
        "character": "Obama",
        "line": "The birthplace of our country."
    },
    {
        "character": "Chairman",
        "line": "We believe something is happening in Independence Hall that gives money its power over men."
    },
    {
        "character": "Obama",
        "line": "Independence Hall... Independence Day... Aliens... Gentlemen, I might know what's causing the sex addiction outbreak. This is highly classified, but... in 1947 a flying saucer was discovered in Roswell, New Mexico. Two deceased alien bodies were recovered and hidden from public knowledge. They carried... a virus with them. A virus that only barely stopped from spreading all over the country."
    },
    {
        "character": "Chairman",
        "line": "And you think that these aliens... could be back with a new virus? One originating from Independence Hall causing rich successful men to have sex with lots of women?!"
    },
    {
        "character": "Obama",
        "line": "[seriously] It's the only explanation that makes any sense. [glances at Michelle, who doesn't react, then looks at the chairman again]"
    },
    {
        "character": "",
        "line": "Tiger Woods' press conference. \"I WAS UNFAITHFUL, HAD AFFAIRS, AND I CHEATED.\""
    },
    {
        "character": "Tiger",
        "line": "I want to say that I am deeply sorry for my irresponsible and selfish behavior. I know that I have severely disappointed all of you. Some have speculated that my wife somehow hurt or attacked me on Thanksgiving Night. It angers me that people would fabricate a story like that. She has shown nothing but grace and poise-"
    },
    {
        "character": "Elin",
        "line": "[off-stage] You motherfucker!"
    },
    {
        "character": "Tiger",
        "line": "Oh no!"
    },
    {
        "character": "Elin",
        "line": "I should have never married [jumps out from behind the curtain and whacks him with a golf club] youuu! [continues whacking him]"
    },
    {
        "character": "Tiger",
        "line": "Agh! Stop it!"
    },
    {
        "character": "Elin",
        "line": "A porn star?! You screwed a porn star?! [the camera pulls back to reveal the video game the boys were playing earlier]"
    },
    {
        "character": "Cartman",
        "line": "Dude, you found another girl's phone number on my cell phone??"
    },
    {
        "character": "Stan",
        "line": "Yeah, back in that water level. [looks over at the front door, then back at the game] Is Kyle still at sex-addiction therapy? That must be really intense."
    },
    {
        "character": "",
        "line": "A military helicopter in the night sky. Kyle and Butters are with the other addicts"
    },
    {
        "character": "Kyle",
        "line": "Okay so, what exactly are we doing now?"
    },
    {
        "character": "Therapist",
        "line": "[sighs heavily] We are on our way to help take of your diseases once and for all!"
    },
    {
        "character": "Butters",
        "line": "Oh good, 'cause I really can't take it anymore."
    },
    {
        "character": "Therapist",
        "line": "Don't worry, as soon as it's dead everything will make sense."
    },
    {
        "character": "Kyle",
        "line": "...As soon as what's dead? [the men groan]"
    },
    {
        "character": "Therapist",
        "line": "The infected alien that they just discovered is hiding out at Independence Hall!"
    },
    {
        "character": "",
        "line": "Independence Hall, night. Police, SWAT, and firefighters swarm the grounds and police barricades are put up. The front doors blow off their hinges and the SWAT team moves in."
    },
    {
        "character": "SWAT Officer 1",
        "line": "Entrance is clear, Mr. President. [Obama leads the chairman and other CDD officials into the front room of the building]"
    },
    {
        "character": "Chairman",
        "line": "Mr. President, you aren't safe here. Let us handle this."
    },
    {
        "character": "SWAT Officer 2",
        "line": "Right side clear!"
    },
    {
        "character": "Expert 4",
        "line": "We must be careful. The alien could have cast some kind of spell of invisibility."
    },
    {
        "character": "Obama",
        "line": "[softly] Which would mean that the alien is also a wizard."
    },
    {
        "character": "Expert 10",
        "line": "Yes! It explains everything! A wizard alien would be able to cast a spell on our species, causing all the men to become sex addicts."
    },
    {
        "character": "Obama",
        "line": "Enough! We need to find the wizard alien and break his spell."
    },
    {
        "character": "SWAT Officer 2",
        "line": "[chuckles] Okay okay alright alright, hang, hang on guys. I mean, come on, this is getting a little ridiculous. Wizard aliens? We all know what's going on here, don't we? Whenever a story breaks about some rich famous guy going around and having sex with tons of girls, we all wanna act like we don't understand it, but we do. We're guys, you know? Our brains are wired to strive to be the alpha male and get all the women we can. [walks into an open area in the room] I mean, look where we are. Even, even Benjamin Franklin screwed everything that moved. Because he could. We don't have to condone what these rich, famous people do, but... we can at least admit that, given the same temptations and opportunities that somebody like Tiger Woods has, a lot of us guys might do somethin' similar. [Obama thinks this over...]"
    },
    {
        "character": "Obama",
        "line": "[speaks into a mic strapped to his wrist] We have a turd in the punch bowl."
    },
    {
        "character": "Secret Service Agent",
        "line": "Turd in the punch bowl. [the other SWAT members close in on him]"
    },
    {
        "character": "SWAT Officer 2",
        "line": "Hey, what are you doin- No. No, come on. [and take him away] Where are you takin' me?"
    },
    {
        "character": "",
        "line": "News 4 news break. A reporter and camera are outside Independence Hall"
    },
    {
        "character": "News 4 Reporter",
        "line": "Ten city blocks have been shut down because an alien is believed to have taken refuge here in Independence Hall. By all accounts, the alien is also a wizard, who could very easily be the cause of the outbreak of sex addiction in our country. [everyone in the Hall is moving around cautiously, with flashlights on.]"
    },
    {
        "character": "SWAT Officer 3",
        "line": "[voice only] Mr. President, here they are. [all flashlights point towards the source of the voice. The SWAT officers make way for the therapist, Kyle, and Butters]"
    },
    {
        "character": "Therapist",
        "line": "This is the boy I told you about. And his friend, Bummers."
    },
    {
        "character": "Chairman",
        "line": "Son, we were told that you think sex addiction can be controlled. That it just takes restraint. Is that true?"
    },
    {
        "character": "Kyle",
        "line": "I just think I'd rather... control it instead of blame it on anything."
    },
    {
        "character": "Chairman",
        "line": "A-mazing. Then the wizard alien spell might not have any power over him! He could draw the bastard out!"
    },
    {
        "character": "Obama",
        "line": "Quick, give that boy a gun! [a SWAT officer gives him a rifle]"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "SWAT Officer 3",
        "line": "You'd better take one too. [gives Butters a rifle]"
    },
    {
        "character": "Obama",
        "line": "Alright, everyone to the stairwell. The bastard's gotta be upstairs. [moves towards the stairs as well]"
    },
    {
        "character": "Kyle",
        "line": "What bastard?"
    },
    {
        "character": "Obama",
        "line": "[looks back at Kyle] The alien wizard hiding out here! Come on, we've got tuh- [a muffled voice is heard]"
    },
    {
        "character": "Chairman",
        "line": "[on the stairs] The hell was that?"
    },
    {
        "character": "SWAT Officer 4",
        "line": "I got a baaad feelin' about this. [behind Kyle and Butters, a door opens and the kidnapped SWAT officer stumbles out with his hands tied in front of him and holding a wand, wearing a huge green mascot head of an alien with ogre ears, a white beard, and a wizard's hat.]"
    },
    {
        "character": "Dr. Tonton",
        "line": "Oh my God there it is!"
    },
    {
        "character": "Chairman",
        "line": "It's the alien wizard! It's gonna get you boys! Shoot it! [a strobe light flickers on and off, blinding the bound SWAT officer, who stumbles around trying to free himself]"
    },
    {
        "character": "Obama",
        "line": "Shoot it boys!"
    },
    {
        "character": "Expert 6",
        "line": "You have to shoot it! [Kyle fires a shot]"
    },
    {
        "character": "Chairman",
        "line": "Shoot it again, it's still alive! [Butters fires a shot]"
    },
    {
        "character": "SWAT Officer 5",
        "line": "You gotta reload! [the boys reload slowly]"
    },
    {
        "character": "Expert 4",
        "line": "Keep firing, boys! Shoot it in the heart! [Kyle fires a shot]"
    },
    {
        "character": "Obama",
        "line": "Keep shooting it!"
    },
    {
        "character": "Expert 11",
        "line": "Shoot him in his blabber mouth! [Kyle fires again, then Butters fires a shot, and the SWAT officer falls to the floor dead. The strobe light keeps flashing just in case]"
    },
    {
        "character": "Chairman",
        "line": "My God, they've done it!"
    },
    {
        "character": "",
        "line": "Outside Independence Hall. The sex addicts dance around and moan gleefully"
    },
    {
        "character": "Bill Clinton",
        "line": "Look! The sex addiction! It's leavin' my body!"
    },
    {
        "character": "David Letterman",
        "line": "I can feel it! I'm free!"
    },
    {
        "character": "Another addict",
        "line": "We are healed!"
    },
    {
        "character": "",
        "line": "The White House, day. President Obama addresses the nation from the South Lawn. \"Sexual Healing\" plays in the background"
    },
    {
        "character": "Obama",
        "line": "We watched... as sex addiction ran rampant through our country. It devastated families. But once again, our great country has risen up as one. The wizard alien... is dead. Sex addiction is no more. And if a rich celebrity is caught again trying to screw lots of women, we will know it isn't because men are just like that, it's because a wizard alien has cast his mighty spell. [the crowd on the lawn jumps up and cheers]"
    },
    {
        "character": "Randy",
        "line": "[watching this on TV in the bedroom] Oh I'm so glad it's over, Sharon. Aren't you? [Sharon isn't paying any attention, preferring to read a book]"
    },
    {
        "character": "News 4 Reporter",
        "line": "We are now with the young boys who helped stop the alien. Boys, how does it feel to be free of your illness?"
    },
    {
        "character": "Kyle",
        "line": "[unsure] I guess it... feels great. Thanks. [Butters looks pissed off]"
    },
    {
        "character": "Butters",
        "line": "Yeah, it feels great! I never wanna see bush again! [swats the reporter's hand away and walks towards the camera] I finally paid a lady to show me hers. You wanna know what's under that bush? Nothin' but a pair of sick Joker lips."
    },
    {
        "character": "",
        "line": "Tiger Woods' press conference. \"I AM RETURNING TO GOLF IN 3 WEEKS.\""
    },
    {
        "character": "Tiger",
        "line": "I am so happy that I am cured, and no longer have any desire to have sex with anyone but my beautiful wife. Now I can be faithful. And my wife won't feel any need to get revenge by sleeping with a bunch of guys. [she glances at him, he glances at her, she glances back at him] So I officially announce my return to golf."
    },
    {
        "character": "",
        "line": "EA Sports Tiger Woods PGA Tour '11. Tiger tees off and the audience claps approvingly. The ball reaches 350 yards. Nothing more exciting happens"
    },
    {
        "character": "Cartman",
        "line": "What the hell?! This game's all boring now!"
    },
    {
        "character": "Stan",
        "line": "Yeah, where's all the fighting?"
    },
    {
        "character": "Cartman",
        "line": "Dude, screw this! [gets off the sofa and throws his controller to the floor, then walks away] Who wants to hit a dumb little ball around?!"
    },
    {
        "character": "Stan",
        "line": "Yeah, golf is stupid again. [gets off the sofa and tosses his controller onto the sofa, then follows Cartman out]"
    }
]