[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "A soccer field, day. The four boys are at soccer practice with other boys from around the neighborhood. They're exercising, touching their bellies, then their feet, then raising their hands in the air."
    },
    {
        "character": "Group",
        "line": "Twenty-one, twenty-two, twenty-three, twenty-four, twenty-five, twenty-six, twenty-seven, twenty-eight, twenty-nine, thirty, thirty-one, thirty-two, thirty-three, thirty-four, thirty-five, thirty-six, thirty-seven, thirty-eight, thirty-nine, forty."
    },
    {
        "character": "Cartman",
        "line": "[after \"27\"] Oh I wish I could exercise with the rest of the team, coach, but I've got such a belly ache."
    },
    {
        "character": "Coach",
        "line": "You seem to have a stomach ache every time we do drills and exercises."
    },
    {
        "character": "Cartman",
        "line": "[faking] I know, it sucks. [the coach blows his whistle as the boys reach \"40\"]"
    },
    {
        "character": "Coach",
        "line": "Alright kids, practice is over for today."
    },
    {
        "character": "Cartman",
        "line": "[grins and throws his sports bottle away] KFC!! [races for his ride]"
    },
    {
        "character": "",
        "line": "Randy's car, after practice. Randy drives the boys across town"
    },
    {
        "character": "Cartman",
        "line": "Oh boy oh boy! I'm gonna get a three piece meal and crispy strips!"
    },
    {
        "character": "Kyle",
        "line": "Cartman, you only come to soccer practice on Fridays, and that's only because we have Kentucky Fried Chicken afterwards!"
    },
    {
        "character": "Cartman",
        "line": "Shut up you shifty Jew! I'll fuckin' kill you! [remembers where he is] Uhm sorry, sorry. I just, you know, when I've been waiting too long for the Colonel's chicken I get easily agitated. You're a fuckin' asshole, Kenny! Oh oh oh, sorry sorry. Oh here we are! Here we are!"
    },
    {
        "character": "",
        "line": "Randy pulls up to a KFC and parks the station wagon. Everyone gets out"
    },
    {
        "character": "Stan",
        "line": "Hey, it looks different."
    },
    {
        "character": "",
        "line": "sure enough, the KFC logo and lettering are gone, but the building still has that KFC style of architecture. The windows advertise medicinal marijuana though. A customer comes out with a bag of weed."
    },
    {
        "character": "Randy",
        "line": "[to the customer] Hey, uh, what's up with the KFC?"
    },
    {
        "character": "Customer",
        "line": "[stops] Oh, it's not a KFC anymore. It's a medicinal marijuana dispensary. [walks away]"
    },
    {
        "character": "Stan",
        "line": "A what?"
    },
    {
        "character": "Cartman",
        "line": "Dude, what the fuck? What the fuck?!"
    },
    {
        "character": "Kyle",
        "line": "So where's the KFC now?"
    },
    {
        "character": "Randy",
        "line": "Alright, boys, wait out here. Let me see what's going on. [leaves them and enters the store.]"
    },
    {
        "character": "",
        "line": "Inside the medicinal marijuana dispensary. Randy walks toward the counter, looking around at the place"
    },
    {
        "character": "Clerk",
        "line": "Can I help you, sir?"
    },
    {
        "character": "Randy",
        "line": "Yeah, we were actually looking to get some KFC?"
    },
    {
        "character": "Clerk",
        "line": "Oh, yeah, sorry, that's gone. We only sell marijuana here."
    },
    {
        "character": "Randy",
        "line": "Really? I mean, you're openly selling pot? For reals?"
    },
    {
        "character": "Clerk",
        "line": "Sure. New state laws say it's okay."
    },
    {
        "character": "Randy",
        "line": "[thinks about what this means] Woohoo, all right! I love the future! Let's see, uh, I'll take half a pound of that uhhh Jamaican Passion [goes to another counter] and give me some of that purplish stuff too!"
    },
    {
        "character": "Clerk",
        "line": "Alright. I'll just need to see your physician's reference."
    },
    {
        "character": "Randy",
        "line": "[his smile vanishes] My huh?"
    },
    {
        "character": "Clerk",
        "line": "Well, sir, we just can't sell the marijuana to anybody. You need a reference from your doctor to show it's necessary."
    },
    {
        "character": "Randy",
        "line": "Ohhh, that's dumb. Okay. Okay, I'll be I'll be right back! [races out the door]"
    },
    {
        "character": "",
        "line": "outside the shop. Randy runs past the boys"
    },
    {
        "character": "Stan",
        "line": "What'd they say?"
    },
    {
        "character": "Randy",
        "line": "[speaking quickly] KFC's gone, been replaced."
    },
    {
        "character": "Cartman",
        "line": "They can't do that! This is the only KFC in all of South Park!"
    },
    {
        "character": "Randy",
        "line": "Yeah, well, I gotta get to the doctor. [runs to the car, opens the driver-side door, and quickly gets in]"
    },
    {
        "character": "Stan",
        "line": "The doctor? But, Dad, we wanna eat."
    },
    {
        "character": "Randy",
        "line": "I gotta get to the doctor! [pulls out of his parking slot and drives away in a hurry, leaving the boys by themselves]"
    },
    {
        "character": "Kyle",
        "line": "...So no KFC?"
    },
    {
        "character": "Cartman",
        "line": "This is a nightmare. This is a nightmare and I CAN'T WAKE UP!"
    },
    {
        "character": "",
        "line": "A doctor's office. Randy is on the bed there and the doctor walks to him with some test results"
    },
    {
        "character": "Dr. Doctor",
        "line": "Well, Mr. Marsh, it looks like you are in prefect health. Your bloodwork came back great and all your vitals appear normal."
    },
    {
        "character": "Randy",
        "line": "All right!"
    },
    {
        "character": "Dr. Doctor",
        "line": "Yep, you check out fine."
    },
    {
        "character": "Randy",
        "line": "That's great. So can I get a referral from you?"
    },
    {
        "character": "Dr. Doctor",
        "line": "For what?"
    },
    {
        "character": "Randy",
        "line": "Medicinal marijuana. [the doctor frowns] There's a shop that opened in the old KFC, and they said I needed a doctor's referral to buy weed."
    },
    {
        "character": "Dr. Doctor",
        "line": "Mr. Marsh, you don't qualify for medicinal marijuana."
    },
    {
        "character": "Randy",
        "line": "But you said I'm totally healthy!"
    },
    {
        "character": "Dr. Doctor",
        "line": "Medicinal marijuana is for people who aren't healthy. AIDS patients, cancer patients. You know, people going through chemo. The THC helps them eat and take the pain. You are in fine shape!"
    },
    {
        "character": "Randy",
        "line": "...Well that sucks! [gets off the bed and puts his clothes back on.] Well so doctor, how do most people get cancer?"
    },
    {
        "character": "Dr. Doctor",
        "line": "Well there's a lot of ways you can get cancer."
    },
    {
        "character": "Randy",
        "line": "Yeah, but what's the quickest way?"
    },
    {
        "character": "Dr. Doctor",
        "line": "The what?"
    },
    {
        "character": "Randy",
        "line": "Well like, what forms of cancer induce in time for the Ziggy Marley concert next Saturday in Denver?"
    },
    {
        "character": "",
        "line": "On Highway 291, night. Liane and Eric are driving northwest into the San Isabel National Forest west of Pueblo. Cartman is showing his frustration by punching the car door"
    },
    {
        "character": "Cartman",
        "line": "Mom, drive faster!"
    },
    {
        "character": "Liane",
        "line": "The KFC in Salida is a long way away, sweetie. Be patient."
    },
    {
        "character": "Cartman",
        "line": "Shut up and drive faster! I've been waiting for chicken for TOO LONG!"
    },
    {
        "character": "Liane",
        "line": "Eric, we're almost to Frisco. Why don't we go to the Church's Fried Chicken there?"
    },
    {
        "character": "Cartman",
        "line": "WHAT?? Church's Fried Chicken tastes like cat shit!"
    },
    {
        "character": "Liane",
        "line": "Alright honey, let's take it easy."
    },
    {
        "character": "Cartman",
        "line": "Fuck you!"
    },
    {
        "character": "",
        "line": "Frisco, day. Liane and Eric arrive at the KFC in Frisco, which is being closed up. \"CLOSED INDEFINITELY\" says the banner over the Colonel's face as workers take down the K and the C"
    },
    {
        "character": "Cartman",
        "line": "No! No, what's going on?! [quickly gets out of the car and shoves a worker aside] Move aside! [stops at the front door and looks up again]"
    },
    {
        "character": "Worker 1",
        "line": "It's closed, kid, there's nothin' in there."
    },
    {
        "character": "Cartman",
        "line": "No you, you can't do this! The KFC in my town is closed too!"
    },
    {
        "character": "Worker 1",
        "line": "Yeah, well, that's because of the vote last November to ban fast food in low-income areas."
    },
    {
        "character": "Cartman",
        "line": "You mean I have to drive all the way to Denver to get chicken?!"
    },
    {
        "character": "Worker 2",
        "line": "No you don't get it, kid. KFCs were only in low-income areas. In the entire state of Colorado, Kentucky Fried Chicken is illegal."
    },
    {
        "character": "Cartman",
        "line": "Nooooooooo-! [his head explodes]"
    },
    {
        "character": "",
        "line": "The Marsh house, day. Randy is on a chaise lounge in his backyard trying to give himself cancer with three possible carcinogens - cigarettes, an X-ray machine and reflective panels, and three cell phones strapped to his forehead. He's smoking."
    },
    {
        "character": "Stan",
        "line": "[opens the sliding door and looks out] Dad, Mom says to stop trying to give yourself cancer."
    },
    {
        "character": "Randy",
        "line": "Just gonna get a little bit of cancer, Stan. Tell Mom it's okay. [Stan walks away and closes the sliding door]"
    },
    {
        "character": "",
        "line": "A methadone clinic, day. Cartman walks in and approaches the counter"
    },
    {
        "character": "Nurse Fran",
        "line": "Can I help you?"
    },
    {
        "character": "Cartman",
        "line": "[looking fatigued and feeling quite itchy] I need... Somebody said you... could help me. I... have to... I haven't... had... KFC... in over... a week. [sniffs heavily]"
    },
    {
        "character": "Nurse Fran",
        "line": "Alright, sign your name on the release form and put down the time-"
    },
    {
        "character": "Cartman",
        "line": "[hops onto a little stool in front of the counter] Really?"
    },
    {
        "character": "Nurse Fran",
        "line": " -your birth year. and we'll get you through the next twenty-four hours. [hands him an application]"
    },
    {
        "character": "Cartman",
        "line": "Whoa, what uh, are you serious? [fills out the application as she gets a treatment out of a cabinet. He turns around...] Oh my God, that's KFC gravy! [quite giddy] You have KFC! Yes! [she opens the gravy and pours some into a small cup, then slides the cup to him. He's disappointed] This is it? One lousy little cup of gravy?!"
    },
    {
        "character": "Nurse Fran",
        "line": "This is a clinic to help you get over your addiction."
    },
    {
        "character": "Cartman",
        "line": "Who wants just gravy?! It goes on mashed potatoes! On extra-crispy chicken skins!"
    },
    {
        "character": "Nurse Fran",
        "line": "[takes the cup back] If you don't want it, that's fine-"
    },
    {
        "character": "Cartman",
        "line": "[grabs it from her hand] NO! [swallows it as fast as he can] Oh God, oh God it's so good."
    },
    {
        "character": "",
        "line": "The Marsh house, kitchen, day. Randy opens a box of instant chicken nuggets and pours the nuggets onto a plate."
    },
    {
        "character": "Randy",
        "line": "[reading from the book \"Cancer Today\"] \"Frozen and processed foods appear to have a direct link to many forms of stomach and colon cancers.\" Alright. [takes the plate and puts the nuggets into the microwave oven, sets the time to four minutes, then starts the oven] \"Tests show that preservatives found in these foods are the leading cause. However, luckily most of these cancers are...\" [he loses hope] \"slow-growing and can take years to develop.\" Dammit. [turns the page] \"Testicular cancer. Most common in older men and can be extremely aggressive.\" Oh this is good. \"There's no data on what causes testicular cancer to grow so rapidly, however the primary causes of testicular cancer are linked to exposure to high doses of radiation\" Hmmm. [closes the book and looks at the microwave and at his balls a few times. Some time later, Stan goes to the kitchen, opens the door, and grabs a sports energy drink, closes the door and walks away. He walks by Randy, who's got the microwave door open and his balls inside the oven.] Oh hey, Stan, could you grab me a beer? [Stan just looks at him and continues on his way.] Stan?"
    },
    {
        "character": "",
        "line": "The Marsh house, dawn. A rooster crows. Randy is still asleep in his bed, but something is beginning to bother him. He turns from his side to his back and then looks at his feet. What he sees amazes him. He pulls down the covers and sees that his balls have grown to the size of large pumpkins"
    },
    {
        "character": "Randy",
        "line": "Whoahhh! Sharon. Hey, hey Sharon!"
    },
    {
        "character": "Sharon",
        "line": "Wha... WHAAAAA?! [she almost lost her mind there]"
    },
    {
        "character": "",
        "line": "Dr. Doctor's office, day. Randy is now in a hospital bed and Sharon sits next to it."
    },
    {
        "character": "Dr. Doctor",
        "line": "Mr. Marsh, I'm afraid that the tests came back positive. You do have testicular cancer."
    },
    {
        "character": "Randy",
        "line": "SCORE! [Sharon is not happy]"
    },
    {
        "character": "Dr. Doctor",
        "line": "Now, the good new is it hasn't spread anywhere. We should... probably schedule to have them re-"
    },
    {
        "character": "Randy",
        "line": "Yeah, yeah, yeah, yeah, but for now can I finally get my prescription please?!"
    },
    {
        "character": "Dr. Doctor",
        "line": "Your prescription for what?"
    },
    {
        "character": "",
        "line": "South Park, day. Randy is carting his massive balls around in a wheelbarrow, singing happily"
    },
    {
        "character": "Randy",
        "line": "Buffalo Soldier... in the heart of America. Stolen from Africa, brought into America. He was fighting on arrival..."
    },
    {
        "character": "",
        "line": "The medicinal marijuana dispensary, day. Randy enters with his wheelbarrow"
    },
    {
        "character": "Randy",
        "line": "One ounce of Purple Lurple, two ounces of Fisherman's Friend, and a half ounce of Alabama Kush!"
    },
    {
        "character": "",
        "line": "At a lamp post in downtown. Officer Barbrady has stopped a speeding motorist and looks over at Randy, who's smoking some weed in plain view."
    },
    {
        "character": "Randy",
        "line": "Uh that is nice! That is nice!"
    },
    {
        "character": "Jimbo",
        "line": "[walks by, sees him, and runs over] Randy! Jesus, Randy. Your balls!"
    },
    {
        "character": "Randy",
        "line": "I know. Smokin' pot right in front of a cop. Pretty sweet, huh?"
    },
    {
        "character": "Jimbo",
        "line": "No, I mean, your actual balls!"
    },
    {
        "character": "Randy",
        "line": "Oh, yeah. Testicular cancer. Here, here, you want some? Oh wait, you're healthy! Hey bust his ass, officer! [laughs]"
    },
    {
        "character": "",
        "line": "Elsewhere in South Park. Cartman walks down the street sighing heavily"
    },
    {
        "character": "Tough Boy 1",
        "line": "Hey kid, they say you're looking for some KFC."
    },
    {
        "character": "Cartman",
        "line": "Yeah. Who isn't?"
    },
    {
        "character": "Tough Boy 1",
        "line": "Yeah well uh, we got some. Over at Billy Miller's house."
    },
    {
        "character": "Cartman",
        "line": "Billy Miller? Seriously??"
    },
    {
        "character": "",
        "line": "Billy Miller's house, basement. The boy follows Cartman down the stai"
    },
    {
        "character": "Billy",
        "line": "Ahhh Eric Cartman, right?"
    },
    {
        "character": "Cartman",
        "line": "Tommy said you have some KFC."
    },
    {
        "character": "Billy",
        "line": "Suuure. [snaps his fingers and waves someone forward] Jessie. [a girl brings a tray with food over to Cartman]"
    },
    {
        "character": "Cartman",
        "line": "Oh my God, the Colonel's popcorn chicken and honey-mustard sauce! [eats them as fast as he can] Oh God yes! [finishes it off] Where did you get that?!"
    },
    {
        "character": "Billy",
        "line": "I have my sources. That'll be $85."
    },
    {
        "character": "Cartman",
        "line": "85 bucks?? I don't have that! [three boys behind him get serious and approach him. One of them has a bat]"
    },
    {
        "character": "Billy",
        "line": "Hold on, hold on. [the boys stop] You're a big boy, Eric. Maybe you can pay me back another way. Do a little job for me. I've got some serious KFC coming in from a dealer. I need somebody willing to get a little risky and... pick it up."
    },
    {
        "character": "Cartman",
        "line": "How much KFC are we talking?"
    },
    {
        "character": "Billy",
        "line": "Two buckets plus a three-piece meal and four sides."
    },
    {
        "character": "Cartman",
        "line": "Holy fuck, dude."
    },
    {
        "character": "Billy",
        "line": "I've got the money to pay for it, but it's become a risky business out there. You get the chicken for me, and I'll make sure you're hooked up for life. Do you wanna do it?"
    },
    {
        "character": "Cartman",
        "line": "Do I wanna do it? Does the Pope help pedophiles get away with their crime?"
    },
    {
        "character": "Billy",
        "line": "Excellent."
    },
    {
        "character": "",
        "line": "Medicinal marijuana dispensary, day. Randy exits the dispensary with his balls in the wheelbarrow"
    },
    {
        "character": "Randy",
        "line": "[smokes, coughs a little] Alright, see you tomorrow! [turns left and has difficulty maneuvering his massive balls. He walks down the sidewalk happily and checks his watch] Oh God, I gotta hurry! Caprica starts in five minutes! [starts moving faster, but the wheelbarrow soon falls apart and he's left sitting on his balls.] Huh-oh Jesus! [looks around, unsure of what to do] Ugh, ohh. [tries to get his feet on the ground, but can't] Uhh, hey, can somebody..? [puffs on the joint, then pulls at his scrotum] ...Rrrr. Ugh, I gotta get home. [gets off his balls and starts pulling them down the street. He sits on them again and bounces on them] Hey, hey, hey, this can work. This could... Hey, it's like a hoppity hop. Aaahah. Whoa-ho. [bounces down the sidewalk]"
    },
    {
        "character": "",
        "line": "South Park, day. People stop and stare as Randy bounces down the street on his balls. He's laughing all the while."
    },
    {
        "character": "",
        "line": "Elsewhere in South Park, Cartman walks into an alley and looks around. Further in the alley he runs across a man"
    },
    {
        "character": "Cartman",
        "line": "Are you Teabag?"
    },
    {
        "character": "Teabag",
        "line": "Maybe I am. Who's askin'?"
    },
    {
        "character": "Cartman",
        "line": "Cut the crap. You got the stuff?"
    },
    {
        "character": "Teabag",
        "line": "Oh, I got the hookup. Question is, you got the money? [Cartman hands him a wad of bills] Alright, we're in biz. [turns right and grabs a couple of bags of KFC food, then hands them to Cartman, who looks inside each bag] It's all there, man."
    },
    {
        "character": "Cartman",
        "line": "Extra crispy? [opens a small bowl of gravy and samples it carefully]"
    },
    {
        "character": "Teabag",
        "line": "'Course, man, I ain't no fool."
    },
    {
        "character": "Cartman",
        "line": "You trying to fuck me dude? This is cut with Boston Market gravy!"
    },
    {
        "character": "Teabag",
        "line": "Awww, it's all the same shit, man."
    },
    {
        "character": "Cartman",
        "line": "IT'S NOT THE SAME SHIT! [reaches behind his back for a pistol and aims it at Teabag]"
    },
    {
        "character": "Teabag",
        "line": "Okay okay I'm sorry, oh... [gets on his knees and shields his face]"
    },
    {
        "character": "Cartman",
        "line": "You're cuttin' Colonel's gravy with Boston Market to try and save yourself some fuckin' money!"
    },
    {
        "character": "Teabag",
        "line": "I'll take back the gravy."
    },
    {
        "character": "Cartman",
        "line": "[lunges at him with the pistol, making him get on all fours] Like anybody wants KFC without gravy!"
    },
    {
        "character": "Teabag",
        "line": "AAAH please. Please, I'm sorry! Take your money back! Take the KFC too! [Barbrady walks by and stops to look]"
    },
    {
        "character": "Barbrady",
        "line": "What's going on back there?"
    },
    {
        "character": "Cartman",
        "line": "Nothin', it's cool."
    },
    {
        "character": "",
        "line": "A table, evening. Jimbo and Ned are shown playing poker"
    },
    {
        "character": "Jimbo",
        "line": "Alright, I'll call. Forty-five to you Ned."
    },
    {
        "character": "Randy",
        "line": "[puffs on a joint and coughs] Oh man. This Rainy Day Woman is the bomb. You guys don't know what you're missing."
    },
    {
        "character": "Peter Nelson",
        "line": "Well you know, you could share some of that with us, Randy."
    },
    {
        "character": "Randy",
        "line": "No, Peter Nelson, that's illegal! I can smoke this because I have cancer."
    },
    {
        "character": "Player 1",
        "line": "Aw some on, just give us a little bit."
    },
    {
        "character": "Player 2",
        "line": "Yeah."
    },
    {
        "character": "Randy",
        "line": "Get your own medicinal marijuana cards! You've all got perfectly good microwaves at home! Look, I'm telling you guys, it's awesome. I can have all the pot I want, I get around faster than walking, and, wherever I need a seat, I can just sit on my balls. And let me tell you something else. [a player listens a little more closely] Chicks... love 'em."
    },
    {
        "character": "Peter Nelson",
        "line": "Women love huge balls?"
    },
    {
        "character": "Randy",
        "line": "Loove 'em. Everywhere I go, when I walk by, chicks are like turning their heads and going \"whaaa?\" I never knew how much women love guys' balls until I got these puppies. [pats his balls]"
    },
    {
        "character": "Woman 1",
        "line": "Travis, did you take out the garba-whaaa? [backs up at the sight of Randy's balls, then runs off]"
    },
    {
        "character": "Randy",
        "line": "See?"
    },
    {
        "character": "",
        "line": "Billy Miller's house, later. Cartman walks down the stairs with the bags of KFC he got from Teabag."
    },
    {
        "character": "Billy",
        "line": "Cartman my boy, you got the stuff?"
    },
    {
        "character": "Cartman",
        "line": "Yeah I got the stuff. [the other boys carry the bags away] And I got the money. [tosses the wad of bills back at Billy]"
    },
    {
        "character": "Billy",
        "line": "Heyyy you're good Eric. I need people like you!"
    },
    {
        "character": "Cartman",
        "line": "Good, 'cause I ate a bunch of chicken on the way over here. [burps]"
    },
    {
        "character": "Billy",
        "line": "That's alright Eric. I've got something big in the works. What if I told you... that I now have a direct line to get all the KFC we want here? I'm sending Tommy to Kentucky, to try and set up a little \"arrangement\" with the Colonel himself."
    },
    {
        "character": "Cartman",
        "line": "Wait a minute. You mean THE Colonel?"
    },
    {
        "character": "Billy",
        "line": "That's right. And I'd like you to go as well and watch Tommy's back for me. Is that something you'd want to do?"
    },
    {
        "character": "Cartman",
        "line": "Is that something I'd want to do? Is the Pope Catholic? And making the world safe for pedophiles?"
    },
    {
        "character": "Billy",
        "line": "Excellent."
    },
    {
        "character": "",
        "line": "Dr. Doctor's office, day. A nurse walks in with an envelope"
    },
    {
        "character": "Nurse",
        "line": "Doctor, Mr. Klein's test results came in. [hands the envelope to the doctor, who opens it and pulls the results out]"
    },
    {
        "character": "Dr. Doctor",
        "line": "What the hell is going on?"
    },
    {
        "character": "Nurse",
        "line": "Doctor?"
    },
    {
        "character": "Dr. Doctor",
        "line": "This is the tenth case I've seen this week. It can't be a coincidence. Something in this town is giving men testicular cancer."
    },
    {
        "character": "",
        "line": "South Park, day. Silly music plays as a line of men bounce down the sidewalk on their swollen balls, smoking pot all the while. The line of men consists of the poker players from Travis' place."
    },
    {
        "character": "Jimbo",
        "line": "Heh! Man, I am stoned off my ass!"
    },
    {
        "character": "Player 3",
        "line": "I'm stoned off my balls! [another man laughs]"
    },
    {
        "character": "",
        "line": "Café Monet, day. The line of men hops past"
    },
    {
        "character": "Randy",
        "line": "Anybody got more of that loompa loompa weed?"
    },
    {
        "character": "Woman 2",
        "line": "Wow. Those guys have nice balls."
    },
    {
        "character": "Woman 3",
        "line": "Wish my man had balls like those."
    },
    {
        "character": "Woman 2",
        "line": "Mmm."
    },
    {
        "character": "",
        "line": "Corbin, Kentucky, the Colonel's home, day. The Colonel is giving a tour of the place to Tommy and Cartman"
    },
    {
        "character": "The Colonel",
        "line": "Our entire production is headquartered here, boys. We move over sixteen tons of chicken every month. Of course, with the new laws in Colorado my business has taken quite a hit. I'm worried other states might follow suit."
    },
    {
        "character": "Tommy",
        "line": "We know, Colonel, but we can get your chicken into the state. We just need a bulk deal, say, four ninety five a key?"
    },
    {
        "character": "Cartman",
        "line": "I've got to hand it to you, Colonel. You have everything a man could want."
    },
    {
        "character": "The Colonel",
        "line": "I like you, Eric. There's no lying in you. Unfortunately, I don't feel the same about your friend."
    },
    {
        "character": "Cartman",
        "line": "Who? You mean Tommy? [looks over at Tommy, then stops walking. The Colonel stops as well - Tommy is missing.] Wait, where'd he go?"
    },
    {
        "character": "The Colonel",
        "line": "Your partner is an informant for Jamie Oliver. [hands him some binoculars and shows him where Tommy is. Through the binoculars, Cartman sees Tommy being roughed up by two men inside a helicopter. One of the men shows Tommy where Cartman is. There's a noose around Tommy's neck. The guy who shows him where Cartman is throws him out of the helicopter and hangs him. Cartman is stunned, but quickly gets over it and laughs]"
    },
    {
        "character": "Cartman",
        "line": "Dude, that was sweet! He's all choked."
    },
    {
        "character": "The Colonel",
        "line": "And how do I know you're not a liar too?"
    },
    {
        "character": "Cartman",
        "line": "Hey, Colonel! I've been your biggest supporter since I was two years old! I love your chicken! I love you!"
    },
    {
        "character": "The Colonel",
        "line": "I think... you and me can work this thing out, Eric. Do business together a long time."
    },
    {
        "character": "Cartman",
        "line": "Good."
    },
    {
        "character": "The Colonel",
        "line": "Just remember, I only tell you one time. Don't fuck me, Eric. Don't you ever try to fuck me. [Cartman keeps his mouth shut]"
    },
    {
        "character": "",
        "line": "The Marsh house, day. Randy is by the sliding doors in back of the house, as his balls are too big for the front door now."
    },
    {
        "character": "Sharon",
        "line": "[walks up] Randy! Randy, will you look at yourself? Your balls are getting bigger."
    },
    {
        "character": "Randy",
        "line": "I know. They're pretty swollen. Kinda hurts. I'm gonna buy some more weed."
    },
    {
        "character": "Sharon",
        "line": "Randy, please. When you get back, do you think maybe we could make love again? [looks down at his balls]"
    },
    {
        "character": "Randy",
        "line": "Ohhh, someone's feeling frisky again. huh?"
    },
    {
        "character": "Sharon",
        "line": "Oh, it's just that I thought that more alone time would maybe be really-"
    },
    {
        "character": "Randy",
        "line": "Hey. My eyes are up here."
    },
    {
        "character": "Sharon",
        "line": "I'm sorry, I just..."
    },
    {
        "character": "Randy",
        "line": "It's alright, I just want you to look at me when we make love and not just at my balls. I'll be home soon, babe. [sends her an air kiss and hops out]"
    },
    {
        "character": "",
        "line": "Medicinal marijuana dispensary, day. The same silly music from before plays. Randy hops up to the front door and opens it. He tries to hop in, but the balls are way too big, causing the music to stop. He gets off his balls and tries to shove them in"
    },
    {
        "character": "Randy",
        "line": "Hey uh, could you uh, give me half a pound of that Suburban Sunrise, please?"
    },
    {
        "character": "Clerk",
        "line": "I'm sorry sir, but you have to be inside the store."
    },
    {
        "character": "Randy",
        "line": "Well eh, I'm right here, can you just... bring it over?"
    },
    {
        "character": "Clerk",
        "line": "Selling medicinal marijuana outside the confines of an approved shop is still illegal."
    },
    {
        "character": "",
        "line": "Randy tries to fit his balls through the door, grunting and murmuring from time to time, but they're just too damn big. He props them up so that he can shove them in with his ass, but they still won't go through"
    },
    {
        "character": "Randy",
        "line": "Look I'm startin' to feel kind of stupid; can I please get high?"
    },
    {
        "character": "",
        "line": "Billy Miller's cellar, day. As Billy's boys move the KFC around this basement warehouse, Billy is talking to Cartman"
    },
    {
        "character": "Billy",
        "line": "What, are you crazy Eric?! Making a deal with the Colonel for ten thousand more boxes?! I can't move that much chicken!"
    },
    {
        "character": "Cartman",
        "line": "[munching on a breast from a bucket] Will you relax, Billy? It's fine!"
    },
    {
        "character": "Billy",
        "line": "...Fine? I'm not making any money here! I'm losing it! I have to pay for more security, I got the cops up my ass, and I have to pay for all these orders to cut the chicken for distribution!"
    },
    {
        "character": "Cartman",
        "line": "[munching on a drumstick, his back to Billy] Billy, Billy, we've gotta be thinking bigger here! It's time to expand!"
    },
    {
        "character": "Billy",
        "line": "How can I expand when thirty-six percent of our product is going to you?! Get out there and sell the chicken or get lost! You've forgotten who the boss of this operation is, Eric!"
    },
    {
        "character": "Cartman",
        "line": "...Yeah welll, you're not gonna be around a lot longer."
    },
    {
        "character": "Billy",
        "line": "What is that supposed to mean?"
    },
    {
        "character": "Cartman",
        "line": "I... [turns around to face Billy] told your mom you got an F on that social studies test."
    },
    {
        "character": "Billy",
        "line": "[suddenly vulnerable] You wouldn't do that."
    },
    {
        "character": "Cartman",
        "line": "Does a bear crap in the woods? And does the Pope crap on the broken lives and dreams of two hundred deaf boys?"
    },
    {
        "character": "Billy's Mom",
        "line": "Billy?! Your father and I want to talk to you!"
    },
    {
        "character": "Cartman",
        "line": "Bye bye Billy. [Billy leaves] Alright everyone listen up! I'm in charge now! Anybody got a problem with that? Alright, good."
    },
    {
        "character": "",
        "line": "Medicinal marijuana dispensary, day. The poker players are bouncing around the dispensary's parking lot in protest. The clerk, the mayor and her aides, and a small crowd are watching these men"
    },
    {
        "character": "Randy",
        "line": "What do we want?"
    },
    {
        "character": "Men",
        "line": "Bigger doors!"
    },
    {
        "character": "Randy",
        "line": "Where do we want them?"
    },
    {
        "character": "Men",
        "line": "Weed stores!"
    },
    {
        "character": "Randy",
        "line": "What do we want?"
    },
    {
        "character": "Men",
        "line": "Bigger doors!"
    },
    {
        "character": "Randy",
        "line": "Where do we want them?"
    },
    {
        "character": "Men",
        "line": "Weed stores!"
    },
    {
        "character": "Clerk",
        "line": "Look, I'm sorry, but the bill says I can't modify any existing structure."
    },
    {
        "character": "Man 1",
        "line": "Well I guess we could change the law to allow for medicinal marijuana to be sold just outside the door of the shop."
    },
    {
        "character": "Man 2",
        "line": "Egah I don't know, maybe the rule should be somebody can buy the medicinal weed for others."
    },
    {
        "character": "Clerk",
        "line": "Look, can't we skip all this and just make pot legal? Everyone is just abusing this medicinal system anyway, it's ridiculous."
    },
    {
        "character": "Man 3",
        "line": "What's ridiculous about it?"
    },
    {
        "character": "Dr. Doctor",
        "line": "[runs through the crowd] Hold on, hold people people, please! [stops] We are all forgetting what is really at issue here! Look around! These men all have cancer! It's no coincidence that when this building changed, the rise in cancer went up. Don't you see? The KFC was keeping people healthy!"
    },
    {
        "character": "",
        "line": "Billy's basement, day. Cartman has squandered everything Billy has worked for by eating all the chicken."
    },
    {
        "character": "Tough Boy 2",
        "line": "Mr. Cartman, come on. We're supposed to be handling the business; you're eating too much of the stuff."
    },
    {
        "character": "Cartman",
        "line": "Shut up Kevin! I'm the boss, not you, buttlicker!"
    },
    {
        "character": "Tough Boy 3",
        "line": "Eric, the Colonel is on the phone for you. He sounds pissed."
    },
    {
        "character": "Cartman",
        "line": "What?! Oh, that's right, I forgot to- Dammit! Uh, okay. [leaves the throne] Put him on speaker."
    },
    {
        "character": "The Colonel",
        "line": "Hello. Hello??"
    },
    {
        "character": "Cartman",
        "line": "Colonel, how are you doing?"
    },
    {
        "character": "The Colonel",
        "line": "What happened?"
    },
    {
        "character": "Cartman",
        "line": "[rips the skin off a breast and lays it on the table] Oh, we had some problems, you know? Colonel? [takes out a credit card and starts mincing the skin as if it were crack cocaine, into lines of finely ground skin]"
    },
    {
        "character": "The Colonel",
        "line": "Eric, what happened??"
    },
    {
        "character": "Cartman",
        "line": "We had a little problem."
    },
    {
        "character": "The Colonel",
        "line": "I heard."
    },
    {
        "character": "Cartman",
        "line": "[snorts a line into his nose] Yeah? How'd, how'd you hear that?"
    },
    {
        "character": "The Colonel",
        "line": "Because Jamie Oliver gave his speech at the UN today. He was not supposed to give that speech, Eric!"
    },
    {
        "character": "Cartman",
        "line": "Hey that's okay, we'll get him next time."
    },
    {
        "character": "The Colonel",
        "line": "There's not going to be a next time you fucking dumb cocksucker!"
    },
    {
        "character": "Cartman",
        "line": "Hey, take it easy Colonel."
    },
    {
        "character": "The Colonel",
        "line": "I told you a long time ago, you fucking little monkey, not to fuck me!"
    },
    {
        "character": "Cartman",
        "line": "[grabs the phone] Hey! Hey who the fuck do you think you're talking to, huh?! Huh?! [hears someone breaking in and looks over his shoulder] Oh crap! [five men pour into the basement and start firing their machine guns at the boys, who scatter and try to escape. Two more men jump into the basement. More men outside the house begin firing their weapons. The police arrive and begin firing at the attackers]"
    },
    {
        "character": "Barbrady",
        "line": "Freeze!"
    },
    {
        "character": "Henchman",
        "line": "It's the cops! [Barbrady kills him. Another attacker is killed nearby. Cartman looks outside from the basement and begins his escape. Billy and his mom begin their escape as well, but through the front door]"
    },
    {
        "character": "Billy's Mom",
        "line": "Run Billy, run! [a bullet kills her. Cartman leaves the basement and escapes]"
    },
    {
        "character": "Billy",
        "line": "Mommy, no!"
    },
    {
        "character": "",
        "line": "South Park City Hall, day. The top city officials are there, including the Mayor and her aides, Sgt. Yates and Murphy, and Dr. Doctor. Officer Barbrady addresses the crowd"
    },
    {
        "character": "Barbrady",
        "line": "Last November, this town passed a bill that seemed silly to some. Since then we've had underground black markets, crime, death, and shootings. But now the bill has been repealed, and I am relieved to announce that once again, marijuana is illegal. [the crowd cheers, and Dr. Doctor takes the mic]"
    },
    {
        "character": "Dr. Doctor",
        "line": "And another bill has been repealed as well. Because ever since we got rid of KFC, we've seen a great rise in cancer. But today we welcome back KFC, and all the medical benefits it gives us. [the store has been renamed MFC - Medicinal Fried Chicken]"
    },
    {
        "character": "Randy",
        "line": "Well I got to admit, it's a lot easier to get in doors with my little prosthetic balls. [Sharon folds her arms and looks up and away angrily]"
    },
    {
        "character": "Sharon",
        "line": "Yeah. Great."
    },
    {
        "character": "Randy",
        "line": "Aw, Sharon, don't be upset. The doctor made you a souvenir. [reaches into a bag and pulls out a flesh-colored winter coat. Sharon looks at it and grins instantly]"
    },
    {
        "character": "Sharon",
        "line": "Randy, I love it! [puts it on and strikes a few poses]"
    },
    {
        "character": "Randy",
        "line": "And when it gets cold it shrinks. [two women approach them]"
    },
    {
        "character": "Nelly's Mom",
        "line": "Sharon, you got a scrotum coat?"
    },
    {
        "character": "Sharon",
        "line": "Yyyup!"
    },
    {
        "character": "Woman 5",
        "line": "Luckyyyyy!"
    }
]