[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "At fudge factory for a field trip, A tour guide shows Mr. Garrison's class around the factory"
    },
    {
        "character": "Tour Guide",
        "line": "Our factory works 24/7 to produce candy, and we have over 500 employees. Here you can see where the cocoa is mixed with the sugar and milk."
    },
    {
        "character": "Cartman",
        "line": "Wow, coo'... [snaps a picture] Chocolate rules!"
    },
    {
        "character": "Kyle",
        "line": "You should know, fatass."
    },
    {
        "character": "Cartman",
        "line": "AY! I'm not fat, you sneaky Jew!"
    },
    {
        "character": "Stan",
        "line": "Oh God, you guys, really? This again? [the students all move to the next spot in the tour]"
    },
    {
        "character": "Tour Guide",
        "line": "And here is where all the fudge is put into boxes to be shipped all over the world."
    },
    {
        "character": "Kyle",
        "line": "Kinda like Cartman's dad shipped out on him."
    },
    {
        "character": "Cartman",
        "line": "I have a dad, butthole. My mom is my dad."
    },
    {
        "character": "Stan",
        "line": "You guys, stop! All you're doing is rehashing a bunch of old stuff! [everyone moves on except Butters, who spots something]"
    },
    {
        "character": "Butters",
        "line": "Hey, Stan, isn't that Tom Cruise?"
    },
    {
        "character": "Stan",
        "line": "Huh? [Tom Cruise is packing fudge into boxes with a hat pulled low over his face] Oh, wow it is! Hey, guys, check it out. Tom Cruise is a fudge packer!"
    },
    {
        "character": "Tom Cruise",
        "line": "What did you call me?"
    },
    {
        "character": "Cartman",
        "line": "Hey, that is Tom Cruise! [snaps a picture]"
    },
    {
        "character": "Butters",
        "line": "How come you're packin' fudge, Mr. Cruise?"
    },
    {
        "character": "Tom Cruise",
        "line": "I'm not a fudge packer!"
    },
    {
        "character": "Kyle",
        "line": "Dude, you don't have to be ashamed or anything."
    },
    {
        "character": "Tom Cruise",
        "line": "But I'm not a fudge packer! [packs a block of fudge into a box]"
    },
    {
        "character": "Stan",
        "line": "Then why are you packing fudge?"
    },
    {
        "character": "Tom Cruise",
        "line": "I'm not. I am a very busy actor who is trying to get away for a week and do some fly fishing! [pushes more fudge into boxes]"
    },
    {
        "character": "Stan",
        "line": "Dude, you are in a fudge factory packing fudge."
    },
    {
        "character": "Tom Cruise",
        "line": "Oh, that does it. I will SUE you!"
    },
    {
        "character": "Stan",
        "line": "For what?"
    },
    {
        "character": "Tom Cruise",
        "line": "You can't just call somebody a fudge packer and get away with it! [Mr. Garrison walks over]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Hey, is that fudge packer Tom Cruise?"
    },
    {
        "character": "Tom Cruise",
        "line": "That's it! [throws his hat away] I'm suing this entire intolerant town!"
    },
    {
        "character": "Stan",
        "line": "But, dude-"
    },
    {
        "character": "Tom Cruise",
        "line": "No buts! If you want to accuse somebody of being a fudgepacker, you're gonna pay the consequences!"
    },
    {
        "character": "",
        "line": "At Tom Cruise's mountain lodge, a big crowd of celebrities has gathered."
    },
    {
        "character": "Tom Cruise",
        "line": "Guys, I want to really thank you all for coming. Shockingly, I've just been slandered once again in the town of South Park, something I know you can all relate to. [all celebrities nod and agree]"
    },
    {
        "character": "Tiger Woods",
        "line": "That town just seems to be a hotbed of hatred and lies!"
    },
    {
        "character": "Bono",
        "line": "I'm fed up with it. That town suggested that I was made of shit!"
    },
    {
        "character": "Tom Cruise",
        "line": "Yeah, well, I was just over there doing a little fly fishing and this little boy walks up and calls me a fudge packer! [The celebrities all are shocked and appealed] I know, right? And then other kids in the town and their teacher start joining in. [Sally Struthers is taking up the whole couch, except for the small place of an annoyed Mickey Mouse.]"
    },
    {
        "character": "Sally Struthers",
        "line": "South Park, Colorado, is the most racist, insensitive, and bigoted place in this country! [George Lucas holding onto a ball-gagged Indiana Jones]"
    },
    {
        "character": "George Lucas",
        "line": "That town thinks they can say whatever they want about people and get away with it!"
    },
    {
        "character": "Paris Hilton",
        "line": "If anyone has a gripe against that shithole, it's me! [coughs up some semen, then rubs it on John Travolta's crotch]"
    },
    {
        "character": "Tom Cruise",
        "line": "Yeah, well, I say enough. All of us together can put a stop to that slander coming from that town once and for all! No longer will they make snide remarks about whoever they want."
    },
    {
        "character": "All Celebrities",
        "line": "YEAH!"
    },
    {
        "character": "Jared Fogle",
        "line": "Hey, Tom, I ate too much Subway. Where's your bathroom?"
    },
    {
        "character": "Tom Cruise",
        "line": "Oh, just the door down the hall there, Jared. [Jared opens the door to find a closet] No, no, no, that's a closet. Go down more. [Jared opens another door, which is also a closet.] No, that's a closet too. [Jared opens a door, and once again it is a closet] Nope, Jared, that's a closet too. [Jared opens another door, it is another closet] No. [Jared opens two more doors, both closets] That's a closet... No that- that's a closet too."
    },
    {
        "character": "",
        "line": "At South Park Elementary, Mr. Garrison's class."
    },
    {
        "character": "Principal Victoria",
        "line": "[over the PA system] Stan Marsh to the principal's office. Stan Marsh, come to the principal's office immediately!"
    },
    {
        "character": "Kyle",
        "line": "Dude, what did you do?"
    },
    {
        "character": "Stan",
        "line": "I have no idea..."
    },
    {
        "character": "",
        "line": "Walks into Victoria's office to discover his parents, the mayor, the counselor, Kyle's parents, and the police"
    },
    {
        "character": "Randy",
        "line": "You just had to push it, didn't you, Stan? You just had to make fun of Tom Cruise again!"
    },
    {
        "character": "Principal Victoria",
        "line": "Did you call him a fudge packer?"
    },
    {
        "character": "Stan",
        "line": "Aww... he was packing fudge!"
    },
    {
        "character": "Mayor",
        "line": "Little boy, you don't understand how serious this is. Tom Cruise has put together a class-action lawsuit, along with 200 other celebrities!"
    },
    {
        "character": "Mr. Mackey",
        "line": "They are going to sue the bejezzus out of this entire town, m'kay!"
    },
    {
        "character": "Stan",
        "line": "It wasn't just me. Other kids called him a fudge packer, even Mr. Gar-"
    },
    {
        "character": "Principal Victoria",
        "line": "But you started it. Mr. Broflovski, tell him what you told us."
    },
    {
        "character": "Gerald",
        "line": "Stan, a class-action lawsuit means the end of this town. We can't possibly go up against their lawyers!"
    },
    {
        "character": "Sgt. Yates",
        "line": "Dammit, Marsh, why couldn't you have just kept your stupid ugly kid in line?!"
    },
    {
        "character": "Randy",
        "line": "Hey, don't start blaming me for his looks!"
    },
    {
        "character": "",
        "line": "Back at the fudge factory, Tom Cruise is busy packing fudge as Stan and Randy stand behind him. Stan has taken off his hat and looks at the floor guiltily."
    },
    {
        "character": "Randy",
        "line": "Mr. Cruise, my son is so, so sorry, and he would do anything to take back his hurtful comments."
    },
    {
        "character": "Tom Cruise",
        "line": "That's nice! [punches the button to take away fudge he just packed] I'm still suing you all! Nobody calls me a fudge packer! [pushes fudge into a box]"
    },
    {
        "character": "Randy",
        "line": "Yes, it was a terrible mistake. But maybe you could see how, since you do... take fudge and... pack it into a box... [Tom Cruise turns around]"
    },
    {
        "character": "Tom Cruise",
        "line": "WHAT?"
    },
    {
        "character": "Randy",
        "line": "We-, I-I'm just saying that you are employed currently as a person who... packages..."
    },
    {
        "character": "Tom Cruise",
        "line": "I am an actor. I do not pack fudge! [turns around and throws a piece of fudge into a box angrily]"
    },
    {
        "character": "Randy",
        "line": "Right, my son just got confused. Because you have a little uniform, and a... hat that says \"Fred's Fudge and Candies\"... and you are... Look it doesn't matter. Just please withdraw the class-action lawsuit. Nobody in our town will ever call you a fudge packer ever again. [Tom Cruise sighs and backs away from his fudge packing station]"
    },
    {
        "character": "Tom Cruise",
        "line": "Well, there is... one thing that your town could do to... maybe make me forget about this lawsuit."
    },
    {
        "character": "Randy",
        "line": "ANYTHING! Anything you want, Mr. Cruise."
    },
    {
        "character": "Tom Cruise",
        "line": "It's just that there's somebody that I have always wanted to meet... face to face. If you could get him to show up in your town-"
    },
    {
        "character": "Randy",
        "line": "Sure! Who is it? We can get anybody for you."
    },
    {
        "character": "Tom Cruise",
        "line": "Muhammad. The prophet of the Muslim faith."
    },
    {
        "character": "Stan",
        "line": "Ooooooo..."
    },
    {
        "character": "Randy",
        "line": "That's... tricky..."
    },
    {
        "character": "Tom Cruise",
        "line": "Well, then you can just get sued! [Returns to packing fudge]"
    },
    {
        "character": "Randy",
        "line": "Mr. Cruise, if there is anybody else we could bring to town, we-"
    },
    {
        "character": "Tom Cruise",
        "line": "No! Just him. You get Muhammad to appear or your little town is DONE!"
    },
    {
        "character": "",
        "line": "South Park Town Meeting Hall. Angry chatter is heard while Randy is speaking to the audience, with Principal Victoria, Mr. Mackey, Mayor and her aides sitting on chairs beside him."
    },
    {
        "character": "Randy",
        "line": "Okay, people, I know, I know. But he will get the other celebrities to withdraw their lawsuit if we just... get Muhammad to appear in South Park."
    },
    {
        "character": "Mr. Garrison",
        "line": "Are you nuts? If Muhammad appears in South Park, we get bombed! [audience shouts in agreement]"
    },
    {
        "character": "Stephen",
        "line": "Now we don't know that. Maybe enough time has passed that it is now OKAY to show Muhammad."
    },
    {
        "character": "Kyle",
        "line": "[to Tolkien] Dude, I can't believe we are dealing with this Muhammad thing again."
    },
    {
        "character": "Mr. Mackey",
        "line": "But even if it were safe for Muhammad to be shown, how would we ever find him?"
    },
    {
        "character": "Sgt. Yates",
        "line": "Yeah, showing an image of him is completely off limits and censored, so nobody has seen what Muhammad looks like. [shows the whole audience. Stan in the middle raises his hand]"
    },
    {
        "character": "Stan",
        "line": "I saw him once. [everyone turns towards Stan]"
    },
    {
        "character": "McDaniels",
        "line": "[steps forward] You did?"
    },
    {
        "character": "Stan",
        "line": "Yeah, one time, my friends joined David Blaine's cult, and I had to go to the Super Best Friends to rescue them, and Muhammad was one of the Super Best Friends."
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh, and what- he was just out in the open where everybody could see him and nobody got bombed?"
    },
    {
        "character": "Stan",
        "line": "No, dude, it was totally fine."
    },
    {
        "character": "Sgt. Yates",
        "line": "Muhammad showed up and there was no violence at all?"
    },
    {
        "character": "Stan",
        "line": "Well, a giant John Wilkes Booth shot Abraham Lincoln..."
    },
    {
        "character": "Randy",
        "line": "Alright, Stan, that's enough. Jesus, can't learn to shut up, can you? Now look, I believe we CAN find Muhammad. I have done a lot of research and I have completed a sketch of what Muhammad might look like today. [holds up a file and begins to open it]"
    },
    {
        "character": "Mr. Garrison",
        "line": "No, don't! [Randy holds it up to reveal a poorly drawn stick figure] Is that okay to show?"
    },
    {
        "character": "Jimbo",
        "line": "I don't know. I guess we'll see."
    },
    {
        "character": "",
        "line": "Tom Cruise's Lodge"
    },
    {
        "character": "Hillary Clinton",
        "line": "Tom, what is up with this Muhammad thing? It doesn't make sense!"
    },
    {
        "character": "Jesse Jackson",
        "line": "Yeah, you said we were just suing South Park."
    },
    {
        "character": "Tom Cruise",
        "line": "No, I said we were going to use South Park to make sure we never got ripped on again. Look, people, all of us get ridiculed, but who is the one person on this earth who is completely free from slander?"
    },
    {
        "character": "Oprah Winfrey",
        "line": "You want Muhammad because he can't be ridiculed?"
    },
    {
        "character": "Tom Cruise",
        "line": "Muhammad has a power that makes him impervious to being made fun of. What if we could harness that power? [moves over to Jimmy Buffet] Jimmy Buffet, how would you like it if nobody could ever call your music drunken frat boy monkey garbage?"
    },
    {
        "character": "Jimmy Buffett",
        "line": "I... I'd love it!"
    },
    {
        "character": "Tom Cruise",
        "line": "By taking what Muhammad has, we could all be safe from ridicule. [walks to the bar next to Tim Burton] Like Tim Burton here. Imagine it Tim; nobody could rip on you for all the rehashed movies you've made lately. There'd never be a TV show that pointed out that you have never had an original idea since Beetlejuice. And, you put Johnny Depp and all the same crappy music in every film. And if you're that in love with Johnny Depp, then you should just have sex with him already. A TV show could never say that!"
    },
    {
        "character": "Tim Burton",
        "line": "Gee, that'd be swell."
    },
    {
        "character": "Tom Cruise",
        "line": "Well it can be a reality. Once we have Muhammad, we can take that power from him. [Cartman walks in]"
    },
    {
        "character": "Cartman",
        "line": "Excuse me... [the celebrities turn around] This is the home of Tom Cruise, right?"
    },
    {
        "character": "Tom Cruise",
        "line": "Hey! It's one of the boys from South Park who slandered me!"
    },
    {
        "character": "Cartman",
        "line": "I didn't come for myself. I just came as an escort for another celebrity who wants in on your lawsuit..."
    },
    {
        "character": "Michael Richards",
        "line": "Who? [Cartman lifts up his hand and takes off his glove, revealing fake hair and painted on lips. It is Jennifer Lopez.]"
    },
    {
        "character": "Jennifer Lopez",
        "line": "Alllloooo... [celebrities gasp]"
    },
    {
        "character": "Tom Cruise",
        "line": "Jennifer Lopez! [celebrities crowd around saying hellos to Jennifer]"
    },
    {
        "character": "Jennifer Lopez",
        "line": "Yes, I am Hennifer Lopez, and I like tacos and burritos."
    },
    {
        "character": "",
        "line": "Turns into the opening theme for the Super Best Friends Show. As religious figures pop onto the screen, the one to the left of the middle is blocked with a giant bar reading CENSORED"
    },
    {
        "character": "Narrator",
        "line": "In the great hall of the Super Best Friends, there are assembled the leaders of the world's greatest religions; Jesus! [Jesus smiles and hammers a wood board] Buddha! [Buddha pries apart the screen] Krishna! [Krishna snaps his fingers and becomes a beaver] Muhammad! [Muhammad is walking down a street, but he has been replaced with a giant bar reading CENSORED] Lao Tzu and Joseph Smith [Walking down a corridor like the opening of Scooby Doo] and... the mighty Semen! [The word \"Seaman\" appears on the screen, but he says semen]"
    },
    {
        "character": "Seaman",
        "line": "It's not semen, it's Seaman!"
    },
    {
        "character": "Narrator",
        "line": "[covering up a laugh] Their mission; right that which is wrong, and to serve all mankind."
    },
    {
        "character": "",
        "line": "Stan and Kyle are sitting at a table, surrounded by the Super Best Friends except for Muhammad."
    },
    {
        "character": "Stan",
        "line": "Jesus, all we are asking you to do is bring Muhammad to our town for like an hour."
    },
    {
        "character": "Jesus",
        "line": "My son, much has changed since you were last here. Muhammad cannot make public appearances."
    },
    {
        "character": "Buddha",
        "line": "We simply cannot risk any violence from the Muslim people"
    },
    {
        "character": "Stan",
        "line": "Awww, not you guys too... Jesus fucking Christ!"
    },
    {
        "character": "Narrator",
        "line": "Back in the hall of the Super Best Friends..."
    },
    {
        "character": "Kyle",
        "line": "Okay, will you let Muhammad come to South Park if we dress him like a pirate?"
    },
    {
        "character": "Joseph Smith",
        "line": "No, Muslims would still be angry if you showed his face."
    },
    {
        "character": "Kyle",
        "line": "K... what if we cover his face with a paper bag?"
    },
    {
        "character": "Lao Tzu",
        "line": "No, 'cause you would still be showing him walking around, that could be a-trouble."
    },
    {
        "character": "Stan",
        "line": "Okay. A suit of armor? We just have Muhammad in a suit of armor so you can't see anything."
    },
    {
        "character": "Jesus",
        "line": "But it's still Muhammad walking around in human form."
    },
    {
        "character": "Kyle",
        "line": "Aww, come on! This is ridiculous! [pounds hands on table]"
    },
    {
        "character": "Joseph Smith",
        "line": "Boys, you need to understand that people get very offended when Muhammad is mocked because he is a religious figure. [snorting noise, Buddha is snorting cocaine]"
    },
    {
        "character": "Jesus",
        "line": "Buddha, don't do coke in front of kids! [Kyle and Stan stare open mouthed for a second]"
    },
    {
        "character": "Kyle",
        "line": "A U-Haul. What if we bring Muhammad to South Park in the back of a U-Haul, and he just stays in there out of sight?"
    },
    {
        "character": "Joseph Smith",
        "line": "But he's talking from the U-Haul?"
    },
    {
        "character": "Stan",
        "line": "Well yeah, he's got to talk or nobody knows he's in there!"
    },
    {
        "character": "Jesus",
        "line": "Hearing his voice, I don't know. What do you think Moses? [Moses is floating over in the previously unseen corner]"
    },
    {
        "character": "Moses",
        "line": "Um... would there be windows on the U-Haul?"
    },
    {
        "character": "Kyle",
        "line": "There doesn't have to be..."
    },
    {
        "character": "Moses",
        "line": "Um... I guess... I guess that would be okay."
    },
    {
        "character": "",
        "line": "Tom Cruises Lodge, celebrities file into a large room which has a machine on the wall"
    },
    {
        "character": "Tom Cruise",
        "line": "Here it is friends. Once we have Muhammad, this machine will give us the power to not be made fun of."
    },
    {
        "character": "Russel Crowe",
        "line": "Tom, Tom, you're talkin' crazy, mate. Only Muhammad has that ability, how could we ever get it from him? [Rob Reiner walks in with a huge sandwich and handkerchief]"
    },
    {
        "character": "Rob Reiner",
        "line": "We take his goo! It's as simple as that friends. [takes a bite and wipes forehead, then walks over near Tom Cruise]"
    },
    {
        "character": "Tom Cruise",
        "line": "Rob Reiner has been telling me about the goo that is inside every person on earth."
    },
    {
        "character": "Rob Reiner",
        "line": "Any goo can be harvested from a person's body, and easily placed into another. [wipes forehead, holds up his hand, but speaks to himself]"
    },
    {
        "character": "Cartman",
        "line": "Wait, wait, wait, you mean we aren't going to sue and get a bunch of money?"
    },
    {
        "character": "Tom Cruise",
        "line": "No Jen, we all have got enough money."
    },
    {
        "character": "Jennifer Lopez",
        "line": "Yes, who needs more money, we need to get Muhammad's goo! Yes, yes, ariva ariva!"
    },
    {
        "character": "Cartman",
        "line": "Uh, excuse us for a second... [walks away]"
    },
    {
        "character": "",
        "line": "Cartman enters an empty room and closes the door"
    },
    {
        "character": "Cartman",
        "line": "Alright, just what the hell do you think you are doing?"
    },
    {
        "character": "Jennifer Lopez",
        "line": "What am I doing? Just having some fun, cholo!"
    },
    {
        "character": "Cartman",
        "line": "Cut the crap, I thought we were here for lawsuit money!"
    },
    {
        "character": "Jennifer Lopez",
        "line": "Just keep your mouth shut, and do what I tell you!"
    },
    {
        "character": "Cartman",
        "line": "If we are staying here, then I want to know what is going on. Don't forget, I know who you really are... [looks at his hand, then removes his hand's hairpiece] Mitch Conner."
    },
    {
        "character": "Mitch Conner",
        "line": "If you know what's good for you, you'll keep your mouth shut, kid."
    },
    {
        "character": "Cartman",
        "line": "You're a no-good swindler and a 2-bit thief. We were here for money, not goo!"
    },
    {
        "character": "Mitch Conner",
        "line": "Think about it. Muhammad is the only person in the world who can't get ripped on. Those celebrities want his goo."
    },
    {
        "character": "Cartman",
        "line": "Yeah, so what?"
    },
    {
        "character": "Mitch Conner",
        "line": "You know what the goo is worth on the open market? Hell, I got people in Hong Kong who'll give me 50 mil for that goo."
    },
    {
        "character": "Cartman",
        "line": "So we let them take it from Muhammad, then we take it for ourselves."
    },
    {
        "character": "Mitch Conner",
        "line": "You catch on quick kid... [knock at the door]"
    },
    {
        "character": "Tom Cruise",
        "line": "[from the other side of the door] Mrs. Lopez..."
    },
    {
        "character": "Mitch Conner",
        "line": "Hurry, get my wig back on! [Tom opens the door]"
    },
    {
        "character": "Tom Cruise",
        "line": "Hey, I was just seeing if you needed some- Oh, god [scratches the back of his head guiltily] you found my fudge packing uniform..."
    },
    {
        "character": "Jennifer Lopez",
        "line": "Oh, your secret is safe with me, Tommy!"
    },
    {
        "character": "",
        "line": "Outside South Park Town Hall, several townspeople are standing around"
    },
    {
        "character": "Randy",
        "line": "Boys, we are so sorry for doubting you. You really did bring us Muhammad."
    },
    {
        "character": "Mayor",
        "line": "Thank you so much for coming, Muhammad. [steps forward toward Muhammad, who is in a giant U-Haul]"
    },
    {
        "character": "Muhammad",
        "line": "[in a small voice] Welcome."
    },
    {
        "character": "Mr Garrison",
        "line": "Oh, is that okay?"
    },
    {
        "character": "Jimbo",
        "line": "I don't know."
    },
    {
        "character": "Randy",
        "line": "Alright, now we just need to figure out how to get Muhammad from the back of the truck into Tom Cruise's limo."
    },
    {
        "character": "Stan",
        "line": "What? No, Dad, we promised the Super Best Friends that Muhammad would stay in the truck."
    },
    {
        "character": "Gerald",
        "line": "Cruise's lawyers were very specific boys. He's sending a limo for Muhammad to meet him outside of town."
    },
    {
        "character": "Kyle",
        "line": "But Muhammad can't be seen, Dad."
    },
    {
        "character": "Sgt. Yates",
        "line": "Alright, we'll put a sheet over him."
    },
    {
        "character": "Stan",
        "line": "No, you can't even show his feet."
    },
    {
        "character": "Sheila",
        "line": "How about a Halloween costume with one of those plastic masks?"
    },
    {
        "character": "Mr. Garrison",
        "line": "No, you could still see his eyes..."
    },
    {
        "character": "Randy",
        "line": "Okay. How 'bout like... like a big mascot outfit? One that covered him completely, head to toe, without even showing his eyes? [Mayor walks over to U-Haul and shouts inside]"
    },
    {
        "character": "Mayor",
        "line": "Muhammad, would that be okay?"
    },
    {
        "character": "Muhammad",
        "line": "[still small voice] Okay."
    },
    {
        "character": "",
        "line": "Tom Cruise's Lodge"
    },
    {
        "character": "Hillary Clinton",
        "line": "Tom, Rob, we've just received word from the lawyers. South Park is saying they have Muhammad for us! [celebrities gasp]"
    },
    {
        "character": "Tom Cruise",
        "line": "Rob, will the machine be ready?"
    },
    {
        "character": "Rob Reiner",
        "line": "Oh, it'll be ready! [hits buttons on the machine's control panel]"
    },
    {
        "character": "Jennifer Lopez",
        "line": "[out of view] More tacos!"
    },
    {
        "character": "Jennifer Lopez",
        "line": "[in-view, the celebrities all turn around to look] More tacos!"
    },
    {
        "character": "Cartman",
        "line": "No! No more tacos Mrs. Lopez."
    },
    {
        "character": "Jennifer Lopez",
        "line": "More tacos."
    },
    {
        "character": "Cartman",
        "line": "You just had seven tacos."
    },
    {
        "character": "Jennifer Lopez",
        "line": "I want more tacos! [Cartman gives a nervous laugh]"
    },
    {
        "character": "Cartman",
        "line": "I'm sorry [whisper] Why are you doing this?"
    },
    {
        "character": "Jennifer Lopez",
        "line": "I am Jennifer Lopez, I need tacos to live!"
    },
    {
        "character": "Cartman",
        "line": "[whispering] You know goddamn well you are not Jennifer Lopez, so stop pissing me off! [Charlie Sheen steps forward]"
    },
    {
        "character": "Charlie Sheen",
        "line": "Mrs. Lopez, I can go. What do you want, like three tacos?"
    },
    {
        "character": "Jennifer Lopez",
        "line": "Oh, thank you 'harlie Sheeeeen. And maybe an enchirito too?"
    },
    {
        "character": "Cartman",
        "line": "Aw- Jee-. They don't even make enchiritos anymore!"
    },
    {
        "character": "Jennifer Lopez",
        "line": "Yes they do!"
    },
    {
        "character": "Cartman",
        "line": "I tried getting one last week!"
    },
    {
        "character": "Jennifer Lopez",
        "line": "Not all Taco Bells have enchiritos, but some still carry them."
    },
    {
        "character": "Cartman",
        "line": "God, will somebody shut her up?"
    },
    {
        "character": "",
        "line": "South Park Town Square, several people still standing around when a limo pulls up"
    },
    {
        "character": "Randy",
        "line": "[facing away from view] Alright, the limo's here. Muhammad, thanks again for doing this. [A giant bear costume has been thrown over Muhammad]"
    },
    {
        "character": "Mayor",
        "line": "You've done this town a huge favor, Muhammad. [walks towards the limo]"
    },
    {
        "character": "Mr. Garrison",
        "line": "[from a distance away] Hold on a second! [runs over to the mayor]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Stop! There's some extremists, threatening that if we give Muhammad to the celebrities, they're gonna bomb us!"
    },
    {
        "character": "Mayor",
        "line": "What?!"
    },
    {
        "character": "Randy",
        "line": "Aw. Aw, it's just a stupid threat! Come on, we don't wanna piss off Tom Cruise again. [starts walking to the limo]"
    },
    {
        "character": "",
        "line": "Jared Fogle and Phil Collins sit in the limo"
    },
    {
        "character": "Jared Fogle",
        "line": "[On a walkie-talkie] Alright, we got him, Tom. [Everyone outside walks toward the limo, when it suddenly explodes]"
    },
    {
        "character": "Stan",
        "line": "Muhammad, are you okay? [Runs toward Muhammad and helps him up]"
    },
    {
        "character": "Randy",
        "line": "What the hell was that?!"
    },
    {
        "character": "Sgt. Yates",
        "line": "Obviously, the terrorists are for real! [notices a paper Garrison is holding] What does that paper say? [reads the paper aloud] We have placed bombs all over your city. You will give Muhammad to us. The celebrities want Muhammad for his power not to be ridiculed. We want that power... huzzah."
    },
    {
        "character": "Stan",
        "line": "They want his power?"
    },
    {
        "character": "Kyle",
        "line": "What kind of extremists are these? [Yates looks over the note]"
    },
    {
        "character": "Sgt. Yates",
        "line": "You won't believe it..."
    },
    {
        "character": "",
        "line": "The Hilton hotel's party room, which is full of red headed people, or gingers."
    },
    {
        "character": "Lead Ginger",
        "line": "Our time is near! Soon, gingers will never be made fun of again!"
    },
    {
        "character": "All Gingers",
        "line": "[in unison] Huzzah!"
    },
    {
        "character": "",
        "line": "Cartman walking down a street, keeping his hand away from himself. He has taken off Mitch Conner's fake hairpiece."
    },
    {
        "character": "Mitch Conner",
        "line": "Where the hell do you think you're going?"
    },
    {
        "character": "Cartman",
        "line": "I'm through with your stupid plans, Conner! I've got better things to do with my time. [Mitch goes in front of Cartman]"
    },
    {
        "character": "Mitch Conner",
        "line": "You gonna walk away from 50 mil? [Cartman stops]"
    },
    {
        "character": "Cartman",
        "line": "Let me by..."
    },
    {
        "character": "Mitch Conner",
        "line": "You walk away now, and you will regret it the rest of your life."
    },
    {
        "character": "Cartman",
        "line": "Screw this Conner. [pushes his hand away and moves on] Find yourself another partner."
    },
    {
        "character": "Mitch Conner",
        "line": "Then I guess I won't tell you about your father. [Cartman stops]"
    },
    {
        "character": "Cartman",
        "line": "My father..."
    },
    {
        "character": "Mitch Conner",
        "line": "Thought that might get your attention. You know nothing about your dad, right?"
    },
    {
        "character": "Cartman",
        "line": "I know enough, my mother is a hermaphrodite, so she is actually my father."
    },
    {
        "character": "Mitch Conner",
        "line": "You really still believe that garbage? The people in your town sold you that line. Come on, you've had to have doubted it all along. [Cartman turns around to face Conner]"
    },
    {
        "character": "Cartman",
        "line": "How could you know anything about who my family is?"
    },
    {
        "character": "Mitch Conner",
        "line": "Heh. I know all about the swindles and schemes in this dead-end town. You got lied to, kid. By the people who were closest to you. I can prove it too, but I'm going to want something in return."
    },
    {
        "character": "Cartman",
        "line": "If you're making this up to keep me around Conner, the you'd better-"
    },
    {
        "character": "Mitch",
        "line": "You just take me where I tell you, and when you learn the truth, you will learn to trust me. And nobody else..."
    },
    {
        "character": "",
        "line": "Chaos, people running around the street screaming"
    },
    {
        "character": "Barbrady",
        "line": "Okay, people, let's try to evacuate in an orderly fashion. Geez."
    },
    {
        "character": "",
        "line": "Mayors Office, McDaniels is pacing while the police stand around her"
    },
    {
        "character": "Sgt. Yates",
        "line": "Mayor, we do not have the resources to deal with this situation! A full evacuation is impossible!"
    },
    {
        "character": "Mayor",
        "line": "Jesus, what are we supposed to do?!"
    },
    {
        "character": "Jimbo",
        "line": "We have to give in to their demands."
    },
    {
        "character": "McDaniels",
        "line": "I'm sorry, Muhammad, but we are going to have to give you over the gingers."
    },
    {
        "character": "Kyle",
        "line": "We can't give him over to the gingers!"
    },
    {
        "character": "Stan",
        "line": "Yeah, we said we'd take care of him."
    },
    {
        "character": "Gerald",
        "line": "But our homes and our lives are at stake."
    },
    {
        "character": "Stan",
        "line": "We made a promise... to Jesus! [Randy steps forward]"
    },
    {
        "character": "Randy",
        "line": "Stan, Jesus doesn't matter when Muhammad is involved. [phone rings, everyone turns to look at it]"
    },
    {
        "character": "Jimbo",
        "line": "That'll be Tom Cruise... [Randy steps forward and slowly picks it up]"
    },
    {
        "character": "Randy",
        "line": "Helllo?"
    },
    {
        "character": "Tom Cruise",
        "line": "Yeah, so whats going on?"
    },
    {
        "character": "Randy",
        "line": "Uh... I'm afraid we can't... well, we can't give Muhammad to you."
    },
    {
        "character": "Tom Cruise",
        "line": "What do you mean, you're not givin' him to us?!"
    },
    {
        "character": "Randy",
        "line": "There are these ginger fundamentalists saying that if we don't give Muhammad to them, they are going to bomb us."
    },
    {
        "character": "Tom Cruise",
        "line": "Gingers?"
    },
    {
        "character": "Kanye West",
        "line": "Gingers? Aww, hell no."
    },
    {
        "character": "Randy",
        "line": "Please, understand that we have no choice here Mr. Cruise."
    },
    {
        "character": "Tom Cruise",
        "line": "You're going to give Muhammad to gingers instead of us, just because they are threatening you with violence?"
    },
    {
        "character": "Randy",
        "line": "Well, yeah."
    },
    {
        "character": "Tom Cruise",
        "line": "Oh, we can play that game too! You want to see violence, well you got it! [throws the phone at the ground and walks away]"
    },
    {
        "character": "Tom Cruise",
        "line": "[pacing around and fuming] Goddamn stupid assholes! You want to play rough?! OK! Spielburg, go and get some automatic rifles! We'll go in there, and we're going to take [around here, he jumps up and down on the couch, shouting his idea, with Oprah on the other cushion] Muhammad by force! And then we are going to show them th- [Rob Reiner rushes up]"
    },
    {
        "character": "Rob Reiner",
        "line": "Tom, Tom. We can't be seen getting violent."
    },
    {
        "character": "Hillary Clinton",
        "line": "Yeah, that would kill all our careers!"
    },
    {
        "character": "Tom Cruise",
        "line": "[still jumping up and down on the couch] But the only way we are going to get Muhammad from South Park now is by getting just as violent as the gingers!"
    },
    {
        "character": "Rob Reiner",
        "line": "Fine, then let's have Her do it."
    },
    {
        "character": "Tom Cruise",
        "line": "[stops jumping] Her who?"
    },
    {
        "character": "Rob Reiner",
        "line": "[whisper] You know... Her."
    },
    {
        "character": "Tom Cruise",
        "line": "Oh right... [Whispers] Her."
    },
    {
        "character": "",
        "line": "In the middle of nowhere, limos start pulling up and celebrities all walk up to a huge structure"
    },
    {
        "character": "Rob Reiner",
        "line": "There she is Tom... Barbra Streisand."
    },
    {
        "character": "",
        "line": "Zooms around Mecha-Streisand, showing her from every angle"
    },
    {
        "character": "Robert Redford",
        "line": "My God, she's even more terrifying than I remember."
    },
    {
        "character": "Steven Spielberg",
        "line": "Tom, Barbra Streisand hasn't been active for a long time. Are we sure we want to do this?"
    },
    {
        "character": "Tom Cruise",
        "line": "Mrs. Streisand got torn apart in the town of South Park. She's probably more angry at that town than any of us."
    },
    {
        "character": "Rob Reiner",
        "line": "Power her up! Release the Kraken! [Mel Gibson places the Diamond of Pantheos in the system, then flips a switch, starting up Mecha-Streisand]"
    },
    {
        "character": "",
        "line": "Mecha-Streisand opens up her eyes, the Diamond on her forehead lights up, and her claws and arm saw are flexed. The gates open and she steps out to meet the celebrities. The song Barbra, Barbra is played. She kneels down and lets out a screech."
    },
    {
        "character": "Japanese Singer",
        "line": "[Singing] Baabura, Baabura, ichi ban kirai na hito. (The number 1 hateful person.) Baabura, Baabura, hana ga ookii. (Her nose is big.)"
    },
    {
        "character": "Rob Reiner",
        "line": "[extremely casual voice] Hey Barbra. It's me, Rob Reiner. [Barbra kneels down and blows steam out of her nose, the celebrities shield their faces]"
    },
    {
        "character": "Rob Reiner",
        "line": "Listen, Babs, we are taking on the town of South Park and we really need your help"
    },
    {
        "character": "Tom Cruise",
        "line": "We figured you're pissed at South Park too, right Mrs. Streisand? [Barbra roars, turns around, and slashes the holding tower with her arm saw]"
    },
    {
        "character": "Tom Cruise",
        "line": "Oh, she's pissed all right."
    },
    {
        "character": "",
        "line": "Someone's house, there is a knock at the door. The door opens, and Eric is standing outside."
    },
    {
        "character": "Mr. Garrison",
        "line": "Eric, what are you doing here?"
    },
    {
        "character": "Cartman",
        "line": "Did you all lie to me? All of you, in that room, when you told me my mother was my father?"
    },
    {
        "character": "Mr. Garrison",
        "line": "What? N-No Eric, are you still worried about that old issue, I mean-"
    },
    {
        "character": "Cartman",
        "line": "I don't trust you. I want to talk to Mr. Hat."
    },
    {
        "character": "Mr. Garrison",
        "line": "Eric, I haven't used Mr. Hat in a long time, and-"
    },
    {
        "character": "Cartman",
        "line": "I said GET. Mr. Hat!"
    },
    {
        "character": "",
        "line": "Garrison's bedroom. He reaches into a drawer and pulls out Mr. Hat."
    },
    {
        "character": "Cartman",
        "line": "Put it on! [he puts it on] Do the voice."
    },
    {
        "character": "Mr. Hat",
        "line": "Hello kids, it's me, Mr. Hat. [Cartman pulls his hand from behind his back, revealing Mitch.]"
    },
    {
        "character": "Mitch Conner",
        "line": "Good to see you Hat. Helluva night, isn't it?"
    },
    {
        "character": "Mr. Hat",
        "line": "I... I don't believe I know you."
    },
    {
        "character": "Mitch Conner",
        "line": "The name's Mitch Conner, I flew the same division as you back in Saigon. [Mr. Garrison lowers Mr. Hat]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Eric, this is silly, why don't we just stop-"
    },
    {
        "character": "Cartman",
        "line": "Keep... your hand... UP!"
    },
    {
        "character": "",
        "line": "A street filled with lots of townspeople, Muhammad, and Stan"
    },
    {
        "character": "Randy",
        "line": "[shouting to the other side of the street] Alright gingers, we have Muhammad for you, now hand over the detonators. [huge group of gingers, all holding detonators]"
    },
    {
        "character": "Lead Ginger",
        "line": "Nuh uh, first you gotta prove that that is still Muhammad in there! Have him step out of the bear costume..."
    },
    {
        "character": "Townspeople",
        "line": "Ohhhhhhh..."
    },
    {
        "character": "Stan",
        "line": "Dude, we can't do that"
    },
    {
        "character": "Lead Ginger",
        "line": "Show us it's Muhammad or South Park is finished!"
    },
    {
        "character": "",
        "line": "Back to Mr. Garrison's bedroom"
    },
    {
        "character": "Mr. Hat",
        "line": "Dammit, Mitch, you're asking questions that shouldn't be answered!"
    },
    {
        "character": "Mitch Conner",
        "line": "So you admit it. There was a cover up. [Mr. Garrison turns away]"
    },
    {
        "character": "Mr. Garrison",
        "line": "No, Mr. Hat, don't say anymore!"
    },
    {
        "character": "Mitch",
        "line": "Yeah, tell 'im whatcha know!"
    },
    {
        "character": "Garrison",
        "line": "Alright, Eric, your father was in the room the day of your DNA test, but the results were... tampered with."
    },
    {
        "character": "Cartman",
        "line": "By who? Goddammit, Garrison, who is my father?"
    },
    {
        "character": "",
        "line": "Flash to townspeople on the street, then flash to gingers on the street then flash to Mecha-Streisand roaring"
    }
]