[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Saigon, 1972, day. U.S. Army helicopters fly overhead. A gunner fires into the fields below"
    },
    {
        "character": "Mitch Conner",
        "line": "Saigon. It's a hell of a place. I've seen a lot of death. [Vietnamese and American soldiers fire at each other] A lot of suffering. Darkness that most people couldn't stand to see. [Wounded American soldiers are carried back to the helicopters] I tried to sit it out as much as I could. [a left arm exactly like Cartman's is shown. It wears dog tags, a tiny helmet, and camouflage face paint]"
    },
    {
        "character": "Soldier 1",
        "line": "What's the matter, Conner? You don't like a little blood?"
    },
    {
        "character": "Mitch Conner",
        "line": "No, I don't like a little blood. Blood ain't the stuff for eighteen year old boys from Sheboygan. Blood ain't the stuff... for Mitch Conner."
    },
    {
        "character": "Soldier 2",
        "line": "Incoming! [An RPG flies into the helicopter and blows up. Cut to a MASH unit, where Mitch opens his eyes]"
    },
    {
        "character": "Army Doctor",
        "line": "Conner, Mitchell. You're discharged, son."
    },
    {
        "character": "Mitch Conner",
        "line": "And that's that. \"Pack your bags, you're headed home. Hugs and kisses from Uncle Sam.\" [cut to the present, where Mitch is now on Cartman's arm facing Mr. Garrison and Mr. Hat.] So how do I end up here, with a nine year old kid who just wants to know who his father is? Life is funny like that. One day you're sifting through the guts of some gook in Vietnam and the next you're playing Dr. Phil with some kid and his teacher."
    },
    {
        "character": "Mr. Garrison",
        "line": "Eric, I, [faces Cartman] I'm really sorry that you were put through all this."
    },
    {
        "character": "Mitch Conner",
        "line": "Sorry is a four letter word with a Y on the end. That doesn't mean anything to this poor kid."
    },
    {
        "character": "Cartman",
        "line": "That's right! Tell me the truth! Now!"
    },
    {
        "character": "Mr. Garrison",
        "line": "[turns away] All I can tell you, Eric, is that we were all told to stick to the story to protect someone very important. I can't say more, I won't. But I'll... I'll tell you who has the answer."
    },
    {
        "character": "",
        "line": "South Park. night. The townsfolk and the gingers face off."
    },
    {
        "character": "Randy",
        "line": "Look, gingers! You said you wanted Muhammad, we got him for you."
    },
    {
        "character": "Ginger 1",
        "line": "We have no way of knowing if Muhammad is really in there. It could be a trick."
    },
    {
        "character": "Stan",
        "line": "It's no trick, dude. My friend and I went to the Super Best Friends and brought him here!"
    },
    {
        "character": "Ginger 1",
        "line": "Then have him step out of the bear costume! You have until the count of ten! One!"
    },
    {
        "character": "Jimbo",
        "line": "Don't do it, Randy. If Muhammad is seen, we could get bombed."
    },
    {
        "character": "Ginger 1",
        "line": "Two!"
    },
    {
        "character": "Sgt. Yates",
        "line": "Idiot, if he isn't seen, we're about to definitely get bombed."
    },
    {
        "character": "Ginger 1",
        "line": "Three!"
    },
    {
        "character": "Randy",
        "line": "Alright, alright, stop! We'll do what you say. [turns to the bear] I'm sorry, Muhammad. Will you please step out of the bear costume? [the bear looks around, then unzips the costume. A familiar red suit and black belt appear. The arms flail a bit and the costume drops away. Santa has stepped out of the costume.]"
    },
    {
        "character": "Stan",
        "line": "Okay, so um, see? This is Muhammad."
    },
    {
        "character": "Ginger 2",
        "line": "That isn't Muhammad, that's Santy Claus."
    },
    {
        "character": "Santa",
        "line": "Sorry, boys. I tried."
    },
    {
        "character": "Kyle",
        "line": "Aw crap."
    },
    {
        "character": "Randy",
        "line": "Boys, you got Santa to be Muhammad? When?"
    },
    {
        "character": "Stan",
        "line": "When you all said you were gonna hand Muhammad over to Tom Cruise. We promised Jesus that Muhammad would stay safely in the U-Haul!"
    },
    {
        "character": "Mr. Hankey",
        "line": "[hops up to Kyle] I'm sorry, Kyle. I really thought my idea would work for you."
    },
    {
        "character": "Stan",
        "line": "If we were gonna have someone in a bear costume, why would we actually have it be Muhammad, you fucking idiot?!"
    },
    {
        "character": "Ginger 1",
        "line": "So where is he?! [heavy footfalls and a mechanical roar are heard, and everyone gets afraid.]"
    },
    {
        "character": "",
        "line": "Hall of Super Best Friends, night."
    },
    {
        "character": "Announcer",
        "line": "Meanwhile, at the Hall of the Super Best Friends..."
    },
    {
        "character": "",
        "line": "Inside. Buddha is snorting coke again."
    },
    {
        "character": "Jesus",
        "line": "Buddha, will you lay off that stuff already?! It's gettin' to be a problem."
    },
    {
        "character": "Buddha",
        "line": "Ohhh, and you're one to talk! With all your Internet porn!"
    },
    {
        "character": "Jesus",
        "line": "Watching porn isn't like doing coke, fag!"
    },
    {
        "character": "Joseph Smith",
        "line": "[runs into the meeting room] Jesus Christ!"
    },
    {
        "character": "Jesus",
        "line": "What?"
    },
    {
        "character": "Joseph Smith",
        "line": "We've got a distress signal coming in. [the Super Best Friends leave their seats and head for the towering screen at one end of the room]"
    },
    {
        "character": "Jesus",
        "line": "On the Super Best Screen!"
    },
    {
        "character": "Police Officer",
        "line": "Super Best Friends! You've got to help us! The Casa Bonita is under attack! [Casa Bonita is shown. Soldiers defend it by firing at Mecha-Streisand, but she just keeps walking towards it]"
    },
    {
        "character": "Jesus",
        "line": "Great Scott! It's Barbra Streisand! [Mecha-Streisand picks up a car and bites the front end off. The driver drops down from it, likely to his death]"
    },
    {
        "character": "Lao Tse",
        "line": "I thought Barbra Streisand had been destroyed by Robert Smith."
    },
    {
        "character": "Seaman",
        "line": "Yeah. Who would have activated her again?"
    },
    {
        "character": "Jesus",
        "line": "I don't know, Seaman. [the other Super Best Friends chuckle]"
    },
    {
        "character": "Seaman",
        "line": "[annoyed] It's Sea-Man! [the other Super Best Friends chuckle, but their attention is again drawn to the screen. ]"
    },
    {
        "character": "Police Officer",
        "line": "The Casa Bonita is gone! Jesus help us!"
    },
    {
        "character": "Jesus",
        "line": "Jesus... That's where the boys took Muhammad. We have to stop her! [he leads the others to Docking Bay Alpha] On the Super Best Friends power cycles! [moments later, amid a cloud of steam, a platform rises, and the Super Best Friends roll off it on modified Segways.]"
    },
    {
        "character": "",
        "line": "South Park Genetic Engineering - Dr. Mephesto's lab. Dr. Mephesto is inside working on an animal."
    },
    {
        "character": "Dr. Mephesto",
        "line": "There there, my little mouse friend. Soon you will have more asses than you ever dreamed of. [the top of his assistant's head is shown moving towards him] Ah, Kevin. You brought me my Fonseca. That's a good boy. [a pounding is heard at the door and both men turn around] What's this? Someone is at the door, Kevin. [the pounding is heard again] We tried to be left alone, Kevin. Who would disturb us at this hour? We must be careful. [looks through the peep hole] Why, it's an African-American man, Kevin. [to the person outside] Yes? What do you want?"
    },
    {
        "character": "Person",
        "line": "[Mitch Conner, in blackface, wearing a wig] Yo man, sorry to bother you, but there's been an accident down the street, man. Can I use your telephone?"
    },
    {
        "character": "Dr. Mephesto",
        "line": "Oh I'm... terribly sorry, but I don't let strangers in."
    },
    {
        "character": "Person",
        "line": "Yo, I understand, man, but this accident is real bad, dawg. My lady's leg is all busted up and shit; she all crawlin' around on the road lookin' like a crippled crab, man. I just need an ambulance, dog!"
    },
    {
        "character": "Dr. Mephesto",
        "line": "There's a gas station about half a mile down the road. They have a phone there."
    },
    {
        "character": "Person",
        "line": "Okay, I see. I guess I understand. You just don't wanna let a black man in yo' house."
    },
    {
        "character": "Dr. Mephesto",
        "line": "No, please, it isn't that at all."
    },
    {
        "character": "Person",
        "line": "No, I gets it man. Thought things had changed, dog. Thought when we got a black president, things would be different. We gots our black president, but Whitey still don't trust me to use his motherfuckin' phone."
    },
    {
        "character": "Dr. Mephesto",
        "line": "No wait, I'm sorry, you're right you're right, we do have a black president. Please, come in. [opens the door, which is built like that of a bank vault]"
    },
    {
        "character": "Cartman",
        "line": "[quickly gets in] Ahaaa!"
    },
    {
        "character": "Dr. Mephesto",
        "line": "WAAH!"
    },
    {
        "character": "Kevin",
        "line": "AAAH!"
    },
    {
        "character": "Cartman",
        "line": "Nice work, Conner."
    },
    {
        "character": "Mitch Conner",
        "line": "Yeah, the old \"Hasn't anything changed?\" speech. Works on white people all the time."
    },
    {
        "character": "Dr. Mephesto",
        "line": "Eric Cartman?"
    },
    {
        "character": "Cartman",
        "line": "Surprise to see me, asshole?! Close the door!"
    },
    {
        "character": "",
        "line": "South Park, night. Mecha-Streisand rounds a corner as the townsfolk run away from her"
    },
    {
        "character": "Santa",
        "line": "[in the crowd] Holy crap! [as the crowd disappears, one lone boy walks towards the robot...]"
    },
    {
        "character": "Pip",
        "line": "Cheeri-o! My name is Pip. I would like to see if you wouldn't mind not smashing our little town to bits. [the robot walks towards him and he turns and runs] Haaah! [Mecha-Streisand crushes him under her left foot]"
    },
    {
        "character": "",
        "line": "Tom Cruise's mansion, night."
    },
    {
        "character": "Announcer",
        "line": "Meanwhile, at the Legion of Doom, which is Tom Cruise's house."
    },
    {
        "character": "Tom Cruise",
        "line": "How do you like that?! Celebrities can get violent too!"
    },
    {
        "character": "Randy",
        "line": "[on the community center roof with other townsfolk] Mr. Cruise, please call Barbra Streisand off! [everyone cringes as Mecha-Streisand walks around] She's destroying everything!"
    },
    {
        "character": "Tom Cruise",
        "line": "We will call her off when you give us Muhammad!"
    },
    {
        "character": "Randy",
        "line": "We don't have Muhammad. We aren't sure where he is."
    },
    {
        "character": "Tom Cruise",
        "line": "That's your problem! Get him back or Babs will kill you all!"
    },
    {
        "character": "Mickey Mouse",
        "line": "Oh boy!"
    },
    {
        "character": "",
        "line": "South Park, night. The crowd runs down the street. Stan and Kyle see Kenny between two buildings and run up to him"
    },
    {
        "character": "Stan",
        "line": "Kenny! Kenny! Dude, what the hell?! You're supposed to be watching Muhammad!"
    },
    {
        "character": "Kenny",
        "line": "(I am. He's right here.) [a locker to his left opens up and Muhammad steps out, a black rectangle with \"CENSORED\" on it covering him up]"
    },
    {
        "character": "Stan",
        "line": "Oh thank God. Hey Muhammad."
    },
    {
        "character": "Kyle",
        "line": "Really sorry about all this, dude. [to Stan] So what the heck are we gonna do now? Muhammad isn't safe here."
    },
    {
        "character": "Stan",
        "line": "The gingers and celebrities all want a piece of him. I don't know where we can go."
    },
    {
        "character": "Kyle",
        "line": "[thinks a bit, then snaps his fingers] Wait. No wait a minute! I've got it. I've totally got it!"
    },
    {
        "character": "Kenny",
        "line": "(What?)"
    },
    {
        "character": "Kyle",
        "line": "Remember the time when we got an elephant to make love to a pig?"
    },
    {
        "character": "Stan",
        "line": "[a bit surprised] ...Yeah."
    },
    {
        "character": "Kyle",
        "line": "I totally know how we can give the gingers and the celebrities what they want, but keep Muhammad safe. Come on! [they all run off]"
    },
    {
        "character": "",
        "line": "Raisins, night. Mecha-Streisand's right foot is on the parking lot next to an overturned car. Her left foot comes down on the restaurant and everyone inside runs out. She then moves on to Country Kitchen buffet and crushes that under her right foot. All the elderly folk get out of there right before it's destroyed."
    },
    {
        "character": "Richard Tweek",
        "line": "She's going to get our coffee store next."
    },
    {
        "character": "Mr. Slave",
        "line": "Ooooo, Jesus Christ. [points to behind the camera. The Super Best Friends roll into town on their cycles]"
    },
    {
        "character": "Jesus",
        "line": "That's enough, Barbra Streisand! Kiwaaa! [takes off his halo and hurls it at her. It bounces off her left shoulder and returns to Jesus. Barbra just gets more pissed off and turns to face Jesus. She walks towards him] Smith! Try your ice breath! [Joseph Smith steps forward and blows a stream of freezing air at Barbra's left claw. She looks at it and flexes her claws]"
    },
    {
        "character": "Joseph Smith",
        "line": "No good!"
    },
    {
        "character": "Seaman",
        "line": "Look out! Barbra Streisand is using her toxic stink ray! [Barbra unleashes a stream of brown gas from her genital area, making the Super Best Friends cough]"
    },
    {
        "character": "",
        "line": "Dr. Mephesto's lab, later"
    },
    {
        "character": "Dr. Mephesto",
        "line": "Eric, your father never wanted this to happen. He was protecting you as well as them."
    },
    {
        "character": "Cartman",
        "line": "Them who?!"
    },
    {
        "character": "Dr. Mephesto",
        "line": "Eric, you have to understand, it's all very complicated."
    },
    {
        "character": "Cartman",
        "line": "Then start explaining it to me!"
    },
    {
        "character": "Dr. Mephesto",
        "line": "[heavy sigh] Very well."
    },
    {
        "character": "Kyle",
        "line": "Come on, Muhammad, the door is open."
    },
    {
        "character": "Stan",
        "line": "Dr. Mephesto, we need your help!"
    },
    {
        "character": "Dr. Mephesto",
        "line": "Oh for crying out loud, now everyone is letting themselves in! [goes to the door and locks it]"
    },
    {
        "character": "Kyle",
        "line": "Doctor, this is Muhammad. We want you to clone him, so we can give his copies to gingers, and Barbra Streisand."
    },
    {
        "character": "Dr. Mephesto",
        "line": "Oh, all right."
    },
    {
        "character": "Cartman",
        "line": "No nooo no no no! He's not doing anything except explaining who my father is!"
    },
    {
        "character": "Stan",
        "line": "Dude, that doesn't matter to people right now!"
    },
    {
        "character": "Cartman",
        "line": "It's all that matters!"
    },
    {
        "character": "Kyle",
        "line": "Dude, nobody gives a crap about who your stupid father is! Muhammad is an important issue with actual ethical ramifications!"
    },
    {
        "character": "Cartman",
        "line": "I guarantee you people care way more about who my father is!"
    },
    {
        "character": "",
        "line": "South Park, night. Joseph Smith has taken flight"
    },
    {
        "character": "Announcer",
        "line": "In the small mountain town of South Park, the holy prophet of the Mormon religion is trying to fly up the nose of a deadly female singer. [Barbra Streisand looks around. Krishna and Seaman float by either side of her head. Smith lands on her nose, but she tries to shake him off]"
    },
    {
        "character": "Seaman",
        "line": "Our powers aren't working, Swallow. [The Super Best Friends float down towards Jesus]"
    },
    {
        "character": "Joseph Smith",
        "line": "We can't attack Streisand's nose! It's just too big!"
    },
    {
        "character": "Jesus",
        "line": "We have to find another weak spot! [into his cuff] Moses!"
    },
    {
        "character": "Moses",
        "line": "What?"
    },
    {
        "character": "Jesus",
        "line": "We need to know any weakness Barbra Streisand might have!"
    },
    {
        "character": "Moses",
        "line": "Um... Let me think... Um... Oh I know... Barbra Streisand can't resist singing duets with Neil Diamond."
    },
    {
        "character": "Jesus",
        "line": "All right. I'll build a stage. Lao Tse, use mind control to get a huge audience. Buddha and Smith, use powers to find a band. Seaman, [chuckles] you and Swallow go get us sushi for dinner. [the other Super Best Friends start chuckling]"
    },
    {
        "character": "Seaman",
        "line": "It's Sea-Man and Swallow."
    },
    {
        "character": "Jesus",
        "line": "Okay, Seaman, you guys head off!"
    },
    {
        "character": "Seaman",
        "line": "Fine! Swallow, come. [the other Super Best Friends chuckle]"
    },
    {
        "character": "Moses",
        "line": "Heh heh heheheh. No way he just said that."
    },
    {
        "character": "",
        "line": "Dr. Mephesto's lab"
    },
    {
        "character": "Stan",
        "line": "Alright alright, just tell Cartman who his dad is real quick so we can clone Muhammad."
    },
    {
        "character": "Dr. Mephesto",
        "line": "It's a complicated story. I just can't tell him quickly."
    },
    {
        "character": "Kyle",
        "line": "Then we'll wait, because we have to clone Muhammad now!"
    },
    {
        "character": "Mitch Conner",
        "line": "Is Muhammad more important than a little boy's broken heart?"
    },
    {
        "character": "Kyle",
        "line": "Oh, you are not doing that again!"
    },
    {
        "character": "Mitch Conner",
        "line": "Look, Mephesto, just tell this kid who his father is and you do it now!"
    },
    {
        "character": "Kyle",
        "line": "Stop talking with your stupid hand!"
    },
    {
        "character": "Cartman",
        "line": "Who you calling stupid, Jew?"
    },
    {
        "character": "Stan",
        "line": "Come on, guys, we're running out of time! [more knocking is heard at Mephesto's door, and Mephesto turns around]"
    },
    {
        "character": "Dr. Mephesto",
        "line": "Yes?"
    },
    {
        "character": "Man",
        "line": "Hey, I'm sorry to bother you. There's uh, been an accident and I need a phone."
    },
    {
        "character": "Dr. Mephesto",
        "line": "Yeah, right, let me guess: You're an African-American."
    },
    {
        "character": "Man",
        "line": "...Well, yes I am, but I don't know what that has to do with anything."
    },
    {
        "character": "Dr. Mephesto",
        "line": "Beat it I'm not helpin' you!"
    },
    {
        "character": "Kyle",
        "line": "Dude!"
    },
    {
        "character": "Stan",
        "line": "That's not cool!"
    },
    {
        "character": "Dr. Mephesto",
        "line": "No no, you don't understand."
    },
    {
        "character": "Kyle",
        "line": "We understand you just sounded like a freakin' racist!"
    },
    {
        "character": "Stan",
        "line": "We don't live in the '60s anymore, you know! We have a black president!"
    },
    {
        "character": "Dr. Mephesto",
        "line": "Alright, alright, jeez. [walks to the door and opens it]"
    },
    {
        "character": "Ginger 1",
        "line": "Hahaaa!"
    },
    {
        "character": "Stan",
        "line": "Oh crap, the gingers!"
    },
    {
        "character": "Cartman",
        "line": "Gingers? No!"
    },
    {
        "character": "",
        "line": "Tom Cruise's mansion"
    },
    {
        "character": "Announcer",
        "line": "L-later, at the Legion of Doom."
    },
    {
        "character": "Benedict XVI",
        "line": "Tom, Tom! The gingers are claiming they have Muhammad!"
    },
    {
        "character": "Tom Cruise",
        "line": "What?! Impossible!"
    },
    {
        "character": "Benedict XVI",
        "line": "They are sending a message now!"
    },
    {
        "character": "Tom Cruise",
        "line": "On screen! [The Legion of Doom's monitor lights up and the gingers are shown with Muhammad. The lead ginger gives the Legion a raspberry.]"
    },
    {
        "character": "Ginger 1",
        "line": "[taunting] We got Muhammad! We got Muhammad!"
    },
    {
        "character": "Rob Reiner",
        "line": "He's useless to you! You can't get Muhammad's power to not be made fun of without the Rob Reiner Goo Transfer Machine!"
    },
    {
        "character": "Ginger 1",
        "line": "Why do you think we're calling?!"
    },
    {
        "character": "Ginger 3",
        "line": "Our boss is willing to share Muhammad with you if you're willing to share the goo machine with us!"
    },
    {
        "character": "Tom Cruise",
        "line": "...Your ...boss?"
    },
    {
        "character": "",
        "line": "The gingers' lair"
    },
    {
        "character": "Dr. Mephesto",
        "line": "What's going on? You got what you wanted, gingers, so let us go."
    },
    {
        "character": "Ginger 1",
        "line": "Oh no no! The head ginger has plans for you!"
    },
    {
        "character": "Stan",
        "line": "What head ginger?! And where's Cartman?!"
    },
    {
        "character": "Ginger 2",
        "line": "Heheh, the head ginger has somethin' reeeally special planned for him."
    },
    {
        "character": "",
        "line": "The gingers' lair, deeper inside. Cartman walks through the cave with a flashlight."
    },
    {
        "character": "Cartman",
        "line": "Hello? What the hell is this? Where am I?"
    },
    {
        "character": "Mitch Conner",
        "line": "You really got yourself in a mess this time, kid."
    },
    {
        "character": "Cartman",
        "line": "Shut up, Conner! How about I shove this flashlight in your mouth?"
    },
    {
        "character": "Mitch Conner",
        "line": "You might wanna [garbled sounds as Cartman puts the flashlight in his left hand]"
    },
    {
        "character": "Cartman",
        "line": "Hello? I'm here, whoever you are. [a slow cackle rises from the darkness]"
    },
    {
        "character": "A Voice",
        "line": "Eric Cartman. I've waited a long time for this."
    },
    {
        "character": "Cartman",
        "line": "Daddy?"
    },
    {
        "character": "A Voice",
        "line": "Guess again. [lights go one a few at a time. Carnival rides begin to appear. The Bean Dip Ferris Wheel. Chili-buster. The Chiliblast. A Hot Chili sign. A Professor Habanero chili booth. More signs come on, and the 2010 Chili Con Carnival is now live. Cartman is awed] Welcome, to my Chili Con Carnival."
    },
    {
        "character": "Cartman",
        "line": "[strokes his chin and thinks] Chili Con Carnival? ...Wait a minute. ...No it can't be."
    },
    {
        "character": "A Voice",
        "line": "Oh, but it can. [Cartman is looking at a throne with a staircase at its base. Six gingers stand guard on the ground and halfway up the steps. Around and behind the steps is a pile of broken baby dolls highlighted by two torches. one on either side of the stairs. The torches are topped with baby doll heads. On the throne itself sits one Scott Tenorman, with top hat and cane. His head is in the shadows] Revenge is a dish best served... [leans forward into the light] chili."
    },
    {
        "character": "Cartman",
        "line": "Scott Tenorman. Eeewww."
    },
    {
        "character": "",
        "line": "South Park, night. \"Live! Tonight Only! NEIL DIAMOND\""
    },
    {
        "character": "Announcer",
        "line": "Meanwhile, at the concert stage Jesus built with his power of super-carpentry..."
    },
    {
        "character": "Joseph Smith",
        "line": "[walks in with Buddha and Lao Tse] That's it, Jesus. The band has been paid and the PA system is working."
    },
    {
        "character": "Jesus",
        "line": "[joins them and drops his hammer] Alright Krishna, the rest is up to you."
    },
    {
        "character": "Krishna",
        "line": "[walks some distance] Form of... Neil Diamond. [poof! He is now Neil Diamond, who then goes on stage and addresses the crowd] If you all wouldn't mind, I'd like to invite a special friend to join me on stage. Miss Barbra Streisand! [Barbra hears her name and walks towards the stage]"
    },
    {
        "character": "Jesus",
        "line": "Let's hope to Christ this works. [Barbra reaches the stage and lowers her head to Neil - er, Krishna]"
    },
    {
        "character": "Krishna",
        "line": "Hello gorgeous. What do you say? Shall we sing together again like the old times?\n[Barbra roars and sits down on stage] \nWell that's because I love the girl. \nAnd I still love you now. What have you got to say? \n[Barbra roars, then the crowd roars] \nThat might be true, but I still miss ya at night. \n[Barbra roars something] \nWhen you roll over, by my side, and you kiss me goodnight. \n[This excites Barbra, who roars and lets out a jet of toxic spray onto the audience. The audience members cough and try to shield themselves]\n\n\n"
    },
    {
        "character": "Joseph Smith",
        "line": "It worked, Jesus!"
    },
    {
        "character": "Jesus",
        "line": "Yeah. And now to find Muhammad and take down Tom Cruise!"
    },
    {
        "character": "",
        "line": "Scott Tenorman's' lair"
    },
    {
        "character": "Scott Tenorman",
        "line": "Do you remember when you had my parents killed and fed them to me as chili? I spent quite a while in a mental institution, Eric. [two ginger kids come and escort Cartman towards a ride] A lot of time for me to learn everything about you, so that one day I could take you down. I even learned the name of your father. [the two kids place Cartman in a car and sit on either side of him. The car begins to move. Screen 1] Oh, I know you're confused. Who wouldn't be? [Screen 2] You've been lied to by everyone! [Screen 3] Even by your own mother! [Screen 4] Hahahahahahahaha. [the car goes through some double doors]"
    },
    {
        "character": "Cartman",
        "line": "What do you know?!"
    },
    {
        "character": "Scott Tenorman",
        "line": "[Screen 5] I wanted to torment you with your father's identity. But what I found was more shocking than I could have possibly guessed!"
    },
    {
        "character": "",
        "line": "The gingers' lair. The goo machine has been moved there and Muhammad has been strapped into the lefthand side of the machine. Tom Cruise has been strapped to the right side"
    },
    {
        "character": "Announcer",
        "line": "[sounding more and more wasted] Meanwhile, at the gingers' lair..."
    },
    {
        "character": "Russell Crowe",
        "line": "Alright, Muhammad is secure. [moves off the machine]"
    },
    {
        "character": "Tom Cruise",
        "line": "Let's do this. Throw the switch, Rob. [Rob Reiner throws the switch. The power level increases on the control panel. Moments later, goo moves from Muhammad through four tubes towards a mixer, then through two tubes towards Tom Cruise. Everyone watches in anticipation] Ohhh. Uhhh. Yes! I can feel it! I can feel the power to not be ridiculed flowing through my veins! [shakes violently for a second, then the machine shuts down. A \"CENSORED\" bar appears over Tom] Ha. Hahahaha! [laughs heartily]"
    },
    {
        "character": "Paris Hilton",
        "line": "O M G it worked!"
    },
    {
        "character": "Tom Cruise",
        "line": "I've done it! I've done it! Look at me! I'm not okay to make fun of anymore!"
    },
    {
        "character": "Benedict XVI",
        "line": "Ooo you lucky fucker."
    },
    {
        "character": "",
        "line": "Chili Con Carnival - Scott Tenorman's lair. Scott has brought in Stan, Kyle, and Kenny, some gingers, and some candidates from Dr. Mephesto's DNA inquiry into Cartman's dad. Dr. Mephesto and Kevin are there too. Scott is inside a center ring next to a table on which rests a bowl of chili. Cartman is on a chair facing the bowl. Only the gingers have their hands free. Everyone else has their hands tied behind their backs"
    },
    {
        "character": "Scott Tenorman",
        "line": "Welcome, everyone, to the final act of my fabulous Chili Carnival!"
    },
    {
        "character": "Liane",
        "line": "Please, leave my boy alone!"
    },
    {
        "character": "Cartman",
        "line": "Mom?"
    },
    {
        "character": "Scott Tenorman",
        "line": "I got them all here for you, Eric! So listen while you got told the truth!"
    },
    {
        "character": "Mr. Garrison",
        "line": "Please don't. We have to protect 'em."
    },
    {
        "character": "Cartman",
        "line": "Protect who??"
    },
    {
        "character": "Scott Tenorman",
        "line": "Yes, protect... who? Tell him! Mr... [points to] Jimbo! [with his cane]"
    },
    {
        "character": "Jimbo",
        "line": "Protect... the Denver Broncos."
    },
    {
        "character": "",
        "line": "The gingers' lair"
    },
    {
        "character": "Announcer",
        "line": "Meanwhile..."
    },
    {
        "character": "Tom Cruise",
        "line": "This is incredible. Who wants to go next?"
    },
    {
        "character": "Benedict XVI",
        "line": "I want to be next."
    },
    {
        "character": "Ginger 4",
        "line": "No, gingers go next."
    },
    {
        "character": "Mickey Mouse",
        "line": "Gingers can suck it! I'm next, ha!"
    },
    {
        "character": "Rob Reiner",
        "line": "It's my goo machine! I'm next!"
    },
    {
        "character": "Jesus",
        "line": "Nobody is going next! [Jesus, Buddha, and Joseph Smith run in while Lao Tse and Seaman drop in from above.] Muhammad is our super best friend! Let him go!"
    },
    {
        "character": "Ginger 4",
        "line": "They can't stop all of us! Get 'em!"
    },
    {
        "character": "",
        "line": "The gingers and celebrities attack the super best friends as one. Joseph Smith blows his super breath on Sally Struthers, who freezes over."
    },
    {
        "character": "Jesus",
        "line": "[fends off every ginger who runs at him.] Kyaaaaa!"
    },
    {
        "character": "",
        "line": "Chili Con Carnival - Scott Tenorman's lair. Scott addresses the captives"
    },
    {
        "character": "Scott Tenorman",
        "line": "The Denver Broncos. [turns to Cartman] There was a right tackle, see? Who had an illegitimate child with your slut of a mom, and everyone here covered it up! To protect the Bronco name!"
    },
    {
        "character": "Mr. Garrison",
        "line": "They were having a really good year! There couldn't be any distractions!"
    },
    {
        "character": "Cartman",
        "line": "My dad was a Denver Bronco?"
    },
    {
        "character": "Scott Tenorman",
        "line": "Would you like to meet him? Well, you can't. Ever. 'Cause you see, Eric, we have something in common. Did I ever tell you that my father... played for the Denver Broncos?"
    },
    {
        "character": "Cartman",
        "line": "No- nooo."
    },
    {
        "character": "Scott Tenorman",
        "line": "The only Bronco who lived in South Park. He got a little bored one week and had an affair with a slut named Liane Cartman!"
    },
    {
        "character": "Liane",
        "line": "No please!"
    },
    {
        "character": "Scott Tenorman",
        "line": "[to Dr. Mephesto] Tell him! You almost did before, but you got shot by your brother who was a Bronco fan! Tell him!"
    },
    {
        "character": "Dr. Mephesto",
        "line": "It's true... Jack Tenorman was your father."
    },
    {
        "character": "Scott Tenorman",
        "line": "You killed your own father and then you fed him to your half... brother!"
    },
    {
        "character": "Cartman",
        "line": "No! Noooo!"
    },
    {
        "character": "Scott Tenorman",
        "line": "Hahahahahahahahahahahahaha! Now eat your chili! [shoves Cartman's face into the chili, just as Cartman had done to him a long time ago. Cartman gags on the chili. A wall explodes and the captives and celebrities rush in, followed by the Super Best Friends] The Super Best Friends? Oh no! [makes a run out of the lair. Russell Crowe smacks Buddha a few times, but Buddha fights back]"
    },
    {
        "character": "Seaman",
        "line": "I'll get you, Tom Cruise! [hops on him and wrestles him]"
    },
    {
        "character": "Stan",
        "line": "Hey look! Tom Cruise has Seaman on his back. [everyone stops and gasps. The \"CENSORED\" bar disappears and Tom is shown again]"
    },
    {
        "character": "Tom Cruise",
        "line": "What did you say?!"
    },
    {
        "character": "Kyle",
        "line": "Oh, yeah. Tom Cruise does have Seaman on his back."
    },
    {
        "character": "Jesus",
        "line": "I guess maybe Tom Cruise likes Seaman. [everyone chuckles.]"
    },
    {
        "character": "Tom Cruise",
        "line": "[straightens up] Whoa, whoa, whoa, whoa! [Seaman gets off his back] You're not supposed to be able to make fun of me anymore! What the hell's going on?!"
    },
    {
        "character": "Scott Tenorman",
        "line": "[on the rafters with a jet pack on his back] I'll be back, Super Best Friends! [tales off through an open door on the roof.]"
    },
    {
        "character": "Jesus",
        "line": "Who's the creepy ginger kid?"
    },
    {
        "character": "Tom Cruise",
        "line": "Reiner, you said the goo machine would work! But I got made fun of!"
    },
    {
        "character": "Kyle",
        "line": "That's because there is no goo, Mr. Cruise. You see, I learned something today. Throughout this whole ordeal, we've all wanted to show things that we weren't allowed to show. But it wasn't because of some magic goo. It was because of the magical power of threatening people with violence. That's obviously the only true power. If there's anything we've all learned, it's that terrorizing people works."
    },
    {
        "character": "Jesus",
        "line": "That's right. Don't you see, gingers? If you don't want to be made fun of anymore, all you need are guns and bombs to get people to stop."
    },
    {
        "character": "Santa",
        "line": "That's right, friends. All you need to do is instill fear, and be willing to hurt people, and you can get whatever you want. The only true power is violence."
    },
    {
        "character": "Stan",
        "line": "[smiles and tilts his head to one side] Yeah."
    },
    {
        "character": "",
        "line": "South Park, day. Reconstruction on the town begins"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Alright, people, let's start rebuilding our town! For the 39th time."
    },
    {
        "character": "Stan",
        "line": "Oh, dude, look. [Cartman is shown on a gurney, crying. Stan, Kyle, and Kenny approach him] Hey, Cartman..."
    },
    {
        "character": "Kyle",
        "line": "Look, man, w-we know what you learned was pretty tough to hear."
    },
    {
        "character": "Cartman",
        "line": "Tough to hear? My dad was Scott Tenorman's dad. Don't you guys realize what that means?"
    },
    {
        "character": "Stan",
        "line": "Yeah, dude, we, we know what it means."
    },
    {
        "character": "Cartman",
        "line": "My dad was a ginger!"
    },
    {
        "character": "Kyle",
        "line": "Wwait, what?"
    },
    {
        "character": "Cartman",
        "line": "I mean, obviously, I take after my mom, but I have the ginger gene inside of me!"
    },
    {
        "character": "Kyle",
        "line": "Dude, you killed your own dad, and you're worried about that?!"
    },
    {
        "character": "Mitch Conner",
        "line": "[appears] Hey, Eric, Eric!"
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Mitch Conner",
        "line": "Come on, cheer up."
    },
    {
        "character": "Cartman",
        "line": "Cheer up? I'm half ginger!"
    },
    {
        "character": "Mitch Conner",
        "line": "Yeah, but you're forgetting, you're also half Denver Bronco. That makes you pretty cool."
    },
    {
        "character": "Cartman",
        "line": "Hey, you're right. That does make me pretty cool."
    },
    {
        "character": "Kyle",
        "line": "You gotta be kidding me!"
    },
    {
        "character": "Mitch Conner",
        "line": "Shut up, Kyle, you dumb Jew. [to Cartman] You've got Bronco blood in you, kid. That makes you awesome. Me? I should be movin' on."
    },
    {
        "character": "Cartman",
        "line": "Really, Mitch? Ya, you've gotta go?"
    },
    {
        "character": "Mitch Conner",
        "line": "There's a bounty on my head and I can't afford to stay in one place for too long. So long... Denver Bronco."
    },
    {
        "character": "Cartman",
        "line": "Take it easy, Conner. [his hand floats away, then opens up all of a sudden. He wiggles his fingers. Next shot is of Tom Cruise sitting by himself on a trash can.]"
    },
    {
        "character": "Stan",
        "line": "Look, Mr. Cruise, I'm sorry I said you were a fudge packer and that Seaman on your back."
    },
    {
        "character": "Tom Cruise",
        "line": "I... I just can't do it anymore. I wanna go away. But there's nowhere on earth that people aren't around to rip on me."
    },
    {
        "character": "Kyle",
        "line": "Hey... Hey, we know a place! We know a place where everything is just happiness and joy. And no humans are there to mess it up."
    },
    {
        "character": "Stan",
        "line": "We do? Oh, oh, yeah, we do!"
    },
    {
        "character": "Tom Cruise",
        "line": "You... really? Somewhere where I can just ...live out my days in peace and quiet and- Oh. [stands up] Oh, please, can you show me where?"
    },
    {
        "character": "Stan",
        "line": "We'll do better than that. We'll help you get there."
    },
    {
        "character": "",
        "line": "The moon. Tom Cruise is shown laying next to Willzyx."
    }
]