[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The students are all in the cafeteria eating lunch. In the middle of the cafeteria is a table with the four boys there. Stan, Kyle, Cartman, and Kenny sit opposite Clyde, Craig, Kevin, and Tolkien."
    },
    {
        "character": "Cartman",
        "line": "So then, the guy hits the ping-pong ball with his dick, and it goes right in the other guy's mouth. [laughs heartily. Butters approaches the table with a sheet of paper]"
    },
    {
        "character": "Butters",
        "line": "Hey, Stan, I have a note for you."
    },
    {
        "character": "Stan",
        "line": "A note?"
    },
    {
        "character": "Butters",
        "line": "Yeah, uh, Wendy said to give you this. [hands him the note] I'm like a mailman. [walks away. Stan reads and Kyle notices]"
    },
    {
        "character": "Kyle",
        "line": "What's it say?"
    },
    {
        "character": "Stan",
        "line": "[omitting the names] We need to talk."
    },
    {
        "character": "Cartman",
        "line": "[voice rising in pitch] Ohhhhhhhh. When a chick says \"We need to talk.\", you might as well just start punching yourself in the balls, dude."
    },
    {
        "character": "",
        "line": "Two tables over, nine girls are eating lunch. Kal, Red, Wendy, Bebe, and Heidi sit opposite Esther, Anne, Lola, and Millie"
    },
    {
        "character": "Red",
        "line": "Are you sure he has a problem, Wendy?"
    },
    {
        "character": "Wendy",
        "line": "Yes. I've read all about it. It's a real disease. It's called \"hoarding.\" People who can't throw anything away, and they just keep living in deeper and deeper filth until the people around them just can't take it anymore."
    },
    {
        "character": "Stan",
        "line": "[approaching] Is something wrong, Wendy? [Wendy sees him, then looks at the girls, gets up and walks up to Stan]"
    },
    {
        "character": "Wendy",
        "line": "[sighs] Stan? We need to talk about your locker."
    },
    {
        "character": "Stan",
        "line": "My locker?"
    },
    {
        "character": "Wendy",
        "line": "[turns away] Every time I see the condition it's in I j-I just wanna cry. It just keeps getting messier and messier. I think you have a problem."
    },
    {
        "character": "Stan",
        "line": "Are you serious?"
    },
    {
        "character": "Wendy",
        "line": "[turns back] It's so full of junk it takes you forever to find anything. And lately you've been asking to keep things in my locker."
    },
    {
        "character": "Stan",
        "line": "Well, it's just a little messy."
    },
    {
        "character": "Wendy",
        "line": "No, Stan, it's called \"hoarding\"! And if you don't get help, I don't know how much longer I could be with you!"
    },
    {
        "character": "Stan",
        "line": "Aw, come on."
    },
    {
        "character": "Wendy",
        "line": "Then can we throw some stuff in your locker away?"
    },
    {
        "character": "Stan",
        "line": "Yeah, alright."
    },
    {
        "character": "Wendy",
        "line": "[wipes a tear from her eye] Okay. [puts a hand on his shoulder] I've hired some experts to help you with this. We'll make this as easy as possible on you, Stan."
    },
    {
        "character": "",
        "line": "South Park Elementary, hallway. Two men stand by Stan and his locker as the fourth graders look on. One of them holds a large trash bag and is wearing a face mask"
    },
    {
        "character": "An Expert",
        "line": "Hello everyone, my name is Dr. Chinstrap. I'm a hoarding specialist, and today we're gonna help Stan clean out his locker. Alright, let's go ahead and see inside your locker, Stan. [Stan goes to his locker, opens it, and a few items fall out. The class gasps in horror: Stan's locker is truly packed. Wendy cries and hides her face with her notebook]"
    },
    {
        "character": "Stan",
        "line": "What, come on, it's not that bad."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Now, as part of Stan's therapy, we need to make sure we don't throw away anything he doesn't want us to. Stan needs to feel like he is in control or his psychosis will come out."
    },
    {
        "character": "Stan",
        "line": "My psychosis? Look, it isn't that big a deal, I'll just throw this stuff away."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "[walks up to Stan and gets down on one knee] Okay, great. How about we start with this? [takes a small box out of the locker]"
    },
    {
        "character": "Stan",
        "line": "Well, no, that's my pencil box. I need my pencil box."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "[defers right away, putting a hand up] Okay, okay, we'll put that right here on the floor. Now how about this? [takes out a bent toothbrush] Broken toothbrush."
    },
    {
        "character": "Stan",
        "line": "Well... it's good to have that, because sometimes I really wanna brush after lunch, and I-"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "But it's broken."
    },
    {
        "character": "Stan",
        "line": "Yeah, but it works perfectly fine and I-"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "[defers right away] Okay, okay. Broken toothbrush is going right here, by the pencil box. [sets it down] Now how about this? [pulls out a clear sandwich bag with rotten food in it] Old sandwich in a baggie filled with maggots."
    },
    {
        "character": "Class",
        "line": "Eeeeewwww! [two more men stand behind the class holding trash bags and wearing face masks]"
    },
    {
        "character": "Stan",
        "line": "Well, that, I mean, yeah, I mean... I kinda need that. Let's, let's just keep that."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "It's full of maggots, Stan. Can we throw it away?"
    },
    {
        "character": "Stan",
        "line": "Well, I might need it if I every have to, you know, like-"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "The maggots are crawling down my hand and biting my wrist, Stan. Can we throw this away?"
    },
    {
        "character": "Stan",
        "line": "Well, I- I guess so, but- [Dr. Chinstrap dumps the baggie into the large trash bag his assistant is holding. The assistant is wearing a facemask] Whoa-whoa-wait, this is all happening a little fast. Can we just slow down? [Kyle, Cartman, and Kenny look at each other worriedly]"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Now how about this empty aspirin bottle?"
    },
    {
        "character": "Stan",
        "line": "Well no, don't throw that out."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Can we throw out these wadded up papers, then? [sweeps out a bunch of loose papers. Stan gets alarmed]"
    },
    {
        "character": "Stan",
        "line": "[begins gathering up the papers] No, because there could be something written on one of them that's important and uh-! No, don't take my empty bottle-! [takes the bottle from Dr. Chinstrap. The assistant pulls out the baggie] G-give me back my sandwich! [Stan grabs the baggie, then reaches for another loose sheet, when he realizes what he's done. Cartman makes a circle around his right ear with his index finger and whistles a cuckoo tune]"
    },
    {
        "character": "Kyle",
        "line": "[walks up to Stan and puts a hand on his left shoulder] Dude. What's wrong with you?"
    },
    {
        "character": "Stan",
        "line": "I don't... I don't know."
    },
    {
        "character": "Kyle",
        "line": "Maybe you should go talk to the counselor."
    },
    {
        "character": "",
        "line": "Mr. Mackey's office, later. Stan is in his office"
    },
    {
        "character": "Mr. Mackey",
        "line": "Stan, as your counselor, I'm here to help you with whatever problems you might have, m'kay? Now, what is the matter? [before Stan answers, he looks around the office. Mr. Mackey has a lot of junk in there]"
    },
    {
        "character": "Stan",
        "line": "Well, my friends are worried that I'm showing signs of... \"hoarding.\""
    },
    {
        "character": "Mr. Mackey",
        "line": "Hoarding? M'kay, what's that?"
    },
    {
        "character": "Stan",
        "line": "Well, apparently, it's when you... don't throw anything away and soon you find yourself, living with a, bunch of... junk?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Hmmm, I haven't heard of that, but it- it definitely sounds bad, m'kay?"
    },
    {
        "character": "Stan",
        "line": "[looks around again] Mr. Mackey, is there, maybe anything you wanna talk about?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Me? ...Like, like what?"
    },
    {
        "character": "Stan",
        "line": "[looks around and picks up an empty milk carton from a box] Well like, you've got an old milk carton here from a month ago that's like-"
    },
    {
        "character": "Mr. Mackey",
        "line": "DON'T YOU TOUCH THAT! THAT'S NOT SOMETHING TO THROW AWAY! IF YOU THROW THAT AWAY I WILL RAPE YOU IN THE MOUTH! M'KAY?! I WILL RAPE YOU IN YOUR FUCKING MOUTH! M'KAY?!"
    },
    {
        "character": "",
        "line": "South Park Elementary faculty room. Randy and Sharon are there with Mr. Garrison, Principal Victoria, Dr. Chinstrap, and another expert"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "There's no doubt about it. The school counselor here is a Class-5 hoarder. As for your son, Mr. and Mrs. Marsh, he's easily a Class-3."
    },
    {
        "character": "Principal Victoria",
        "line": "But why is Mr. Mackey doing this now?"
    },
    {
        "character": "Sharon",
        "line": "Yes, our son has always been fairly clean."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "We don't know a lot about what causes hoarding, but we do know it often relates to some kind of psychological trauma. If it's okay with you, we'd like to run some tests on the both of them."
    },
    {
        "character": "Sharon",
        "line": "Is that really necessary for Stan? It's just his locker."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "I don't know if you realize how serious locker hoarding is. [turns away] It can lead to room hoarding, then house hoarding. In some cases, people even hoard animals, like cats."
    },
    {
        "character": "Randy",
        "line": "Oh yeah. Like that weird guy over on on Burgess Road. That guy, Mr. Yelman. He's been hoarding animals for years now."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Oh no, really?"
    },
    {
        "character": "",
        "line": "A pasture, day. Dr. Chinstrap and his partner are present with Sgt. Yates and an officer"
    },
    {
        "character": "Sgt. Yates",
        "line": "Mr. Yelman, we received some disturbing reports that you might be hoarding sheep."
    },
    {
        "character": "Mr. Yelman",
        "line": "[a shepherd, or sheep herder, or sheep hoarder] ...Well I, that is I, I-"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "It's okay, Mr. Yelman, I'm a hoarding specialist. What you have is an illness. [Mr. Yelman doesn't know what they're talking about]"
    },
    {
        "character": "",
        "line": "A lab, later. Stan, Mr. Mackey, and Mr. Yelman are all on couches with electrodes attached to their temples. Dr. Chinstrap is running tests as his partner and Stan's parents watch from an observation room"
    },
    {
        "character": "Partner",
        "line": "Don't worry, Mr. and Mrs. Marsh. Dr. Chinstrap is a professional at memory regression. This should prove very helpful."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Alright everyone, we are all here to face the disease of hoarding together. Nothing to be ashamed of, everyone here has the same problem. Whether it's office hoarding, or in the locker, or even the hoarding of animals."
    },
    {
        "character": "Mr. Yelman",
        "line": "Excuse me, but uh, I am a sheep herder."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "It's pronounced \"hoarder,\" and yes you are."
    },
    {
        "character": "Mr. Yelman",
        "line": "But but I, uh I'm actually herding sheep."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Yes, you are hurting sheep by hoarding them, aren't you? It's good you realize that."
    },
    {
        "character": "Mr. Yelman",
        "line": "No, but I just thought that-"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Now listen: there's a psychological reason you're all doing this, and we're gonna get to the bottom of it. We're gonna do some regression therapy. I'll be taking you deep into your memories, into your past."
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay, that that sounds like it could be bad, uh-kay?"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Trust me, I know what I'm doing. I want the three of you to relax, and think about... a cloud. A lone cloud... floating... changing... light... cool air... blowing on the cloud. float- [jumps out of his chair suddenly, startling the subjects] WAAH! HAAA! HAAA!"
    },
    {
        "character": "Mr. Mackey",
        "line": "What?! What?! Jesus, what?!"
    },
    {
        "character": "Mr. Yelman",
        "line": "Oh my God!"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Sorry, I just got a weird gas bubble for a second. [clears his throat] Anyway, A lone cloud... floating... wisps of cool air... now the cloud is near you, you... you reach out to it."
    },
    {
        "character": "Mr. Mackey",
        "line": "[stretches his arm out] Mmm-kay..."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "It's the cloud of your memories, of your past, [focus on Mr. Mackey] ...your childhood perhaps, ...what do you see in the cloud? Who is in the cloud?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Billy, ...Billy Thompson?"
    },
    {
        "character": "",
        "line": "Mackey's memory takes him back to the 1970s, when he was in grammar school. Three kids angrily walk towards him in the hall."
    },
    {
        "character": "Billy",
        "line": "There he is! Hey, Mackey! [Mr. Mackey, talking to two other boys, suddenly drops his books and turns around]"
    },
    {
        "character": "Mackey",
        "line": "Oh uh, hi Billy. Nice to see ya, m'kay?"
    },
    {
        "character": "Billy",
        "line": "Come 'ere! [points to the spot where he wants Mackey. Mackey's friends panic and split]"
    },
    {
        "character": "Mackey",
        "line": "Uh well, actually I need to get home, m'kay? I uh..."
    },
    {
        "character": "Billy",
        "line": "You snitched and told the principal I was smoking."
    },
    {
        "character": "Mackey",
        "line": "Oh well uh, uh... smoking's bad, uhkay? [Billy throws him up against a locker] Huhhhhh!"
    },
    {
        "character": "Billy",
        "line": "You're gonna die Mackey! [to his friends] Hold his legs! [his friends move in, but Mackey gets loose and runs away, screaming. Mackey rounds a corner, finds a room, and goes in before Billy could catch him. Billy and his friends round the corner and run past the room Mackey entered] Come back here!"
    },
    {
        "character": "Mackey",
        "line": "[in the darkness, starts to calm down] Okay. Okay, okay okay, it's okay. It's okay. Calm down, okay. Turn on the light. [turns on the light, revealing Stan]"
    },
    {
        "character": "Stan",
        "line": "What? Whoa wait, what am I doing here?"
    },
    {
        "character": "Mackey",
        "line": "Shh. Be quiet."
    },
    {
        "character": "Mr. Yelman",
        "line": "'Scuse me, where are we?"
    },
    {
        "character": "Mackey",
        "line": "Shh. You've gotta be quiet. Billy Thompson's out there."
    },
    {
        "character": "Stan",
        "line": "What the hell's going on?!"
    },
    {
        "character": "",
        "line": "In the observation room Dr. Chinstrap and his partner analyze some printouts"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "What the hell is going on?!"
    },
    {
        "character": "Partner",
        "line": "The counselor's flat top readers are calculating with the boy's and the sheep hoarder's."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Oh Jesus."
    },
    {
        "character": "Randy",
        "line": "What does that mean?"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "It means Mr. Mackey's childhood regression dream is... so vivid it actually sucked the other two patients into it."
    },
    {
        "character": "Randy",
        "line": "What?!"
    },
    {
        "character": "Partner",
        "line": "I'm afraid your son has gone into his counselor's dream."
    },
    {
        "character": "Randy",
        "line": "Aw come on, that's stupid. How's that, how's that even possible?"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "It's not stupid at all! Pinkerton, you explain the logic and I'll provide the background."
    },
    {
        "character": "Pinkerton",
        "line": "Alright. [walks up to Randy and Sharon] Look, it is possible to enter into someone else's dreams. [Dr. Chinstrap begins a musical accompaniment] Send dream trackers to go into a person's subconscious, like a spy seeing their dreams as they see them. Perhaps even planting ideas. If one person is regressing deeply enough, the dream can actually envelop those dreaming around the first person I talked about who's dreaming! And then, everyone in the dream would be in danger of never coming back. [Dr. Chinstrap ends his accompaniment at the same time]"
    },
    {
        "character": "",
        "line": "Mackey's dream. Mackey runs into his bedroom, which is strewn with toys popular in the '70s."
    },
    {
        "character": "Mackey",
        "line": "Yay, my bedroom! Yep, this is my happy place, m'kay?"
    },
    {
        "character": "Stan",
        "line": "Mr. Mackey."
    },
    {
        "character": "Mackey",
        "line": "[sees his Lite Brite, runs to work on it, and sings] Lite Brite, making things with light. What a sight, making things with Lite Brite, m'kay."
    },
    {
        "character": "Stan",
        "line": "Mr. Mackey, what are you doing?"
    },
    {
        "character": "Mackey",
        "line": "Well this is a Lite Brite, m'kay. I can make things with light, like um, birds, m'kay, clowns, m'kay."
    },
    {
        "character": "Stan",
        "line": "Come on, dude, you've gotta wake up!"
    },
    {
        "character": "Mackey",
        "line": "Oh yeah, my Evel Knievel doll! [goes to his dresser and grabs it] I can take the motorcycle, hm'kay, I put it on this thing, like this. [puts the motorcycle on the little ramp] Okay now crank it back, and now I let go. [releases the motorcycle, which zooms across the room and does a wheelie. Mackey giggles with excitement] Okay. Okay."
    },
    {
        "character": "Stan",
        "line": "Mr. Mackey, I realize this might be fun for you, but it totally isn't for me."
    },
    {
        "character": "Mackey",
        "line": "Hey, look what's on! It's ZOOM!"
    },
    {
        "character": "Mr. Yelman",
        "line": "Excuse me, I really need to get back to my sheep."
    },
    {
        "character": "Stan",
        "line": "I'm working on it!"
    },
    {
        "character": "Mackey",
        "line": "[Singing along with the TV] Write Zoom Z Double O M Box 350 Bos-ton Mass. Oooh two ooone three fouuur, m'kay!"
    },
    {
        "character": "Stan",
        "line": "[walks up to Mackey and turns him around] Dude, please wake up! You're a grown man in a psychiatrist's office! [something hits Mackey's window and he goes to see what it was. He sees Billy on the sidewalk with his friends]"
    },
    {
        "character": "Billy",
        "line": "You can hide in your house for now, Mackey, but tomorrow is the field trip! Frisco Woods! And I'm gonna do things to you you'll never forget!"
    },
    {
        "character": "Mackey",
        "line": "No, uh Billy, please, uh-kay? I'm really sorry about the smoking thing, uh."
    },
    {
        "character": "Billy",
        "line": "See you in the woods tomorrow, dead man! [walks away with his friends]"
    },
    {
        "character": "Mackey",
        "line": "[turns away from the window] Oh Jesus..."
    },
    {
        "character": "Stan",
        "line": "Is that why we're here? Did something really bad happen on the field trip?"
    },
    {
        "character": "Mackey",
        "line": "Yeah, it's probably gonna be bad, m'kay. [looks away]"
    },
    {
        "character": "",
        "line": "The lab. The patients continue dreaming and moaning"
    },
    {
        "character": "Stan",
        "line": "Oh-Ohhhhhhh."
    },
    {
        "character": "Mr. Mackey",
        "line": "Ohhhhhhh, m'kay."
    },
    {
        "character": "",
        "line": "The observation room"
    },
    {
        "character": "Randy",
        "line": "What kind of hoarding specialist are you?! You trapped our son in his counselor's subconscious, and now you're saying he could die in there?!"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Believe me, this is the last thing I wanted to have happen."
    },
    {
        "character": "Randy",
        "line": "That does it! [goes into the lab]"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "What are you doing?!"
    },
    {
        "character": "Randy",
        "line": "I'm goin' in! [pulls up a couch next to Stan's] If they're locked into his regression, then maybe I can be too!"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Are you crazy?! Mackey is in a very unstable state!"
    },
    {
        "character": "Randy",
        "line": "Damn your incongruities! [hooks himself up] I'm goin' in after my son!"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "It's a dream world where Mackey can imagine himself to be anything. It's dangerous!"
    },
    {
        "character": "Randy",
        "line": "I said get me in there!"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Alright, you wanna risk your ass?! Fine! [snaps into a soothing rush job] You see a cloud, it's a fluffy cloud, floating, happy, happy fluffy cloud. You reach out to it."
    },
    {
        "character": "Randy",
        "line": "Ahhh."
    },
    {
        "character": "",
        "line": "Next day, the field trip"
    },
    {
        "character": "Bus Driver",
        "line": "Alright kids, everyone on the bus."
    },
    {
        "character": "Stan",
        "line": "Wait wait, where the hell are we now?"
    },
    {
        "character": "Mackey",
        "line": "It's the day of the big field trip."
    },
    {
        "character": "Billy",
        "line": "[from the bus window] Come on, Mackey. We're waitin' for ya."
    },
    {
        "character": "Mackey",
        "line": "Oh Jesus."
    },
    {
        "character": "Stan",
        "line": "Mr. Mackey, you have to wake up! I don't belong here! I need to have my own regression therapy!"
    },
    {
        "character": "Bus Driver",
        "line": "Everyone on the bus now! We're runnin' late!"
    },
    {
        "character": "Mr. Yelman",
        "line": "Excuse me, I'm actually a sheep herder."
    },
    {
        "character": "Driver",
        "line": "It's pronounced \"hoarder,\" young man, and if you are you should talk to the school counselor about it! [shoves him into the bus]"
    },
    {
        "character": "Mr. Yelman",
        "line": "Yes, but I, I'm so- wah- um."
    },
    {
        "character": "Stan",
        "line": "Please, I don't wanna go on your field trip, Mackey."
    },
    {
        "character": "Randy",
        "line": "Stan? [Stan looks around] Stan!"
    },
    {
        "character": "Stan",
        "line": "Dad? Is that you?"
    },
    {
        "character": "Randy",
        "line": "Yes, it's me, Stan."
    },
    {
        "character": "Stan",
        "line": "Where are you?"
    },
    {
        "character": "Randy",
        "line": "It's me! Up here! [Stan looks up and sees him] I'm a butterfly!"
    },
    {
        "character": "Stan",
        "line": "The hell are you doing, dad?"
    },
    {
        "character": "Randy",
        "line": "I'm flying free with my beautiful butterfly wings!"
    },
    {
        "character": "Stan",
        "line": "Did you come here to help me?"
    },
    {
        "character": "Randy",
        "line": "I was gonna, but ooh! This is fun!"
    },
    {
        "character": "Stan",
        "line": "Dad, you gotta stop Mackey and bring us back to reality!"
    },
    {
        "character": "Randy",
        "line": "Butterflies have no concern for such things, Stan. I'm gonna go find me some butterly poon."
    },
    {
        "character": "Stan",
        "line": "DAD!"
    },
    {
        "character": "",
        "line": "in the lab, Randy is smiling"
    },
    {
        "character": "Randy",
        "line": "[moaning happily] Aah ahhh aha ahhh."
    },
    {
        "character": "Stan",
        "line": "[moaning in frustration] Aaaaaagh!"
    },
    {
        "character": "",
        "line": "The observation room. Pinkerton checks the printouts"
    },
    {
        "character": "Pinkerton",
        "line": "Uh oh, something's wrong."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "What is it?!"
    },
    {
        "character": "Pinkerton",
        "line": "The father. He's gone completely off chart."
    },
    {
        "character": "Sharon",
        "line": "Off chart? What does that mean?"
    },
    {
        "character": "Pinkerton",
        "line": "We don't even know."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "I told him not to go into the dream after his son. He should have waited for the experts to get here."
    },
    {
        "character": "Sharon",
        "line": "Who are the experts? [five men shooting guns enter the observation room, and one of them goes down with a gunshot wound]"
    },
    {
        "character": "Leonardo DiCaprio",
        "line": " Get that door closed! Keep me covered! [the expert in striped shirt shuts the door]"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Ah good, you're here."
    },
    {
        "character": "DiCaprio",
        "line": "What's the sitch?!"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Four people, in there, all stuck in the middle one's dream."
    },
    {
        "character": "Expert 1",
        "line": "We need to move them all to the next dream level before the projections kill them!"
    },
    {
        "character": "Sharon",
        "line": "What next dream level?"
    },
    {
        "character": "DiCaprio",
        "line": "Alright look. Right now they're all trapped in a dream. [Dr. Chinstrap resumes the accompaniment] We need to go in and put them under so they can go into a dream within a dream."
    },
    {
        "character": "Sharon",
        "line": "Why?"
    },
    {
        "character": "Expert 1",
        "line": "[Black Suit (Arthur)] Because in the dream within a dream we can protect them from getting to limbo."
    },
    {
        "character": "Sharon",
        "line": "What's that?"
    },
    {
        "character": "Expert 2",
        "line": "[in striped shirt (Eames)] Empty scary dreamspace."
    },
    {
        "character": "Sharon",
        "line": "So like a nightmare?"
    },
    {
        "character": "Expert 3",
        "line": "[African-American (Yusef)] No, like a nightmare within a nightmare!"
    },
    {
        "character": "Sharon",
        "line": "Why can't you wake up from that?"
    },
    {
        "character": "Expert 1",
        "line": "You can, but someone inside the dream has to kick you awake from the nightmare!"
    },
    {
        "character": "Sharon",
        "line": "That doesn't sound very difficult."
    },
    {
        "character": "Expert 1",
        "line": "It is!"
    },
    {
        "character": "Sharon",
        "line": "Why?"
    },
    {
        "character": "Expert 4",
        "line": "Arrgh."
    },
    {
        "character": "Expert 1",
        "line": "We don't have time for this!"
    },
    {
        "character": "Sharon",
        "line": "Uh okay, fine. So you're gonna take my son to a dream within a dream, and then what?"
    },
    {
        "character": "Expert 1",
        "line": "Then we go into your husband's dreams!"
    },
    {
        "character": "Sharon",
        "line": "Okaaay..."
    },
    {
        "character": "DiCaprio",
        "line": "But your husband will think we're in Hasselbeck's dream."
    },
    {
        "character": "Sharon",
        "line": "Okay, wait. Who's Hasselbeck?"
    },
    {
        "character": "Hasselbeck",
        "line": "I am."
    },
    {
        "character": "Sharon",
        "line": "Okay. Wait, no. Why do we need a football player?"
    },
    {
        "character": "DiCaprio",
        "line": "Sometimes, thoughts of my dead wife manifest themselves as trains!"
    },
    {
        "character": "Sharon",
        "line": "Are you all saying that you can go into a dream and take people in that dream into their own dream?"
    },
    {
        "character": "DiCaprio",
        "line": "Not all the time, just this once. And maybe one other time."
    },
    {
        "character": "Expert 1",
        "line": "It's so complex and cool."
    },
    {
        "character": "Sharon",
        "line": "Just because an idea is overly convoluted and complex doesn't make it cool! Going to multiple dream levels sounds like a really stupid idea!"
    },
    {
        "character": "DiCaprio",
        "line": "You just don't get it 'cause you're not smart enough. Let's move! [the five experts and Hasselbeck enter the lab and hook themselves up]"
    },
    {
        "character": "Sharon",
        "line": "Will they be able to wake Mackey up?"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "If they don't, it'll be the end of Europe as we know it."
    },
    {
        "character": "Sharon",
        "line": "Why?"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Because."
    },
    {
        "character": "",
        "line": "Frisco Woods, day. The class has arrived at its destination"
    },
    {
        "character": "Ranger Pete",
        "line": "Hello kids, my name is Ranger Pete."
    },
    {
        "character": "Class",
        "line": "Hi Ranger Pete."
    },
    {
        "character": "Mackey",
        "line": "Hi Ranger Pete, m'kay."
    },
    {
        "character": "Ranger Pete",
        "line": "Today we're gonna be learning all about these amazing evergreens and this fragile ecosystem."
    },
    {
        "character": "Mackey",
        "line": "Oh that should be fun, m'kay. [looks at Billy, who looks back and punches his right palm with his left fist. His voice trembles] Ahhhh..."
    },
    {
        "character": "Ranger Pete",
        "line": "But first we have a very special guest. It's Woodsy Owl. [Woodsy !Owl skips into view]"
    },
    {
        "character": "Mackey",
        "line": "Oh boy! Woodsy Owl!"
    },
    {
        "character": "Stan",
        "line": "Who's that?"
    },
    {
        "character": "Mackey",
        "line": "\"Give a hoot, don't pollute,\" m'kay."
    },
    {
        "character": "Woodsy Owl",
        "line": "Hi, I'm Woodsy Owl, remindin' you all to please pick up your trash, and keep our forests clean. In the city or in the woods,"
    },
    {
        "character": "Mackey",
        "line": "Help keep Americaaa lookin' good, m'kay. [claps] Oh, boy I love that song."
    },
    {
        "character": "Ranger Pete",
        "line": "Alright kids, time to split up and go into the forest. Let's divide you all up into groups of six."
    },
    {
        "character": "Billy",
        "line": "We wanna be in Mackey's group!"
    },
    {
        "character": "Mackey",
        "line": "Oh no, that that's m'kay. We'll uh we'll get paired with someone else uh."
    },
    {
        "character": "Ranger Pete",
        "line": "That's fine. You six boys can team up and be our first group in."
    },
    {
        "character": "Mackey",
        "line": "Oh no, oh God here it comes, unkay? [Stan looks at the ranger, then hears gunfire, so he turns to see where it's from. The group of experts is seen chasing and shooting at Butterfly Randy]"
    },
    {
        "character": "DiCaprio",
        "line": "Is this the dream, or the dream within the dream?"
    },
    {
        "character": "Expert 2",
        "line": "I think it's the dream inside the Matrix inside the dream!"
    },
    {
        "character": "DiCaprio",
        "line": "Oh well. Just keep shooting!"
    },
    {
        "character": "Stan",
        "line": "What the fuck?"
    },
    {
        "character": "",
        "line": "The lab. All the patients moan and ahhh"
    },
    {
        "character": "An Expert",
        "line": "Mommy? Mommy?"
    },
    {
        "character": "",
        "line": "The observation room. Pinkerton, Dr. Chinstrap, and Sharon are now accompanied by several firefighters, and they all observe the patients"
    },
    {
        "character": "Fire Captain",
        "line": "[turns to Dr. Chinstrap] So you're saying that all those people in there are somehow trapped in one person's dream?"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Yes, and so that's why I called the fire department. I don't know where else to turn."
    },
    {
        "character": "Fireman 1",
        "line": "But, wait, if those people got stuck in there, why wouldn't we?"
    },
    {
        "character": "Pinkerton",
        "line": "It's very simple: You see, [Dr. Chinstrap provides accompaniment once again] when the dream experts go in, they attempt to take the subject to a dream within a dream."
    },
    {
        "character": "Fireman 1",
        "line": "Like a taco within a taco?"
    },
    {
        "character": "Fire Captain",
        "line": "A double-decker taco supreme."
    },
    {
        "character": "Pinkerton",
        "line": "Exactly. But only dream spies have the ability to go deeper into dream levels, and firemen have the ability to bring ladders into other people's dreams."
    },
    {
        "character": "Fire Captain",
        "line": "Wait wait whoa whoa, how can you take a ladder into a dream? [Dr. Chinstrap continues his accompaniment, this time pulling a lamb by its tail and including its bleat]"
    },
    {
        "character": "Pinkerton",
        "line": "Because the firemen dreams aren't like dreams at all. They're more like a dream within a matrix within a dream."
    },
    {
        "character": "Pizza Man",
        "line": "Somebody order a pizza?"
    },
    {
        "character": "Pinkerton",
        "line": "No."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Probably one of them in the dream."
    },
    {
        "character": "Pizza Man",
        "line": "[determined] Alright, I'm goin' in. [goes into the lab. He goes to the first expert's couch, lays down next to him, and hooks himself up]"
    },
    {
        "character": "Pinkerton",
        "line": "Look, if we can get the fire department into the counselor's dream, then we can jump everyone down at least another six dream levels. That way we'll be in the counselor's deepest level of subconscious."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "And it will be like a taco, inside a taco, within a Taco Bell, that's inside a KFC, within a mall, that's INSIDE YOUR BRAIN! [provides his own accompaniment]"
    },
    {
        "character": "",
        "line": "Frisco Woods, a pleasant scene. A butterfly sits on a leaf doing nothing when Randy descends on it and starts humping it. Soon, Mackey runs by and both butterflies fly away separately. Stan and Mr. Yelman chase Mackey"
    },
    {
        "character": "Mackey",
        "line": "Aaaaaah! Not again, m'kay! Aaaaaah!"
    },
    {
        "character": "Stan",
        "line": "Mr. Mackey, stop running!"
    },
    {
        "character": "Mackey",
        "line": "But, but they're gonna kick my butt, m'kay! [stops briefly, then runs again] They're gonna kick it bad!"
    },
    {
        "character": "Stan",
        "line": "Look, dude! [catches up to Mackey and stops him] Whatever happened with those bullies, you just have to stop running and face it! It's just a dream dude! You can control what happens. Stand up to them this time."
    },
    {
        "character": "Mackey",
        "line": "I know what about? I don't remember what they did. I just remember the field trip being really bad, okay."
    },
    {
        "character": "Billy",
        "line": "There he is! You can't run forever!"
    },
    {
        "character": "Mackey",
        "line": "Oh god, oh god, oh god, oh god, oh god... [Mr. Yelman catches up]"
    },
    {
        "character": "Stan",
        "line": "Mr. Mackey, go, and face it! Please. So that we can get out of here and find out why we're hoarding."
    },
    {
        "character": "Mr. Yelman",
        "line": "But I literally herd sheep."
    },
    {
        "character": "Stan",
        "line": "Shut up!"
    },
    {
        "character": "Mackey",
        "line": "Okay. Okay, I can do this. I'm just gonna stand and, and face what happens, okay?"
    },
    {
        "character": "",
        "line": "The lab. The firemen have hooked themselves up and entered Mr. Mackey's dream."
    },
    {
        "character": "Pizza Man",
        "line": "Somebody... order pizza? Pizza?"
    },
    {
        "character": "Pinkerton",
        "line": "Mr. Mackey must be dreaming about something extremely traumatic."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Alright, that does it. [goes to the coat hanger and grabs his coat] Get your coat."
    },
    {
        "character": "Pinkerton",
        "line": "Where are we going?"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "We need to get help from the most powerful dream infiltrator in the world."
    },
    {
        "character": "Pinkerton",
        "line": "You don't mean..."
    },
    {
        "character": "",
        "line": "Deep in the woods, day. A small cabin is seen in the distance as three helicopters fly towards it. A familiar bogeyman is shown splitting wood with an axe."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Hello, Freddy. [the bogeyman turns around and it's Freddy Krueger, now with a full beard and mustache] You're looking healthy."
    },
    {
        "character": "Freddy Krueger",
        "line": "Chinstrap! What happened? You run out of stoolies to do your work?"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Alright, look, we're in a pickle again and we need your help. Got some people trapped inside a dream."
    },
    {
        "character": "Freddy Krueger",
        "line": "Told you a long time ago: I gave that up. [resumes splitting wood]"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "There's some good men stuck in there."
    },
    {
        "character": "Freddy Krueger",
        "line": "[stops and turns around, exasperated] I said I'm done with it! [the cabin door and a woman with two kids appears in the doorway]"
    },
    {
        "character": "Woman",
        "line": "Everything all right, Fred?"
    },
    {
        "character": "Freddy Krueger",
        "line": "It's fine, Peg. Get back in the house. [Peg tugs at her kids and they all go back inside]"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Wife and kids."
    },
    {
        "character": "Freddy Krueger",
        "line": "No thanks to you."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "We need ya Fred."
    },
    {
        "character": "Freddy Krueger",
        "line": "Like you needed me to kill those teenagers to stop the Russians?!"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "We had a country to protect!"
    },
    {
        "character": "Freddy Krueger",
        "line": "Protect it yourselves this time."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Dammit I'm not working for the military anymore, Krueger!"
    },
    {
        "character": "Freddy Krueger",
        "line": "Then you should have no problem covering it up. [resumes splitting wood]"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "[a few seconds later] Some of those trapped are firemen. Public servants, innocent in all of this."
    },
    {
        "character": "Freddy Krueger",
        "line": "[stops, sighs, and throws his axe away] Alright, fine."
    },
    {
        "character": "",
        "line": "Frisco Woods, day. Mackey and Billy finally face off and Mackey is ready to fight"
    },
    {
        "character": "Mackey",
        "line": "Alright Billy, I'm not gonna let you hurt me this time, hm'kay? This time I'm gonna stand up for myself!"
    },
    {
        "character": "Billy",
        "line": "You? Gonna fight back? I don't think so! [Stan and Mr. Yelman look on]"
    },
    {
        "character": "Stan",
        "line": "You can do it Mr. Mackey."
    },
    {
        "character": "Mackey",
        "line": "Go ahead and do your worst, Billy. I'm facing you head-on, m'kay?"
    },
    {
        "character": "Billy",
        "line": "Alright Mackey. Take this. [rears his right arm back and is about to deliver a punch when a gunshot kills him. A second gunshot hits him for good measure. The five experts converge on Billy and his friends and shoot them thoroughly]"
    },
    {
        "character": "DiCaprio",
        "line": "Get the perimeter secure! Make sure they're dead!"
    },
    {
        "character": "Stan",
        "line": "What the hell?"
    },
    {
        "character": "Expert 2",
        "line": "We got 'em! The bad memories are dead."
    },
    {
        "character": "Fire Captain",
        "line": "[through his bullhorn] Alright everyone, this is the fire department. Do not panic."
    },
    {
        "character": "Stan",
        "line": "Who are you people?"
    },
    {
        "character": "DiCaprio",
        "line": "We came here to rescue you from the bad guys in Mackey's dream."
    },
    {
        "character": "Stan",
        "line": "Well uh, wouldn't it be better to have Mackey face them on his own?"
    },
    {
        "character": "Expert 1",
        "line": "No. As long as the source of the drama is wiped out, the counselor can wake up."
    },
    {
        "character": "Expert 2",
        "line": "Right. [nothing happens]"
    },
    {
        "character": "Stan",
        "line": "...So then why aren't we waking up?"
    },
    {
        "character": "Expert 2",
        "line": "Unless... the bullies aren't the source of the counselor's bad memory."
    },
    {
        "character": "Mackey",
        "line": "Hey that's right. The bullies didn't even beat me up that day. I, I ran away from them."
    },
    {
        "character": "Expert 2",
        "line": "[strokes the back of his neck with his left hand] Oh, whoops."
    },
    {
        "character": "Mackey",
        "line": "[begins to walk away] I remember. [walks to a small shack nearby] I ran and I ran and I hid in this building here. And somebody was in there. Somebody who talked to me real nice and then... and then touched me somewhere bad. [pushes the door open. Woodsy is molesting the actual boy Mackey]"
    },
    {
        "character": "Real Mackey",
        "line": "No Woodsy! Hmkay? Don't touch muh pee pee. No Woodsy, please. I'll give a hoot, hm'kay?"
    },
    {
        "character": "Mackey",
        "line": "Woodsy Owl! No! I'll never litter again! I'll keep all my trash! No please Woodsy no! [the woods begin to rumble and shake]"
    },
    {
        "character": "Fire Captain",
        "line": "What's happening?"
    },
    {
        "character": "Expert 2",
        "line": "Dream conundrum. This is bad. [Woodsy breaks through the front wall of the shack with glowing red eyes and roars]"
    },
    {
        "character": "Fire Captain",
        "line": "What the hell's going on?"
    },
    {
        "character": "DiCaprio",
        "line": "The bad memory is manifesting itself! It didn't wanna be exposed! [Woodsy runs towards the group. The experts begin shooting at it and advance, but Woodsy remains unharmed] Our dream bullets don't hurt it. [Woodsy reaches for Mr. Yelman and decapitates him with a swipe of his left wing]"
    },
    {
        "character": "Mackey",
        "line": "No! No more, Woodsy. [hides his face]"
    },
    {
        "character": "Stan",
        "line": "Mr. Mackey, you have to wake up now!"
    },
    {
        "character": "Expert 1",
        "line": "He can't! Don't you get it?! We're all gonna go to limbo! [Woodsy roars again, and Freddy's blades rip through Woody's back and chest]"
    },
    {
        "character": "Freddy Krueger",
        "line": "There's a real hoot for ya, Woodsy! [pulls his blades out and Woodsy falls down dead]"
    },
    {
        "character": "Mackey",
        "line": "It's dead... It's finally dead. [grins]"
    },
    {
        "character": "",
        "line": "The observation room. Dr. Chinstrap reads the printouts this time"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Something's happening. I'm getting Bogart levels on all counter ups."
    },
    {
        "character": "Pinkerton",
        "line": "They're waking up. They're coming to. [enters the lab, and Dr. Chinstrap follows]"
    },
    {
        "character": "",
        "line": "The lab. Everyone is finally out of Mackey's dream"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Ahhh, you're back, everyone! [grins]"
    },
    {
        "character": "Randy",
        "line": "Aw, dammit. [Sharon is just happy Stan is back as they grin at each other]"
    },
    {
        "character": "Fire Captain",
        "line": "Thanks, Freddy."
    },
    {
        "character": "Freddy Krueger",
        "line": "If only I could have saved the sheep herder."
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Well, did you find the painful source of your hoarding problems, Mr. Mackey?"
    },
    {
        "character": "Mr. Mackey",
        "line": "I sure did."
    },
    {
        "character": "DiCaprio",
        "line": "Turns out he was molested by Woodsy Owl."
    },
    {
        "character": "Mr. Mackey",
        "line": "I completely blocked it from my memory, hm'kay?"
    },
    {
        "character": "Fire Captain",
        "line": "So, he was hoarding because when he tried to throw things away his subconscious would remember Woodsy's voice saying \"Give a hoot, don't pollute\" and touching his penis with his wing?"
    },
    {
        "character": "Pinkerton",
        "line": "Wow, that is so complex and trippy and cool!"
    },
    {
        "character": "Dr. Chinstrap",
        "line": "Well, now that we've uncovered Mackey's source of hoarding, we can finally move on to yours, Stan. Are you ready for your therapy?"
    },
    {
        "character": "Stan",
        "line": "[thinks a moment] I think I have a better idea."
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Stan is cleaning out his locker. Kyle and Wendy walk up to him"
    },
    {
        "character": "Wendy",
        "line": "Stan, did you find out the reason you've been hoarding?"
    },
    {
        "character": "Stan",
        "line": "Whatever it is, I don't wanna know. I'm just gonna throw this crap away like I should have to begin with."
    },
    {
        "character": "Kyle",
        "line": "But dude, there must be something in your past you're not dealing with."
    },
    {
        "character": "Stan",
        "line": "Don't care. After going through all that crap and seeing what happened to Mackey, I don't want any part of therapy!"
    },
    {
        "character": "Kyle",
        "line": "How do you know... [this stops Stan cold] that wasn't your therapy? [Dr. Chinstrap walks up and begins his accompaniment...]"
    }
]