[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "A new comic book. The speech bubbles give the hero away: this comic book is about Mintberry Crunch. On the page, two villains run from the flying half-man half-berry"
    },
    {
        "character": "Mintberry Crunch",
        "line": "Sit back, justice believers, and listen to another edition of America's favorite superhero, Mintberry Crunch! [The camera pulls out to reveal the whole page, which is a cover of \"the AMAZING MINTBERRY CRUNCH\"] Our story begins in a remote corner of the Gulf of Mexico. [a graphic of the BP oil rig is shown] The BP Oil Company drills into the ocean floor, [a graphic of a fire destroying the rig] but they drill too much, and the BP Oil Company accidentally unleashes Cthulhu, an ancient evil god from another dimension. Halfway across the country, [Coon & Friends in their normal outfit are shown, with Bradley as the leader instead of Stan] a mild-mannered attractive fourth-grader, Bradley Biggle, hears of the disaster on the news while with his friends. [the page flips over and Bradley is shown transforming] But Bradley Biggle is no ordinary fourth-grader! Not long ago, he realized he had superpowers he could call upon by turning in place and saying the magic word, \"Shablagoo!\" And in a flash, Bradley is transformed into the thrilling superhero, Mintberry Crunch! Joined by the other Coon Friends, Mintberry Crunch went to investigate the Gulf spill crisis! The superheroes came across a cult, in existence for years, that had been waiting for Cthulhu's arrival. They are the key to stopping Cthulhu from taking over the world! Sometimes, when everything seems hopeless, that's when you need to bring it all. [Mintberry Crunch stands at the corner of a roof in a heroic pose] That's when you need... to bring the Crr-runch!"
    },
    {
        "character": "",
        "line": "Coon and Friends Secret Base. The Friends are there listening to Mintberry Crunch"
    },
    {
        "character": "Toolshed",
        "line": "[after a few seconds of silence] Dude, I'm sorry, but we still aren't getting it. You're half man and half berry?"
    },
    {
        "character": "Mintberry Crunch",
        "line": "Rrright!"
    },
    {
        "character": "Human Kite",
        "line": "But then what exactly is your superpower?"
    },
    {
        "character": "Mintberry Crunch",
        "line": "The power of mint and berries yet with a satisfying tasty crunch!"
    },
    {
        "character": "Toolshed",
        "line": "...Nah, see, that's the problem dude, that's not really a superpower. Like, I have mental command over all power tools, Human Kite can fly-"
    },
    {
        "character": "Human Kite",
        "line": "And shoot lasers out of my eyes."
    },
    {
        "character": "Toolshed",
        "line": "And shoot lasers out of his eyes. And Mysterion can... [pauses and looks over at Mysterion.] Wait, what's your superpower Mysterion?"
    },
    {
        "character": "Mysterion",
        "line": "[with his back to the group] I can't die!"
    },
    {
        "character": "Toolshed",
        "line": "...Oh yeah, good one. Mysterion can't die, and Iron Maiden is indestructible-"
    },
    {
        "character": "Mysterion",
        "line": "No, Stan, I'm being serious! I really, really can't die!"
    },
    {
        "character": "Toolshed",
        "line": "...Woo-hat?"
    },
    {
        "character": "Mysterion",
        "line": "[turns to face them] Like last night, in the alley, the cult leader stabbed me and I bled all over the place! And you screamed \"Oh my God,\" and you called him a bastard!"
    },
    {
        "character": "Human Kite",
        "line": "[arms down and out, palms out] When was that?"
    },
    {
        "character": "Mysterion",
        "line": "All the time! I die all the time! And you assholes NEVER REMEMBER!"
    },
    {
        "character": "Toolshed",
        "line": "...Ah I think we would remember you dying, dude."
    },
    {
        "character": "Mysterion",
        "line": "Well you don't! I die over. And over! Only to wake up in my bed like nothing happened!"
    },
    {
        "character": "Toolshed",
        "line": "[notices Mintberry Crunch] Dude, you're freaking out Mintberry Crunch. He's peed his pants. [Mintberry Crunch notices that he has indeed peed his pants and covers his groin quickly]"
    },
    {
        "character": "Mintberry Crunch",
        "line": "Nono. Mintberry Crunch doesn't ever pee his pants!"
    },
    {
        "character": "Mysterion",
        "line": "[turns away] I knew there'd be no point in telling you guys."
    },
    {
        "character": "Human Kite",
        "line": "[approaches him] Alright. dude, let, let's just say you're not crazy and it's true. What's the big deal? I mean, I think it'd be pretty cool not to be able to die."
    },
    {
        "character": "Mysterion",
        "line": "[confronts him] Pretty cool?! Do you know what it feels like to be stabbed?! To be shot?! Decapitated?! Torn apart?! Burned?! Run over?!"
    },
    {
        "character": "Toolshed",
        "line": "Kenny Kenny, calm down."
    },
    {
        "character": "Mysterion",
        "line": "It's not pretty cool, Kyle! It fuckin' hurts! And it won't go away, and nobody will believe me! [walks away, then turns around] Remember this time! Try and fuckin' remember! [pulls out a gun and shoots himself in the head]"
    },
    {
        "character": "Toolshed",
        "line": "Oh my God! Holy shit, dude!"
    },
    {
        "character": "Human Kite",
        "line": "Dude!"
    },
    {
        "character": "Mintberry Crunch",
        "line": "Is he? Oh Jesus! [flees up the stairs and out of the basement]"
    },
    {
        "character": "Toolshed",
        "line": "[draws closer] Kenny? No! No!"
    },
    {
        "character": "",
        "line": "The Coon comic book. On the cover, Cartman carries an American flag while Cthulhu stands behind him wearing a Coon and Friends shirt. The story unfolds with a few embellishments in the design of the secret base"
    },
    {
        "character": "Coon",
        "line": "Gather around, believers in good, and listen to the newest installment of The Coon. It all began when the BP Oil Company drilled into the ocean floor and ripped open a hole into another dimension. Seeing the disaster on Coon-Vision, the Coon immediately called together his trusty Coon Friends. As the Coon explained how the disaster could be stopped, something terrible happened. Without warning, the Coon friends changed. Their superpowers morphed somehow, turning them into... supervillains. [the friends are depicted with evil grins] The Coon tried to reason with them, tried to bring them back to the side of good, [\"Heroes must be good. Go with Christ!\"] but it was too late. [Human Kite: \"GET OUT!!!\" Mysterion: \"WE ARE EVIL NOW!\"] Their black hearts had been tainted by hate and rage. The Coon was alone, turn by the ultimate dilemma. [Coon is shown sitting on Lincoln's shoulder at the Lincoln Memorial] He had to put a stop to the evil villains, even though they had once been his friends. Sometimes, to fight the ultimate evil, you must make friends with enemies. [Coon is showing looking at Cthulhu] The Coon teamed up with Cthulhu, because even Cthulhu knows what evil assholes Kyle and Stan and those guys are! And that they are manipulative, uncaring, vagina faces! They're all planning to destroy the world. Only one thing can stop them: the Coon. With Cthulhu's help, I can try to banish them to a dark oblivion, for all eternity. [the Friends are shown surrounding a glowing globe of Earth with evil grins on their faces] I will not rest until that happens."
    },
    {
        "character": "",
        "line": "South Park, Cartman's street, day. Cartman is walking home and approaches the front door"
    },
    {
        "character": "Coon",
        "line": "Bab-ay,\nI know you're askin' me to stay\nSay \"Please please please don't go away.\"\nYou say I'm givin' you the blues.\n[enters the house]\nMayb-ay,\nyou mean every word you say\nCan't help but think-\n\n\n\n"
    },
    {
        "character": "Liane",
        "line": "[confronts him with her arms crossed over her chest] Eric Cartman!"
    },
    {
        "character": "Coon",
        "line": "Hi Mom."
    },
    {
        "character": "Liane",
        "line": "Where have you been, young man?!"
    },
    {
        "character": "Coon",
        "line": "Just doin' stuff Mom. Are my friends downstairs in the secret base?"
    },
    {
        "character": "Liane",
        "line": "Yes they are, but you were supposed to be grounded in your room! And now you're more grounded, young man!"
    },
    {
        "character": "Coon",
        "line": "[turns around and thinks hard, to himself] The Coon's mother appears to be extremely upset. In order to get past her, I must use the LeBron James technique."
    },
    {
        "character": "Liane",
        "line": "Eric, are you listening to me?!"
    },
    {
        "character": "Coon",
        "line": "[faces Liane] Mom... what should I do?"
    },
    {
        "character": "Liane",
        "line": "[disarmed] What?"
    },
    {
        "character": "Coon",
        "line": "What should I do? Should I admit I made mistakes? Should I say I've done this before? Should I write a song about how I should have stayed in my room? What should I do?"
    },
    {
        "character": "Liane",
        "line": "What do you mean \"what should-\""
    },
    {
        "character": "Coon",
        "line": "Should I say I am not a role model? Should I not listen to my conscience? It's my conscience, Mom! What should I do? Go back to my room and pretend nothing happened? Not jump out the window and fly to New Orleans? What should I do, Ma? Tell me!"
    },
    {
        "character": "Liane",
        "line": "[overwhelmed] I just, I- I'm gonna go make you kids some lemonade. [runs off to the kitchen]"
    },
    {
        "character": "",
        "line": "Coon and Friends Secret Base. The Friends are at the table"
    },
    {
        "character": "Human Kite",
        "line": "Alright Coon and Friends, what good deed should we do next?"
    },
    {
        "character": "Mosquito",
        "line": "Perhaps we should make more lemon bars to raise money for people in need."
    },
    {
        "character": "TupperWear",
        "line": "Okay!"
    },
    {
        "character": "Mysterion",
        "line": "You guys have no memory of me shooting myself in the head, do you?"
    },
    {
        "character": "Toolshed",
        "line": "Uh-what?"
    },
    {
        "character": "Mysterion",
        "line": "What we need to do is talk to people in that cult! I wanna know where my powers come from."
    },
    {
        "character": "Human Kite",
        "line": "Yeah cool let's talk about where our powers come from."
    },
    {
        "character": "Mosquito",
        "line": "I was bitten by a radioactive mosquito! Bzzzzzzt."
    },
    {
        "character": "TupperWear",
        "line": "I was in a car accident, then put back together with Tupperware parts."
    },
    {
        "character": "Iron Maiden",
        "line": "Tih-Timmieh!"
    },
    {
        "character": "Mysterion",
        "line": "Will you guys listen to me?! I actually have a power that I actually want to know about!"
    },
    {
        "character": "Coon",
        "line": "[appearing on the basement stairs] Hey guys. [the Friends look at him] So, what's goin' on?"
    },
    {
        "character": "Toolshed",
        "line": "Go away Cartman. We kicked you out of Coon and Friends, remember?"
    },
    {
        "character": "Coon",
        "line": "No, I, I know. That's cool, I understand. Even though I started it and the secret base is in my house. Yes, that's totally understandable."
    },
    {
        "character": "Human Kite",
        "line": "You just wanted to frame and blackmail people, then you beat up Clyde and Bradley for no reason!"
    },
    {
        "character": "Coon",
        "line": "No you're right. For no reason. Clearly something is wrong with me. But you guys, what should I do?"
    },
    {
        "character": "Human Kite",
        "line": "You should fuck off, that's what you should do."
    },
    {
        "character": "Coon",
        "line": "[sees the LeBron James technique isn't working] Hm. Ah, all right, look. You guys were totally right, okay? That's all I wanted to say. That and... there's a double rainbow outside."
    },
    {
        "character": "Mintberry Crunch",
        "line": "A what?"
    },
    {
        "character": "Coon",
        "line": "Double rainbow, you guys. You don't see 'em often, but there's one outside right now. You've gotta come see! [rushes up the stairs and out of the secret base]"
    },
    {
        "character": "Mintberry Crunch",
        "line": "A double rainbow? Shablagoo! [the heroes all leave their seats]"
    },
    {
        "character": "Human Kite",
        "line": "Wait, Mintberry Crunch ya you might not wanna go- [goes up the stairs with the others]"
    },
    {
        "character": "Professor Chaos",
        "line": "Huhey, can I see the double rainbow, fellas? [softly] Uh, fellas?"
    },
    {
        "character": "",
        "line": "Cartman's house, front lawn, day. Coon leads the friends out"
    },
    {
        "character": "Coon",
        "line": "Isn't it beautiful you guys?"
    },
    {
        "character": "Human Kite",
        "line": "There's no double rainbow, fatass!"
    },
    {
        "character": "Coon",
        "line": "You are correct, Human Kike! Not that supervillains like you guys could ever see a double rainbow!"
    },
    {
        "character": "Mosquito",
        "line": "What are you talking about?"
    },
    {
        "character": "Coon",
        "line": "Your evil-doing days are over, Mosquito! All of you shall now be dealt the swift hand of justice!"
    },
    {
        "character": "Human Kite",
        "line": "Cartman, you are the bad guy, not us!"
    },
    {
        "character": "Coon",
        "line": "Nuh uh, you guys are the bad guy. [whistles. A gust of wind blows leaves at the boys, and heavy footsteps follow. Cthulhu soon stands before the Friends, who look at him in awe]"
    },
    {
        "character": "Mintberry Crunch",
        "line": "Waaaaaaaaaah! [runs off]"
    },
    {
        "character": "Mysterion",
        "line": "What are you doing with that thing?!"
    },
    {
        "character": "Coon",
        "line": "He's going to help me get rid of you guys so together we can make the world a better place!"
    },
    {
        "character": "Human Kite",
        "line": "Cartman, if you team up with the most evil thing in the universe, then clearly you are the bad guy!"
    },
    {
        "character": "Coon",
        "line": "No, because it's for the greater good, like when Superman teamed up with Lex Luthor!"
    },
    {
        "character": "Human Kite",
        "line": "Superman never teamed up with Lex Luthor!"
    },
    {
        "character": "Coon",
        "line": "[thinks it over, then crosses his arms] Well, that's why Superman isn't around anymore, isn't it? Cthulhu! Banish them to a dark oblivion, please! [Cthulhu opens his right paw and sweeps it from left to right in the air. The boys scream and become deformed, then disappear] Aww! Dude, that was awesome! You're all like \"Mehhhh\" and they were all like \"Nooo!\""
    },
    {
        "character": "",
        "line": "Night. Coon and Cthulhu sit in a valley somewhere with a large city in the distance."
    },
    {
        "character": "Coon",
        "line": "All right, now, we've taken out most of the synagogues, destroyed San Francisco, sent my friends into a dark oblivion, and so our next order of business will be Burning Man. [Cthulhu roars softly] Burning Man is the biggest hippie festival in the world, and tomorrow, we're gonna wipe them all out. Pretty soon, the whole world will be transformed thanks to the Coon! [Cthulhu roars softly] Yes yes, the Coon and Friend. Now after Burning Man we'll take down Whole Foods alright? [Cthulhu repositions himself to confront Coon and roars loudly. Coon thinks] The dark lord is agitated and the LeBron James technique might not work. The Coon will have to use an even more manipulative technique. Time to bust out: Cute Kitten. [aloud] Meow meow meow meow meow meow meow. [climbs up onto Cthulhu.] Meow meow meow. [digs his blades into Cthulhu's back and massages him while at the same time making a comfortable place to nap in. Cthulhu's face softens and he giggles, then looks back at Cartman sleeping on his back. Cthulhu blinks several times, then walks forward softly]"
    },
    {
        "character": "",
        "line": "a strange place altogether"
    },
    {
        "character": "Toolshed",
        "line": "Dude, where the fuck are we?"
    },
    {
        "character": "Mysterion",
        "line": "I don't know, but... I feel like... I've... been here before. [huge butterfly-like creatures pop up from behind some plants]"
    },
    {
        "character": "",
        "line": "a new installment of the Amazing Mintberry Crunch. He remembers things a bit differently..."
    },
    {
        "character": "Mintberry Crunch",
        "line": "And so, the Coon had returned with the dark lord Cthulhu! Upon seeing Cthulhu in person, Mintberry Crunch heroically dashed off, to, to save the day! With Minty coolness he hurried back home! And heroically watched Judge Judy, knowing that his superhero friends were probably just fine without him!"
    },
    {
        "character": "",
        "line": "the strange place. The Friends run and scream until they reach a cliff"
    },
    {
        "character": "Toolshed",
        "line": "Oh shit!"
    },
    {
        "character": "Human Kite",
        "line": "[panting] We aren't going that way!"
    },
    {
        "character": "Mosquito",
        "line": "You guys, I wanna go home."
    },
    {
        "character": "Toolshed",
        "line": "We all wanna go home, Clyde. I don't think we're gonna last very long out here."
    },
    {
        "character": "Mosquito",
        "line": "Look, maybe we should just find a place to hide and wait for help."
    },
    {
        "character": "Human Kite",
        "line": "What help, dude? Nobody in the real world even knows we're here."
    },
    {
        "character": "Mysterion",
        "line": "Alright, you guys hide as long as you can. I'll try and find help. [moves away from the cliff]"
    },
    {
        "character": "Toolshed",
        "line": "How, dude?"
    },
    {
        "character": "Human Kite",
        "line": "Kenny, where the hell are you going?"
    },
    {
        "character": "Mysterion",
        "line": "I'm going to try to get you all out of here. If this works. Or, I could be wrong. [runs towards the cliff]"
    },
    {
        "character": "Mosquito",
        "line": "Kenny! [Kenny jumps off the cliff and impales himself on some big spiky plants ]"
    },
    {
        "character": "Mysterion",
        "line": "Ow! That fucking HURTS! [moans a few times and dies.]"
    },
    {
        "character": "Toolshed",
        "line": "Oh my God! Kenny!"
    },
    {
        "character": "Human Kite",
        "line": "You... you crazy bastard! [the boys turn away from the edge, seemingly forgetting their dead friend below]"
    },
    {
        "character": "",
        "line": "Kenny's room, night. Kenny is back in his bed and wakes up. He sits up and checks himself out. Satisfied that he's alright, he jumps off the bed and goes to his closet, opens it and pulls a curtain off a hidden chest of drawers. He opens the top drawer and pulls out a Mysterion costume."
    },
    {
        "character": "",
        "line": "The living room. As his parents watch TV, Kenny runs past them and out the front door."
    },
    {
        "character": "",
        "line": "Burning Man Festival, Black Rock City, day. Dance music pumps along"
    },
    {
        "character": "Man 1",
        "line": "[on a fish-cycle] It's burning Man!"
    },
    {
        "character": "Man 2",
        "line": "[dressed as an angel] Biggest party in the world, baby! [more shots of the festival are shown. It's a carnival, but a roar changes all that. Cthulhu appears and throws an RV into the festival, and everyone scatters]"
    },
    {
        "character": "Coon",
        "line": "[on Cthulhu's back] Fucking hippies! Fuck all o'you! [Cthulhu raises his left paw and unleashes a lightning bolt upon a girl, incinerating her and leaving nothing but bones]"
    },
    {
        "character": "Reporter",
        "line": "The dark and evil Cthulhu is bringing his angry wrath down upon the Burning Man Festival, Tom. Cthulhu isn't behaving as most scientists had speculated, Tom, but the dark lord is wreaking havoc everywhere and-"
    },
    {
        "character": "Coon",
        "line": "[walks up and interrupts him] No nonono! Excuse me! It is not Cthulhu, it is Coon and Friend! I'm a little sick of everyone giving him all the credit when I'm the one really making the world a better place!"
    },
    {
        "character": "Reporter",
        "line": "Tom, it appears that Bruce Vilanch has arrived on the scene wearing a rat costume."
    },
    {
        "character": "Coon",
        "line": "[greatly insulted by the reporter's comment] Oh, you motherfucker! [runs towards Cthulhu] Cthulhu, this guy too! [Cthulhu unleashes more lightning and the reporter is incinerated] Kewl. Oh get that fire-twirling hippie bitch."
    },
    {
        "character": "",
        "line": "Henrietta's bedroom, night. The Goth kids are sitting around on her red throw rug. Red Goth strikes a lighter and it lights up. He then blows out the flame. Kindergoth taps his cigarette onto an ash tray."
    },
    {
        "character": "Michael",
        "line": "This freaking sucks! We worshiped and prayed to Cthulhu, went to all the cult meetings, but life is still totally freaking gay."
    },
    {
        "character": "Pete",
        "line": "I thought that when Cthulhu rose from the dead all was gonna be darkness and pain. I thought at least school would be canceled."
    },
    {
        "character": "Mysterion",
        "line": "How to I fight him? [the Goth kids look at the window and see him there]"
    },
    {
        "character": "Michael",
        "line": "Oh joy, it's Underwear Boy again."
    },
    {
        "character": "Mysterion",
        "line": "That god you pray to just took away all my friends."
    },
    {
        "character": "Pete",
        "line": "Not our god. He promised everything would change if we worshiped him, but we're still sitting here smoking cigarettes like before [hair flip] It's like Obama all over again."
    },
    {
        "character": "Mysterion",
        "line": "How do I fight him?!"
    },
    {
        "character": "Pete",
        "line": "Cthulhu isn't alive or dead, alright?"
    },
    {
        "character": "Mysterion",
        "line": "Tell me what that means! [the bedroom door opens and Henrietta's mom appears]"
    },
    {
        "character": "Mrs. Biggle",
        "line": "Henrietta, your little brother wants to play with you."
    },
    {
        "character": "Henrietta",
        "line": "Go away Mom, I hate you."
    },
    {
        "character": "Mrs. Biggle",
        "line": "Just let your little brother play with your friends, sweetie. He's lonely. Go on in, Bradley. [Bradley appears and enters the room]"
    },
    {
        "character": "Bradley",
        "line": "Will you guys play with me?"
    },
    {
        "character": "Henrietta",
        "line": "Fuck off, dork! I don't want you here!"
    },
    {
        "character": "Bradley",
        "line": "Please, can I just- oh g'uh! [sees Mysterion in the window] Mu-Mysterion! Wuh what's goin'- Uh, that's okay, sis. I'll play with you another time. [leaves and closes the door]"
    },
    {
        "character": "",
        "line": "the hallway. Bradley round the corner and walks to his room"
    },
    {
        "character": "Bradley",
        "line": "Mysterion is here! He must have come for my help. [enter his room] No time to waste. Time for Bradley Biggle to transform. [opens a drawer under his nightstand and sees his costume] Shablagoo! [turns in place]"
    },
    {
        "character": "",
        "line": "Henrietta's bedroom. As Bradley transforms, Henrietta explains to Mysterion how to fight Cthulhu. She starts with the Necronomicon"
    },
    {
        "character": "Henrietta",
        "line": "Alright, look. The Necronomicon is an account of the Old Ones, their history, and the means for summoning them. [the first page shows a Prince Abdul Al-Kazred in 700 A.D. The next one has the prince genuflecting before an Old One.]"
    },
    {
        "character": "Mysterion",
        "line": "Old Ones?"
    },
    {
        "character": "Michael",
        "line": "Dark deities that existed before man."
    },
    {
        "character": "Henrietta",
        "line": "It was written by a mad prince who knew of the nightmare city of R'Lyeh, which fell from the stars and exists beneath the sea. And, in another dimension."
    },
    {
        "character": "Mysterion",
        "line": "That's it! That's the place I just was!"
    },
    {
        "character": "Michael",
        "line": "You've been to the nightmare city of R'Lyeh?"
    },
    {
        "character": "Pete",
        "line": "Luckyyy..."
    },
    {
        "character": "Henrietta",
        "line": "Cthulhu and other beings are from this city, but for years cultists have tried to bring them into our world."
    },
    {
        "character": "Mysterion",
        "line": "And what about Cthulhu's power? Why can't Old Ones die?"
    },
    {
        "character": "Henrietta",
        "line": "The only thing that can destroy an immortal... is another immortal. [Henrietta's door opens again and Mintberry Crunch barges into the room]"
    },
    {
        "character": "Mintberry Crunch",
        "line": "Ahaaa! Don't worry, Mysterion. Mintberry Crunch is here to help you with these black cultists!"
    },
    {
        "character": "Henrietta",
        "line": "Get out of my room, TWERP!"
    },
    {
        "character": "Mintberry Crunch",
        "line": "Mintberry Crunch isn't afraid of his fat sister! Grab her legs, Mysterion! [Mysterion is gone] M- Mysterion? [the Goth kids turn to look at the window.] Aw crap. [runs out of the room]"
    },
    {
        "character": "",
        "line": "The street. Mysterion walks down the street briskly when Mintberry Crunch opens the front door and sees him"
    },
    {
        "character": "Mintberry Crunch",
        "line": "Hey Mysterion, wait up! [leaves the door open] Come on, wait uuup! [catches up to him] Us Coon Friends need to stick together remember? Where are you going?"
    },
    {
        "character": "Mysterion",
        "line": "Wherever Cthulhu is!"
    },
    {
        "character": "Mintberry Crunch",
        "line": "What? But he'll kill you."
    },
    {
        "character": "Mysterion",
        "line": "Maybe, but with any luck I might find the reason for my powers."
    },
    {
        "character": "Mintberry Crunch",
        "line": "Oh right. Maybe I can find the reason for my powers too."
    },
    {
        "character": "Mysterion",
        "line": "You don't understand!"
    },
    {
        "character": "Mintberry Crunch",
        "line": "[turns away from Mysterion] How was it that mint and berry came together delivering full flavor in an intense crunch? [Mysterion leaves] We must find out answers Mysterion. [turns around, but doesn't immediately see him] Mu-Mysterion, I'm going with you."
    },
    {
        "character": "",
        "line": "The Coon comic book, four pages in"
    },
    {
        "character": "Coon",
        "line": "After the triumphant victory over the evil hippies of Burning Man, Coon and Friends turned their attention to the next villainous scourge, bravely taking out every Whole Foods left in the country! No more organic crap for America! Thanks to Coon and Friends the country would soon be rid of all evil, but first, they would come up against their most challenging and most evil opponent, Justin Bieber. In order to save the Earth, this little butthole had to be stopped."
    },
    {
        "character": "",
        "line": "Justin Bieber concert at Staples Center"
    },
    {
        "character": "Justin Bieber",
        "line": "[grabbing his crotch constantly, and singing badly off-key] Babih babih babih oooo! Babih babih babih oooo! Babig baibig woo woo, Bay-wooo [Cthulhu reaches down and grabs him off the stage] Wooooo-ooo-oo! [Cthulhu grumbles]\n\n\n"
    },
    {
        "character": "Coon",
        "line": "Yep, that's him. So long, Justin Bieber, you little douchebag! [Cthulhu crushes Bieber between his forefinger and thumb like a grape]"
    },
    {
        "character": "Reporter 2",
        "line": "The dark god Cthulhu continues his rampage of destruction and terror, and there seems to be no hope for man. I'm joined now by a supposed team member of Cthulhu, the Coon."
    },
    {
        "character": "Coon",
        "line": "It isn't just Cthulhu, Mr. Reporter. He's merely a small piece of Coon and Friends, who will continue to fight for good and justice."
    },
    {
        "character": "Reporter 2",
        "line": "Good and justice? J-Justin Bieber and most of his fans have just been massacred."
    },
    {
        "character": "Coon",
        "line": "Yes, Coon and Friends are happy to help. We do not need thanks for our deeds. We do not want gifts, all we want is for people to buy our Coon and Friends T-Shirts for $14.95."
    },
    {
        "character": "Mysterion",
        "line": "Hey, fat boy!"
    },
    {
        "character": "Coon",
        "line": "Kenny? What the hell? I sent you to the-"
    },
    {
        "character": "Mysterion",
        "line": "To the sunken city of R'Lyeh fallen from the stars! [approaches him] You little fucking prick! What is wrong with you?! What kind of sick fuck does that to his friends?!"
    },
    {
        "character": "Coon",
        "line": "It's not my fault you guys turned evil, Kenny!"
    },
    {
        "character": "Mysterion",
        "line": "You are the bad guy, fat boy! YOU!"
    },
    {
        "character": "Coon",
        "line": "I'm going around making the world a better place!"
    },
    {
        "character": "Mysterion",
        "line": "For you! You're making it a better place for you!"
    },
    {
        "character": "Coon",
        "line": "Right, that's what superheroes do."
    },
    {
        "character": "Mysterion",
        "line": "No! This is what superheroes do! [walks up to Cthulhu] You banished me but I'm back! What does that make me?! [that gets Cthulhu's attention] Bring back my friends! Take me!"
    },
    {
        "character": "Mintberry Crunch",
        "line": "[gets through the police line] Mysterion, no! What are you doing?!"
    },
    {
        "character": "Mysterion",
        "line": "[to Mintberry Crunch] Only an immortal can kill another immortal! [to Cthulhu] Here's your prize! Take this curse away from me, you big pussy!"
    },
    {
        "character": "Coon",
        "line": "[stands next to Mysterion] Don't listen to him Cthulhu! We have more important stuff to do!"
    },
    {
        "character": "Mysterion",
        "line": "Go on! Kill me before I kill you! But bring my friends back, wuss!"
    },
    {
        "character": "Coon",
        "line": "Cthulhu, you are a Coon Friend, and I'm the Coon! You will listen to me! [Cthulhu picks Coon up and scolds him, then cradles him. Coon takes the hint and scrambles onto Cthulhu's back. Coon kneads Cthulhu's back again and Cthulhu is relieved. Coon is asleep on Cthulhu's back and Cthulhu turns and walks away]"
    },
    {
        "character": "Mysterion",
        "line": "No! Come back! I have to know what I am! Come back!"
    },
    {
        "character": "Coon",
        "line": "Fuck you, Kenny!"
    },
    {
        "character": "Mysterion",
        "line": "Come back, you fat piece of shit! [notices something in the sky. Others notice too. A bright object descends onto the parking lot and dims enough to reveal a giant oval shaped light that serves as a holograph. An image of a man appears inside and begins to talk. Mysterion is puzzled]"
    },
    {
        "character": "Alien Man",
        "line": "Hello my son. If you are seeing this message, then it must be dark times. And you must have many questions. Your true name is Gok'Zarah. The power given to you comes from a planet far away. You are from that planet, Gok'Zarah. It is for that reason you have a power that normal humans do not have. I know you must sometimes see this power as a curse, but you were sent here to stop evil from taking over the Earth and now, that time has apparently come. You must now harness and focus your power, Gok'Zarah. The power of mint and berries yet with a tasty, satisfying crunch."
    },
    {
        "character": "Mintberry Crunch",
        "line": "...Uh yes. Yes, please go on."
    },
    {
        "character": "Alien Man",
        "line": "Your home planet, K'oh Kajan, is known throughout the universe for its berry mines. Berries that have the power to fuel nearly anything. Needless to say, when the mint hunters of Kogenrah got word of them, our fate was already sealed, Gok'Zarah. But our two worlds collided and soon, mint and berry were one."
    },
    {
        "character": "Mintberry Crunch",
        "line": "Wow!"
    },
    {
        "character": "Alien Man",
        "line": "Your mother and I sent you as far away as we could. Use your power, son. Save Earth. Shablagoo! [the orb rises up and away]"
    },
    {
        "character": "Mintberry Crunch",
        "line": "I will, father. No more running away for... Mintberry Crunch! [jumps up in the air and floats up, then aims at Cthulhu and flies towards him] Hello, Cthulhu, I heard you haven't been \"berry\" nice! [unleashes a torrent of berries at him. Cthulhu shields himself, but doesn't go down.] Not enough, huh? Maybe the intense flavor of mint will freshen things up! [Cthulhu is soon enveloped in a tornado of mint leaves]"
    },
    {
        "character": "",
        "line": "The Amazing Mintberry Crunch. The following is illustrated in the comic book"
    },
    {
        "character": "Mintberry Crunch",
        "line": "I reached the Gulf of Mexico in no time, and with all my strength, I dragged Cthulhu back to the depths from whence he came! My trusty hero companions were there, still alive. I returned them to their world encased in a protective berry bubble. Then it's back down to fill up the hole created by the BP Oil Company, returning home only momentarily to flip off my fat sister. [\"Fuck you! I have powers you fat bitch!\"]"
    },
    {
        "character": "",
        "line": "Coon and Friends Secret Base, later. The Coon Friends are all there"
    },
    {
        "character": "Toolshed",
        "line": "Dude, thanks for getting us out of that dark oblivion, Mintberry Crunch."
    },
    {
        "character": "Mintberry Crunch",
        "line": "Oh no, we worked as a team! All the Coon and Friends stopped the BP drilling spill crisis."
    },
    {
        "character": "Human Kite",
        "line": "And finally the evil Coon is right where he belongs. [the Coon is in his own holding cell with Professor Chaos]"
    },
    {
        "character": "Coon",
        "line": "Come on you guys, this is fucking bullcrap! Let me out!"
    },
    {
        "character": "Human Kite",
        "line": "You're not going anywhere for a long time!"
    },
    {
        "character": "Coon",
        "line": "This is inhumane! There's a big bucket with Butters' poop in here, and there's nothing to eat!"
    },
    {
        "character": "Toolshed",
        "line": "Ya got poop, don't ya?"
    },
    {
        "character": "Mintberry Crunch",
        "line": "Well, I'm off. There are still many more questions left unanswered. I need to know what happened to my parents."
    },
    {
        "character": "Human Kite",
        "line": "Well, come back and visit any time, dude."
    },
    {
        "character": "Mintberry Crunch",
        "line": "I will. Shaaablagoo! [twirls in place and disappears in a streak of light, leaving behind berry cereal]"
    },
    {
        "character": "Coon",
        "line": "Fuckin' Mintberry fuckin' Crunch."
    },
    {
        "character": "Toolshed",
        "line": "Wow, can you believe it Kenny? Bradley actually had superpowers. Isn't that cool?"
    },
    {
        "character": "Mysterion",
        "line": "Yeah. I'm tired, guys. I think I'm gonna go to bed. [takes a gun out and just shoots himself in the head. The other boys jump back in shock.]"
    },
    {
        "character": "Toolshed",
        "line": "Oh my God! Holy shit dude!"
    },
    {
        "character": "Human Kite",
        "line": "Kenny? No! Nooo!"
    },
    {
        "character": "",
        "line": "Kenny's parents room, night. They're asleep, but something wakes Carol up. Stomach pains; labor pains. She sits up holding her belly"
    },
    {
        "character": "Stuart",
        "line": "What? Whaaat?!"
    },
    {
        "character": "Carol",
        "line": "It's happenin' again! [falls back on the bed and raises her legs in the air.]"
    },
    {
        "character": "",
        "line": "Kenny's room, moments later. The parents enter. Stuart turns on the light. Carol holds baby Kenny in her arms while Stuart sets out a parka for Kenny to sleep in. Carol zips it up and the parents leave the room"
    },
    {
        "character": "Carol",
        "line": "[before closing the door] We should have never gone to that stupid cult meetin'. [Stuart turns off the light and Carol closes the door]"
    }
]