[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary Cafeteria, lunchtime. The students are eating lunch. Butters holds court at a table. Around him are Stan, Tolkien, Clyde, Kevin, Kenny, Craig, and Kyle"
    },
    {
        "character": "Butters",
        "line": "And so then, and so then it turns out the Terminator secretly had a kid, ten years ago. Meaning Terminator could be his own father. And then Skeletor gets angry and wants to fight him."
    },
    {
        "character": "Kyle",
        "line": "[looks at Craig, who looks back] ...No, dude, that's not the trailer for Terminator 5, that really happened."
    },
    {
        "character": "Butters",
        "line": "[jumps up on the bench] Skeletor is real??"
    },
    {
        "character": "Stan",
        "line": "No, dude, that's not Skeletor, that's Terminator's wife."
    },
    {
        "character": "Butters",
        "line": "Skeletor's a lady??"
    },
    {
        "character": "Cartman",
        "line": "[storms into the cafeteria and walks towards the table] Goddamnit!!! [Butters sits back down] Who the fuck do they think they are?! [arrives and starts pacing back and forth] This is the last fucking straw!!! I AM GOING TO FUCKING KILL EVERYBODY!!!"
    },
    {
        "character": "Butters",
        "line": "Hey Eric."
    },
    {
        "character": "Cartman",
        "line": "[begins to rattle the table] I AM SO SICK OF THIS FUCKING SCHOOOOOL!!! [Butters groans as Cartman shakes the table. Cartman soon stops] This stupid school and its stupid principal have gone too far this time!!!!"
    },
    {
        "character": "Kyle",
        "line": "You get in trouble again, Cartman?"
    },
    {
        "character": "Cartman",
        "line": "No, I didn't do a damn thing!!! Nothing!!! I told you, this school is a DEN of SNAKES!!! You're not gonna believe what they did this time, you guys!!!"
    },
    {
        "character": "Stan",
        "line": "Dude we're, we're just trying to eat."
    },
    {
        "character": "Cartman",
        "line": "Oh, you think I'm overreacting again, huh?! No!!! Not this time!!! [flies into a rage again and rattles the table] The school has gone too far, and it affects each and every one of you!!! [the other boys look at each other] You remember the school physical we all took last week?!"
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "Well, the school put the sizes of all our penises up on a big chart in the school hallway!!!"
    },
    {
        "character": "Kyle",
        "line": "[skeptical, as is tradition] No they didn't."
    },
    {
        "character": "Cartman",
        "line": "Yeah they fucking did, Kyle!!!"
    },
    {
        "character": "Stan",
        "line": "Dude, why would the school put up the sizes of our wieners?"
    },
    {
        "character": "Cartman",
        "line": "Because they don't fucking care!! I've told you this!! They don't give a shit about the students, and they live to make us miserable!!"
    },
    {
        "character": "Kyle",
        "line": "That doesn't make any sense."
    },
    {
        "character": "Cartman",
        "line": "Go look for yourselves!!!"
    },
    {
        "character": "",
        "line": "The school hallway, moments later. The boys gather in front of the chart Cartman had mentioned"
    },
    {
        "character": "Cartman",
        "line": "There, you see?! Can you fucking believe it?!"
    },
    {
        "character": "Butters",
        "line": "Is that really all our wiener sizes?"
    },
    {
        "character": "Cartman",
        "line": "Yeah, dude, look at it! It says right there: \"Eric Cartman, 1.2 inches\"! [turns around and faces the other boys] Why would they tell everybody that?! They wanna measure my wiener?! Fine! But don't put me on blast!"
    },
    {
        "character": "Craig",
        "line": "Craig Tucker, 2.4 inches. Yeah, that's about right."
    },
    {
        "character": "Butters",
        "line": "Butters Stotch, 2.2 inches. Is that good?"
    },
    {
        "character": "Kyle",
        "line": "How big do they say mine is? [it's 2.4, just like Craig's. The boys continue talking amongst themselves. At the far end of the hall, Principal Victoria and Mr. Mackey walk by and stop to look at the boys; Mr. Mackey is carrying a cup of coffee]"
    },
    {
        "character": "Principal Victoria",
        "line": "I told you the students would be interested in how much they grew since their last physical."
    },
    {
        "character": "Mr. Mackey",
        "line": "You're right. They, they really seem into it, m'kay. [takes a sip of coffee and walks away with the Principal]"
    },
    {
        "character": "Stan",
        "line": "Wait, it says mine's only 2.1 inches. That doesn't seem right."
    },
    {
        "character": "Cartman",
        "line": "No shit, Sherlock! My dick isn't 1.2 inches either! It ISN'T! This is another conspiracy by the school faculty!"
    },
    {
        "character": "Butters",
        "line": "A conspiracy?"
    },
    {
        "character": "Cartman",
        "line": "They're trying to stir up some big thing again, get all the girls all heated up - freaking out - over which boy has the biggest schlong! This has to be dealt with!"
    },
    {
        "character": "Kyle",
        "line": "Well everyone has already seen it; nothing we can do about it now."
    },
    {
        "character": "Cartman",
        "line": "Oh, there's something we can do about it alright! If they're gonna put us on blast, they're at least gonna get the numbers right! We are going to remeasure!!"
    },
    {
        "character": "",
        "line": "The Boys restroom, day, inside. Craig, Tolkien, and Cartman have notepads with them. Clyde is standing on a small stool with his pants and briefs down."
    },
    {
        "character": "Cartman",
        "line": "[measures, then writes down the result on his notepad] Alright. Clyde Donovan, 2.3 inches. [Clyde zips up and turns around] You see, witnesses? That's .2 inches more than what the school said."
    },
    {
        "character": "Clyde",
        "line": "[smiles, steps off the stool, and walks away] Alright."
    },
    {
        "character": "Cartman",
        "line": "Nice one, Clyde. Alright, next? [Butters walks up and gets on the stool] Whip it out, Butters. [Butters drops his pants and briefs]"
    },
    {
        "character": "Butters",
        "line": "Whoa, it's a little chilly in here."
    },
    {
        "character": "Cartman",
        "line": "Alright Butters, let's see what you got going down there."
    },
    {
        "character": "Butters",
        "line": "Hey wait, the cold is making it shrink some. Where're you going, little feller?"
    },
    {
        "character": "Cartman",
        "line": "Butters, I don't have time for this! I can't wait if your wiener is pulling a Scared Turtle."
    },
    {
        "character": "Butters",
        "line": "Hang on, he's coming back out. There he is. Who's a little guy?"
    },
    {
        "character": "Cartman",
        "line": "Alright Butters, looks like we haaave 2.- wow, 2.4 inches. Really nice, Butters."
    },
    {
        "character": "Butters",
        "line": "I'm hung like a horse!"
    },
    {
        "character": "Cartman",
        "line": "Alright, that's everybody. Let's go post these numbers. [walks towards the door with Butters, Tolkien and Craig, but their way is blocked by Stan, Kyle, and Kenny.] What?"
    },
    {
        "character": "Kyle",
        "line": "Didn't you forget something?"
    },
    {
        "character": "Cartman",
        "line": "What, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "You measured everyone's wiener except for yours."
    },
    {
        "character": "Cartman",
        "line": "I measured mine this morning. See? It's right here at the top. [points to his measurement]"
    },
    {
        "character": "Kyle",
        "line": "[grabs the notepad and has a look] Thirteen point seven inches?"
    },
    {
        "character": "Cartman",
        "line": "Yeah, it's pretty good."
    },
    {
        "character": "Kyle",
        "line": "Your wiener is not 13 inches long!"
    },
    {
        "character": "Stan",
        "line": "You made everyone else get measured with witnesses; you have to too."
    },
    {
        "character": "Cartman",
        "line": "Well what are you guys going to do?! Use a tape measure and measure my penis yourselves?! Are you homos?!"
    },
    {
        "character": "Stan",
        "line": "You just did that to everybody in class!"
    },
    {
        "character": "Cartman",
        "line": "Okay, fine! Whatever! Go ahead! [goes to get measured by his peers.]"
    },
    {
        "character": "",
        "line": "The school hallway. Clyde and Craig post the new measurements on the wall: \"ACTUAL BOYS' PENIS SIZES\". Stan supervises the placement of the sign"
    },
    {
        "character": "Stan",
        "line": "Yeah. That's good. A little higher on Craig's side. [continues directing until the poster is on just right] Yeup. [Cartman stands defiant until the poster is up. The girls begin to enter the hallway]"
    },
    {
        "character": "Millie",
        "line": "Actual boys' penis sizes?"
    },
    {
        "character": "Nelly",
        "line": "Gross!"
    },
    {
        "character": "Cartman",
        "line": "There, you see? My wiener isn't 1.2 inches, it's 1.4! [The two girls leave and Red walks by] What, Red?! You're all freaking out because my wiener is smaller than the other guys'?! I don't care! [wanders about approaching random girls] Clearly I'm very happy with the size of my wiener, or else why would I have called for a new measurement, and for this poster to be put up at all?! Don't forget that this was all my idea!"
    },
    {
        "character": "Principal Victoria",
        "line": "[over the PA system] Eric Cartman to the principal's office immediately."
    },
    {
        "character": "Cartman",
        "line": "Oh, Goddamnit!"
    },
    {
        "character": "",
        "line": "The principal's office, moments later. Cartman is on a chair facing Principal Victoria, his arms folded."
    },
    {
        "character": "Cartman",
        "line": "Let me guess: I'm in trouble again!"
    },
    {
        "character": "Principal Victoria",
        "line": "You're darn right, Eric!"
    },
    {
        "character": "Cartman",
        "line": "For what?!"
    },
    {
        "character": "Principal Victoria",
        "line": "Why did you measure all the boy students' penis sizes and put the results on the school bulletin board?!"
    },
    {
        "character": "Cartman",
        "line": "Why did YOU measure our penis sizes and put the results on the school bulletin board?!"
    },
    {
        "character": "Principal Victoria",
        "line": "[confused] What?"
    },
    {
        "character": "Cartman",
        "line": "I don't care if Obama IS President! You don't go around putting little boys on blast, telling the whole world the length of their DICKS!!!"
    },
    {
        "character": "Principal Victoria",
        "line": "Wait. Are you talking about the numbers we published Tuesday from the physicals?"
    },
    {
        "character": "Cartman",
        "line": "You're damn right! One point two inches! I'll have you know that my penis is a respectable 1.4 inches! Maybe it's still the smallest in school, but it's 0.2 inches bigger than you said!!!"
    },
    {
        "character": "Principal Victoria",
        "line": "[sternly] The numbers we put up were height differentials. [Cartman has no reply to this]"
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Principal Victoria",
        "line": "We thought it would be fun to put up how much each student has grown in height since their physical last year. You grew 1.2 inches."
    },
    {
        "character": "Cartman",
        "line": "Those weren't our dick sizes?"
    },
    {
        "character": "Principal Victoria",
        "line": "Why would we publish the lengths of our students' private parts?!"
    },
    {
        "character": "Cartman",
        "line": "I don't know! Why would you?!"
    },
    {
        "character": "Principal Victoria",
        "line": "We didn't!"
    },
    {
        "character": "Cartman",
        "line": "[gets off the chair and walks off] Aw crap! You mean everyone knows my wiener is smaller than everyone else's because of me?!"
    },
    {
        "character": "Principal Victoria",
        "line": "This is exactly the kind of thing we are always talking about, Eric. You get angry about something, you don't think, and you cause bad things to happen. This time you've done it to yourself!"
    },
    {
        "character": "Cartman",
        "line": "Oh God. Why couldn't I have just taken a minute to think about it?"
    },
    {
        "character": "Principal Victoria",
        "line": "Because you have an anger problem, Eric!"
    },
    {
        "character": "Cartman",
        "line": "Fuck you! No I don't!"
    },
    {
        "character": "",
        "line": "A doctor's office. Cartman and his mom are visiting the doctor."
    },
    {
        "character": "Doctor",
        "line": "What we need to figure out here is, are we dealing with maybe a little bipolarism? Some rage addiction? It could be a lot of things."
    },
    {
        "character": "Liane",
        "line": "My little sunshine has a temper sometimes, but he's not all bad."
    },
    {
        "character": "Doctor",
        "line": "Let's try a little experiment. I wanna see maybe what kind of things... trigger you, Eric. Okay? How do you think you would react if I said some negative things about you?"
    },
    {
        "character": "Cartman",
        "line": "Honestly, I wouldn't really care."
    },
    {
        "character": "Doctor",
        "line": "What if I were to tell you that I think you're fat? I think you're a fat little boy. I think you're waaaaay too fat for your age. Does that make you feel any anger? Huh, fatty? Jelly-belly? You got jelly in your belly you little fat fuck? You get a little flash of anger when someone tells you you've got tits like a 40-year-old woman? Fat boy?! [as the doctor's voice rises, Cartman takes out a cell phone and starts texting] Huh?! You like that, shitty-titty jelly-belly?! [stands up and starts provoking him] Oh yeah, he's a big boy!! Get that fatty some mud flaps for his ass!! Big old jiggly fatty butt!! [Cartman seems unfazed, so the doctor relents and sits down. Cartman continues texting, clears his throat, and resumes texting] ...Huh. Well, I just don't see it, Ms. Cartman. Your son doesn't seem to be triggered by anger at all. In fact, I'd say he's one of the more even-tempered children I've ever seen."
    },
    {
        "character": "Receptionist",
        "line": "[opens the door and peeks in] Sorry Doctor, your wife's on the phone? Says it's an emergency. [leaves and closes the door]"
    },
    {
        "character": "Doctor",
        "line": "Excuse me. [leaves his chair and walks to his desk, where he picks up the phone] Carol, what? ...Whoa, calm down honey. What do you mean? Web chat with wha-? What 14-year-old girl? Carol, I would ne- [Cartman puts down the phone quietly. Liane simply notices, but stays quiet] No I don't have a criminal record. Who would- Who is Mitch Conner?! There can't be an official police report, honey, there's no- No no, Carol, put down the gun, swee- uh sweetie, come on, put down the [\"blam.\"] Carol?! Carol!! [looks at Cartman]"
    },
    {
        "character": "Cartman",
        "line": "[coldly] I'm not fat. I'm big-boned."
    },
    {
        "character": "",
        "line": "South Park Elementary Library, evening. Principal Victoria has called a school meeting. Mr. Mackey is present."
    },
    {
        "character": "Principal Victoria",
        "line": "Thank you for coming, parents. We called you in because we've had a little incident at the school. The fourth grade boys measured their penises and posted results in the school hallway."
    },
    {
        "character": "Randy",
        "line": "Oh dear."
    },
    {
        "character": "Principal Victoria",
        "line": "Now, we realize this issue can have a troubling effect that can get blown out of proportion."
    },
    {
        "character": "Randy",
        "line": "Did they measure from the base or from the balls? [no one says a thing for six seconds]"
    },
    {
        "character": "Mrs. Stevens",
        "line": "How does the school let things like this happen??"
    },
    {
        "character": "Principal Victoria",
        "line": "Now now, boys' fascination with their genitalia is a natural thing. We... simply need to find a way to help the students understand what they've done."
    },
    {
        "character": "Randy",
        "line": "[stands up and faces the other parents] I'm a scientist. I think it's best I handle this."
    },
    {
        "character": "",
        "line": "South Park Elementary, Fourth Grade Class. Mr. Garrison has given class time to Randy, who is reclining on Mr. Garrison's desk casually."
    },
    {
        "character": "Randy",
        "line": "Hello students, my name is Dr. Marsh, and I'm gonna talk to you a little bit about what happened at the school yesterday. How do a man and a woman... make a baby? Anybody? A man and woman, what do they do to make a baby? How about the little girl in the brown coat? Yeah you."
    },
    {
        "character": "Girl with Brown Coat",
        "line": "[first appearance on the show] They have sex?"
    },
    {
        "character": "Randy",
        "line": "Good! The man puts his penis [makes a fist with his left hand.] Okay? Into the woman's vagina. [pronounces the g with a heavy h sound and jabs his left arm through the air, through an imaginary vagina formed with his cupped right hand] Okay now, sometimes, a man can feel like how long his penis is, is actually important. But is it? When you boys measure your penis length, the truth is it doesn't really matter. What does matter is [starts writing the equation on the board: (L×d)+W/G)/(∠∝(2@t)] Length times diameter plus weight over girth divided by angle of the tip squared, okay? When we're talking about penis size, we can't just use a tape measure. We need a scale [pulls down the projector screen] and... [pulls something out of his back pocket] a protractor as well. [walks to a projector] Let's look at it on the graph here.. [wheels it into view and positions it right in front of the screen, then turns on the projector. A picture of a happy, naked man in profile appears on the screen. The length of his penis is 8 inches, the angle is 135 degrees] Follow along with me on your study sheets, kids."
    },
    {
        "character": "",
        "line": "A classroom. A sign is shown which reads \"1. know why you are mad 2. know what makes you mad 3. know how to let go of anger\". Cartman and the others in attendance are seated in a circle with their arms folded and looking angry"
    },
    {
        "character": "Doctor",
        "line": "I want to congratulate all of you for making the effort to come to anger management class."
    },
    {
        "character": "Bodybuilder",
        "line": "We didn't make any effort, we didn't have a choice!"
    },
    {
        "character": "Tea Bag Participant",
        "line": "Yeah! This is bullshit!"
    },
    {
        "character": "Doctor",
        "line": "Together, we're gonna learn what makes us angry, okay? And how to better deal with it so we don't get ourselves into trouble anymore."
    },
    {
        "character": "Michael",
        "line": "So lame! Why doesn't everyone just die?!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Rook! Ifuh somebody ordereduh shitty beef, anduh complain because they say they ordereduh shitty shrimp, It's notuh my fault he gets the shitty chicken poured all over hisuh fuckin' head!"
    },
    {
        "character": "Tea Bag Participant",
        "line": "We have good reason to be angry! This country is going to shit! We have exactly twelve days before the oil is gone, and our president is a socialist who wasn't even born in America!"
    },
    {
        "character": "Doctor",
        "line": "Right. See, what we all need to do is chaaannel our various reasons for anger, and learn to control it."
    },
    {
        "character": "Wigger",
        "line": "[stands up and grabs his crotch] Man, this shit wack, man. I just seen all this shit frontin' mahn. [drops into a wide leg stance] I don't understand, it like my pops ain't no fuckin' good mah. [makes a phone gesture with his other hand] Bitch be callin' me, tappin' that shit, man."
    },
    {
        "character": "Cartman",
        "line": "Why the fuck am I here?!"
    },
    {
        "character": "Doctor",
        "line": "Well, Eric, because I know you want to... control your anger and become a better person."
    },
    {
        "character": "Cartman",
        "line": "Are you saying I have problems like these fucking people?!"
    },
    {
        "character": "Doctor",
        "line": "[panics and drops his pen] NO! No! I'm not saying that, at all. Please I, I'm just saying how a-, amazing you are for wanting to... l-lessen some of your more... less awesome attributes."
    },
    {
        "character": "Cartman",
        "line": "Oh, that's cool."
    },
    {
        "character": "",
        "line": "South Park Elementary, Fourth Grade Class. Randy continues his lecture."
    },
    {
        "character": "Randy",
        "line": "And so, by dividing the weight and the girth of the penis by the angle or the- what do we call it again? The yaw? The yaw of the shaft? What we finally get is the adjusted penis size, or, T.M.I. Any questions so far? Yes, little girl over there."
    },
    {
        "character": "Girl with Blue Vest",
        "line": "[first appearance on the show] What's a penis?"
    },
    {
        "character": "Randy",
        "line": "[six second later, after mulling what his answer would be] ...Ah, good question. Ahh, the penis is the thing we're talking about that boys have that we're... measuring. [now quickly] Okay any other questions? Okay, so then let's move on to the example on your study sheet. How about you? Could you read the first example for the class? [a girl is shown] Example 1, young lady. Please read the problem out loud"
    },
    {
        "character": "Riley",
        "line": "Example 1: Randy has a penis that is 4.4 inches in length."
    },
    {
        "character": "Randy",
        "line": "[writes the number on the board] Four point four inches..."
    },
    {
        "character": "Riley",
        "line": "Its angle is 32 degrees. Its flaccid girth is one inch in diameter. His balls are seven centimeters from the base."
    },
    {
        "character": "Randy",
        "line": "Seven centimeters..."
    },
    {
        "character": "Riley",
        "line": "Randy notes that the drift of his penis is four centimeters to penis right, and its dead weight is 0.5 kilograms."
    },
    {
        "character": "Randy",
        "line": "Great! And so divide by the 17. carry the 1, and we can see that Randy's adjusted penis size, or T.M.I., is... 6.3 inches. Do we got that? Randy's length is 4.4 inches, but his adjusted length is 6.3. So how does our example person \"Randy\" compare to others on the T.M.I. scale? By referring again to the T.M.I. chart, we see that a T.M.I. of 6.3 is .8 inches more than the national average. [grins at the class]"
    },
    {
        "character": "",
        "line": "Anger Management Class, later."
    },
    {
        "character": "Doctor",
        "line": "Okay, what we're going to do now is get to the root of all your anger. Daniel, could you stand up please? [Daniel stands up with his arms still crossed.] What makes you the angriest, Daniel?"
    },
    {
        "character": "Daniel",
        "line": "[the Tea Bag participant] Stupid-ass blind liberals!"
    },
    {
        "character": "Doctor",
        "line": "Okay, great. Chase, could you stand up and pretend to be a stupid-ass blind liberal? [the bodybuilder stands up and walks up to Daniel] And what makes you angriest, Chase?"
    },
    {
        "character": "Chase",
        "line": "Scrawny-ass sissies!"
    },
    {
        "character": "Doctor",
        "line": "Okay, Daniel's a scrawny-ass sissy, he just cut in front of you in line at the bank. Go!"
    },
    {
        "character": "Chase",
        "line": "Hey! What, do you think I got a small dick?! Huh?! [strikes him on the chest]"
    },
    {
        "character": "Daniel",
        "line": "Huh I don't have a small penis! My wife thinks my penis is perfectly fine!"
    },
    {
        "character": "Doctor",
        "line": "[doesn't say anything for a few seconds] ...Okay. Uh, why don't we uh do some roleplaying now with Wayne D, who gets angriest at his mom. [Wayne D stands and moves to the center of the room] Gretchen, can you play Wayne D's mom for us? [Gretchen, a butch woman, stands up and walks to the middle of the room]"
    },
    {
        "character": "Wayne D",
        "line": "Yo, bitch! You think you bad? Just 'cause you're a mom don't mean I can't put a cap in your ass, bitch, mang!"
    },
    {
        "character": "Gretchen",
        "line": "I may be female on the outside, but I still have a bigger penis than you!"
    },
    {
        "character": "Wayne D",
        "line": "[begins to tear up and drops the gangsta act] I don't have a small penis! Don't say that, it isn't true! It isn't true!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "[stands up and yells in frustration] That's enough! I've beem sick of everyone talk aboutuh penis shize!"
    },
    {
        "character": "Daniel",
        "line": "[stands up and yells] Yeah, it doesn't matter! It doesn't matter!"
    },
    {
        "character": "Doctor",
        "line": "[if he wasn't sure before, he is now] Does... everyone here have an issue with their penis size?"
    },
    {
        "character": "Chase",
        "line": "No."
    },
    {
        "character": "Gretchen",
        "line": "No."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Not me."
    },
    {
        "character": "Daniel",
        "line": "Nnnooo."
    },
    {
        "character": "Wayne D",
        "line": "No, my, my shit be packing, manh."
    },
    {
        "character": "Cartman",
        "line": "My penis is 13 inches long."
    },
    {
        "character": "Doctor",
        "line": "Hmmm."
    },
    {
        "character": "",
        "line": "Mr. Garrison's room, day. The kids have another guest speaker"
    },
    {
        "character": "Guest Speaker",
        "line": "Kids, my name is Rebecca Turnod, and I'm an \"actual doctor\" of human sexuality and behavior. Unfortunately you have been taught some very wrong ideas in the past couple of days, and I am here to set things straight."
    },
    {
        "character": "Wendy",
        "line": "Thank God."
    },
    {
        "character": "Ms. Turnod",
        "line": "I want you to try and forget these wild theories and understand that all that's important when it comes to a man and a woman making love is actually [turns around, picks up some chalk and starts writing down the equation on the board: ((L×G)/(∠A°))÷(M/W)] Length times girth over angle of the shaft divided by mass over width- [the classroom door flies open and Randy is at the door, incensed]"
    },
    {
        "character": "Randy",
        "line": "PUTAIN D'MENTEUR!!!  [runs up and attacks Ms. Turnod. She responds with a punch and a kick to the balls. They trade punches as the class looks on. Randy knocks her to the floor, gets on top of her, and keeps punching away]"
    },
    {
        "character": "",
        "line": "Anger Management Class, a day or two later. Randy is now in there with the other seven members."
    },
    {
        "character": "Doctor",
        "line": "We all want to welcome our new member, Randy. Say hi to everyone, Randy."
    },
    {
        "character": "Randy",
        "line": "Aw, suck it! All o'ya!"
    },
    {
        "character": "Doctor",
        "line": "Now, we've all been trying to channel our anger in more constructive ways, Randy. Why don't you share what's bothering you?"
    },
    {
        "character": "Randy",
        "line": "You just don't go around changing math! Who the hell is this chick surgeon general appointed by Obama?!"
    },
    {
        "character": "Daniel",
        "line": "Goddamn right! Socialist fascist!"
    },
    {
        "character": "Randy",
        "line": "[has a lighter and tries to torch a chair with it] Power to the people! Burn it down! Burn it down!!"
    },
    {
        "character": "Doctor",
        "line": "Mr. Marsh, this is what we're here to try and work on, okay?"
    },
    {
        "character": "Randy",
        "line": "No dude, fuck you! We're burnin' this shit!"
    },
    {
        "character": "Doctor",
        "line": "If you take a minute to think about your anger, and give- [the chair lights up in flames] whoa! Whoawhoawhoa!"
    },
    {
        "character": "Randy",
        "line": "Yeeaahh!"
    },
    {
        "character": "Cartman",
        "line": "Yeah dude!"
    },
    {
        "character": "Wayne D",
        "line": "Man, that shit be burnin' an' shit, manh!"
    },
    {
        "character": "Gretchen",
        "line": "Yeeaahh!"
    },
    {
        "character": "Cartman",
        "line": "[takes his chair and swings it against a wall, where it shatters] Yeah!"
    },
    {
        "character": "",
        "line": "The class begins to riot. Randy walks to some curtains and sets them on fire."
    },
    {
        "character": "Randy",
        "line": "Yeeaahh! [the office is soon destroyed]"
    },
    {
        "character": "",
        "line": "FedEx Office, day. A clerk and customer do business"
    },
    {
        "character": "Clerk",
        "line": "Welcome to FedEx. How can I help you today?"
    },
    {
        "character": "Customer",
        "line": "Yes, I've got some birthday presents I need shipped."
    },
    {
        "character": "Clerk",
        "line": "Alrighty, let's see what kind of-"
    },
    {
        "character": "Randy",
        "line": "[runs in with the other anger-management class members] Burn it down! [the other members go forth destroying the store. Randy walks up to a huge poster and sets it on fire]"
    },
    {
        "character": "Cartman",
        "line": "Burn it down, dude! [Daniel demolishes boxes with a bat while Gretchen takes a pipe to other boxes. Michael holds a knife and kicks some boxes while Cartman takes a small hammer to a huge box. Wayne D fires away with a pistol while Chase fires away with a semi-automatic rifle and Tuong Lu Kim swings a Chinese cleaver around ]"
    },
    {
        "character": "Randy",
        "line": "[approaches the counter to set it on fire] Let's see how the American government likes it when we shut down their Federal Express! [Gretchen reappears to bash more stuff up]"
    },
    {
        "character": "",
        "line": "A news report. The media got wind of the riot"
    },
    {
        "character": "Field Reporter",
        "line": "Tom, I'm standing outside the FedEx in Fairplay, Colorado, where a radical political group has taken several people hostage. They call themselves the pissed-off and angry party. And they allowed me to speak with them moments ago."
    },
    {
        "character": "",
        "line": "Recorded earlier. The FedEx staff and customers are huddled on the ground while Cartman and the others stand near them with their weapons drawn."
    },
    {
        "character": "Randy",
        "line": "[holding the clerk hostage] This is a call to all angry people! We've had enough! We're gonna hit the government where it hurts! Right in the Federal Express!"
    },
    {
        "character": "Field Reporter",
        "line": "What exactly are you angry about?"
    },
    {
        "character": "Randy",
        "line": "We're angry about this stupid liberal government and fascist lies, media- control, and the-"
    },
    {
        "character": "Cartman",
        "line": "The Jews!"
    },
    {
        "character": "Randy",
        "line": "Yeah, Jews! And all this stuff that the government's doing!"
    },
    {
        "character": "Field Reporter",
        "line": "You've got a lot of people scared. What are your demands?"
    },
    {
        "character": "Randy",
        "line": "Well first of all, we want that surgeon general to step down!"
    },
    {
        "character": "Chase",
        "line": "Yeeaahh!"
    },
    {
        "character": "Randy",
        "line": "And we want-"
    },
    {
        "character": "Daniel",
        "line": "[runs into view] And we want to see Obama's REAL birth certificate! [walks offscreen]"
    },
    {
        "character": "Randy",
        "line": "Yeah, we want to see Obama's REAL birth certificate! And um,"
    },
    {
        "character": "Wayne D",
        "line": "[enters from the other side] And my mom gotta stop trippin', manh. [grabs his crotch] Bitch be trippin' all the time, manh. [walks offscreen]"
    },
    {
        "character": "Randy",
        "line": "Yeah, we want our moms to stop trippin', man! 'Cause the bitches be trippin' all the time! And I think that- uhh, [looks back at the other members.] is that it?"
    },
    {
        "character": "Cartman",
        "line": "No, and fuck Kyle!"
    },
    {
        "character": "Randy",
        "line": "Oh yeah, and fuck Kyle! Surgeon general's resignation, Obama's real birth certificate, moms to stop trippin', and fuck Kyle! You got that?! Or else we're gonna bring the Federal Express to a grinding halt!"
    },
    {
        "character": "Field Reporter",
        "line": "Does it bother you that the Federal Express is not affiliated at all with the Federal Government?"
    },
    {
        "character": "Randy",
        "line": "No. No, that doesn't matter! [releases the clerk and turns to look at the other members] Fuck, really?!"
    },
    {
        "character": "",
        "line": "Butters' house, day. Butters is measuring his penis again and again and putting down his measurements on a sheet of paper on a small table next to him"
    },
    {
        "character": "Linda",
        "line": "Butters, what are you doing?"
    },
    {
        "character": "Butters",
        "line": "Homework! I just don't get it! That is the fourth time I've calculated, and it's below average! I thought I was hung, but according to my T.M.I., I have a micropenis! [throws down his pencil and notepad in disgust]"
    },
    {
        "character": "Linda",
        "line": "Your T.M.I.?"
    },
    {
        "character": "Butters",
        "line": "I don't understand it! An' I'm startin'- uhh, I'm starting to feel angry! Rawr! [kicks his bed]"
    },
    {
        "character": "Linda",
        "line": "Butters, put your clothes on."
    },
    {
        "character": "Butters",
        "line": "[begins to vent, pacing back and forth] Oh what's the point, Mom?! What's the point of life anyway?! All you do is yell at me! And the government... wuh, which is led by fascists, and everyone's a Justin Bieber wannabe. I wanna go and drive a Hummer, that's what I wanna do! I wanna drive a car that goes, that goes rawr rawr rawrawrawr!"
    },
    {
        "character": "Linda",
        "line": "Butters, what does driving a car have to do with your penis being small? [outside, some car rev by. Linda and Butters go to his window to look]"
    },
    {
        "character": "Driver 1",
        "line": "[in an SUV on monster wheels] Hey, everyone who's pissed off and angry is rallying to take down America! Join the fight! [peels off]"
    },
    {
        "character": "Driver 2",
        "line": "[in a little red Corvette] We're gonna take down the Federal Expresses, the American Apparels, and the American Furniture Warehouse! [peels off]"
    },
    {
        "character": "Driver 3",
        "line": "[in a massive truck] We're fed up and we've had enough! [peels off]"
    },
    {
        "character": "",
        "line": "The surgeon general's office, day. The surgeon general is there surrounded by her staff."
    },
    {
        "character": "Aide 1",
        "line": "Surgeon general, twelve more FedExes have been taken over; the Pissed Off and Angry Party is gaining more support!"
    },
    {
        "character": "Aide 2",
        "line": "They've shut down American Airlines and American Apparels all over the country. We have to ask you to step down."
    },
    {
        "character": "Rebecca Turnod",
        "line": "Are you seriously saying we're going to give in to their demands?"
    },
    {
        "character": "Aide 2",
        "line": "They're all really angry. We have to make them stop. Is the team standing by to fuck that little boy Kyle?"
    },
    {
        "character": "Aide 3",
        "line": "Team is standing by, sir."
    },
    {
        "character": "Doctor",
        "line": "[charges in] 'Scuse me. Excuse me, let me through."
    },
    {
        "character": "Rebecca Turnod",
        "line": "Who is this?"
    },
    {
        "character": "Doctor",
        "line": "[approaches the surgeon general's desk] Surgeon general, I believe I know why this is happening. I have found a direct correlation between the anger, and T.M.I. [goes to a whiteboard and beings writing out the equation: Anger equals (L×W)/(M^2-∠)+YAW ] Anger equals length times width over mass squared minus angle of the shaft plus yaw. [finishes and looks at the surgeon general] Look, we all get angry, but when someone is consistently angry or always finding new reasons to be angry, it means they have a very very very very small dick."
    },
    {
        "character": "Rebecca Turnod",
        "line": "Your theory is fine, doctor, but it doesn't matter. The T.M.I. equation is true solid science, which cannot be changed. There's nothing we can do about it."
    },
    {
        "character": "Doctor",
        "line": "Isn't there? Isn't... there?"
    },
    {
        "character": "",
        "line": "The FedEx in Fairplay, thoroughly destroyed, day."
    },
    {
        "character": "Daniel",
        "line": "We've waited long enough, Randy! Let's start killin' these sons of bitches!"
    },
    {
        "character": "Woman",
        "line": "No, please!"
    },
    {
        "character": "Cartman",
        "line": "Yeah, dude, they aren't gonna give us what we want!"
    },
    {
        "character": "Wayne D",
        "line": "Yo let's cap these bitches, manh! Let's cap an leave em at the back of the building, manh!"
    },
    {
        "character": "Michael",
        "line": "[watching a working TV, turns around and calls the other members] Hey, come over here. Look. [turns to watch TV again as the others arrive]"
    },
    {
        "character": "Announcer",
        "line": "We interrupt this newscast for an important message from the surgeon general."
    },
    {
        "character": "Rebecca Turnod",
        "line": "Fellow Americans, as you all know, the T.M.I. scale was implemented long ago to assure that each and every American could accurately measure their junk. The established equation is a hundred percent accurate."
    },
    {
        "character": "Randy",
        "line": "Rrrr!"
    },
    {
        "character": "Daniel",
        "line": "Shhh."
    },
    {
        "character": "Rebecca Turnod",
        "line": "However, due to recently collected data, we are making one change. [the T.M.I. scale is shown] The national average for penis length is now officially moved, from 6 inches to 1.5 inches. [the lower regions of the chart shrink and the NICE region takes up the slack] Anyone with a T.M.I. of over 1.5 inches is considered \"above average\". [she puts her stamp of approval to it]"
    },
    {
        "character": "Randy",
        "line": "[takes a step back. Everyone has a smile on their face now, except for Cartman. An electric organ begins to play in the background].\nThe winds of change are blowin'.\nThere's excitement in the air.\nCan you feel it? It's electric and magical.\nThe happy train's on track.\n'Cause America is BACK!\nWoohoo! Come on!\n\n\n\n[the group throw their weapons aside and dance in celebration as they run to the exit. Cartman stands alone.]\n\n"
    },
    {
        "character": "Cartman",
        "line": "Wait, what?"
    },
    {
        "character": "",
        "line": "FedEx, exterior. Randy pushes the FedEx door open and leads the group outside in a dance. A few police officers run up with smiles on their faces and join them."
    },
    {
        "character": "Randy",
        "line": "America is back!\nAmerica is back!\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[runs outside and tries to get their attention] Wait! According to that scale, I still have a small wiener!"
    },
    {
        "character": "Randy",
        "line": "We're back, we're back, we're back back back!\nAmerica is back!\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "I'm still fucking angry!"
    },
    {
        "character": "Randy",
        "line": "Back and we're back and we're back!\nWe're so back, we're so back back back back back back!\n\n\n"
    }
]