[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Downtown South Park. There's traffic and people on the sidewalk. Among all that is a small postman who looks pretty familiar. The postman stops at a kitchenware place and knocks on the door. A cashier comes to the door and opens it"
    },
    {
        "character": "Butters",
        "line": "Hello sir. Postman Butters with a special delivery for you. [hands him a flyer]"
    },
    {
        "character": "Cashier",
        "line": "What's this?"
    },
    {
        "character": "Butters",
        "line": "An all-new sushi restaurant just opened in town. Try their lunch specials."
    },
    {
        "character": "Cashier",
        "line": "Thanks."
    },
    {
        "character": "Butters",
        "line": "You can count on Postman Butters! [salutes and leaves. As he does so, the cashier makes a ball out of the flyer and tosses it away. Butters doesn't notice, but instead sees a woman coming up and hands her a flyer] Special delivery, ma'am. [sees a man coming up and hands him a flyer. The woman crumples up her flyer and tosses it away] Here you are, sir. [the man balls up and tosses his flyer away] Brand new sushi restaurant in town. [Butters sees another man and hands him a flyer] A flyer for you, from Postman Butters! [the man crumples up his flyer and tosses is away. Butters ends up in front of City Wok and enters. He approaches the counter]"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Welcome to Shitty Wok. Can I take a order prease?"
    },
    {
        "character": "Butters",
        "line": "Hello, sir. Postman Butters here with a special delivery for you."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "[leaves the counter] Wha you talking 'bout?"
    },
    {
        "character": "Butters",
        "line": "It's a coupon for a brand-new Asian restaurant that just opened up in town."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "A what? Ret me see that! [grabs the flyer] Oh no, a sushi prace? How come every time a hard-working Chinese man open a business, some shmelly Japanese dog has to come and try invade him?!"
    },
    {
        "character": "Butters",
        "line": "Uhhhh I don't know, I'm just bein' paid to hand out flyers."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Where is this Japanese-uh toiret bowl?! How far from my Shitty Wok?!"
    },
    {
        "character": "Butters",
        "line": "Wuh you mean the sha-sushi restaurant? Ih-it's right over there."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "What?! Whaaat?! [runs outside and looks both ways. He looks to his left again... There it is: City Sushi, complete with cat statues] What the fuuuck?! [goes inside]"
    },
    {
        "character": "",
        "line": "Inside City Sushi. Butters follows Mr. Kim in"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Welcome to City Sushi. Can I take er order prease?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "What's the big idea putting your Shitty Sushi right next to my Shitty Wok?!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "I'm sorry I do not understand your accent. You want a Shitty tuna roll?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "No I don't want Shitty tuna roll! I want you to go find another shitty town to open your Shitty Sushi prace!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Why don't you please ujust speak Engrish? Maybe I can understand you!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "I am speaking Engrish! Why don't you speak a fucking Engrish, you soba eating fuck!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Get out or I call porice!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Come on, kid, you don't wanna eat this-a Shitty Sushi! It give you worms."
    },
    {
        "character": "Mr. Takiyama",
        "line": "Better than Shitty Kung Pao Chicken made from cat! [Mr. Kim turns and runs to the counter, jumps over it and lands a blow in Mr. Takiyama's face. They trade blows. Mr. Kim ends with an uppercut]"
    },
    {
        "character": "",
        "line": "Butters' house, day. Sgt. Yates and another office bring Butters home. Sgt. Yates knocks, Mr. Stotch answers"
    },
    {
        "character": "Steven",
        "line": "Hello?"
    },
    {
        "character": "Sgt. Yates",
        "line": "Sir, does this mailman belong to you?"
    },
    {
        "character": "Stephen",
        "line": "That's my son. Is there a problem, officer?"
    },
    {
        "character": "Sgt. Yates",
        "line": "There's been an Asian turf war, sir, and your son appears to have caused it."
    },
    {
        "character": "Stephen",
        "line": "What?! An Asian turf war- Butters! You are grounded!"
    },
    {
        "character": "Butters",
        "line": "But, sir, i was just handing out coupons for-"
    },
    {
        "character": "Stephen",
        "line": "Don't talk back to me! [Butters goes inside]"
    },
    {
        "character": "Sgt. Yates",
        "line": "We'll send a bill for the damages, [the officers turn and leave] but in the meantime, please keep a closer eye on your child, sir? [Stephen closes the door]"
    },
    {
        "character": "",
        "line": "Butters' house, inside. Linda meets Stephen at the foot of the stairs as he has words with Butters"
    },
    {
        "character": "Stephen",
        "line": "Go up to your room, now! [Butters goes upstairs]"
    },
    {
        "character": "Linda",
        "line": "What's going on?"
    },
    {
        "character": "Stephen",
        "line": "Butters started an Asian turf war!"
    },
    {
        "character": "Linda",
        "line": "Oh, for the love of Pete! What is wrong with that boy?"
    },
    {
        "character": "Stephen",
        "line": "I don't know, but it's clear it isn't our parenting! We're awesome! He must have mental problems. I think we'd batter have him checked out, Linda."
    },
    {
        "character": "",
        "line": "Center for Criminally Insane Children. Inside, a doctor is in a lab with Butters as Linda and Stephen wait outside. The doctor opens the door and sighs. He meets with Butters' parents."
    },
    {
        "character": "Stephen",
        "line": "Well, Dr. Janus?"
    },
    {
        "character": "Dr. Janus",
        "line": "I'm afraid I have some bad news. Your son is suffering from Multiple Personality Disorder."
    },
    {
        "character": "Linda",
        "line": "What?"
    },
    {
        "character": "Dr. Janus",
        "line": "There are several distinct personalities going on in there. One is named \"Postman Butters\" and yet another is \"Fireman Butters.\" And then there's even \"Inspector Butters\" and uh, \"Professor Chaos\"."
    },
    {
        "character": "Linda",
        "line": "Oh my God!"
    },
    {
        "character": "Dr. Janus",
        "line": "From what I gather, he seems to mostly jump in and out of personalities when he's outside playing. Sometimes he's a cowboy and other times he's an Indian, and the two seem to be at constant odds."
    },
    {
        "character": "Linda",
        "line": "Oh, poor Butters!"
    },
    {
        "character": "Stephen",
        "line": "Doctor, what can we do? Should we ground him?"
    },
    {
        "character": "Dr. Janus",
        "line": "No, I don't think grounding him would do much good at this point. [glances at Butters] What your son needs now is lots of tender loving... medication. Heavy medication."
    },
    {
        "character": "",
        "line": "News report, outside the two Asian restaurants, day"
    },
    {
        "character": "Field reporter",
        "line": ""
    },
    {
        "character": "Tuong Lu Kim",
        "line": "[comes out of his restaurant and sees the sign] What the fuuuck?! [goes into City Sushi] You see what happen?!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "I told you not to come in here!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Now everyone in town think a Chinese and a Japanese are the same fucking thing!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "I don't even know what the fuck you are saying! Uhpupuh putuh peepee!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Aaah you Japanese racist! [Mr. Kim launches at Mr. Takiyama like he did before, and they trade blows again.]"
    },
    {
        "character": "",
        "line": "Butters' house, night. Steven is reading the newspaper at his den."
    },
    {
        "character": "Linda",
        "line": "[runs in] Stephen! Stephen, come quick! It's Butters! [runs off. He follows her out. They reach the backyard] Look!"
    },
    {
        "character": "Butters ",
        "line": "[pretending he's a trucker in his cab] Honk honk! Breaker 1-9, breaker 1-9. It's clean clear out to Flagtown! Looks like we got ourselves a convoy! Honk honk!"
    },
    {
        "character": "Linda",
        "line": "Now he thinks he's a truck driver. [cries into Stephen's shoulder]"
    },
    {
        "character": "Stephen",
        "line": "Oh God the medication isn't working!"
    },
    {
        "character": "Butters",
        "line": "It's okay, buddy, you've got a smokey on your tail, bug Big Rig Butters is here to help! Vroovrooom. [Stephen runs up to him]"
    },
    {
        "character": "Stephen",
        "line": "Butters! Butters!! [grabs Butters by the shoulders and shakes him hard] Butterrrrs!!!"
    },
    {
        "character": "Butters",
        "line": "Oh hey Dad."
    },
    {
        "character": "Stephen",
        "line": "You're back. You're back-he's back! [Stephen hugs Butters tight and cries.] I love you, son!"
    },
    {
        "character": "Butters",
        "line": "I love you too, Dad."
    },
    {
        "character": "Stephen",
        "line": "You're going to be okay, Butters! You hear me?! You are going to be okay!!! [Linda whimpers a bit]"
    },
    {
        "character": "",
        "line": "City Sushi, day. Mr. Kim enters"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Youuu, get out! I told you not to come in here!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Okay, whoa, just hold a minute, hold a minute. I come ina peace."
    },
    {
        "character": "Mr. Takiyama",
        "line": "I don't berieve you!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Come on, rook! All this fighting, it's just to sirry, you know? Chinese anda Japanese been fighting for so rong. It'sa ridicurous. What we need... is to have a tweaty."
    },
    {
        "character": "Mr. Takiyama",
        "line": "What is tweaty?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Nono, we need a tweaty."
    },
    {
        "character": "Mr. Takiyama",
        "line": "A tweaty?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "No, not a treaty, a tweaty!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Oh, you mean a treaty?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "What the fuck is a tweaty?"
    },
    {
        "character": "Mr. Takiyama",
        "line": "No no, a treaty."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "A tweaty? [no response] Rook rook. All these racist people thinka that a Chinese and a Japanese are the same, right? So you and me, we put on a big assembry for all the kids are school, and then everyone understand curtural difference. You know, so they know fried rice isn't from Japan and teriyaki isn't from China."
    },
    {
        "character": "Matt",
        "line": "Teriyaki isn't from China?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "[screams in his face] No, teriyaki isn't froma fucking China!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Very well. I will do assembly with you."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Oh really? Oh great. [backs away] Okay, I'll meet you tomorrow and we can go over our prans. [turns around] And when you get to that assembry, you gonna get big surprise, you Japanese dog."
    },
    {
        "character": "",
        "line": "Dr. Janus' lab, day."
    },
    {
        "character": "Dr. Janus",
        "line": "Butters, when you were playing in the yard yesterday, do you remember becoming someone named... Big Rig Butters?"
    },
    {
        "character": "Butters",
        "line": "Sure."
    },
    {
        "character": "Dr. Janus",
        "line": "What makes Big Rig Butters come out? Did somebody hurt him? Did he do something bad he can't forgive himself for?"
    },
    {
        "character": "Butters",
        "line": "Uh, no, he's pretty much just a truck driver."
    },
    {
        "character": "Dr. Janus",
        "line": "You don't know. But, maybe somebody else in there does. Do you think it would be possible for me to speak with... Inspector Butters?"
    },
    {
        "character": "Butters",
        "line": "Sure."
    },
    {
        "character": "Dr. Janus",
        "line": "I'm now speaking to the person known as Inspector Butters."
    },
    {
        "character": "Butters",
        "line": "Inspector Butters is on the case! Heheh, he this is fun."
    },
    {
        "character": "Dr. Janus",
        "line": "Inspector Butters, what do you want?"
    },
    {
        "character": "Butters",
        "line": "Uh, well, to solve mysteries."
    },
    {
        "character": "Dr. Janus",
        "line": "And is there someone else living with you, someone named... Professor Chaos?"
    },
    {
        "character": "Butters",
        "line": "Oh well, sure, uh he's the bringer of destruction and evil!"
    },
    {
        "character": "Dr. Janus",
        "line": "He's a bad man. He doesn't like Butters, does he? Does Professor Chaos want to murder Butters?"
    },
    {
        "character": "Butters",
        "line": "What? Why would I do that?"
    },
    {
        "character": "Dr. Janus",
        "line": "Who am I speaking to now?"
    },
    {
        "character": "Butters",
        "line": "Me, Butters."
    },
    {
        "character": "Dr. Janus",
        "line": "Ah, Butters. You're back."
    },
    {
        "character": "Butters",
        "line": "Sir, I'm confused."
    },
    {
        "character": "Dr. Janus",
        "line": "I know you are. This is going to sound scary, pal, but... you have people living inside your head. And some of them want to murder you."
    },
    {
        "character": "Butters",
        "line": "Really?"
    },
    {
        "character": "Dr. Janus",
        "line": "Yes, I'm afraid you're a little sick. But it's okay, because together we're going to get you well."
    },
    {
        "character": "Alias 1",
        "line": "[a teenaged personality] Don't listen to Dr. Janus! He's a mean old man and a big silly grown up."
    },
    {
        "character": "Butters",
        "line": "Pardon me?"
    },
    {
        "character": "Alias 1",
        "line": "He's just a big old stick in the mud who doesn't like to play."
    },
    {
        "character": "Dr. Janus",
        "line": "Don't mind him, Butters. Billy's a pretty messed up kid. He was molested by his uncles."
    },
    {
        "character": "Psycho Janus",
        "line": "Dr. Janus isn't going to be alive for long! I'm going to kill him!"
    },
    {
        "character": "Dr. Janus",
        "line": "Now, what are the things that make you happy, Butters? What's the matter, Butters? Are you still with us? Is one of your other personalities trying to take over?"
    },
    {
        "character": "Billy",
        "line": "Let's play Battleship! All hands on the poop deck!"
    },
    {
        "character": "Psycho Janus",
        "line": "Your soul will bleed for eternity!"
    },
    {
        "character": "Alias 2",
        "line": "You don't even know what sexy is, Mr. Harrison."
    },
    {
        "character": "Alias 3",
        "line": "That Big Red freshness lasts right through it!\n\n\n"
    },
    {
        "character": "Alias 4",
        "line": "The horned toad says we should go to Mexico. [Butters doesn't know what to make of this doctor, and now he's afraid]"
    },
    {
        "character": "Dr. Janus",
        "line": "What are you feeling, Butters? Are you nervous about your condition?"
    },
    {
        "character": "Butters",
        "line": "Yes!"
    },
    {
        "character": "",
        "line": "Butter's bedroom, later. He's looking at a video he took of himself on his computer"
    },
    {
        "character": "Butters",
        "line": "[a recording] This... is Butters. It's Wednesday night at 9 p.m. From what I understand, there are people living inside my head and they want to kill me. It must be true, because now every night I wet the bed. So tonight I'm gonna leave the camera on to see what exactly I become while I am sleeping."
    },
    {
        "character": "Butters",
        "line": "Oh man, this is freaky. Like that movie Paranormal."
    },
    {
        "character": "Butters",
        "line": "[a recording] Well goodnight for now. [leaves the desk and goes to bed] Goodnight, Butters."
    },
    {
        "character": "Butters",
        "line": "Goodnight, Butters. Hmm. Alright, I guess I'm goin' to fast-forward. [fast-forwards three hours and then gasps. At normal speed, his bedroom door opens slowly. A second later, Dr. Janus enters] Dr. Janus? [nothing happens for three more hours, so Butters fast-forwards to 3:32 in the morning, when Dr. Janus unzips his pants, pulls out his dick and urinates all over Butters, puts his penis away, zips his pants up, and punches Butters HARD several times before running out of the bedroom. Six seconds later, Butters is fully awake]"
    },
    {
        "character": "Butters",
        "line": "[a recording] Mom! Dad! I wet the bed again!"
    },
    {
        "character": "Butters",
        "line": "Oh, sweet jumping Jesus!"
    },
    {
        "character": "",
        "line": "South Park Elementary Gymnasium, day. An Asian diversity poster is up on the projection screen. Mr. Mackey walks up next to it"
    },
    {
        "character": "Mr. Mackey",
        "line": "Okay, kids, today we have a special assembly, m'kay. Today we're going to learn about \"the diversity of Asian people.\" Please welcome Mr. Lu Kim and Mr. Junichi Takiyama. [Walks away. \"Shake that.\" A techno song comes on, followed my Mr. Kim and Mr. Takiyama dancing into view]"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Ni hao ma, South Park Erementary?!\n\n\n"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Konnichiwa?!\n\n\n"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "How are we arr feering?! [the music stops and the stand back to back]\n\n Hey, Mr. Takiyama, did you know that China and Japan are actually uh different countries?\n"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Oh, rearry? [they separate] Hey, that ruhight. If you ook at map, you can see."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "This whoooore thing is China, and Japan is this riiittle bitty country over here. And that's why the Japanese always try anda take over China!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "What?!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "The Japanese planned to kill people in Nanking! The only thing Japanese ruve more than killing people is killing themselves! Suicide rate in Japan sky-high!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Fuck you!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "\"Oh no, I'm a Japanese and I had a bad day! I think I'm gonna kill myself!\""
    },
    {
        "character": "",
        "line": "Dr. Janus' lab, day. Mr. Janus leaves it, but is surprised to find Butters waiting for him"
    },
    {
        "character": "Dr. Janus",
        "line": "Oh, hello Butters. I wasn't expecting you till 5:30."
    },
    {
        "character": "Butters",
        "line": "[nervous] Uh, yeah, Dr. Janus, I wanted to give you something. You remember how you told me if I got myself on video it might help me with my problem?"
    },
    {
        "character": "Dr. Janus",
        "line": "Yes. did you catch something?"
    },
    {
        "character": "Butters",
        "line": "Well yeah ah, I saw you pissing in my face."
    },
    {
        "character": "Dr. Janus",
        "line": "[sees the DVD disc and snatches it away, then checks it over] Oh, so you're on to me, huh you little shit?!"
    },
    {
        "character": "Butters",
        "line": "Huh?"
    },
    {
        "character": "Dr. Janus",
        "line": "What, Inspector butters figured out I set him up?!"
    },
    {
        "character": "Butters",
        "line": "Well no, ah I just thought it was one of your other personalities trying to give me a-"
    },
    {
        "character": "Dr. Janus",
        "line": "Oh come on! You think multiple personality disorder is real?! I've been using that to scam this town for seven years! Now I gotta get out of here, thanks to you! But I'm getting one last heist before I go, and you're gonna help me!"
    },
    {
        "character": "",
        "line": "A jewelry shop, closed for the night. Dr. Janus destroys a window with a crow bar, then lifts Butters into the shop"
    },
    {
        "character": "Dr. Janus",
        "line": "Get in there! Move it, asshole!"
    },
    {
        "character": "Butters",
        "line": "This is illegal. We could get arrested. [Dr. Janus breaks into some display cases and swipes the jewels into a satchel that Butters is carrying] Oh Jesus!"
    },
    {
        "character": "Dr. Janus",
        "line": "They're all idiots! The vault! Get to the vault! Come on! Go! Movie it! [puts some welding goggles on Butters while getting a welding torch and firing it up] Get this on and get in that vault! That's where the real good are! [hands the lit torch to Butters] Torch that door, do you hear me?! I'll kill your parents! I'll kill your friends! I said get that fucking door open!"
    },
    {
        "character": "Butters",
        "line": "I'm trying, sir! [this changes Dr. Janus' behavior]"
    },
    {
        "character": "Dr. Janus",
        "line": "Butters? Butters, what are you doing? What is that? A blowtorch? Put that down! You're having another episode!"
    },
    {
        "character": "Butters",
        "line": "What?"
    },
    {
        "character": "Dr. Janus",
        "line": "Butters. Your name is Butters! Try and remember!"
    },
    {
        "character": "Butters",
        "line": "But you said to uh, but I got to uh, and then, you told me tuh..."
    },
    {
        "character": "Dr. Janus",
        "line": "[sighs loudly] Oh boy, you've really done it this time. I know it's not your fault, but I'm sorry. I'm going to have to alert the authorities, pal."
    },
    {
        "character": "",
        "line": "Delia's Jewelers, day. Dr. Janus addresses the crowd and the police"
    },
    {
        "character": "Dr. Janus",
        "line": "We have to try and understand that he can't help what he's doing, officer. He probably has no memory of it at all."
    },
    {
        "character": "Sgt. Yates",
        "line": "Well, at least everything is accounted for. Thank God you came when you did, Dr. Janus."
    },
    {
        "character": "Steven",
        "line": "Breaking into a store, Butters?! What are you?!"
    },
    {
        "character": "Sgt. Yates",
        "line": "Well I suppose there's no need for jail, Mr. and Mrs. Stotch, so long as you ground your son."
    },
    {
        "character": "Steven",
        "line": "Oh, we'll ground the shit out of him, detective. Thank you so much."
    },
    {
        "character": "",
        "line": "City Sushi, day. Mr. Takiyama is preparing some sushi behind the counter when Mr. Kim enters"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Herro-o."
    },
    {
        "character": "Mr. Takiyama",
        "line": "You get the fuck out of my place!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Okay, hold on, hold on, please! I'ma sorry, okay? I'm sorry. I admit it. I fucked you at the assembly. How about you and me together do an Asian Diversity festival?"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Get the fuck out before I call police!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Please, I admitting it, okay?I fucked you at assembly. There's no way around it. It was verrry sneaky. Kind of like Pearl Harbor. Okay? That was a little sneaky too, huh? Pearl Harbor kind of sneaky; I think we can all be a rittle sneaky sometimes, hm? But that sneaky Chinese man? He's gone! Okay? Okay, if we can have Asian Diversity festival, then we no longer have to deal witha \"recial stereotypes.\" Prease."
    },
    {
        "character": "Mr. Takiyama",
        "line": "Against my better judgment, I will trust you one more time. But this time, you'd better not rub your hands together when you turn around to walk away."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Okay, see you tomorrow. [turns around and walks away, but stops long enough to rub his hands together] And on that Asian Diversity day you're gonna get a rittle surprise, you Japanese dog. [continues on his way]"
    },
    {
        "character": "",
        "line": "Butters' backyard. His Postman Butters uniform is on the ground, and he pours some gas on it. He then lights it and begins throwing in more of his costumes, which are in a cardboard box labeled \"Butters' Play Clothes\""
    },
    {
        "character": "Butters",
        "line": "That does it, you hear me?! I am through with all of you! No more Postman Butters, No more Inspector Butters, no more Porn Star Butters, no more Professor Chaos, and no more- [a bicycle horn stops him, and he holds on to his Professor Chaos mask. He looks over and sees Dr. Janus on a child's tricycle glaring at him] Waaahh! [runs away. As he does, he tosses the Professor Chaos mask back into the cardboard box. Butters runs into the neighborhood park. Dr. Janus chases him down and tackles him there.]"
    },
    {
        "character": "Dr. Janus",
        "line": "Butters please! It's me, Billy! You've gotta help! [moments later they are seated on a park bench] Please, Butters, I've tried to tell old Dr. Janus that we're in danger, but Dr. Janus doesn't rrealize thaere's a problem! [stands up and walks around] The mean man that lives in our head is trying to take over for good!"
    },
    {
        "character": "Butters",
        "line": "[sees a couple walking by] Um, excuse me?"
    },
    {
        "character": "Dr. Janus",
        "line": "[running around the bench to quickly distract Butters] No no nonono! Don't call out for help! [Dr. Janus opens his sports coat and points to a sidearm] He's got a gun."
    },
    {
        "character": "Butters",
        "line": "Wahh!"
    },
    {
        "character": "Dr. Janus",
        "line": "If you draw any attention he'll kill us!"
    },
    {
        "character": "Butters",
        "line": "Please, Billy, ah I'm just a kid too. I can't help you."
    },
    {
        "character": "Dr. Janus",
        "line": "No, you can't. But you know somebody who can. Inspector Butters."
    },
    {
        "character": "Butters",
        "line": "What??"
    },
    {
        "character": "Dr. Janus",
        "line": "You've got to become Inspector Butters again and help me find out what the mean man wants."
    },
    {
        "character": "Butters",
        "line": "No! You told me NOT to play Inspector Butters!"
    },
    {
        "character": "Dr. Janus",
        "line": "You don't understand! For some reason the mean man is getting stronger. You have to help me find out how to stop him! Please! [Butters sighs]"
    },
    {
        "character": "",
        "line": "South Park's Little Tokyo presents \"Asian Diversity Day.\" A pagoda now stands between the two restaurants, and all three buildings are decorated with strings of lights, dragons, fish, and other motifs. Both restaurants are also offering samples of their menus. Here's a news report"
    },
    {
        "character": "Field reporter",
        "line": ""
    },
    {
        "character": "A woman",
        "line": "Mr. Takiyama, a note for you. [Mr. Takiyama takes the note and reads it]"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "[voice-over] Konnichiwa, my fine Japanese friend. It's so great that Chinese and Japanese are finarry getting arong. We should take our picture together on top of the Tower of Peace. I'm up there waiting for you now. [Mr. Takiyama looks up, but doesn't see anyone up there] Prease, come meet me on top of the Tower of Peace. It would be rearry nice. [Tuong Lu Kim's image begins to rubs its hands together] Yesss, and when you get to the top of that tower you're gonna get a rittle surprise, you Japane- Oh, sorry. Anyway, see you on top of tower! [Mr. Takiyama leaves his sample display booth and goes into the tower]"
    },
    {
        "character": "",
        "line": "Meanwhile, in a mansion, Dr. Janus and Butters walk around with flashlights"
    },
    {
        "character": "Dr. Janus",
        "line": "[as Billy] Dr. Janus sure has a big house, dudn't he? He's planning on hurting people; I just know it!"
    },
    {
        "character": "Butters",
        "line": "It's okay, Billy, we're gonna get to the bottom of this."
    },
    {
        "character": "Dr. Janus",
        "line": "This is kinda fun. You're Inspector Butters and I'm your faithful assistant, Dr. Watson!"
    },
    {
        "character": "Butters",
        "line": "Well alright, Watson, well let's find out what we need to and get out of here!"
    },
    {
        "character": "Dr. Janus",
        "line": "Yeah! [Dr. Janus takes over] Butteers, what are you doing in my house?"
    },
    {
        "character": "Butters",
        "line": "Hah?"
    },
    {
        "character": "Dr. Janus",
        "line": "Oh dear. It's okay, Butters. You just think you're Inspector Butters right now."
    },
    {
        "character": "Butters",
        "line": "Aw man."
    },
    {
        "character": "Dr. Janus",
        "line": "[escorts Butters to the front door] Come on, let's get you home. [Billy takes over] Where are ya gon', Butters?"
    },
    {
        "character": "Butters",
        "line": "Oh, come on!"
    },
    {
        "character": "Dr. Janus",
        "line": "You aren't leaving here, Inspector! None of you are!"
    },
    {
        "character": "Butters",
        "line": "AAAAAAAAAAA! [runs away. Dr. Janus follows him upstairs] AAAAAAAAAAA!"
    },
    {
        "character": "Dr. Janus",
        "line": "Butters, come on! Try and come back to us! [Mean Guy takes over] You can't run forever! [pizza delivery man takes over] Excuse me, did someone order a pizza? [Dr. Janus takes over] Yes, that was me, but I'm a little busy at the moment. I'll be right back! [Mean Guy takes over as Butters enters an attic room or a penthouse floor] You'll never turn me in, Inspector Butters! You're dead!"
    },
    {
        "character": "Butters",
        "line": "Waaaa! [runs to the end of a hall and knocks on the door found there. The door opens and he falls into a room. He looks up and gasps at what he sees: walls covered in newspaper headlines about City Sushi and its chef, and one word written in blood: KILL. Dr. Janus reaches the room and Butters looks over his shoulder. Dr. Janus squints his face and combs over his hair: it's...]"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "They wanna take over my Shitty Woookk?! Hory crap, what time is it? [checks his watch] Oh no, I'm rate! [turns around and runs downstairs, leaving Butters quite confused]"
    },
    {
        "character": "",
        "line": "The Tower of Peace, night. Tuong Lu Kim runs upstairs and reaches the top, and sighs"
    },
    {
        "character": "Mr. Takiyama",
        "line": "What took you so long?!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "[takes out a cigarette, clips the end off, and lights it] Yes, I'm afraid my Tower of Peace was a rittle bit of trickery, Mr. Japanese dog. I'm going to put an end to you, and everyone gonna think it's just because you did what Japanese people ruve doing most. \"No, don't do it! Don't kill yourself, prease!\" [jumps on Mr. Takiyama and grabs him by the throat]"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Urgh. Fuck you! I'ma not trying to kill myself!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "\"No, don't do it, prease!\" [some sirens are heard below] \"So much to rive for!\" [floodlights quickly find the two chefs, and they stand down]"
    },
    {
        "character": "Sgt. Yates",
        "line": "[through his bullhorn] This is South Park Police!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Porice?! How?!"
    },
    {
        "character": "Sgt. Yates",
        "line": "We know the truth, Dr. Janus!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "Thisa Chinise rat trying to kill me!"
    },
    {
        "character": "Sgt. Yates",
        "line": "He's not Chinese! He's white!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "What the fuck you talkin' about?!"
    },
    {
        "character": "Sgt. Yates",
        "line": "[enunciating] Your name is Dr. Janus!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "You people crazy! [Billy takes over] Listen to them! It's true! [Mean Guy takes over] Truth hurts, doesn't it, Janus! [Dr. Janus takes over] Who are you people?! Why are you all here?!"
    },
    {
        "character": "Mr. Takiyama",
        "line": "How could I ret myself berieve white man was a Chinese?! I have brought shame upon myself! [gets on the balcony and jumps off] Nooooo, this is racial stereotaipuuu! [crashes into his own restaurant, destroying it and dying upon impact]"
    },
    {
        "character": "",
        "line": "Park County Police station, night. The police are talking to Butters and his parents"
    },
    {
        "character": "Steven",
        "line": "So you're telling us that Dr. Janus has been the owner of City Wok all this time?"
    },
    {
        "character": "Sgt. Yates",
        "line": "That's right. Of all his multiple personalities, the strongest was Lu Kim. And we never would have known... if it hadn'ta been for Inspector Butters. [the other officers present give Butters a round of applause.]"
    },
    {
        "character": "Butters",
        "line": "Thanks. I'm just glad the whole thing is over and done. Maybe now poor old Dr. Janus can finally get the help he needs."
    },
    {
        "character": "Steven",
        "line": "Yes Butters. Thanks to you, maybe Dr. Janus can get back to his real self."
    },
    {
        "character": "Sgt. Yates",
        "line": "[walks off] Yes, I'm sure he could. But, then again, [stops, then turns around] does the world really need another therapist?"
    },
    {
        "character": "Steven",
        "line": "Whattaya mean?"
    },
    {
        "character": "Sgt. Yates",
        "line": "Well I mean, would it really be so bad for us to just let him go on thinking he's Lu Kim forever? Now that City Sushi is gone, City Wok is the only Chinese restaurant left in town."
    },
    {
        "character": "Desk officer",
        "line": "Oh yeah."
    },
    {
        "character": "Black officer",
        "line": "Yeah. Let's just let him keep believing he's a Chinese man."
    },
    {
        "character": "Sgt. Yates",
        "line": "Done!"
    },
    {
        "character": "Other officers",
        "line": "Good! Alright! Alright! Yeah!"
    },
    {
        "character": "Blond officer",
        "line": "Detective, he's asking for a blanket. Is that alright?"
    },
    {
        "character": "Sgt. Yates",
        "line": "Go ahead. We're gonna process him and get him back to the restaurant. [the officer who conveyed the request carries a blanket back to Tuong Lu Kim's cell. He enters...]"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Thank you. [...and leaves. The guard by the door locks it] \"Oooooo, I hate Japanese people! They try and shut down my Shitty Wok, but they never wiiiiill. They're probably all ratching me, the Japanese. Ret them! I'm not even gonan swat that fryyy. They'll see. And they'll say 'Wow, that Shitty Wok owner. Why, he wouldn't even harm a fryyyyy.'\" [City Wok is shown one more time]"
    }
]