[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Sundance Film Festival. A small Western town. Bustling sounds are heard as the camera slowly pans down. A crowd streams by in the background behind a sports car and limo, and front and center are Robert Redford and a woman."
    },
    {
        "character": "Robert Redford",
        "line": "Why do we hold the Sundance Film Festival here, Phyllis? It's so painfully crowded."
    },
    {
        "character": "Phyllis",
        "line": "Because. People from L.A. love to come to a quaint little mountain town for a few days, and this gives them an excuse."
    },
    {
        "character": "Robert Redford",
        "line": "No, this used to be a quaint little mountain town. Now look at it. Sushi restaurants, upscale clothes stores, $25 parking, Liam Neeson... I tell you, Phyllis, I think we've tapped this town's resources out. We must move the festival to another small mountain town and begin again."
    },
    {
        "character": "Phyllis",
        "line": "That's not a bad idea. But where?"
    },
    {
        "character": "",
        "line": "South Park. Winter is indeed back. A man hums as he arrives at the town flag pole with a purple flag and runs it up to the top. It unfurls, revealing: 1st Annual South Park Film Festival. A crowd instantly pours in and mills about."
    },
    {
        "character": "Man in background",
        "line": "Ching ching cha-ching."
    },
    {
        "character": "Man in foreground",
        "line": "Whoa."
    },
    {
        "character": "",
        "line": "South Park Elementary."
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay, children. I have some very exciting news for you... Oo-why don't you tell them, Mr. Twig?"
    },
    {
        "character": "Mr. Twig",
        "line": "That's right, Mr. Garrison. The First Annual South Park Film Festival begins today."
    },
    {
        "character": "Wendy",
        "line": "Wow! Cool!"
    },
    {
        "character": "Kyle",
        "line": "They're not gonna show that stupid-ass Godzilla movie again, are they?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Nono, Kyle. These are independent films."
    },
    {
        "character": "Stan",
        "line": "Hoohh, like Independence Day? That sucked ass, too."
    },
    {
        "character": "Cartman",
        "line": "No, dude, independent films are those black and white hippie movies. They're always about gay cowboys eating pudding."
    },
    {
        "character": "Wendy",
        "line": "No they're not! Independent films are produced outside the Hollywood system. They're movies about all the glitz and glamour of Hollywood."
    },
    {
        "character": "Cartman",
        "line": "Byeh, sure. Well, you show me one independent film that isn't about gay cowboys eating pudding!"
    },
    {
        "character": "Wendy",
        "line": "Once again, you have no idea what you're talking about, fatass!"
    },
    {
        "character": "Cartman",
        "line": "I'm not fat! I just haven't grown into my body yet, skinny bitch!"
    },
    {
        "character": "Wendy",
        "line": "(Gasp)!"
    },
    {
        "character": "Mr. Garrison",
        "line": "Eric, if you call Wendy a bitch one more time, I'm sending you to the principal's office!"
    },
    {
        "character": "",
        "line": "Cartman looks around for a second."
    },
    {
        "character": "Cartman",
        "line": "...bitch."
    },
    {
        "character": "Mr. Garrison",
        "line": "That's it Eric, you-!"
    },
    {
        "character": "Cartman",
        "line": "I'm going!"
    },
    {
        "character": "",
        "line": "He hops off his chair and walks out, closing the door behind him."
    },
    {
        "character": "Mr. Garrison",
        "line": "Anyway, children, I want you all to see at least one independent film at the festival and then write a paper about it."
    },
    {
        "character": "",
        "line": "The class groans."
    },
    {
        "character": "Mr. Garrison",
        "line": "The first film showing is called Witness To Denial, and it's a sexual exploration piece about two women in love."
    },
    {
        "character": "Stan",
        "line": "Oh, my uncle Jimbo has a ton of those movies in his dresser drawer."
    },
    {
        "character": "",
        "line": "There's certainly a lot of people now. Two of them are talking on cell phones."
    },
    {
        "character": "Director 1",
        "line": "Norma, I want to shoot the script next month with Demi Moore instead."
    },
    {
        "character": "Director 2",
        "line": "[In shorts!] Well you can tell Spielberg he can kiss my ass!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "[Walking about with one of her aides.] Wow, look at this, Johnson. Traffic jams at every intersection, hoards of people pushing their way through the crowd. It's almost like we're a real city."
    },
    {
        "character": "",
        "line": "After school and the kids are out in the town."
    },
    {
        "character": "Cartman",
        "line": "I can't believe I got sent to the principal's office because of your stupid girlfriend!"
    },
    {
        "character": "Stan",
        "line": "She's not my girlfriend."
    },
    {
        "character": "Kenny",
        "line": "(Yeah, that's because you vomit on her all the time.)"
    },
    {
        "character": "",
        "line": "Cartman and Kyle laugh."
    },
    {
        "character": "Kyle",
        "line": "Sick, Kenny."
    },
    {
        "character": "Stan",
        "line": "Damn, dude. Look at all these people."
    },
    {
        "character": "Director 3",
        "line": "[Rushing by with a cell phone.] I'm late for a screening, I'll call you from the theater."
    },
    {
        "character": "Kyle",
        "line": "All this for a bunch of stupid movies?"
    },
    {
        "character": "",
        "line": "They come upon a stand that saysCHEF'SSOUL FOOD\n"
    },
    {
        "character": "Chef",
        "line": "Hello there, children!"
    },
    {
        "character": "The boys",
        "line": "Hey, Chef."
    },
    {
        "character": "Stan",
        "line": "Whatcha doin'?"
    },
    {
        "character": "Chef",
        "line": "Children, this whole film festival thing has quite lucrative monetary possibilities. Now I'm gonna sell some of my famous cookies, to these Hollywood types, and make a mint!"
    },
    {
        "character": "Cartman",
        "line": "What kind of cookies?"
    },
    {
        "character": "Stan",
        "line": "Calm down, tubby."
    },
    {
        "character": "Chef",
        "line": "They're little cookies, with fudge in the middle. And I call them, \"Fudge 'Ems\"."
    },
    {
        "character": "",
        "line": "Chef pulls out a box with that name on them."
    },
    {
        "character": "Cartman",
        "line": "I wanna Fudge 'Em."
    },
    {
        "character": "Chef",
        "line": "I can just see the commercial now. \"Wife got you down? Boss makin' you angry? Kids yellin' atcha? Well, Fudge 'Ems.\""
    },
    {
        "character": "Kyle",
        "line": "Cool!"
    },
    {
        "character": "Chef",
        "line": "And I've also got my double chocolate cookies, \"Fudge This.\""
    },
    {
        "character": "Director 3",
        "line": "[Passing by with his date.] Oh look, one of the natives is selling local food wares... how quaint."
    },
    {
        "character": "Woman",
        "line": "This is why I come to these things, to get away from L.A. and become one with the more simple culture."
    },
    {
        "character": "Chef",
        "line": "Well, perhaps you'd like to try my low-calorie cookies, \"Go Fudge Yourself,\" or my all-natural, \"I Don't Really Give A Flying Fudge.\""
    },
    {
        "character": "Woman",
        "line": "Ooh, do you have any tofu or steamed celery?"
    },
    {
        "character": "Chef",
        "line": "Huh?"
    },
    {
        "character": "Director 3",
        "line": "I would kill for some cous cous right now."
    },
    {
        "character": "Chef",
        "line": "Whose goose?"
    },
    {
        "character": "Woman",
        "line": "Uuuuh, never mind. We brought some food from the Natural Market in L.A."
    },
    {
        "character": "Director 3",
        "line": "Cute sign, though."
    },
    {
        "character": "",
        "line": "The couple leaves, and Chef looks confused. Wendy walks up."
    },
    {
        "character": "Wendy",
        "line": "Stan, I have two tickets for the opening film of the festival. Would you like to come with me?"
    },
    {
        "character": "Cartman",
        "line": "[Taunting.] Stan, nunh tunh tunh tunh tunh tunh tunh tunh tunh tunh tunh tunh hunh. Tunh tunh tunh tunh tinh teenh?"
    },
    {
        "character": "Stan",
        "line": "Shut up, Cartman! [To Wendy.] Sure, dude. I mean, since we have to write a paper on a film anyway. [They walk away.]"
    },
    {
        "character": "Cartman",
        "line": "She'll be the death of him, Kyle. Mark my words: she'll be the death of him."
    },
    {
        "character": "Kyle",
        "line": "If she holds his hand in that theater it'll be all over."
    },
    {
        "character": "Chef",
        "line": "Get 'em while they're hot! My all new cookies! \"I Just Went And Fudged Your Momma!\""
    },
    {
        "character": "Cartman",
        "line": "[To Kyle.] Jesus, he sure ran that one into the ground."
    },
    {
        "character": "",
        "line": "At the Bijou, South Park's movie theater. Now playing: Witness To Denial. Stan sits in the front row with Wendy."
    },
    {
        "character": "Stan",
        "line": "When's this thing start? I hope there are some good previews."
    },
    {
        "character": "Wendy",
        "line": "Stan, film festival movies usually don't have previews before them."
    },
    {
        "character": "Stan",
        "line": "They what?!"
    },
    {
        "character": "",
        "line": "The projectionist starts the film. Only the right half of a woman is shown in close-up. The sound is overmodulated."
    },
    {
        "character": "Candice",
        "line": "Who are you to judge my womanly soul?"
    },
    {
        "character": "",
        "line": "Her girlfriend appears far in the background."
    },
    {
        "character": "Candice",
        "line": "The Goddess flames that burn in my memory aren't dark. Dare you call them dark!"
    },
    {
        "character": "",
        "line": "They switch places. The girlfriend's left side appears in close-up."
    },
    {
        "character": "Candice",
        "line": "Here lies the Goddess truth of my body."
    },
    {
        "character": "Stan",
        "line": "[With soda and popcorn.] Oh, brother."
    },
    {
        "character": "Candice",
        "line": "The Goddess that cries, \"Freedom!\""
    },
    {
        "character": "",
        "line": "Her hands cover her mouth."
    },
    {
        "character": "Candice",
        "line": "Here is the Goddess truth of my womanly being"
    },
    {
        "character": "",
        "line": "Stan puts his left hand on the arm rest. Wendy reaches for his soda and takes a sip. In a new scene, Candice is talking to her lover, who wears a Lilith Fare shirt."
    },
    {
        "character": "Candice",
        "line": "You are my blossom, my flame. When we make love, it's like the sun is right outside the door."
    },
    {
        "character": "Candice's Girlfriend",
        "line": "Then make love to me, right now"
    },
    {
        "character": "",
        "line": "The two of them embrace and drop out of view."
    },
    {
        "character": "Stan",
        "line": "Dude!"
    },
    {
        "character": "Wendy",
        "line": "Sshh!"
    },
    {
        "character": "Stan",
        "line": "Dude!"
    },
    {
        "character": "",
        "line": "Kyle's house. He's in the restroom crapping away."
    },
    {
        "character": "Kyle",
        "line": "I can see clearly now, the rain is gone\nI can see all obstacles in my way-\n\n\n"
    },
    {
        "character": "Sheila",
        "line": "[From the master bedroom.] Bubbeleh you need to get to bed! It's late!"
    },
    {
        "character": "Kyle",
        "line": "I'm poopies, ma!"
    },
    {
        "character": "Sheila",
        "line": "Well, hurry up!"
    },
    {
        "character": "Kyle",
        "line": "Gone are the dark clouds that had me-\n\n\n"
    },
    {
        "character": "Mr. Hankey",
        "line": "[Voice only, slowly, with echo.] Ky-yle! Ky-yle!"
    },
    {
        "character": "",
        "line": "Kyle looks down into the toilet."
    },
    {
        "character": "Kyle",
        "line": "Could it be?"
    },
    {
        "character": "Mr. Hankey",
        "line": "[In his shrill voice.] Hooowwwdy ho!"
    },
    {
        "character": "",
        "line": "Kyle hops off and looks into the toilet. No poo is seen."
    },
    {
        "character": "Kyle",
        "line": "Mr. Hankey? Mr. Hankey, is that you? Hello?"
    },
    {
        "character": "",
        "line": "Day two of the South Park Film Festival."
    },
    {
        "character": "Tom",
        "line": "I'm here live in South Park, Colorado, where citizens from Los Angeles are arriving in droves for the town's first annual film festival. This is just a small quiet mountain community where nothing out of the ordinary ever really happens, [Softly.] except for the occasional complete destruction of the entire town [Normally.] and so the excitement level is naturally very high. Right now, the townspeople are anxiously awaiting the arrival of some of Hollywood's top celebrities."
    },
    {
        "character": "",
        "line": "At the Bijou, the boys are watching \"The Body Decayeth\"."
    },
    {
        "character": "Kyle",
        "line": "It was him, dude. I told you, it was Mr. Hankey!"
    },
    {
        "character": "Cartman",
        "line": "Wait, I thought Mr. Hankey only came at Christmastime."
    },
    {
        "character": "Kyle",
        "line": "Well, I'm sure it was him."
    },
    {
        "character": "Man",
        "line": "Look, look! Here comes somebody!"
    },
    {
        "character": "",
        "line": "People come closer as a limousine pulls up. Someone steps out."
    },
    {
        "character": "A woman",
        "line": "Move aside, I can't see."
    },
    {
        "character": "Tom",
        "line": "Ladies and gentlemen, TV's Fred Savage."
    },
    {
        "character": "",
        "line": "Fred Savage steps out of the limo wearing a shirt that says, 'I'm Fred Savage'."
    },
    {
        "character": "Crowd",
        "line": "[In disappointment.] AAWWWW!"
    },
    {
        "character": "",
        "line": "Fred's head drops as the limo and crowd scurries away."
    },
    {
        "character": "Tom",
        "line": "Well, I'm sure a real person will show up soon."
    },
    {
        "character": "Kyle",
        "line": "So how was that movie last night, dude?"
    },
    {
        "character": "Stan",
        "line": "Aw, dude, you don't even wanna know!"
    },
    {
        "character": "Cartman",
        "line": "It had a bunch of gay cowboys eating pudding, huh?"
    },
    {
        "character": "Stan",
        "line": "Yeah, pretty much."
    },
    {
        "character": "Cartman",
        "line": "Yeah!"
    },
    {
        "character": "Stan",
        "line": "The theater sucks, though. They need to get a bigger screen."
    },
    {
        "character": "Kyle",
        "line": "Maybe they should project the movies on Cartman's ass."
    },
    {
        "character": "",
        "line": "Stan and Kenny laugh."
    },
    {
        "character": "Cartman",
        "line": "Ay!"
    },
    {
        "character": "Stan",
        "line": "Yeah, but that'd be like IMAX."
    },
    {
        "character": "",
        "line": "Kyle and Kenny laugh."
    },
    {
        "character": "Cartman",
        "line": "Okay, that's enough fat-ass jokes for this week."
    },
    {
        "character": "Kenny",
        "line": "(Cartman's ass is so fuckin' huge that they could probably show six stupid films on it and still have some room, heheheheheh.)"
    },
    {
        "character": "",
        "line": "Stan and Kyle laugh."
    },
    {
        "character": "Cartman",
        "line": "Okay, that does it. Screw you guys, I'm going home."
    },
    {
        "character": "",
        "line": "Cartman looks around, but doesn't go anywhere."
    },
    {
        "character": "Kyle",
        "line": "Well?"
    },
    {
        "character": "Cartman",
        "line": "I'm gonna, just give me a minute."
    },
    {
        "character": "Robert Redford",
        "line": "This is perfect. Why didn't we think of it sooner? This town still has some charm left, not the mess we turned Park City into."
    },
    {
        "character": "Phyllis",
        "line": "Forgive me for being observant, but, won't we just end up doing the same thing to this town?"
    },
    {
        "character": "Robert Redford",
        "line": "Yes. And the town after, and the town after that. Like termites, we will move this film festival from town to town until we have used it up. And then move on, until every quiet mountain town is like Los Angeles."
    },
    {
        "character": "Phyllis",
        "line": "Why? Why would we do such a thing?"
    },
    {
        "character": "Robert Redford",
        "line": "Because we have to live in L.A. And if we can't live in quiet, simple, peaceful mountain towns, then nobody will!"
    },
    {
        "character": "",
        "line": "He laughs maniacally."
    },
    {
        "character": "Robert Redford",
        "line": "Waitwaitwait. Zoom in to a close-up of my face when I do that. Ready? Then NOBODY will!"
    },
    {
        "character": "",
        "line": "The camera moves in as he laughs maniacally again."
    },
    {
        "character": "Robert Redford",
        "line": "That's it."
    },
    {
        "character": "",
        "line": "The kids pass by Chef's booth. Cartman is still with them. Now the booth says \"Chef's Salty Balls\""
    },
    {
        "character": "Chef",
        "line": "Children! I'm glad you're here! I want you to check out my new confectioneries. I think they're going to sell right through the roof! I call them, \"Chef's Salty Chocolate Balls.\""
    },
    {
        "character": "",
        "line": "He brings out the cookie tray to show them. The boys say nothing."
    },
    {
        "character": "Stan",
        "line": "Are they good?"
    },
    {
        "character": "Chef",
        "line": "Try 'em."
    },
    {
        "character": "Stan",
        "line": "Hey, dude, these are good!"
    },
    {
        "character": "Cartman",
        "line": "Yeah, I love these Salty Chocolate Balls, Chef."
    },
    {
        "character": "",
        "line": "Kenny laughs at Cartman's unintended double entendre."
    },
    {
        "character": "Mr. Hankey",
        "line": "[From under the runoff grate.] Ky-yle!"
    },
    {
        "character": "Kyle",
        "line": "There it is again!"
    },
    {
        "character": "",
        "line": "Stan and Kyle have traded places."
    },
    {
        "character": "Stan",
        "line": "There is what again?"
    },
    {
        "character": "",
        "line": "Kyle looks left."
    },
    {
        "character": "Mr. Hankey",
        "line": "[Moaning.] Ky-yle!"
    },
    {
        "character": "Kyle",
        "line": "It's Mr. Hankey! I think he's in some kind of trouble."
    },
    {
        "character": "",
        "line": "Mr. Hankey's theme song begins to play."
    },
    {
        "character": "Stan",
        "line": "Dude, how do you tell if a piece of poo is in trouble?"
    },
    {
        "character": "Kyle",
        "line": "Where does that grill go?"
    },
    {
        "character": "Stan",
        "line": "To the sewer, dude."
    },
    {
        "character": "Kyle",
        "line": "Of course, the sewer! That must be where he is. Come on!"
    },
    {
        "character": "",
        "line": "He walks off, but stops when no one follows."
    },
    {
        "character": "Kyle",
        "line": "Come on!"
    },
    {
        "character": "",
        "line": "The boys have left, Chef starts to sing."
    },
    {
        "character": "Chef",
        "line": "Hey, everybody,\nhave you seen my balls?\nThey're big and salty and brown\nIf you ever need a quick pick-me-up,\njust stick my balls in your mouth\nOoooo, suck on my cho-colate salty balls\nput 'em in your mouth\nPut 'em in your mouth and suck 'em and suck 'em...\n\n\n"
    },
    {
        "character": "",
        "line": "The boys are now in the sewer with flashlights in hand. A rat clamors up a pipe and out of view. Spiderwebs are everywhere."
    },
    {
        "character": "Cartman",
        "line": "Aw, man, smells like ass down here."
    },
    {
        "character": "Kyle",
        "line": "Of course it smells like ass, retard. It's a sewer!"
    },
    {
        "character": "",
        "line": "A sound is heard and the boys quickly turn to look."
    },
    {
        "character": "Stan",
        "line": "What was that?"
    },
    {
        "character": "",
        "line": "The beam of his flashlight lands on a rat."
    },
    {
        "character": "Cartman",
        "line": "Aw, man, let's get out of here!"
    },
    {
        "character": "Kyle",
        "line": "We can't, dude. Not until we find Mr. Hankey."
    },
    {
        "character": "",
        "line": "They look ahead, only to see something making splashes in the water."
    },
    {
        "character": "The boys",
        "line": "Aaaaah!"
    },
    {
        "character": "Kenny",
        "line": "(Wait!)"
    },
    {
        "character": "",
        "line": "The figure rises and turns, only to reveal itself as a snorkeling human, Mr. Garrison, with him is Mr. Twig."
    },
    {
        "character": "Kyle",
        "line": "What the hell?"
    },
    {
        "character": "",
        "line": "Mr. Garrison removes his mouthpiece."
    },
    {
        "character": "Stan",
        "line": "Mr. Garrison?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh uh- hello, children."
    },
    {
        "character": "Cartman",
        "line": "What are you doing down in the sewer with a bunch of snorkel stuff on?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh I- I was just-uh hangin' out."
    },
    {
        "character": "Kyle",
        "line": "In a sewer?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Children, do you know how to file a police report?"
    },
    {
        "character": "The boys",
        "line": "No."
    },
    {
        "character": "Mr. Garrison",
        "line": "Good. See you in school."
    },
    {
        "character": "",
        "line": "He puts his mouthpiece back on and drops into the water. The boys are stunned, but walk forward."
    },
    {
        "character": "Cartman",
        "line": "This is ridiculous! What the hell are we, the Goonies?"
    },
    {
        "character": "Kyle",
        "line": "Yeah, we're the Goonies, Cartman. Why don't you pretend like you're the fat kid?"
    },
    {
        "character": "Cartman",
        "line": "Okay, that does it. Screw you guys, I'm home."
    },
    {
        "character": "Mr. Hankey",
        "line": "Hooowwwdy ho!"
    },
    {
        "character": "",
        "line": "The boys turn to see Mr. Hankey rowing in a paper fries tray."
    },
    {
        "character": "Kyle",
        "line": "Mr. Hankey!"
    },
    {
        "character": "Mr. Hankey",
        "line": "Howdy-ho, boys."
    },
    {
        "character": "Kyle",
        "line": "I told you guys he'd be here!"
    },
    {
        "character": "Mr. Hankey",
        "line": "Gosh, look at yuh. You're all growin' up sho fasht."
    },
    {
        "character": "Cartman",
        "line": "[Displeased.] Hi, Mr. Hankey. Nice to see yuh."
    },
    {
        "character": "Mr. Hankey",
        "line": "Have you all been brushing behind your teeth?"
    },
    {
        "character": "The boys",
        "line": "Yes."
    },
    {
        "character": "Mr. Hankey",
        "line": "And usin' dental floss?"
    },
    {
        "character": "The boys",
        "line": "Yes."
    },
    {
        "character": "Mr. Hankey",
        "line": "And washin' behind your ears?"
    },
    {
        "character": "The boys",
        "line": "Yes."
    },
    {
        "character": "Cartman",
        "line": "No."
    },
    {
        "character": "",
        "line": "Mr. Hankey coughs."
    },
    {
        "character": "Kyle",
        "line": "What's the matter, Mr. Hankey? Are you sick?"
    },
    {
        "character": "Mr. Hankey",
        "line": "Oh, I just got a little cold is all. All these new people in South Park are stressful on my home."
    },
    {
        "character": "Stan",
        "line": "What do you mean?"
    },
    {
        "character": "Mr. Hankey",
        "line": "Well, you see, boys, the sewer is a fragile ecosystem."
    },
    {
        "character": "Cartman",
        "line": "[Incredulous.] Oh my God."
    },
    {
        "character": "Mr. Hankey",
        "line": "These new folks in town eat nothin' but cous cous, tofu, and raw vegetables, and it's destroying my environment."
    },
    {
        "character": "Kyle",
        "line": "And that's why you got a cold?"
    },
    {
        "character": "Mr. Hankey",
        "line": "That's why, Kyle. That's why."
    },
    {
        "character": "Stan",
        "line": "Well, why don't you just ask them to leave?"
    },
    {
        "character": "Mr. Hankey",
        "line": "There's only one time of year I can come to the surface, and that's Christmastime. That's why I need you boys to go for me."
    },
    {
        "character": "",
        "line": "He coughs some more."
    },
    {
        "character": "Kyle",
        "line": "Don't worry, Mr. Hankey. We'll go tell everyone. Come on, guys."
    },
    {
        "character": "",
        "line": "The boys move off."
    },
    {
        "character": "Mr. Hankey",
        "line": "Don't forget to change your sheets once a week!"
    },
    {
        "character": "",
        "line": "Mr. Hankey rows away. Meanwhile, back at the festival... Playing at the Bijou: \"A Bunch Of Gay Cowboys Eating Pudding.\" Score another one for Cartman. Inside, the festival host stands before the movie audience."
    },
    {
        "character": "Host",
        "line": "So without further ado we will begin this amazing film. It's a work of blood, sweat, and tears."
    },
    {
        "character": "Kyle",
        "line": "[Rushing in.] Wait! Stop! Could I have your attention, please?"
    },
    {
        "character": "Director 4",
        "line": "Is that Leonardo DiCaprio?"
    },
    {
        "character": "",
        "line": "The audience buzzes and cameras flash everywhere, Kyle shields his eyes."
    },
    {
        "character": "Kyle",
        "line": "Aaahh!"
    },
    {
        "character": "Director 4",
        "line": "Ohuh no, wait, that's not him."
    },
    {
        "character": "",
        "line": "The audience groans."
    },
    {
        "character": "Kyle",
        "line": "Ladies and gentlemen, my best friend, Mr. Hankey, is getting sick because South Park has become overcrowded with people who eat health food."
    },
    {
        "character": "Female director",
        "line": "Excuse me, little boy, what's a \"Mr. Hankey\"?"
    },
    {
        "character": "Kyle",
        "line": "He's a talking piece of poo that lives in the sewer. But now he's getting sick because his egosystem is all out of whack because of all the extra poo in the sewer. If you don't all leave and go home soon, Mr. Hankey's gonna die. He's one of my best friends in the whole wide world, and I don't want him to die."
    },
    {
        "character": "",
        "line": "No reaction from the audience."
    },
    {
        "character": "Director 3",
        "line": "What a great story-it has everything!"
    },
    {
        "character": "Female director",
        "line": "This could be the next Free Willy."
    },
    {
        "character": "Director 5",
        "line": "Great pic, son. How much do you want for it?"
    },
    {
        "character": "Kyle",
        "line": "Huh??"
    },
    {
        "character": "Director 6",
        "line": "Does it-uh have to be a talking piece of poo?"
    },
    {
        "character": "",
        "line": "The boys just stare."
    },
    {
        "character": "Director 7",
        "line": "It could be a crime-fighting rabbit. Or a lovable turtle."
    },
    {
        "character": "Director 4",
        "line": "This could be a great summer movie."
    },
    {
        "character": "Female director 2",
        "line": "[Rising in the back.] Can we put a mon-key in it?"
    },
    {
        "character": "Director 8",
        "line": "\"The Mr. Hankey Stor-\" uh is Harrison Ford available for a fall pic?"
    },
    {
        "character": "Director 9",
        "line": "Keanu Reeves."
    },
    {
        "character": "Director 10",
        "line": "Matt Damon!"
    },
    {
        "character": "Fred Savage",
        "line": "Fred Savage!"
    },
    {
        "character": "",
        "line": "The other audience members laugh at the thought, and Fred is miffed."
    },
    {
        "character": "Director 7",
        "line": "I'd pay a million for this story!"
    },
    {
        "character": "Director 10",
        "line": "I'll pay two."
    },
    {
        "character": "",
        "line": "The rest of the audience descends into conversation."
    },
    {
        "character": "Kyle",
        "line": "Dude, no one even listened to me."
    },
    {
        "character": "Stan",
        "line": "Well um, it does sound like a pretty sweet movie."
    },
    {
        "character": "",
        "line": "One of the directors has pulled Cartman aside."
    },
    {
        "character": "Director 3",
        "line": "Mmuh I take it you're part owner of this whole Mr. Hooey story, right?"
    },
    {
        "character": "Cartman",
        "line": "Huh? Uhuh, yeah, I guess."
    },
    {
        "character": "Director 3",
        "line": "I want you to do a big-money deal with me."
    },
    {
        "character": "Cartman",
        "line": "All of us?"
    },
    {
        "character": "Director 3",
        "line": "Mm-we-hell, I can see that you're the real brains of the group. You don't really need those guys, do you?"
    },
    {
        "character": "Cartman",
        "line": "Ye-ah, screw those guys. I don't even like them."
    },
    {
        "character": "Director 3",
        "line": "Hm-that's great, kid. Let's make a deal."
    },
    {
        "character": "",
        "line": "They walk off. Meanwhile, in front of the library. Robert Redford and Phyllis have something to announce. Of course, the Mayor and her aides are there."
    },
    {
        "character": "Robert Redford",
        "line": "Ladies and gentlemen, I want to thank you all for making the First Annual South Park Film Festival a success. We've barely even started and already the festival has seen more attendance than last year's Sundance festival."
    },
    {
        "character": "",
        "line": "The crowd cheers."
    },
    {
        "character": "Someone in the crowd",
        "line": "Fantastic!"
    },
    {
        "character": "Robert Redford",
        "line": "And I'm very pleased to announce that in honor of the South Park people who have welcomed us, we are going to build a Hollywood Planet restaurant, right here where this library used to stand."
    },
    {
        "character": "",
        "line": "A wrecking ball appears and knocks the building down with one fell swoop."
    },
    {
        "character": "Crowd",
        "line": "[Gasping.] Ooohhh!"
    },
    {
        "character": "Aide 2",
        "line": "Can they do that?"
    },
    {
        "character": "Mayor McDaniels",
        "line": "They're Hollywood! They can do anything!"
    },
    {
        "character": "",
        "line": "Kyle is in the sewer all alone, looking to tell Mr. Hankey the bad news. An organ is heard."
    },
    {
        "character": "Kyle",
        "line": "Mr. Hankey!"
    },
    {
        "character": "",
        "line": "Kyle looks all around and walks."
    },
    {
        "character": "Kyle",
        "line": "Mr. Hankey?!"
    },
    {
        "character": "",
        "line": "Kyle is surprised to see an organ before him, and Mr. Hankey playing vigorously."
    },
    {
        "character": "Kyle",
        "line": "Mr. Hankey?"
    },
    {
        "character": "Mr. Hankey",
        "line": "[Turns around.] Oh, Kyle. Howdy-ho."
    },
    {
        "character": "",
        "line": "Mr. Hankey starts coughing again."
    },
    {
        "character": "Mr. Hankey",
        "line": "Well, how did it go? Is everyone gonna stop poopin' in my environment?"
    },
    {
        "character": "Kyle",
        "line": "They didn't believe me. They thought I was pitching a movie."
    },
    {
        "character": "Mr. Hankey",
        "line": "[Droops.] Oh. I, I see. Welluh shucks, Kyle, I can't thank you enough for tryin'."
    },
    {
        "character": "",
        "line": "He turns back and starts playing the organ again."
    },
    {
        "character": "Kyle",
        "line": "[Determined.] We only have one option. I've gotta take you to the surface."
    },
    {
        "character": "Mr. Hankey",
        "line": "Aw I can't. The sun'll dry me out."
    },
    {
        "character": "Kyle",
        "line": "It's the only way to prove to them that you're real."
    },
    {
        "character": "Mr. Hankey",
        "line": "But I won't last long up above."
    },
    {
        "character": "Kyle",
        "line": "Well, you're not gonna last down here either, Mr. Hankey. Now, come on! I'm not gonna let you die!"
    },
    {
        "character": "Mr. Hankey",
        "line": "All right, just let me get my toothbrush."
    },
    {
        "character": "",
        "line": "The Bijou. Wendy and Stan are heading for the ticket booth."
    },
    {
        "character": "Wendy",
        "line": "Come on, Stan, we're gonna be late for the screening!"
    },
    {
        "character": "",
        "line": "They look up to see \"Tom Hanks in: Me & Mr. Hankey\"."
    },
    {
        "character": "Stan",
        "line": "Jeez, they made that into a movie already?"
    },
    {
        "character": "",
        "line": "Inside, they sit in the first row, middle two seats. On the screen, Tom Hanks is in a hospital with a fever, hand to forehead."
    },
    {
        "character": "Tom Hanks",
        "line": "Mr. Hankey, I can't go on anymore. I've lost the fight."
    },
    {
        "character": "Mr. Hankey",
        "line": "[A talking monkey hanging from the curtain.] No, I'm not leaving without you."
    },
    {
        "character": "",
        "line": "The monkey drops down and goes to Tom Hanks' bedside."
    },
    {
        "character": "Mr. Hankey",
        "line": "We started this together, we're gonna finish it together."
    },
    {
        "character": "",
        "line": "The monkey holds his hand."
    },
    {
        "character": "Tom Hanks",
        "line": "I always thought death was something glorious, but now I know that it's not."
    },
    {
        "character": "",
        "line": "Stan reaches out for Wendy's hand. Wendy cries, blows her nose into a napkin, and hands it to Stan, who just looks at it."
    },
    {
        "character": "Director 3",
        "line": "[Sitting in the back with Cartman.] It's going over really well. People are gonna be knocking my door down to get you."
    },
    {
        "character": "Cartman",
        "line": "Who the hell cast Tom Hanks in this?! Tom Hanks can't act his way out of a nutsack!"
    },
    {
        "character": "Tom Hanks",
        "line": "[Onscreen.] I'll always love you, Mr. Hankey."
    },
    {
        "character": "Cartman",
        "line": "[Mocking.] I'll momaymumyeu, Meemuhmammy."
    },
    {
        "character": "",
        "line": "Kenny waits outside for Stan and Wendy, so he's passing the time with a yo-yo. The doors open and the patrons flood out, crushing Kenny."
    },
    {
        "character": "Man 1",
        "line": "Oh my God, I found a penny! [Picks it up.]"
    },
    {
        "character": "Man 2",
        "line": "You bastard!"
    },
    {
        "character": "",
        "line": "The street. A manhole cover pops up and Kyle comes out with Mr. Hankey."
    },
    {
        "character": "Kyle",
        "line": "Mph. Okay, Mr. Hankey. We're out. How are you doin'?"
    },
    {
        "character": "Mr. Hankey",
        "line": "[Looking more frozen than dry.] It sure is -dry up here. [Coughs]"
    },
    {
        "character": "Kyle",
        "line": "Don't worry. We'll do this quick, okay? Just hang on, Mr. Hankey, just hang on!"
    },
    {
        "character": "",
        "line": "Construction is under way at the Hollywood Planet, South Park's \"Death Star\"."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Excuse me, Mr. Film Commissioner, could I have a word with you?"
    },
    {
        "character": "Robert Redford",
        "line": "[Arms crossed.] Make it quick."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Well, the people of my town are a little upset. I don't think we realized what an impact this festival would have on our town."
    },
    {
        "character": "Robert Redford",
        "line": "Uh-huh."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Right. So, we were actually wondering if we could call this whole thing off?"
    },
    {
        "character": "Robert Redford",
        "line": "We have contracts. [He pulls some out.] You try to pull out now, we'll sue your little town for every penny it's got. But thanks so much for the hard work."
    },
    {
        "character": "Cartman",
        "line": "[With director 3.] Eh but, but this doesn't make sense to me, Marty! Okay, you told me the movie made a lot of money!"
    },
    {
        "character": "Marty",
        "line": "Mmp right. Two million, minus your agent's fee, minus your lawyer's fee, minus my fee, and the publicity and taxes taken out, you get three dollars! That's more than most people in your position make, trust me!"
    },
    {
        "character": "Stan",
        "line": "[Happening upon the scene.] Serves you right, Cartman! You're a sellout!"
    },
    {
        "character": "Cartman",
        "line": "I'm not a sellout! What's a sellout?"
    },
    {
        "character": "Stan",
        "line": "If you work in the entertainment business and you make money, you're a sellout!"
    },
    {
        "character": "Chef",
        "line": "[Stopping by.] It's all gone to hell, children. And we're all to blame. Even me!"
    },
    {
        "character": "",
        "line": "His booth is shown."
    },
    {
        "character": "Chef",
        "line": "I was sellin' out my town, too! And now look at it."
    },
    {
        "character": "",
        "line": "The town looks just like Sundance at the beginning of the episode."
    },
    {
        "character": "Stan",
        "line": "So what do we do now?"
    },
    {
        "character": "Chef",
        "line": "There's nothin' we can do. Just sit here and suck on my balls."
    },
    {
        "character": "",
        "line": "Kyle arrives with Mr. Hankey in a shoebox."
    },
    {
        "character": "Kyle",
        "line": "You guys, we have to hurry!"
    },
    {
        "character": "Stan",
        "line": "Why?"
    },
    {
        "character": "Kyle",
        "line": "Come on! Everything's gonna be okay!"
    },
    {
        "character": "",
        "line": "They walk over to Robert Redford."
    },
    {
        "character": "Kyle",
        "line": "Sir! Sir!"
    },
    {
        "character": "Robert Redford",
        "line": "Not now!"
    },
    {
        "character": "Kyle",
        "line": "I have to show you something."
    },
    {
        "character": "",
        "line": "Kyle presents the box containing Mr. Hankey to Robert Redford."
    },
    {
        "character": "Kyle",
        "line": "I think it will change the way you feel about your impact here."
    },
    {
        "character": "A director",
        "line": "What's this?"
    },
    {
        "character": "",
        "line": "Others have started to gather around."
    },
    {
        "character": "Kyle",
        "line": "I want you guys to all meet my friend."
    },
    {
        "character": "",
        "line": "Kyle removes the lid to the box and rattles the box a bit. When nothing happens, he turns the box over and Mr. Hankey drops out, dry as a bone. The boys gasp."
    },
    {
        "character": "Robert Redford",
        "line": "That's great, kid. A dried-out lump of shit; very compelling. [To the crowd] Okay, folks, let's move! We've gotta have that sign down in time for the opening tonight!"
    },
    {
        "character": "Kyle",
        "line": "You can't die, Mr. Hankey. You can't."
    },
    {
        "character": "",
        "line": "Mr. Hankey starts coughing and is barely audible, only his right eye opens."
    },
    {
        "character": "Mr. Hankey",
        "line": "Kyle. Be-fore I go there's something I must tell you. Come clo-ser."
    },
    {
        "character": "",
        "line": "Kyle draws closer."
    },
    {
        "character": "Mr. Hankey",
        "line": "Clo-ser."
    },
    {
        "character": "",
        "line": "Kyle moves in further."
    },
    {
        "character": "Kyle",
        "line": "Well-. Huwhat is it, Mr. Hankey?"
    },
    {
        "character": "Mr. Hankey",
        "line": "There is a-nother Sky-walk-er."
    },
    {
        "character": "",
        "line": "Mr. Hankey dies."
    },
    {
        "character": "Kyle",
        "line": "Nooohohohohohoho-"
    },
    {
        "character": "Mr. Hankey",
        "line": "Wake up."
    },
    {
        "character": "Kyle",
        "line": "What is it, Mr. Hankey?"
    },
    {
        "character": "Mr. Hankey",
        "line": "Come clo-ser."
    },
    {
        "character": "",
        "line": "Kyle moves in closer."
    },
    {
        "character": "Kyle",
        "line": "What is it?"
    },
    {
        "character": "Mr. Hankey",
        "line": "Clo-ser."
    },
    {
        "character": "",
        "line": "Kyle moves even further in."
    },
    {
        "character": "Kyle",
        "line": "Yes?"
    },
    {
        "character": "Mr. Hankey",
        "line": "Closer!"
    },
    {
        "character": "",
        "line": "Kyle is very close."
    },
    {
        "character": "Mr. Hankey",
        "line": "One time, when you were sleeping, I put myself in your mouth and had my friend take a picture."
    },
    {
        "character": "",
        "line": "He dies."
    },
    {
        "character": "Kyle",
        "line": "Nooo!"
    },
    {
        "character": "",
        "line": "Flashbacks of Mr. Hankey flood Kyle's mind, including one of the monkey who played Mr. Hankey in the movie."
    },
    {
        "character": "Voice over",
        "line": "[Singing slowly, mournfully.]Mr. Hankey, the Christmas Poo.\nHe loved me, I loved you.\nTherefore vicariously he loved you-\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "Nooo!"
    },
    {
        "character": "HazMat official",
        "line": "I'm sorry, son. Let's get him to ICU."
    },
    {
        "character": "",
        "line": "The HazMat official scoops Mr. Hankey's corpse into a small white body bag."
    },
    {
        "character": "Kyle",
        "line": "[Weeping.] Noo! No!"
    },
    {
        "character": "Stan",
        "line": "[Concerned.] Are you gonna be okay, dude? I'm here for you."
    },
    {
        "character": "Wendy",
        "line": "[Arriving.] Hi, Stan. Ready to go see another movie? [Damn.]"
    },
    {
        "character": "Stan",
        "line": "Okay!"
    },
    {
        "character": "",
        "line": "Stan releases Kyle, who falls to the ground."
    },
    {
        "character": "Kyle",
        "line": "Uuf."
    },
    {
        "character": "",
        "line": "Over at the Bijou, now showing: \"BOW DOWN TO HOLLYWOOD, SOUTH PARK\" A Film by TOM M. POONER. But inside, it's \"A Bunch Of Gay Cowboys Eating Pudding\", in color. Stan reaches for Wendy's hand. She notices, then looks at him. He pulls his hand back and looks at the screen."
    },
    {
        "character": "Cowboy",
        "line": "Say, Tom. Do you have any pudding left?"
    },
    {
        "character": "Tom",
        "line": "I ate all mine up, silly."
    },
    {
        "character": "Cowboy",
        "line": "Well then, now what do we do?"
    },
    {
        "character": "",
        "line": "Stan tries again, and again pulls back. This time, Wendy takes his left hand in her right one and smiles at him. He smiles back at her. A few blinks from her eyes and a gentle squeeze from her hand and he vomits - at a man sitting in front of her."
    },
    {
        "character": "Man",
        "line": "AAWWWW!"
    },
    {
        "character": "Wendy",
        "line": "Eeewww!"
    },
    {
        "character": "Man",
        "line": "[Facing Stan.] Hey!"
    },
    {
        "character": "Stan",
        "line": "Sorry."
    },
    {
        "character": "Cowboy",
        "line": "Well, why don't we just explore our sexuality?"
    },
    {
        "character": "Tom",
        "line": "Ooh, good idea. Let's."
    },
    {
        "character": "",
        "line": "They hug, and the cowboy drops to work on Tom's pants."
    },
    {
        "character": "Stan",
        "line": "Aw, dude, I shouldn't be seeing this!"
    },
    {
        "character": "",
        "line": "Wendy is alarmed, Stan jumps up and."
    },
    {
        "character": "Stan",
        "line": "Blaach!"
    },
    {
        "character": "",
        "line": "He vomits on the man in front of him again."
    },
    {
        "character": "Man",
        "line": "Aaww! [Turns around to face Stan.] Is there a problem, young man?"
    },
    {
        "character": "Stan",
        "line": "No problem, dude."
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital. Chef and Kyle are at the ICU. The window above Mr. Hankey's bed is sealed so no sunlight gets in. The whole room is sealed in. Mr. Hankey has several wires streaming into him."
    },
    {
        "character": "Kyle",
        "line": "I'll never forget you. You were my best friend after Stan."
    },
    {
        "character": "Chef",
        "line": "Come on, Kyle. It's time to go."
    },
    {
        "character": "Kyle",
        "line": "Chef, does poo go to heaven?"
    },
    {
        "character": "Chef",
        "line": "[Chef ponders a moment.] Well, uh-I kinda hope not."
    },
    {
        "character": "",
        "line": "Kyle starts weeping."
    },
    {
        "character": "Chef",
        "line": "I mean, sure it does."
    },
    {
        "character": "",
        "line": "Kyle quiets down."
    },
    {
        "character": "Chef",
        "line": "Here. I'll give him one of my Salty Balls to take with him to poo heaven."
    },
    {
        "character": "",
        "line": "Chef removes the face tubes and drops a ball into Mr. Hankey's mouth, then puts the tubes back."
    },
    {
        "character": "Chef",
        "line": "Come on, let's go."
    },
    {
        "character": "",
        "line": "They start to walk away."
    },
    {
        "character": "Mr. Hankey",
        "line": "[Weakly.] Kyle."
    },
    {
        "character": "Kyle",
        "line": "[Rushes back.] Mr. Hankey?"
    },
    {
        "character": "Mr. Hankey",
        "line": "Howdy-ho."
    },
    {
        "character": "Kyle",
        "line": "He's back! He's back! [Chef returns.]"
    },
    {
        "character": "Mr. Hankey",
        "line": "That was delicious."
    },
    {
        "character": "Chef",
        "line": "My Salty Chocolate Balls must have re-juvenated him!"
    },
    {
        "character": "Kyle",
        "line": "You've got the best balls in the whole world, Chef."
    },
    {
        "character": "Chef",
        "line": "You're daaamn right."
    },
    {
        "character": "",
        "line": "Hollywood Planet is finished and awaiting its unveiling. But first, over at Cartman's booth,"
    },
    {
        "character": "Cartman",
        "line": "Step on up, get them here! Mr. Hankey & Me T-shirts! Get them while they last, folks. for only $14.95!"
    },
    {
        "character": "Woman",
        "line": "I'll take two."
    },
    {
        "character": "Man",
        "line": "I'd like to pay for one."
    },
    {
        "character": "Cartman",
        "line": "Selling T-shirts kicks ass!"
    },
    {
        "character": "",
        "line": "Robert Redford is at the podium."
    },
    {
        "character": "Robert Redford",
        "line": "Ladies and gentlemen, I'm pleased to announce on this Gala Opening of Hollywood Planet South Park, that the festival will be back next year!"
    },
    {
        "character": "",
        "line": "Mr. Mackey, Mr. Garrison, and Jimbo are dismayed, along with the rest of the town."
    },
    {
        "character": "Robert Redford",
        "line": "And the year after that, and the year after that, and so on! And now, release the curtain!"
    },
    {
        "character": "",
        "line": "The curtain drops to reveal Hollywood Planet in all its glory. Kliegl lights move their beams around and palm tress line the restaurant front."
    },
    {
        "character": "Robert Redford",
        "line": "I give you, \"Hollywood in South Park!\""
    },
    {
        "character": "",
        "line": "He laughs sinisterly. The crowd gasps at the size of the thing."
    },
    {
        "character": "Kyle",
        "line": "Wait!"
    },
    {
        "character": "",
        "line": "The crowd turns to see who it is."
    },
    {
        "character": "Kyle",
        "line": "I brought him! I brought him to show you!"
    },
    {
        "character": "",
        "line": "Cartman is with Stan and Kyle."
    },
    {
        "character": "Robert Redford",
        "line": "[Put off.] Oh, not this again!"
    },
    {
        "character": "Kyle",
        "line": "Behold! Mr. Hankey!"
    },
    {
        "character": "",
        "line": "Mr. Hankey jumps out of the box."
    },
    {
        "character": "Mr. Hankey",
        "line": "Hoooooowwwdy-ho!"
    },
    {
        "character": "",
        "line": "The crowd looks at him blankly, then turns back to face the commissioner. Hollywood folks are hard to impress."
    },
    {
        "character": "Robert Redford",
        "line": "Anyway, this new Hollywood Planet will be the official meeting place for all-"
    },
    {
        "character": "Mr. Hankey",
        "line": "Howdy-ho, folks. I'm afraid my buddy Kyle was right. There's not enough room in South Park to accommodate a festival."
    },
    {
        "character": "Short Man",
        "line": "Mr. Poo, if you wouldn't mind, we can't hear our chairman. If you could just turn yourself down. You're at about 7 right now, we need you at about, 3, okay?"
    },
    {
        "character": "",
        "line": "Mr. Hankey's hands drop and he hops over to the podium. Robert steps aside."
    },
    {
        "character": "Mr. Hankey",
        "line": "Uh, folks, please. Little towns like this simply aren't made for friggin' films. We love havin' visitors, but golly, too many of you is hurtin' our ecosystem. Be-sides, folks, film festivals shouldn't be about what celebrities are comin' or what film is gonna get sold. It should be about people gettin' together, and watchin' movies, and about people who could never get their movies seen havin' a chance to have it watched, if only once. A good film festival should be something where we all say, \"Gaw, let's forget about lawyers and managers and studios and celebrities. Let's forget all those things for just a while, and just watch some new art.\""
    },
    {
        "character": "",
        "line": "The crowd ponders the speech. Kyle smiles, and so does Mr. Hankey."
    },
    {
        "character": "Robert Redford",
        "line": "[Grabs Mr. Hankey and pulls back.] I have had enough of you! [He tosses him away.]"
    },
    {
        "character": "Mr. Hankey",
        "line": "[Flying through the air.] Nyyaarrrr!"
    },
    {
        "character": "Kyle",
        "line": "No!"
    },
    {
        "character": "",
        "line": "Mr. Hankey hits a wall and slides down."
    },
    {
        "character": "Robert Redford",
        "line": "Now, as I was saying, this shall usher in a whole new decade of film festivals."
    },
    {
        "character": "",
        "line": "Cartman, Stan, Kyle, and Chef gather 'round Mr. Hankey."
    },
    {
        "character": "Kyle",
        "line": "[Crying.] O-hoho he's dead. Mr. Hankey's dead."
    },
    {
        "character": "Chef",
        "line": "Well, it worked once before."
    },
    {
        "character": "",
        "line": "Chef drops six balls into Mr. Hankey's mouth."
    },
    {
        "character": "Mr. Hankey",
        "line": "[Recovering.] Hi, Chef. Your big chocolate balls are just the trick!"
    },
    {
        "character": "",
        "line": "He rubs his belly and hops off. As he does, syncopated music plays, and he switches to a sorcerer's cap. He's pissed."
    },
    {
        "character": "Stan",
        "line": "What the hell is he doing?"
    },
    {
        "character": "Kyle",
        "line": "I don't know."
    },
    {
        "character": "",
        "line": "Mr. Hankey hops up to Hollywood Planet and jumps onto the top of the globe. He is now fully dressed as a sorcerer's apprentice. He starts to do his magic, waving his hands as clouds gather and poo jumps out of manholes and grills throughout the town."
    },
    {
        "character": "Cartman",
        "line": "Whoa!"
    },
    {
        "character": "",
        "line": "Robert Redford is awed. Mr. Hankey continues wielding his power, and three poo men rise up out of the poo that now covers the street. They start to dance."
    },
    {
        "character": "An Agent",
        "line": "Oh my God!"
    },
    {
        "character": "",
        "line": "Mr. Hankey continues. Poo pours forth from the Porta Potties nearby and builds into a giant wave."
    },
    {
        "character": "Crowd Members",
        "line": "[Fleeing.] Aaaaahh!"
    },
    {
        "character": "",
        "line": "The poo squelches them and sweeps them away. People clear out of the Hollywood Planet area. Robert Redford and Phyllis get out as well. Mr. Hankey is brewing something up and releases it."
    },
    {
        "character": "Man",
        "line": "Oh, my God, it's crap!"
    },
    {
        "character": "Man 2",
        "line": "Ohh! Noo!"
    },
    {
        "character": "",
        "line": "The poo traps a car and pushes it into the air as the poo turns into a twister."
    },
    {
        "character": "Man 3",
        "line": "Whoa, it smells, it smells!"
    },
    {
        "character": "",
        "line": "Robert Redford and Phyllis reach their car."
    },
    {
        "character": "Phyllis",
        "line": "[Now inside.] Come on, let's go! It's coming!"
    },
    {
        "character": "Robert Redford",
        "line": "[With key in the ignition.] I'm trying, damn it!"
    },
    {
        "character": "",
        "line": "Mr. Hankey directs the twister back and forth as it picks up stuff and people. He then has it engulf Hollywood Planet. The poo seeps into Robert Redford's car and fills it up."
    },
    {
        "character": "Robert Redford",
        "line": "Aww. Aww. Glup."
    },
    {
        "character": "",
        "line": "The poo drowns them and pours out the car windows."
    },
    {
        "character": "Man",
        "line": "Let's get out of this town!"
    },
    {
        "character": "",
        "line": "Whatever people are left get into their cars and drive out quickly. Mr. Hankey lets up and relaxes, and the clouds clear away. The town is covered in poo. So are the townspeople."
    },
    {
        "character": "Mr. Hankey",
        "line": "[Gazing at the scene.] Gosh. I guess I don't know my own strength."
    },
    {
        "character": "",
        "line": "He takes his cap off and lifts it high in a flourish, smiling."
    },
    {
        "character": "Kyle",
        "line": "You did it, Mr. Hankey. You got rid of all the film people!"
    },
    {
        "character": "Townsfolk",
        "line": "Hooray!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Ooh, yeaah. Now all we have is a town covered in shit! This is much better!"
    },
    {
        "character": "Mr. Hankey",
        "line": "I couldn't have done it without you, Kyle."
    },
    {
        "character": "",
        "line": "He jumps down to Kyle."
    },
    {
        "character": "Mr. Hankey",
        "line": "Kisses."
    },
    {
        "character": "",
        "line": "He kisses Kyle, and Kyle hugs him. Chef hugs both Stan and Kyle."
    },
    {
        "character": "Wendy",
        "line": "[Stopping by.] Stan, I'm sorry I dragged you to all those independent films."
    },
    {
        "character": "Stan",
        "line": "Oh, that's okay Wendy. I forgive you."
    },
    {
        "character": "Wendy",
        "line": "Sometimes I forget that even though a few independent films are great, most of them suck ass."
    },
    {
        "character": "Cartman",
        "line": "Yes. And I've learned something, too."
    },
    {
        "character": "",
        "line": "The others turn, Stan and Wendy hold hands."
    },
    {
        "character": "Cartman",
        "line": "Being a sellout is sweet. Because you make a lot of money. And when you have money, you don't have to hang out with any poor-ass losers- like you guys. Screw you guys, I'ma goin' home."
    },
    {
        "character": "",
        "line": "End of Chef's Chocolate Salty Balls. The song of the same name plays."
    }
]