[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "The USGS in Colorado. Four men are shown at their desks working. Nelson is front and center, Randy is behind him to his right, and two more men work behind them"
    },
    {
        "character": "Randy",
        "line": "I mean, look guys, I know it's just the Dolphins, but Tebow is definitely our quarterback for the future. What do you think, Nelson?"
    },
    {
        "character": "Peter Nelson",
        "line": "I didn't see the game."
    },
    {
        "character": "Randy",
        "line": "[soft sneeze] You didn't see the game? What the hell were you doing?"
    },
    {
        "character": "Peter Nelson",
        "line": "Took the wife down to Denver to see that new musical in town."
    },
    {
        "character": "Randy",
        "line": "A musical? [laughs and rises from his chair to approach him] Nelson couldn't watch football 'cause his wife made him take her to a musical! [laughs while moving around the desk]"
    },
    {
        "character": "Worker 1",
        "line": "[bearded] Good for you, Nelson. Did you get a blowjob afterwards?"
    },
    {
        "character": "Peter Nelson",
        "line": "Sure did."
    },
    {
        "character": "Worker 2",
        "line": "[clean-shaven] Niice. [Randy's smile turns into a frown]"
    },
    {
        "character": "Randy",
        "line": "What?"
    },
    {
        "character": "Worker 1",
        "line": "I took my girl to see that show last week. Got the best hummer of my entire life afterwards."
    },
    {
        "character": "Peter Nelson",
        "line": "Forty-five minutes non-stop."
    },
    {
        "character": "Randy",
        "line": "[surprised, then] Nuh uh."
    },
    {
        "character": "Worker 2",
        "line": "It's true. I'm taking my wife on Saturday bro."
    },
    {
        "character": "Randy",
        "line": "[looks back at him for a few seconds] Noh uh."
    },
    {
        "character": "Peter Nelson",
        "line": "I'm telling you Randy, put your time in with the musical, and the rewards afterwards are awesome."
    },
    {
        "character": "Randy",
        "line": "Must be... a pretty hot and steamy show. What's it called?"
    },
    {
        "character": "Peter Nelson",
        "line": "Wicked."
    },
    {
        "character": "Randy",
        "line": "[interested] Oh. Wicked."
    },
    {
        "character": "",
        "line": "Denver, night. Wicked is playing"
    },
    {
        "character": "Singers",
        "line": "\n...Heaven knows we know what goodness is\nO heaven knows wicked people aren't good.\nFrom head to toe, she was just wicked people\nHead to toe...\nShe wasn't good, to know what goodness is...\n\n\n\n"
    },
    {
        "character": "",
        "line": "During the song, Sharon has her hands over her heart and she's thoroughly enchanted. Randy studies her reactions. Onstage several actors sing their hearts out. One actress descends from the rafters on a large circular ornament. Randy keeps studying Sharon"
    },
    {
        "character": "Randy",
        "line": "Hey do you uh, do you want some alcohol or somethin', Sharon?"
    },
    {
        "character": "Sharon",
        "line": "Nono, I'm good, thanks."
    },
    {
        "character": "Randy",
        "line": "Okay, I'll be right back. [gets up and heads for the aisle, passing a couple on the way] 'Scuse me, sorry. [leaves the auditorium]"
    },
    {
        "character": "",
        "line": "a bar in the theater. Randy walks up to it and takes a seat. Another man is already at the bar with the bartender"
    },
    {
        "character": "Randy",
        "line": "Can I get a scotch and soda? [the bartender goes off to prepare it]"
    },
    {
        "character": "Man 1",
        "line": "Enjoying the show?"
    },
    {
        "character": "Randy",
        "line": "[nervous at first] Oh, yeah, it's not really what I expected."
    },
    {
        "character": "Man 1",
        "line": "No?"
    },
    {
        "character": "Randy",
        "line": "To be honest, I'm just here for the blowjob. From what I heard I figured the show must be really sexy and hot, but... I just don't see it happening."
    },
    {
        "character": "Man 1",
        "line": "Oh, it'll happen, don't worry. Right now your wife is being shot so full of subliminal messages, all she'll be thinking about afterwards is \"blowjob.\""
    },
    {
        "character": "Randy",
        "line": "Subliminal messages?"
    },
    {
        "character": "Man 1",
        "line": "It's a musical thing. Women are so caught up in all the singing and dancing they don't even notice it but, there's a blowjob reference almost every ten seconds. Broadway writers call it \"subtext.\" Just listen really, really closely."
    },
    {
        "character": "",
        "line": "The auditorium. Randy returns to his seat"
    },
    {
        "character": "The Wizard",
        "line": "While you'll do great here in the Emerald City, I'm sure you can't wait to go!"
    },
    {
        "character": "Singers",
        "line": "\nTake me away to that special place (that blowjob place)\nWhere people like us can all live free (Free to give blowjobs)\nTake me away and let's live together\nThat's the place/blowjobs for you (blowjobs) and me\n\n\n\n"
    },
    {
        "character": "",
        "line": "A man and woman sing next, alternating lines"
    },
    {
        "character": "Witches",
        "line": "Now let's try ... defying ................... gravity ...\n\n\n"
    },
    {
        "character": "Male",
        "line": "....... Look at them ... becoming friends ... here in Oz, you love blowjobs.\n\n\n"
    },
    {
        "character": "Witches",
        "line": "And new loves cry ... defying ................... gravity ...\n\n\n"
    },
    {
        "character": "Male",
        "line": "....... Suddenly ... Don't you love free love blowjobs?\n\n\n"
    },
    {
        "character": "",
        "line": "The drive home. Sharon's happily looking up beyond the car ceiling"
    },
    {
        "character": "Sharon",
        "line": "Oho that was so much fun! All the costumes and the sets were amazing! I really love the songs. That Stephen Schwartz is a genius! I've got them all stuck in my head. [swoons a bit, then looks at Randy, then at his crotch, then at him again] Hey, that was such a treat. How would you like a little treat? [looks at his crotch again. Randy looks at her in surprise. She giggles and takes off her seatbelt, then leans over and begins to give him a blowjob]"
    },
    {
        "character": "Randy",
        "line": "[softly] Whoa, no way!"
    },
    {
        "character": "",
        "line": "Park County Recreation Center, day. It has an aquatic center, and in there a bunch of kids stand in line for turns on the diving board. One fat kid is on the diving board wearing a life preserver. Waiting for the board are Stan, Cartman, Shelly, Kenny, and Clyde, amongst others. The fat kid is quite afraid and is crying"
    },
    {
        "character": "Stan",
        "line": "Come on, Larry! [Larry continues crying] Dude, why does this happen every time?"
    },
    {
        "character": "Shelly",
        "line": "Do something, you stupid vegan!"
    },
    {
        "character": "Cartman",
        "line": "Coach! Feegan the vegan won't jump off the board! Hey Coach!"
    },
    {
        "character": "",
        "line": "At the other end of the pool are Coach Randy and his coworkers, and Stephen Stotch"
    },
    {
        "character": "Randy",
        "line": "You just don't get it, Stotch! I'm telling you, go see Wicked! It's the best time!"
    },
    {
        "character": "Man 2",
        "line": "How long was it?"
    },
    {
        "character": "Randy",
        "line": "She started in the car, and then it lasted the whole drive home, and then, she kept going for like another twenty minutes."
    },
    {
        "character": "Worker 2",
        "line": "Nice, bro!"
    },
    {
        "character": "Randy",
        "line": "Get tickets, Stotch, it's worth it."
    },
    {
        "character": "Stephen",
        "line": "What was the show about?"
    },
    {
        "character": "Randy",
        "line": "Uh, shit, I don't know, some green chick and a goat or something."
    },
    {
        "character": "",
        "line": "The diving board. Larry is still crying up there. Shelly makes her move."
    },
    {
        "character": "Stan",
        "line": "Come on, Feegan, either jump or get off! [Shelly walks up the little ladder to the board and jumps up and down]"
    },
    {
        "character": "Shelly",
        "line": "Go! Go! [Larry bounces up and down crying, but doesn't fall into the water]"
    },
    {
        "character": "",
        "line": "The other end of the pool"
    },
    {
        "character": "Randy",
        "line": "Look, I thought Broadway musicals weren't for me either, but I just didn't know about the whole subtext thing, you know? I couldn't really appreciate 'em till now."
    },
    {
        "character": "Worker 2",
        "line": "Wicked isn't even the best, bro. You've gotta check out Jersey Boys! It makes women hummer crazy!"
    },
    {
        "character": "Randy",
        "line": "Really??"
    },
    {
        "character": "Worker 1",
        "line": "Nonono, have you see South Pacific? That's a jaw-breaker."
    },
    {
        "character": "",
        "line": "The Marsh house. Sharon is at the computer when Randy walks in"
    },
    {
        "character": "Randy",
        "line": "Say Sharon, how would you like to go to New York for the weekend?"
    },
    {
        "character": "Sharon",
        "line": "[gets off the chair] What?? Randy, are you serious??"
    },
    {
        "character": "Randy",
        "line": "[walks up to Sharon and hugs her] I got plane tickets and a hotel room! We leave in three hours!"
    },
    {
        "character": "Sharon",
        "line": "Oh my God, first you take me to Wicked and now this?"
    },
    {
        "character": "Stan",
        "line": "Hey wait, Dad, are you guys really going away? What about us?"
    },
    {
        "character": "Randy",
        "line": "Oh don't worry. I've taken care of everything! You're staying the weekend with the Feegans!"
    },
    {
        "character": "Shelly",
        "line": "Not the vegans!"
    },
    {
        "character": "Stan",
        "line": "No. Dad. Please don't do this!"
    },
    {
        "character": "",
        "line": "The Feegan home, arguably the nicest house ever shown in South Park. The Feegans are indeed vegans, eating a dinner of mushrooms, alfalfa sprouts, vegan hot dogs, and tofu. They're also something of survivalists, as they all wear life preservers"
    },
    {
        "character": "Mr. Feegan",
        "line": "It takes a lot of guts to be a vegan in today's world! You get labeled \"soft\" or \"silly.\" [he must have been talking for a while, for Stan and Shelly look bored] But the truth is there isn't a need to eat animal products. Would you ever believe that hot dog was vegan?"
    },
    {
        "character": "Shelly",
        "line": "Yes."
    },
    {
        "character": "Mr. Feegan",
        "line": "Cancer, heart disease, drowning, all preventable with a vegan diet and a life jacket. And if people wanna say us vegans are silly, well they can just laugh all they want, 'cause being vegan is more important than being popular!"
    },
    {
        "character": "Shelly",
        "line": "Maybe you should let your son decide that for himself. [Larry is stunned and drops his fork, then looks as his parents' reactions. His parents are stunned too, but grow angry]"
    },
    {
        "character": "Mr. Feegan",
        "line": "He does decide for himself! Larry's been a vegan since he was born! [Larry waves at her to keep going]"
    },
    {
        "character": "Shelly",
        "line": "Maybe if Larry had a nice steak once in a while he wouldn't get beat up by every kid in school. [Larry signals for her to keep 'em coming]"
    },
    {
        "character": "Mr. Feegan",
        "line": "You know that when you think you have the flu, you're actually experiencing the gastrointestinal effects of contaminated meats or eggs? Researchers have found that in meat-eating households there is more fecal bacteria in the kitchen sinks than in the toilets."
    },
    {
        "character": "Stan",
        "line": "[just outside the dining room on the phone with Randy while Mr. Feegan speaks.] Dad? Dad, you have to come back. This isn't working out. [no answer] Please answer the phone Dad. [no answer. He looks around] Dad?"
    },
    {
        "character": "",
        "line": "Times Square, New York, night. A huge Cup Of Soup sign looms over the square, which is filled with taxis and advertisements for everything. A taxi takes Randy and Sharon around town. An original song, \"Man Time,\" plays. First the Marshes watch \"Cats.\" A couple behind them doesn't waste any time - the woman gives her man a blowjob during the play. Randy notices and the man puts up his left thumb. Randy approves with his right thumb. The doors open and everyone exits \"Sister Act.\" Sharon whispers in Randy's ear and Randy brightens up, responds, and the couple goes away happily."
    },
    {
        "character": "Country Singer",
        "line": "Man time! I need some Man Time!\nI got the horses fed and the truck locked up, been workin' my fingers to the bone.\nNow I need a little bit of man time, gonna see me a Broadway show!\n\n\n\n"
    },
    {
        "character": "",
        "line": "Next play is \"Anything Goes\""
    },
    {
        "character": "Female Sailor",
        "line": "Anything goes\n\n\n"
    },
    {
        "character": "Male Sailor 1",
        "line": "Blowjob!\n\n\n"
    },
    {
        "character": "Female Sailor",
        "line": "Anything goes\n\n\n"
    },
    {
        "character": "Male Sailor 2",
        "line": "Blowjob!\n\n\n"
    },
    {
        "character": "",
        "line": "Next is \"Godspell\""
    },
    {
        "character": "Singers",
        "line": "Man time!\n\n\n"
    },
    {
        "character": "Females",
        "line": "Hear things more clearly\n\n\n"
    },
    {
        "character": "Males",
        "line": "Day blowjob day!\n\n\n"
    },
    {
        "character": "",
        "line": "Randy and Sharon are in a taxi again, and stop to see \"The Jersey Boys.\" Then they're in a taxi and Sharon gives Randy a blowjob."
    },
    {
        "character": "",
        "line": "\"Jersey Boys\""
    },
    {
        "character": "Country Singer",
        "line": "I'm about to get drunk and loud, gonna have me a rowdy good time.\nAll I need is my girl and my truck and some Rodgers and Hammerstein!\n\n\n"
    },
    {
        "character": "",
        "line": "Next, they're holding hands at \"The Phantom of the Opera\""
    },
    {
        "character": "Christine",
        "line": "AAAAAAAAAAAAAAH\n\n\n"
    },
    {
        "character": "The Phantom",
        "line": "Sing, my angel of blowjob music!\n\n\n"
    },
    {
        "character": "",
        "line": "Next, they're watching \"Les Misérables\""
    },
    {
        "character": "Female",
        "line": "But the tigers come at night!\n\n\n"
    },
    {
        "character": "Male",
        "line": "On you bed\n\n\n"
    },
    {
        "character": "",
        "line": "Finally they watch \"Sunday in the Park with George\""
    },
    {
        "character": "Singers",
        "line": "Man time!\n\n\n"
    },
    {
        "character": "Males",
        "line": "...........job, blowjob.\n\n\n"
    },
    {
        "character": "Females",
        "line": "It's cold up here, I'm locked up here\n\n\n"
    },
    {
        "character": "",
        "line": "The Marshes are on a plane out of New York"
    },
    {
        "character": "Singers",
        "line": "Man time!\n\n\n"
    },
    {
        "character": "",
        "line": "Randy is falling asleep, to Sharon gives him another blowjob, and he's awake and happy."
    },
    {
        "character": "Singers",
        "line": "Man time!\n\n\n"
    },
    {
        "character": "",
        "line": "Hooters, evening. Over curly fries and beer, Randy is sharing his trip with the group of men who were present at the aquatic center"
    },
    {
        "character": "Randy",
        "line": "Oh man! It was great! A different Broadway show every night! I'm telling you guys, New York is the place to be!"
    },
    {
        "character": "Man 2",
        "line": "Sounds like a dream, bro."
    },
    {
        "character": "Randy",
        "line": "It felt like a dream, bro. Broadway is simply the greatest time a dude can have. Just kind of sucks to be back here now, you know? I mean there's no culture here. Only Broadway show in Denver is \"Wicked\" and I've already taken Sharon to see it twenty three times."
    },
    {
        "character": "Worker 1",
        "line": "And Wicked moves to Seattle in a couple of weeks."
    },
    {
        "character": "Peter Nelson",
        "line": "It's gonna be blue balls for all of us."
    },
    {
        "character": "Stephen",
        "line": "Wish we could live in New York where all the musicals are."
    },
    {
        "character": "Randy",
        "line": "Hey. Wait a minute. Why not bring Broadway to South Park?"
    },
    {
        "character": "Bob",
        "line": "Huh?"
    },
    {
        "character": "Randy",
        "line": "[gets up and walks off a bit] Think about it, brah. How hard can writing a musical be? We need some musicians, some actors. We can put on our own shows right here in town."
    },
    {
        "character": "",
        "line": "At a playhouse. Randy has begun rehearsals for his own musical. Onstage are the actors and a park bench"
    },
    {
        "character": "Lady 1",
        "line": "\n[dressed in cyan]\nO what a glorious Sunday. I know what I'd like to do with my time.\n[walks up to man nearby]\nWould you like a blowjob?\n\n\n\n"
    },
    {
        "character": "Man 3",
        "line": "Yes I would like a blowjob [smiles]\n\n\n"
    },
    {
        "character": "Both",
        "line": "Nothing beats a blowjob on football Sunday.\n\n\n"
    },
    {
        "character": "Lady 1",
        "line": "[approaches a man on a bench] Excuse me, I'm the queen of blowjobs.\n\n\n"
    },
    {
        "character": "Man 4",
        "line": "Really? I would love a blowjob.\n\n\n"
    },
    {
        "character": "All",
        "line": "A woman should give blowjobs on football Sunday\n\n\n"
    },
    {
        "character": "Lady 1",
        "line": "\nI want to be covered in semen on a bed in the Hotel Jerome\n[the park bench is pulled away and the actors gather around her]\nA woman is prettiest covered in semen.\n\n\n"
    },
    {
        "character": "All",
        "line": "Give you husband a blowjob when you get home.\n\n\n"
    },
    {
        "character": "Man 4",
        "line": "[to Lady 2, dressed in pink] And what about you, my fair lady? Could I trouble you for a quick Lewinsky?\n\n\n"
    },
    {
        "character": "Lady 2",
        "line": "Oh I don't know, kind sir. Blowjobs seem a little degrading to me."
    },
    {
        "character": "Man 4",
        "line": "Come now, a blowjob isn't with your mouth, it's with your heart."
    },
    {
        "character": "Men",
        "line": "Now get on your knees and put that heart to work!\n\n\n"
    },
    {
        "character": "All",
        "line": "Blowjobs, give up your blowjobs.\n\n\n"
    },
    {
        "character": "",
        "line": "concurrent"
    },
    {
        "character": "Men",
        "line": "You're guilty at blowjobs, you love giving blowjobs\n\n\n"
    },
    {
        "character": "Women",
        "line": "... Blowjobs, ...blowjobs, ...blowjobs, ...blowjobs"
    },
    {
        "character": "",
        "line": "together"
    },
    {
        "character": "Singers",
        "line": "So what could be better on a football Sunday? What could be better on a football Sunday?\n\n\n"
    },
    {
        "character": "",
        "line": "The Marsh house, day. Larry walks up with a daisy and knocks. Shelly opens the door and they look at each other for a few more seconds"
    },
    {
        "character": "Shelly",
        "line": "What do you want, Larry? [Larry raises the daisy up slowly, presenting it to her]"
    },
    {
        "character": "Larry",
        "line": "Today, I went to 7-11 and I ate a Slim Jim. It was the greatest thing I ever tasted. Nobody ever stood up for me before. [sets the daisy on the landing, then turns around and trots off. Shelly looks on in wonder]"
    },
    {
        "character": "",
        "line": "The playhouse, next day. More rehearsals. Man 4's stage name is now given"
    },
    {
        "character": "Lady 1",
        "line": "Oh Reginald! How about a hummer at halftime? A Super Bowl suckle from me?\n\n\n"
    },
    {
        "character": "Reginald",
        "line": "A Super bowl hummer at halftime from my lovely blowjob queen!\n\n\n"
    },
    {
        "character": "Both",
        "line": "Two people in love it's amazing. Tim Tebow please don't let us down. How about a hummer at halftime-?\n\n\n"
    },
    {
        "character": "Representative",
        "line": "Mr. Randy Marsh?"
    },
    {
        "character": "Randy",
        "line": "And hold! [the stage falls silent] Sorry folks, we're in a hold. Just freeze right there. [to the representative] Uhh, this better be important."
    },
    {
        "character": "Representative",
        "line": "It is. I represent some of the biggest names in all of Broadway. They wish to speak with you."
    },
    {
        "character": "Randy",
        "line": "Really? Oh my Gaw! [to the cast] Take a break, guys. this could be it!"
    },
    {
        "character": "",
        "line": "Hooters, day. The messenger and Randy walk in and towards a table"
    },
    {
        "character": "Representative",
        "line": "Mr. Marsh, this is Andrew Lloyd Webber [eating a drumstick]"
    },
    {
        "character": "Webber",
        "line": "Helleow."
    },
    {
        "character": "Representative",
        "line": "Stephen Schwartz"
    },
    {
        "character": "Schwartz",
        "line": "[gruffly] Hey bro."
    },
    {
        "character": "Representative",
        "line": "Mr. Elton John. [Elton John belches] and Stephen Sondheim."
    },
    {
        "character": "Sondheim",
        "line": "Sup bro?"
    },
    {
        "character": "Randy",
        "line": "Not much, sup with you guys?"
    },
    {
        "character": "Sondheim",
        "line": "No. I mean, \"sup, bro!\""
    },
    {
        "character": "Webber",
        "line": "Sit down, Mr. Marsh, we need to have a talk. [Randy takes a seat]"
    },
    {
        "character": "Schwartz",
        "line": "We got wind of your musical. Just what the hell do you think you're doing?"
    },
    {
        "character": "Randy",
        "line": "Same as you guys. Trying to get men lengthier, better-quality blowjobs."
    },
    {
        "character": "Elton John",
        "line": "You're making it too obvious! Women are gonna figure out what we're doin'!"
    },
    {
        "character": "Sondheim",
        "line": "Musicals are about subtext!"
    },
    {
        "character": "Randy",
        "line": "My musical has lots of subtext."
    },
    {
        "character": "Sondheim",
        "line": "\"A blowjob isn't with your mouth, it's with your heart. Now get on your knees and put that heart to work.\""
    },
    {
        "character": "Randy",
        "line": "And then she does. It's a metaphor."
    },
    {
        "character": "Schwartz",
        "line": "Bro! What's metaphorical about a musical called \"Splooge-Drenched Blowjob Queen\"?!"
    },
    {
        "character": "Webber",
        "line": "Tricking bitches into hour-long blowjobs is an art form. You have to leave it to the professionals!"
    },
    {
        "character": "Randy",
        "line": "[rises] Well sorry if you guys think you have a monopoly on subtext! But us up-and-comers have a voice too!"
    },
    {
        "character": "Sondheim",
        "line": "You're gonna ruin everything, you idiot!"
    },
    {
        "character": "Randy",
        "line": "Sorry if my work isn't up to your standards! [rises, moving his chair aside] And now I need to get back to rehearsals. [leaves, then stops and turns around] Oh. And if \"Splooge-Drenched Blowjob Queen\" wins the Tony, don't expect to be invited to my after party. [turns around and walks out]"
    },
    {
        "character": "",
        "line": "The Marsh house, day. Larry walks up and knocks. Shelly opens the door and they look at each other for a few seconds. Larry now has a tiny guitar"
    },
    {
        "character": "Shelly",
        "line": "What do you want, Larry? [he begins to play her a tune]"
    },
    {
        "character": "Larry",
        "line": "You make me come out of my shell, Shelly.\nYou give me strength where there was only fear\nI ate at a Burger King today, Shelly\nAnd stood up to a boy who called me \"queer\"\nWhen you pushed me off the diving board I\n...fell.\nAnd you make the world a nicer place, Shelly\nSo I can come out of my... shell.\n[sets the guitar on the landing, then slowly takes off his life preserver and sets it on the landing as well. He turns around and trots off again. He makes a right on the sidewalk and runs]\n\n\n"
    },
    {
        "character": "Shelly",
        "line": "Hey! [Larry stops and looks back] Do you wanna play Settlers of Catan on Xbox? [Larry turns around]"
    },
    {
        "character": "",
        "line": "Back at the playhouse, Randy continues with rehearsals. The Queen carries a Broncos flag"
    },
    {
        "character": "Actors",
        "line": "Blow--- job--- Queen!\nDon't stop giving that blowjob. Even when you're tired, don't stop! Don't stop!\nShaaaaroooon!\n\n\n"
    },
    {
        "character": "Worker 2",
        "line": "[leads the group of Randy's friends] Randy! Randy, brah!"
    },
    {
        "character": "Randy",
        "line": "[to the cast] Uh, and hold. [the stage falls silent] Sorry folks, we're in a hold. [the actors are frozen in place] What is it now?"
    },
    {
        "character": "Worker 2",
        "line": "Stephen Sondheim is really pissed off, Randy. He says he wants to challenge you to a bro down."
    },
    {
        "character": "Randy",
        "line": "[stunned at first, then gets angry] Fine! He wants to bro down?! I'll bro down! [leaves the table and walks up the aisle towards the exit]"
    },
    {
        "character": "Worker 2",
        "line": "Randy, no! Stephen Sondheim is the greatest Broadway composer alive today! Perhaps the greatest of all time! You do NOT want to bro down with him."
    },
    {
        "character": "Randy",
        "line": "[quietly] Then what am I supposed to do?! Run?"
    },
    {
        "character": "Man 2",
        "line": "Don't bro down against Sondheim, Randy! It's suicide!"
    },
    {
        "character": "Randy",
        "line": "I've studied musicals! I've seen them all! I could do this! [turns] Let's bro down! [goes out the doors]"
    },
    {
        "character": "",
        "line": "The Marsh house, Shelly's room. This is the first time we see it."
    },
    {
        "character": "Larry",
        "line": "Oh no, you built another settlement?"
    },
    {
        "character": "Shelly",
        "line": "And I got a victory point for the most roads connecting settlements."
    },
    {
        "character": "Larry",
        "line": "[laughing merrily] Oh wow!"
    },
    {
        "character": "",
        "line": "The living room below. Sharon and Mrs. Feegan enjoy some tea between them"
    },
    {
        "character": "Mrs. Feegan",
        "line": "They're having such a great time together. I really wanna thank you, Sharon."
    },
    {
        "character": "Sharon",
        "line": "No, no, little Larry is really making Shelly come out of her shell too."
    },
    {
        "character": "Mrs. Feegan",
        "line": "I have to admit it makes me a little nervous having Larry up there without a life preserver on, but I guess we have to take changes sometimes."
    },
    {
        "character": "Sharon",
        "line": "That's what we're doing, putting our faith in Randy's new musical."
    },
    {
        "character": "Mrs. Feegan",
        "line": "That's right, I, I hear his musical is getting a lot of attention, that it really has a chance of making it."
    },
    {
        "character": "Sharon",
        "line": "Oho, more than a chance. Randy's actually having a meeting right now with Stephen Sondheim."
    },
    {
        "character": "",
        "line": "Hooters parking lot, at that very moment. A crowd of bros watch Randy and Sondheim face off, circling each other"
    },
    {
        "character": "Randy",
        "line": "Whassup brah?!"
    },
    {
        "character": "Sondheim",
        "line": "What brah?!"
    },
    {
        "character": "Randy",
        "line": "Sup brah?!"
    },
    {
        "character": "Sondheim",
        "line": "Take a swing, brah!"
    },
    {
        "character": "Randy",
        "line": "Right here, brah! [they continue circling each other]"
    },
    {
        "character": "Webber",
        "line": "Let's go, Sondheim! Wipe the street with his punk ass!"
    },
    {
        "character": "Randy",
        "line": "What makes you the brauthority brah?!"
    },
    {
        "character": "Sondheim",
        "line": "West Side Story, brah!"
    },
    {
        "character": "Randy",
        "line": "What brah?!"
    },
    {
        "character": "Sondheim",
        "line": "Sweeney Todd, brah!"
    },
    {
        "character": "Randy",
        "line": "What brah?! What brah?!"
    },
    {
        "character": "Sondheim",
        "line": "Merrily We Rode Along, bro! Why you gotta disrespect, bro?!"
    },
    {
        "character": "Randy",
        "line": "I do respect you, bro!"
    },
    {
        "character": "Sondheim",
        "line": "Show some respect, bro!"
    },
    {
        "character": "Randy",
        "line": "I do respect you, bro!"
    },
    {
        "character": "Sondheim",
        "line": "Then stop disrespectin', bro!"
    },
    {
        "character": "Randy",
        "line": "I respect you, bro!"
    },
    {
        "character": "Sondheim",
        "line": "Okay, I respect you too!"
    },
    {
        "character": "Randy",
        "line": "Okay! [the two men stay quiet begin to relax]"
    },
    {
        "character": "Schwartz",
        "line": "The bro down is over! Let's bro out!"
    },
    {
        "character": "Spectator",
        "line": "Bro out!"
    },
    {
        "character": "Spectator 2",
        "line": "Party people!"
    },
    {
        "character": "",
        "line": "Hooters, later. Randy sits between Webber and Sondheim. The combatants now share some beer, clinking their mugs together"
    },
    {
        "character": "Randy",
        "line": "Oh man, I'm so glad we put our differences aside! That's what bros do!"
    },
    {
        "character": "Schwartz",
        "line": "That's what bros fuckin' do!"
    },
    {
        "character": "Sondheim",
        "line": "You're alright, Marsh. If it's cool with you, bro, Elton and Andrew and all of us wanna help you with your musical."
    },
    {
        "character": "Randy",
        "line": "Hey, really??"
    },
    {
        "character": "Elton John",
        "line": "Yeh. We can help youse out a li'l bit with the subtext. [checks out a waitress as she passes by - first her breasts, then her face]"
    },
    {
        "character": "Webber",
        "line": "How about instead of \"Splooge-Drenched Blowjob Queen\" we call it... \"The Woman In White\""
    },
    {
        "character": "Randy",
        "line": "Oh, that is beautiful!"
    },
    {
        "character": "Bros",
        "line": "[all approve] Yeeeeeeeah!"
    },
    {
        "character": "Sondheim",
        "line": "And a cheer to Randy Marsh. Welcome... to Bro'dway."
    },
    {
        "character": "Randy",
        "line": "Bro'dwaaay!"
    },
    {
        "character": "Sondheim",
        "line": "Wooooooooooo!"
    },
    {
        "character": "Webber",
        "line": "Woohoo!"
    },
    {
        "character": "",
        "line": "The Marsh house, night. Randy walks into the living room"
    },
    {
        "character": "Randy",
        "line": "Ooof. [rubs the back of his head for a moment, then walks by the sofa, where Sharon is reading a book]"
    },
    {
        "character": "Sharon",
        "line": "Hey hun."
    },
    {
        "character": "Randy",
        "line": "Hi babe. Sorry, I'm... [stops behind the sofa] kind of hanging out with the guys."
    },
    {
        "character": "Sharon",
        "line": "Ruhur-Randy, it's fine. You do plenty with me. Did you have a good time?"
    },
    {
        "character": "Randy",
        "line": "Yeah, yeah, and we really made some progress with the show. Andrew Lloyd Webber and those guys are gonna help us with it."
    },
    {
        "character": "Sharon",
        "line": "Oho Randy, that's great! I'm really proud of you."
    },
    {
        "character": "Randy",
        "line": "Aw Sharon, you're the best. I'm not feeling a hundred percent; do you care if I go lay down?"
    },
    {
        "character": "Sharon",
        "line": "Of course not, go ahead, hun."
    },
    {
        "character": "Randy",
        "line": "[heads for the stairs] Alright babe."
    },
    {
        "character": "Sharon",
        "line": "I'm just gonna wait up for Shelly."
    },
    {
        "character": "Randy",
        "line": "Okay. What's Shelly doing?"
    },
    {
        "character": "Sharon",
        "line": "I gave her those tickets to \"Wicked.\" [Randy stops and looks back at Sharon] She's seeing it with her little boyfriend."
    },
    {
        "character": "Randy",
        "line": "[does a double take, then plants his hands on the bannister] She's WHAT?!"
    },
    {
        "character": "Sharon",
        "line": "Yeah, her and little Larry Feegan. They're going to see \"Wicked\" together. It's Shelly's first Broadway musical."
    },
    {
        "character": "Randy",
        "line": "OH! [runs back outside] Shelly! Hold on! [closes the door. Sharon just watches him go and smiles]"
    },
    {
        "character": "",
        "line": "On the road to Denver. Randy has gone back for Sharon and is driving madly down the road. He mows down a mailbox"
    },
    {
        "character": "Sharon",
        "line": "Randy, slow down! Jesus Christ!"
    },
    {
        "character": "Randy",
        "line": "AWWWWWWW! Why didn't you tell me Shelly was gonna see \"Wicked\"?!"
    },
    {
        "character": "Sharon",
        "line": "Why does it matter?!"
    },
    {
        "character": "Randy",
        "line": "She's too young for that stuff!"
    },
    {
        "character": "Sharon",
        "line": "Too young?!"
    },
    {
        "character": "Randy",
        "line": "This is what I get! I drank from the lie that is Broadway and now it has my daughter!"
    },
    {
        "character": "Sharon",
        "line": "That's it, Randy! Turn this car around right now!"
    },
    {
        "character": "Randy",
        "line": "I can't!"
    },
    {
        "character": "Sharon",
        "line": "WHY?!"
    },
    {
        "character": "Randy",
        "line": "Aww! Alright, look. There's something I should have told you a long time ago, Sharon. Broadway musicals... aren't what you think they are! They're subliminal propaganda to get women to give more blowjobs! On the outside it's all singing and dancing, but buried in it are commands to perform oral sex. It's called subtext."
    },
    {
        "character": "Sharon",
        "line": "[crosses her arms and looks away] That's ridiculous! Musicals don't make me wanna give blowjobs!"
    },
    {
        "character": "Randy",
        "line": "D'augh. Do you remember the night after we saw \"Wicked\"?"
    },
    {
        "character": "Sharon",
        "line": "Yes. Oh... Well, yeah, but-"
    },
    {
        "character": "Randy",
        "line": "And after \"Lion King\" in New York? \"Godspell\"? \"Mamma Mia\"?"
    },
    {
        "character": "Sharon",
        "line": "Oh my gosh."
    },
    {
        "character": "Randy",
        "line": "Broadway shows' sole purpose is to make women famished for blowjobs! I'm so sorry Sharon."
    },
    {
        "character": "Sharon",
        "line": "Nuh-nn No, this is crazy! Musical theater people are respected. Refined. Cultured."
    },
    {
        "character": "Randy",
        "line": "No, they're... they're bros, Sharon. Stephen Sondheim, Elton John, Andrew Lloyd Webber... They're total bros who hang out at Hooters. Sharon, I'm so sorry."
    },
    {
        "character": "Sharon",
        "line": "It can't be! I've loved Broadway musicals ever since I saw \"Grease\" with Jacob Harrison and his brother Kip and we- [gasps and puts her hands over her heart] Oh my God!"
    },
    {
        "character": "Randy",
        "line": "AAAA!"
    },
    {
        "character": "Sharon",
        "line": "AAAA!"
    },
    {
        "character": "Randy",
        "line": "Shelly! [steps on the gas pedal, and the car goes past 60 mph]"
    },
    {
        "character": "",
        "line": "At the Denver Playhouse. Larry and Shelly are watching the play."
    },
    {
        "character": "Singers",
        "line": "\nNo one cares about wicked people.\nNow she's gone but we don't care.\nAnd are we gonna live in peace, and all live free, you'll see.\nO Heaven knows we know what goodness is\nO heaven knows wicked people aren't good.\nFrom head to toe-\n\n\n\n"
    },
    {
        "character": "",
        "line": "During the singing"
    },
    {
        "character": "Randy",
        "line": "[stopping by random rows] Shelly? Shelly? [he finds her and gets to her row] Shelly, come on. We have to go!"
    },
    {
        "character": "Shelly",
        "line": "Dad, what are you doing here?"
    },
    {
        "character": "Randy",
        "line": "Right now, Shelly! [A woman sitting by the aisle shushes him] Shelly, you are not watching this trash! Now, come on!"
    },
    {
        "character": "Elderly Man",
        "line": "Would you mind?! I'm trying to enjoy this musical with my granddaughter!"
    },
    {
        "character": "Randy",
        "line": "Oh you fucking pervert!"
    },
    {
        "character": "Usher",
        "line": "Alright, get the hell out of here, you! [he and another usher haul him away]"
    },
    {
        "character": "Randy",
        "line": "Shelly! [the two ushers take him outside and away from the playhouse, then push him away.]"
    },
    {
        "character": "",
        "line": "Outside the playhouse. Randy stumbles and falls in front of Creepy City Costumes & Novelties. Sharon catches up with him"
    },
    {
        "character": "Sharon",
        "line": "Randy! [Randy gets up and smashes a window open with his left elbow, then reaches in. Sharon turns away so she doesn't get hit with shards of glass, then turns back] Randy, what are you doing?!"
    },
    {
        "character": "Randy",
        "line": "[bent over, putting on a costume] It's time to put an end to Broadway once and for all! [gets up dressed as Spider-Man, and puts on the mask last. He runs back into the playhouse]"
    },
    {
        "character": "",
        "line": "Back inside the playhouse"
    },
    {
        "character": "The Wizard",
        "line": "While you'll do great here in the Emerald City, I'm sure you can't wait to go!"
    },
    {
        "character": "Singers",
        "line": ""
    },
    {
        "character": "",
        "line": "During the song, a shot of Larry and Shelly is shown. Onstage a witch moves towards on stage, only to be kicked away by Randy as he swings down from the rafters"
    },
    {
        "character": "Audience",
        "line": "Ohhhh."
    },
    {
        "character": "",
        "line": "Randy comes back around and kicks down another actor. He then swings up into the audience and almost kicks a man in the balcony"
    },
    {
        "character": "Audience Member",
        "line": "Hey, it's Spider-Man"
    },
    {
        "character": "",
        "line": "on his way down, Randy kicks a few audience members out of their seats"
    },
    {
        "character": "Randy",
        "line": "Sorry! Sorry."
    },
    {
        "character": "",
        "line": "Randy knocks out three more cast members on stage, then goes up into the rafter. He strikes a water main and knocks out the valve, releasing the water onto the stage and audience"
    },
    {
        "character": "Randy",
        "line": "Agh! [swings onto one of the side balconies, knocking out a man. Randy gets his bearings on a rail and swings back towards the orchestra pit. He knocks out the conductor and finds himself dangling from a chandelier, the cable wrapped around his right ankle. The stage lights go out and the house lights come on]"
    },
    {
        "character": "Announcer",
        "line": "Sorry folks, we are in a hold. We are in a hold."
    },
    {
        "character": "Audience",
        "line": "Awwwwww. [And that ends that showing]"
    },
    {
        "character": "",
        "line": "The Marsh house, night. Shelly's in her bed, watching TV. Her bedroom door is ajar"
    },
    {
        "character": "Field Reporter",
        "line": "The musical came to a screeching halt as patrons flooded out the exits and water flooded the theater. [one of the actors is being led to an ambulance] The only fatality was a young boy who could not get out of the theater in time. The fire chief said it was unfortunate the child was not wearing a life preserver. [Shelly begins to sob softly]"
    },
    {
        "character": "Randy",
        "line": "[looks in, then opens the door some more and enters] Shelly, I'm sorry your little friend was killed by Spider-Man tonight. Just know that... for Spider-Man to do what he did, he must have had a very good reason. Spider-Man works in mysterious ways, Shelly. And wherever he is, he loves you. [backs out and closes the door]"
    },
    {
        "character": "",
        "line": "The master bedroom. Sharon is already in bed and Randy slips in next to her"
    },
    {
        "character": "Randy",
        "line": "[glancing at Sharon from time to time] It's just so... wrong! For men to m- manipulate women like that! I don't care how much singing and dancing there is, a woman's mouth is sacred! Tomorrow I am calling Woman's Day magazine, and exposing the whole conspiracy! [looks at Sharon] I'm sorry, Sharon. I love you. [lies down] I shouldn't have tried to brainwash you. You have every right to be mad."
    },
    {
        "character": "Sharon",
        "line": "I don't know if I can really be that mad at you for doing something every guy in America does."
    },
    {
        "character": "Randy",
        "line": "Really?"
    },
    {
        "character": "Sharon",
        "line": "[sits up] Oh Randy, [kneels before him. Randy sits up] the bottom line is I love going to those shows. If the fallout from that is I make you really happy for a while, well, I guess they're actually a pretty magical thing."
    },
    {
        "character": "Randy",
        "line": "[rises and kneels before her] Oh Sharon, you're the best. [they laugh and hug each other]"
    },
    {
        "character": "Sharon",
        "line": "So, what Broadway show do you think is coming to Denver next?"
    },
    {
        "character": "Randy",
        "line": "I don't know, but whatever it is, it's worth the ticket price, because couples that pay to see it are stronger, better, and much, much happier."
    },
    {
        "character": "Announcer",
        "line": "\"The Book of Mormon.\" You'll get a blowjob."
    }
]