[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "The Donovan house. Stan, Kyle, Cartman, Kenny and Clyde are playing football in the backyard."
    },
    {
        "character": "Stan",
        "line": "Throw it here! Throw it here! [Clyde throws the ball.] Yeah! Nice one, Clyde! [Clyde's mom shouts through the window.]"
    },
    {
        "character": "Betsy",
        "line": "Clyde! Clyde! Clyde, get up here! Hurry! [Clyde runs in with panic. The boys follow him.]"
    },
    {
        "character": "",
        "line": "Betsy is waiting Clyde in the bathroom with an angry expression. Clyde comes in and the other boys wait him outside."
    },
    {
        "character": "Betsy",
        "line": "[points at the toilet] What is that?"
    },
    {
        "character": "Clyde",
        "line": "A toilet?"
    },
    {
        "character": "Betsy",
        "line": "That's right. It's a toilet, Clyde. And where is the toilet seat? It's up, because you left it up, again! We've been through this countless times, Clyde."
    },
    {
        "character": "Clyde",
        "line": "Okay mom, just not in front of my friends okay?"
    },
    {
        "character": "Betsy",
        "line": "No, not okay. Because you aren't getting the message! What if I'd fallen in? Start listening to me! Put it down! Put it down! [Clyde hurriedly puts it down. Betsy walks to the door] Thank you. [Clyde stands alone, embarrassed.]"
    },
    {
        "character": "Cartman",
        "line": "[whistles] Dude, that sucks, Clyde. A mom shouldn't be able to put rules on toilet-time like that. Toilet-time is the last bastion of American freedom."
    },
    {
        "character": "Kyle",
        "line": "Is your mom always like that dude?"
    },
    {
        "character": "Clyde",
        "line": "Look, could you guys just not say anything about this in school, please?"
    },
    {
        "character": "Cartman",
        "line": "[puts his arm on Clyde] Of course, man. It's cool."
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The kids are in class."
    },
    {
        "character": "Cartman",
        "line": "[imitating Clyde's mom] Clyde, Clyde! What have I told you about pissing on the seat? And Clyde's all like \"Ah, okay mom, fuck! Not in front of my friends! [He laughs, Butters joins him.]"
    },
    {
        "character": "Kyle",
        "line": "Cartman, it was actually really lame."
    },
    {
        "character": "Cartmam",
        "line": "I know, right. Women are just jealous 'cause they have to sit outwards to pee and crap."
    },
    {
        "character": "Butters",
        "line": "[laughs] Wait a minute! You're supposed to poop on the toilet facing out? [looks around] But I thought you sit on the toilet this way. [demonstrates by sitting backwards on his chair] So that you have that nice little shelf for your comics and chocolate milk? Well, because you got the flusher right here. No? [turns around] Oh jeez, that's embarrassing."
    },
    {
        "character": "Betsy",
        "line": "[offscreen] Clyde! Clyde! [comes in wearing a nightgown, a coat and slippers] There you are!"
    },
    {
        "character": "Clyde",
        "line": "Mom?"
    },
    {
        "character": "Betsy",
        "line": "Clyde Donovan, you come home this instant!"
    },
    {
        "character": "Clyde",
        "line": "Why?"
    },
    {
        "character": "Betsy",
        "line": "What have I told you about putting the toilet seat down after you go to the bathroom?"
    },
    {
        "character": "Clyde",
        "line": "Mom, I'm in class."
    },
    {
        "character": "Betsy",
        "line": "How many times do I have to tell you Clyde? I was trying to get ready for work and the toilet seat was up, again."
    },
    {
        "character": "Roger",
        "line": "Betsy, come back home. It's just not that big a deal."
    },
    {
        "character": "Betsy",
        "line": "No, Roger! It's a disgusting habit and I'm sick and tired of it. If I had sat down, I would have gotten toilet water all over my vagina."
    },
    {
        "character": "Butters",
        "line": "My grandma is from Virginia. [smiles]"
    },
    {
        "character": "Betsy",
        "line": "You're coming home right now, and you're putting the seat down where it belongs. Let's go."
    },
    {
        "character": "Clyde",
        "line": "[Looks down in embarrassment, leaves the classroom.]"
    },
    {
        "character": "",
        "line": "The Cartman house, night. Cartman is lying on his bed with his pajamas on and he is cutting his toenails and eating Thwizlers while talking on the phone."
    },
    {
        "character": "Cartman",
        "line": "Dude, I'm telling you it was fucking hysterical. Clyde had to get up in the middle of class and follow his mom home to put the seat down. He was so embarrassed, dude, I thought he was gonna die."
    },
    {
        "character": "",
        "line": "The Broflovski house, night. Kyle is talking on the phone while his family is seen eating dinner behind."
    },
    {
        "character": "Kyle",
        "line": "I know, fatass. I was there."
    },
    {
        "character": "Cartman",
        "line": "His mom... His mom goes: \"Clyde you're an asshole and now I have toilet water in my vagayjay.\""
    },
    {
        "character": "Kyle",
        "line": "That's not what she said. You're putting extras on again. It's not that funny."
    },
    {
        "character": "Cartman",
        "line": "I know dude. The bathroom is the last bastion of American freedom."
    },
    {
        "character": "Kyle",
        "line": "Don't you just feel a little bad for Clyde?"
    },
    {
        "character": "Cartman",
        "line": "Nuh-uh."
    },
    {
        "character": "Kyle",
        "line": "Well you should. The poor guy shouldn't be screamed for something that just isn't that big a deal at all. [police siren is heard offscreen.]"
    },
    {
        "character": "",
        "line": "The Donovan house, night. The police, firefighters, ambulance and a crowd of people has gathered around the house. A ladder is placed to reach the second floor window. The camera pans to Stan and Kenny with Kyle approaching them."
    },
    {
        "character": "Kyle",
        "line": "What's going on?"
    },
    {
        "character": "Stan",
        "line": "They are trying to save Clyde's mom."
    },
    {
        "character": "Kyle",
        "line": "From what?"
    },
    {
        "character": "Stan",
        "line": "They're saying Clyde left the toilet seat up again."
    },
    {
        "character": "",
        "line": "The Donovan's bathroom. Betsy is stuck in the toilet, moaning and desperately trying to get herself out. Three firemen, a paramedics figure and Clyde are standing beside her. "
    },
    {
        "character": "Fireman 1",
        "line": "Hang it there. You're going to be fine okay? Stay with me now. [Another fireman approaches Roger.]"
    },
    {
        "character": "Fireman 2",
        "line": "I'm sorry, there's nothing we can do."
    },
    {
        "character": "Roger",
        "line": "What?!"
    },
    {
        "character": "Fireman 2",
        "line": "When she fell into the toilet, she also made it flush. It created a suction that's literally pulling out her insides."
    },
    {
        "character": "Roger",
        "line": "Can't we disconnect the toilet from the plumbing?"
    },
    {
        "character": "Paramedic",
        "line": "Yes, we'll have to, but when we do that the change in pressure will rip out her organs."
    },
    {
        "character": "Clyde",
        "line": "But she's not gonna die, is she?"
    },
    {
        "character": "Fireman 2",
        "line": "Why did you leave the toilet seat up, son?"
    },
    {
        "character": "Betsy",
        "line": "Clyde! Clyde! [Clyde goes next to her.] Clyde, I want you to know I don't blame you for this. We should have been h-h-harder on you all those times you left the toilet seat up."
    },
    {
        "character": "Clyde",
        "line": "Mom, I'm sorry."
    },
    {
        "character": "Betsy",
        "line": "Shhh! Sh! I.. don't... have a lot of time, Clyde. Just please put the toilet seat down from now on for your sister's sake, please. Oh, God, please let me go. Let me go. Do it! Do it! Do it! [The third fireman shuts off the plumbing. Betsy screams while her organs are pulled out, then stops, apparently dead.]"
    },
    {
        "character": "Clyde",
        "line": "Mom?"
    },
    {
        "character": "",
        "line": "The church. It's the funeral of Betsy Donovan. A plain chant is heard. Stephen Stotch is giving his speech."
    },
    {
        "character": "Stephen",
        "line": "I'll always remember Betsy Donovan's kind nature, more than anything. She always treated people with dignity and respect. [The camera zooms out. Betsy's corpse in the coffin is seen with a heavy make-up and a pink dress, yet still stuck in the toilet.] What a tragedy she had to leave us so soon. But I'm sure Betsy is hoping that her death will help women everywhere, just take that extra second to look before they sit on a toilet. [Sharon and Sheila look at each other in disbelief.]"
    },
    {
        "character": "Linda",
        "line": "I'd like to say on behalf of the departed, that it isn't a woman's responsibility to see that the seat is down. It's a man's responsibility to put it down. It's not that hard. [all the women start to applause]"
    },
    {
        "character": "Women",
        "line": "Yeah, yes. That's right."
    },
    {
        "character": "Man With Grey Hair",
        "line": "[reads from a paper] Putting the toilet seat down isn't that hard. So is it too much to ask women to just look and put it down before they go plopping their butts blindly to the toilet bowl?"
    },
    {
        "character": "Woman With Brown Hair",
        "line": "My God, people. This is a funeral! Please have some respect! There's a little boy here who has lost his mother! [Clyde is shown, looking down in sorrow] He'll never see her again, because he couldn't take that sixth-tenths of a second to put the seat down when he was done peeing. [camera shows the woman again] And now little Clyde's mother is dead, and the blood is on his penis. [organ music is played]"
    },
    {
        "character": "",
        "line": "The Cartman house, day. Two men from the TSA ring on the door. Cartman is watching Terrance and Phillip while eating cereal."
    },
    {
        "character": "Terrance",
        "line": "Crap. It's too bad we didn't find any treasure on the subway, Phillip."
    },
    {
        "character": "Phillip",
        "line": "Oh, hello, Ugly Bob. [the doorbell rings again]"
    },
    {
        "character": "Ugly Bob",
        "line": "Hello Terrance. Hello Phillip."
    },
    {
        "character": "Cartman",
        "line": "Mom, get the door! [Liane walks in to answer the door]"
    },
    {
        "character": "Terrance",
        "line": "You're looking hideously ugly today, Ugly Bob."
    },
    {
        "character": "Ugly Bob",
        "line": "How come you guys say stuff like that?"
    },
    {
        "character": "Phillip",
        "line": "Because you're goddamn ugly... [The sound from the TV fades away]"
    },
    {
        "character": "TSA agent 1",
        "line": "Hello ma'am, we're the Toilet Safety Administration."
    },
    {
        "character": "Liane",
        "line": "The what?"
    },
    {
        "character": "TSA agent 2",
        "line": "After the recent tragedy, new safety regulations require us to check every toilet for security. Can we come in?"
    },
    {
        "character": "Liane",
        "line": "Oh sure. [The TSA employees come in and go upstairs to the bathroom.]"
    },
    {
        "character": "Cartman",
        "line": "Who are these buttholes?"
    },
    {
        "character": "Liane",
        "line": "It's the Toilet Safety Administration, hun. They're gonna do something to the potty."
    },
    {
        "character": "Cartman",
        "line": "My potty? What are they going to do to it? [runs upstairs]"
    },
    {
        "character": "",
        "line": "The hallway. The TSA employees enter the bathroom while Cartman runs after them."
    },
    {
        "character": "Cartman",
        "line": "Hey, hey! That's my bathroom! [Liane follows him]"
    },
    {
        "character": "",
        "line": "The bathroom."
    },
    {
        "character": "TSA agent 1",
        "line": "Oh yeah, we're gonna have to completely redo this ma'am."
    },
    {
        "character": "Liane",
        "line": "Oh."
    },
    {
        "character": "TSA agent 1",
        "line": "You need to have this counter moved to a minimum of six inches, but we'll go ahead and install your safety belt."
    },
    {
        "character": "Liane",
        "line": "Safety belt?"
    },
    {
        "character": "TSA agent 2",
        "line": "Federal law requires all toilets to be fitted with a safety harness so that nobody can fall in."
    },
    {
        "character": "Cartman",
        "line": "Dude, you can't make me wear a seatbelt to take a dump."
    },
    {
        "character": "TSA agent 2",
        "line": "This is for your safety. A woman died, you know."
    },
    {
        "character": "Cartman",
        "line": "Yeah but the blood's on Clyde's wiener, not mine."
    },
    {
        "character": "",
        "line": "Hoffman & Turk Law Office. Clyde, Kyle, Stan and Jimmy are talking to an attorney who is reading a case file."
    },
    {
        "character": "Kyle",
        "line": "Sir, we are really worried about our friend Clyde. Everywhere he goes people are telling him he had blood on his wiener."
    },
    {
        "character": "Attorney",
        "line": "Uh-uh, go on."
    },
    {
        "character": "Stan",
        "line": "We keep trying to tell him maybe this all isn't his fault. Maybe the people who made the toilet are to blame for what happened."
    },
    {
        "character": "Kyle",
        "line": "So we were just wondering if we could sue somebody."
    },
    {
        "character": "Attorney",
        "line": "You can always sue somebody."
    },
    {
        "character": "Kyle",
        "line": "All right, you see, Clyde. Okay, we wanna help him sue whoever invented the toilet."
    },
    {
        "character": "Attorney",
        "line": "You got it. [types on his computer] Here we go, the inventor of the toilet. [the camera shows the webpage he's reading, which turns out to be a Wickie page] Sir Thomas Harrington. In England, died in 1692."
    },
    {
        "character": "Kyle",
        "line": "Aw, he's dead?"
    },
    {
        "character": "Stan",
        "line": "So then we can't sue him?"
    },
    {
        "character": "Attorney",
        "line": "Why not? You can always sue somebody. It's just gonna take some special protocol. We would have to perform a sue-ance. [spooky music, lightning and thunder follow]"
    },
    {
        "character": "Jimmy",
        "line": "A...a...a...a sue-ance?"
    },
    {
        "character": "Attorney",
        "line": "You bet. Here at Hoffman and Turk we specialize in suing the dead. If you hire us, we'll work hard, for you."
    },
    {
        "character": "Stan",
        "line": "Wow, really?!"
    },
    {
        "character": "Kyle",
        "line": "[puts his arm around Clyde] You hear that Clyde?"
    },
    {
        "character": "Attorney",
        "line": "Now look. I'll be asking all of you to have a very open mind and a willingness to face you fears. [draws a curtain] I warn you boys. A sue-ance can be very... expensive."
    },
    {
        "character": "Stan",
        "line": "How expensive?"
    },
    {
        "character": "Attorney",
        "line": "How much do you have?"
    },
    {
        "character": "Kyle",
        "line": "Clyde got $3000 from his mom's life insurance"
    },
    {
        "character": "Attorney",
        "line": "Wow! That's exactly how much a sue-ance costs. [Dramatic music plays. The camera zooms to the man, then pans to the boys.]"
    },
    {
        "character": "Jimmy",
        "line": "Wow, that's weird."
    },
    {
        "character": "",
        "line": "Randy is sitting on a toilet. He yawns, then farts. A ladder is put on the window, with a cop on it knocking on the window"
    },
    {
        "character": "Randy",
        "line": "Aw, damn it. [reaches the seatbelt. The cop knocks again, so he opens the window.] He, hey officer."
    },
    {
        "character": "Officer",
        "line": "If you're stting on the toilet you need to wear your safety belt, sir."
    },
    {
        "character": "Randy",
        "line": "Yeah, I know, I had it on. I just took it off for a second to get the uh... to get to the uh..."
    },
    {
        "character": "Officer",
        "line": "The address here is 260 Avenue de los Mexicanos?"
    },
    {
        "character": "Randy",
        "line": "Oh, come on, don't give me a ticket!"
    },
    {
        "character": "Officer",
        "line": "Gotta wear your safety belt or you could fall in."
    },
    {
        "character": "Randy",
        "line": "I'm not gonna fall in. I'm not a chick. [puts his belt on]"
    },
    {
        "character": "Officer",
        "line": "The law is the law sir. [hands over the ticket] You can pay this by mail or appear in court on that date. Have a good day, sir. [leaves]"
    },
    {
        "character": "Randy",
        "line": "Yeah thanks. [under his breath] Asshole."
    },
    {
        "character": "Officer",
        "line": "[comes up] You say something?"
    },
    {
        "character": "Randy",
        "line": "No, I was talking to my asshole. C-C'mon, asshole. Let's get back to work. [the cop leaves]"
    },
    {
        "character": "",
        "line": "International House of Pancakes (IHOP), day. Cartman and Butters are in the long line for the bathroom. Butters looks impatient because of retaining his pee."
    },
    {
        "character": "Cartman",
        "line": "This is unbelievable. Stupid Toilet Safety Administration. You can't even take a crap at IHOP without a forty minute line!"
    },
    {
        "character": "R. Booth",
        "line": "Shoes off, belts off! Sharp objects go in the plastic tray!"
    },
    {
        "character": "Man 1",
        "line": "This is inhumane."
    },
    {
        "character": "R. Booth",
        "line": "Shut up! Sir."
    },
    {
        "character": "",
        "line": "Two TSA agents are examining a woman for the toilet pass."
    },
    {
        "character": "R. Wiley",
        "line": "Taking a dump today, ma'am?"
    },
    {
        "character": "Woman 2",
        "line": "No, just need to pee."
    },
    {
        "character": "R. Wiley",
        "line": "I'll just need to check inside your aaasshole. [Cartman comes in]"
    },
    {
        "character": "Cartman",
        "line": "Hey, how about you people speed it up in here? I'm about to crap my pants and I demand access to the toilet right now!"
    },
    {
        "character": "R. Wiley",
        "line": "All right, do you mind if I touch your balls, sir?"
    },
    {
        "character": "Cartman",
        "line": "What? Yes I'd mind! Do you mind if I touch your fucking balls?"
    },
    {
        "character": "Gerald",
        "line": "[flushes and comes out the toilet cabin] Okay, I'm done."
    },
    {
        "character": "R. Wiley",
        "line": "Alright, sir. I just need to check inside your aaasshole. [takes out a handkerchief and starts wiping his butt]"
    },
    {
        "character": "Gerald",
        "line": "I don't need you wiping my ass for me. I'm a grown man."
    },
    {
        "character": "R. Wiley",
        "line": "Yes, you're a big boy, aren't you, sir?"
    },
    {
        "character": "Gerald",
        "line": "Yeah, I'm a big boy."
    },
    {
        "character": "R. Wiley",
        "line": "That's a big boy, sir."
    },
    {
        "character": "Gerald",
        "line": "I'm a big boy. I took a big boy poop."
    },
    {
        "character": "R. Wiley",
        "line": "Yes."
    },
    {
        "character": "",
        "line": "Stan, Kyle, Clyde, Jimmy and the attorney are sitting around a table in a dark room. The attorney lights two candles."
    },
    {
        "character": "Attorney",
        "line": "Alright boys, sit down and clear your minds. The sue-ance is about to begin. Doors and windows are locked. You boys have your $500 in cash ready?"
    },
    {
        "character": "Stan",
        "line": "[holds the money] Yeah."
    },
    {
        "character": "Attorney",
        "line": "Alright. Then I've got this big bowl set here to catch all money we're about to make. Now. Let us start. [holds hands with Jimmy and Clyde, then closes his eyes, so does Jimmy] We call out to the land of the dead. Sir John Harrington. Your presence is requested. Appear to us, John Harrington. We have a subpoena."
    },
    {
        "character": "Jimmy",
        "line": "Jeez, it's not working."
    },
    {
        "character": "Attorney",
        "line": "John Harrington. My client is due compensation for negligence. [a creepy music plays. The table starts to rock, much to the Stan and Kyle's surprise.] What is your name, spirit?"
    },
    {
        "character": "Spirit",
        "line": "[offscreen] Burns. Jimmy Burns. What's it to you? Who are you, mugs?"
    },
    {
        "character": "Attorney",
        "line": "[under his breath] That's how people talked in the past. [to the spirit] We have a claim against a John Harrington. Do you know him, spirit?"
    },
    {
        "character": "Burns",
        "line": "Well, maybe I do and maybe I don't. Might need a little something to jar my memory."
    },
    {
        "character": "Attorney",
        "line": "We gotta grease him. Put a hundred in the box. [Stan puts the money. The money disappears with a sparkling effect.]"
    },
    {
        "character": "Burns",
        "line": "Oh yeah, Harrington. I know him. Always going round inventing things."
    },
    {
        "character": "Attorney",
        "line": "Yes, that's him. Is his personage amongst you?"
    },
    {
        "character": "Burns",
        "line": "Well, maybe it is and maybe it isn't."
    },
    {
        "character": "Attorney",
        "line": "Give him another hundred. [Stan puts the money, it disappears like the previous one]"
    },
    {
        "character": "Burns",
        "line": "Yeah, I've seen him around, alright. He was just down that way, bragging about some porcelain machine and whatever. [the table rocks]"
    },
    {
        "character": "Spirit 2",
        "line": "Nooo! Nooooo!"
    },
    {
        "character": "Attorney",
        "line": "By the power of Christ, we sue you! [fireworks start to pop] By the power of Christ, we sue you!"
    },
    {
        "character": "Spirit 2",
        "line": "You can't sue me! [the drawers around the room move]"
    },
    {
        "character": "Attorney",
        "line": "Quick, put the other $300 in the box! [Stan tosses the money. The attorney swings the box, gasping for breath.] This actually went really, really well. Always happens some bureaucrat tries to block the first sue-ance attempt, but this was good. We'll get him tomorrow."
    },
    {
        "character": "Clyde",
        "line": "So that's it?"
    },
    {
        "character": "Attorney",
        "line": "Yeah, we're gonna need about 400 more dollars tomorrow. I know you're sad about your mom, Clyde, but don't worry. We're going to win this thing."
    },
    {
        "character": "",
        "line": "The Marsh house, morning. Randy walks in the hallway to the toilet. He is in his morning gown, hold a coffee in his hand."
    },
    {
        "character": "",
        "line": "The toilet. The two TSA agents from IHOP are there. R. Wiley is sitting behind a plastic tray."
    },
    {
        "character": "R. Wiley",
        "line": "Put your coffee in the plastic tray please, sir."
    },
    {
        "character": "R. Booth",
        "line": "Shoes off. Belts off."
    },
    {
        "character": "Rand",
        "line": "[takes off his gown] Yeah yeah."
    },
    {
        "character": "R. West",
        "line": "Got any metal in your pockets?"
    },
    {
        "character": "R. Wiley",
        "line": "I just need to check your asshole."
    },
    {
        "character": "Randy",
        "line": "[sighs, then turns around, lowering his pants] So ridiculous."
    },
    {
        "character": "R. Wiley",
        "line": "[examines his ass with a flashlight] Asshole clear."
    },
    {
        "character": "Randy",
        "line": "[puts his pants on] Thanks."
    },
    {
        "character": "R. West",
        "line": "Pick your coffee up, sir. [Randy picks his coffee, then heads to the toilet]"
    },
    {
        "character": "R. Wiley",
        "line": "Anyways, he says I'm getting nothing anyway, so then you can..."
    },
    {
        "character": "Randy",
        "line": "[points away] Hey, what's that thing? [a camera]"
    },
    {
        "character": "R. Wiley",
        "line": "That's a camera. It's a security camera."
    },
    {
        "character": "Randy",
        "line": "Aw, you people have me on camera now?"
    },
    {
        "character": "R. West",
        "line": "It's okay, sir. There's just one person viewing the monitors in a discrete location."
    },
    {
        "character": "",
        "line": "The TSA security camera monitoring room. There is one guy apparently masturbating over the view of hundreds of people in bathrooms."
    },
    {
        "character": "",
        "line": "South Park Community Center. Cartman is giving his speech"
    },
    {
        "character": "Cartman",
        "line": "Exactly how long are we going to sit around as our freedoms are stripped away one by one. It's time for us to stand together, and say, we want the government out of our bathrooms."
    },
    {
        "character": "People",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "Now listen. All we have to do is agree as a community to all bolt our toilet seats down. If they can't raise or lower, there's zero chance of anyone falling in."
    },
    {
        "character": "Mr. Garrison",
        "line": "Hey, yeah. If there's no toilet seats, the government can't make toilet seat laws. [the crowd cheers]"
    },
    {
        "character": "Jimbo",
        "line": "Alright, let's do it."
    },
    {
        "character": "Sheila",
        "line": "No, no, hold on. If the seat can't raise up the men will just pee all over it."
    },
    {
        "character": "Man 3",
        "line": "No, we won't."
    },
    {
        "character": "Woman 3",
        "line": "Yeah, you will."
    },
    {
        "character": "Cartman",
        "line": "Well, sorry if women might have to deal with a little splash of pee on the rim, but it's a far better solution than having the government in out bathrooms, right?"
    },
    {
        "character": "Woman 4",
        "line": "How about we agree to that, if men will agree that they will always sit down to urinate."
    },
    {
        "character": "Stephen",
        "line": "Well, no, you can't make men sit down to pee. How could we play sink the boat?"
    },
    {
        "character": "Randy",
        "line": "Yeah, how will Nelson and I make an X on sleepover nights?"
    },
    {
        "character": "Man 4",
        "line": "What about us loggers? Hardworking man who like to stand up after they have taken a poo and then turn around and but the poo in half with their urine?"
    },
    {
        "character": "Cartman",
        "line": "Well, sorry, but if we don't want the government treating us like children, we might have to give up being able to pee out feces in half."
    },
    {
        "character": "Man 4",
        "line": "But folks been logging round these parts for generations. My pappy taught me logging. And his pappy before him."
    },
    {
        "character": "Randy",
        "line": "Yeah, I think we've just gotta live with the TSA. [several men say 'Yeah' agreeing him]"
    },
    {
        "character": "",
        "line": "The dark room. Stan, Kyle, Clyde, Jimmy and the attorney are sitting around the same table. The attorney is holding hands with Jimmy and Clyde with his eyes closed."
    },
    {
        "character": "Attorney",
        "line": "Oh, oohh! The spirits of the dead are looking over the subpoena. Motion for summary judgement on behalf of the plaintiff? Ah, aaaah!"
    },
    {
        "character": "Jimmy",
        "line": "What's happening now?"
    },
    {
        "character": "Attorney",
        "line": "Our motion has been denied by the judge. [the drawers begin to move] Concentrate boys! [holds the box tight. The drawers stop, the attorney heaves a sigh of relief] This specter is like none I have ever encountered. I managed to avert liability within injunction against out claim."
    },
    {
        "character": "Stan",
        "line": "So what does that mean?"
    },
    {
        "character": "Attorney",
        "line": "We'll hit him with a class action lawsuit tomorrow. We'll need all your friends and family to sign a petition and kick in 50 bucks each."
    },
    {
        "character": "Kyle",
        "line": "[frowning] What?"
    },
    {
        "character": "Attorney",
        "line": "Hang in there, Clyde. This is all to make the world a safer place."
    },
    {
        "character": "",
        "line": "The security camera monitoring room. Squishy sounds arise while the monitor guy masturbates. He clicks on the monitor's button a couple of times to change the channel, then stops at a woman reading book while taking a dump. He changes the channel some more, and then takes some bit of the moisturizing lotion on the table to put on his penis. He keeps on changing the channel until the view of Cartman standing with an angry face appears. He keeps looking at the monitor while rubbing his penis, though his motions get more interrupted. Cartman puts a gun on a stool, brings in a baby and R. Wiley, bound and gagged. He climbs up a small ladder and sprays the camera with black spray paint. The man's expression changes to a concerned look. He reaches to the microphone."
    },
    {
        "character": "Monitor Man",
        "line": "Security breeeach!"
    },
    {
        "character": "",
        "line": "The news."
    },
    {
        "character": "Reporter",
        "line": "An embarrassing day for the toilet safety administration. Shocking outrage ensued after an unknown terrorist managed to get through TSA security with a gun and a baby. Leaving the toilet seat up. The head TSA chief of operations had this to say:"
    },
    {
        "character": "",
        "line": "R. West is shown sitting on an outside table in a park."
    },
    {
        "character": "R. West",
        "line": "Shiiiit!"
    },
    {
        "character": "Reporter",
        "line": "Meanwhile, outraged civilians are claiming they're finally fed up with the overblown government bureaucracy."
    },
    {
        "character": "",
        "line": "Park County Community Center, day. A huge crowd has gathered in front of the building. Cartman is standing in front of the crowd, and Randy is behind the pulpit"
    },
    {
        "character": "Randy",
        "line": "What good is the TSA if they aren't protecting us? Why have we given up freedom if a terrorist can take a hostage in a bathroom with a baby and a gun on the toilet?"
    },
    {
        "character": "Woman 5",
        "line": "And the toilet seat was up."
    },
    {
        "character": "Randy",
        "line": "We've all stood by as our mother government has taken out dignity."
    },
    {
        "character": "Cartman",
        "line": "That's right."
    },
    {
        "character": "Randy",
        "line": "Now it's time for us to take responsibility for ourselves."
    },
    {
        "character": "Cartman",
        "line": "Yeah."
    },
    {
        "character": "Randy",
        "line": "It is time for us all to grow up."
    },
    {
        "character": "Cartman",
        "line": "That's right."
    },
    {
        "character": "Randy",
        "line": "It is time for a sue-ance."
    },
    {
        "character": "People",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "Wait, what? What the fuck is a sue-ance?"
    },
    {
        "character": "",
        "line": "Colorado State Courthouse. A news reporter is standing outside the building."
    },
    {
        "character": "Reporter 2",
        "line": "Tom, I'm standing outside the South Park courthouse where experts have successfully summoned the ghost of toilet inventor Sir John Harrington. Now that the spirit has crossed over from the dead, lawyers are gonna try and sue him."
    },
    {
        "character": "",
        "line": "The court. A trial is hold. The judge has a bored look on his face."
    },
    {
        "character": "Attorney",
        "line": "Sir Thomas Harrington, your extreme negligence has cost tax payers millions."
    },
    {
        "character": "Spirit",
        "line": "No! No!"
    },
    {
        "character": "Attorney",
        "line": "You will be sued, spirit. Thy liability is without question. [the table before the attorney moves. Jimmy, Clyde, Cartman, Stan and Kyle are shown sitting there.] Appear before this court, Harrington."
    },
    {
        "character": "Spirit",
        "line": "Never!"
    },
    {
        "character": "Attorney",
        "line": "Quick, everyone, get our all your money. [the light goes out and the table rocks. A bright light appears above the judge accompanied by an echoed voice. It turns out to be Betsy's ghost.]"
    },
    {
        "character": "Betsy",
        "line": "Clyde? Clyde?"
    },
    {
        "character": "Clyde",
        "line": "Mom?"
    },
    {
        "character": "Betsy",
        "line": "[points to the attorney] This lawyer is a fraud. He has been swindling you and your friends for your money."
    },
    {
        "character": "Attorney",
        "line": "Fuck me, it's a ghost."
    },
    {
        "character": "Betsy",
        "line": "You can't sue the dead, Clyde. Putting the toilet seat down is a matter of simple etiquette. It's common sense, Clyde!"
    },
    {
        "character": "Cartman",
        "line": "Oh boy, here we go."
    },
    {
        "character": "Betsy",
        "line": "Don't try and blame mommy's death on anything but your failure to something I have asked you time and time again to do. [camera pans to Clyde] It's your fault!"
    },
    {
        "character": "Spirit 2",
        "line": "[offscreen] Now hold on a second! It's not anyone's fault. [everyone turns to the root of the sound. A spirit enters the court] I am sick an tired of all this nonsense over my porcelain toilet machine."
    },
    {
        "character": "P. Sanchez",
        "line": "There he is, Sir John Harrington."
    },
    {
        "character": "Mr. Garrison",
        "line": "Quick, sue him!"
    },
    {
        "character": "Sir Harrington",
        "line": "You can't sue me. [approaches to the toilet cabinet located in the court] You're all using my toilet invention the wrong way. [camera pans to the TSA agents who look at each other] When you have to sit and take a Sir Harrington, you're supposed to be facing this way. [sits on it backwards, just like the way Butters did] So you can use the little shelf for your books, and your quill and your ink."
    },
    {
        "character": "Butters",
        "line": "A-ha! I told you you should sit on it that way! I told you!"
    },
    {
        "character": "Sir Harrington",
        "line": "Why would I design it so that when you're finished taking a Sir Harrington, you have to stand up, turn around and look down right at your Harrington to flush?! That's gross!"
    },
    {
        "character": "Randy",
        "line": "Well, yeah, but... but if you sit on it that way, you have to take your pants all the way off."
    },
    {
        "character": "Sir Harrington",
        "line": "Of course! Why do you think I designed toilet rooms with a laundry hole? [points to the hole in the cabin]"
    },
    {
        "character": "Randy",
        "line": "Oh, that's what that hole is for? Oh. [the people in the room join] Oops."
    },
    {
        "character": "",
        "line": "The Cartman house, night. Cartman is lying on the bed in his pajamas while cutting his toenails, just like the beginning of the episode. He is talking on the phone."
    },
    {
        "character": "Cartman",
        "line": "So then... so then Clyde's mom's ghost was all like \"Clyde, what have I told you Clyde, you asshole!\" And Clyde is all like \"Mom, leave me alone! I'm seriously. Stop, please!\" Dude, it was a riot."
    },
    {
        "character": "",
        "line": "Clyde is reading a comic book on a shelf while holding the receiver on his ear."
    },
    {
        "character": "Clyde",
        "line": "That's not what I said."
    },
    {
        "character": "Cartman",
        "line": "Hah. Yeah, well, I'm just glad that stupid TSA crap is over with. I know you've had a tough week, Clyde. But at least your mom didn't die for nothing. I mean, we're kinda right back at the bathroom being the last bastion of American freedom. So technically, your mom did die for nothing, but... Clyde? Clyde?"
    },
    {
        "character": "",
        "line": "Clyde is sitting on the toilet... backwards, and peeing."
    },
    {
        "character": "Cartman",
        "line": "[his voice comes through the receiver] Clyde, you there? Hello? [Clyde comes off the toilet, flushing it. He waits for a few seconds, then angrily puts the seat up, and leaves the bathroom while flipping off his mother pointing upwards.]"
    }
]