[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Looming Sunset Assisted Living center, day. We can surmise from this that Grandpa Marsh was put in this home when Sharon and Randy divorced shortly after Stan's 10th birthday. The family stops by for a visit."
    },
    {
        "character": "Randy",
        "line": "Well, Dad, it was really great seeing you. We'd love to stay for dinner, but the food here gives Sharon diarrhea."
    },
    {
        "character": "Sharon",
        "line": "What?! Randy!"
    },
    {
        "character": "Randy",
        "line": "[shushes her] Just trying to leave without being rude."
    },
    {
        "character": "Marvin",
        "line": "[rolls over to a small table next to the TV. There's a gift-wrapped box on it] Hold on, hold on just a second. I got a present for my grandson. [gets the box and wheels back to the family] Come here, Billy. [meets Stan in the middle of the room] You've grown up, Billy. It's time for you to have somethin' expensive and flashy [Stan smiles and glances back at his parents], to impress all the ladies [Stan takes the gift from him, then looks back at his parents]."
    },
    {
        "character": "Sharon",
        "line": "Go ahead and open it, Stan. [Stan opens the gift as Shelly and his parents surround him. Sharon kneels behind him and looks over his shoulder] Ohoho look at that! A bolo tie! Isn't that beautiful, Stan? [she puts it on him - gold base, turquoise center, diamonds surrounding it (12 small, 24 tiny)]"
    },
    {
        "character": "Marvin",
        "line": "That's 14 karat gold, with turquoise and reeeal diamonds."
    },
    {
        "character": "Randy",
        "line": "[approaches Marvin] Grandpa, how much did you spend on that?"
    },
    {
        "character": "Marvin",
        "line": "Six thousand dollars."
    },
    {
        "character": "Randy",
        "line": "Six thousand?!"
    },
    {
        "character": "Marvin",
        "line": "It's worth fifty thousand. The Jewels and Gems Shopping Network said so."
    },
    {
        "character": "Randy",
        "line": "Dad, you shouldn't be spending your retirement money on frivolous things! You should be saving it for when you die. That's our money!"
    },
    {
        "character": "Sharon",
        "line": "It's gorgeous, Dad, thank you. Oh, and tomorrow's picture day at school! Stan can wear it for his photo!"
    },
    {
        "character": "Marvin",
        "line": "Oh, that's wonderful! That'll make me feel reeeally good. Who's Stan?"
    },
    {
        "character": "",
        "line": "The bus stop, next day. It's picture day! Cartman, Kyle, and Kenny are waiting at the bus stop. Stan approaches, wearing the bolo tie, and stands next to the other boys. Cartman studies him at length"
    },
    {
        "character": "Cartman",
        "line": "Nice bolo tie, Stan."
    },
    {
        "character": "Stan",
        "line": "[looks away to avoid eye contact] Thanks. [Kyle takes notice]"
    },
    {
        "character": "Cartman",
        "line": "Bolo ties are... [quickly glances at Kyle] really in right now. Cool you have one."
    },
    {
        "character": "Stan",
        "line": "[annoyed] Look, it was a gift from my grandpa, okay? And it cost a lot of money."
    },
    {
        "character": "Cartman",
        "line": "No, dude, it's... badass."
    },
    {
        "character": "Stan",
        "line": "[angered] It happens to be worth six thousand dollars!"
    },
    {
        "character": "Kyle",
        "line": "That... was six grand?"
    },
    {
        "character": "Stan",
        "line": "Yeah dude. It's a recreation of the bolo tie worn by King Henry V."
    },
    {
        "character": "Cartman",
        "line": "...Dude, it's fucking gay as fuck."
    },
    {
        "character": "Stan",
        "line": "[finally breaks, facepalming] I know! [lowers his right arm] I really wish if my grandpa wanted to give me something, he'd just give me the money!"
    },
    {
        "character": "Kyle",
        "line": "Why don't you take it to one of those pawn places? Every two blocks you see a guy with a sign that says \"Cash For Gold and Jewelry.\" There must be a lot of people doin' it."
    },
    {
        "character": "",
        "line": "Downtown South Park, the jewelry district, day. Outside a Cash For Gold store a man spins a sign around with his hands. Inside, behind a bullet-proof partition, a clerk looks the bolo over with a jeweler's scope"
    },
    {
        "character": "Clerk 1",
        "line": "You didn't steal this, did you?"
    },
    {
        "character": "Stan",
        "line": "No, my grandpa gave to me as a present. But it's worth so much I reel really bad accepting it, so I just want the cash."
    },
    {
        "character": "Clerk 1",
        "line": "[does some calculations on his computer] It's 14-karat gold, diamond and turquoise. I'll give you fifteen dollars."
    },
    {
        "character": "Stan",
        "line": "...What? That cost my grandpa six thousand dollars. Those are real diamonds on the outside."
    },
    {
        "character": "Clerk 1",
        "line": "Yeah, I can't really make anything on the diamonds. I'd have to send it to a smelter, have it all smelted down for the gold, probably could make a ten-dollar profit."
    },
    {
        "character": "Stan",
        "line": "Fifteen bucks?!"
    },
    {
        "character": "Kyle",
        "line": "Dude, this guy's trying to rook us! We can go someplace else!"
    },
    {
        "character": "Stan",
        "line": "Yeah, I'm not gettin' taken advantage of! [takes back the bolo tie]"
    },
    {
        "character": "Cartman",
        "line": "You may suck our collective balls, sir! [they leave the store, turn right and walk]"
    },
    {
        "character": "Kyle",
        "line": "Don't worry. There's gotta be another cash for gold place around here somewhere."
    },
    {
        "character": "Stan",
        "line": "Yeah! Here's one. [turns into the next store past the empty lot. The man outside is wearing a signboard]"
    },
    {
        "character": "",
        "line": "Inside the second store, a fat blonde woman looks the bolo tie over"
    },
    {
        "character": "Clerk 2",
        "line": "These are real diamonds, right?"
    },
    {
        "character": "Stan",
        "line": "Yeah dude, you can test them."
    },
    {
        "character": "Clerk 2",
        "line": "Okay. Eight dollars."
    },
    {
        "character": "Stan",
        "line": "[stunned, then angry] This is the same bolo tie worn by King Henry V!"
    },
    {
        "character": "Clerk 2",
        "line": "[looks it over again] Nine dollars."
    },
    {
        "character": "",
        "line": "Taco Bell, day. No go at the second store, so the boys come here. Outside, a man twirls a sign around which also points to Taco Bell as a cash for gold and jewelry store. The boys go in and get the bolo tie appraised"
    },
    {
        "character": "Clerk 3",
        "line": "Welcome to Taco Bell. Would you like to try our Doritos Locos Tacos?"
    },
    {
        "character": "Stan",
        "line": "I wanna see how much you'll give me for this gold and turquoise diamond bolo. [hands the bolo to the clerk. The clerk looks it over, brings out his own pocket scope, and looks it over more closely]"
    },
    {
        "character": "Clerk 3",
        "line": "Fourteen-karat gold gets yaaa $14 a gram on the open market, got about... 4 grams here... [puts his scope away] It's not really worth my time. I guess I can give you a six-layer burrito for it."
    },
    {
        "character": "Stan",
        "line": "A six-layer burrito?"
    },
    {
        "character": "Kyle",
        "line": "You guys don't even make a six-layer burrito!"
    },
    {
        "character": "Clerk 3",
        "line": "Alright, a seven-layer burrito! But that's as high as I'm going!"
    },
    {
        "character": "",
        "line": "Outside Taco Bell, sitting on a curb"
    },
    {
        "character": "Stan",
        "line": "Dude, my grandpa paid $6000 for something barely worth anything. How? How does something like this happen?"
    },
    {
        "character": "",
        "line": "J&G Shopping Network, Jewelry Bonanza with DEAN, Channel 233. The show is already in progress. Dean, dressed in a white Western shirt, shows off his wares"
    },
    {
        "character": "Dean",
        "line": "Okay, folks, we are com-, half-way complete with today's broadcast. [scratches his nose] You wanna get in on these deals, call now. Next item is... This is item number 4 5 7 8 1 1 1. [switch to a close-up] Look at these stunning earrings. These are genuine faux sapphire earrings. Fourteen karat gold, 86 carat faux sapphire. Faux is a French word. Got an x in it, but you don't need to pronounce the x. How do you like that for prestigious? These earrings normally go for $6,000,000. We're gonna sell these today fer... [purses his lips together and exhales through them] $320!That's a steal. Now th-oh, there go the phones, they're lightin' up. I believe we have a sale? Do we have a sale? Yea- let's get her on the line. Hello? Who am I speakin' with?"
    },
    {
        "character": "Vivian",
        "line": "Hello... my name is... Vivian."
    },
    {
        "character": "Dean",
        "line": "Vivian, you just got a heck of a deal. What's your last name, sweetheart?"
    },
    {
        "character": "Vivian",
        "line": "Oh I... I can't remember."
    },
    {
        "character": "Dean",
        "line": "You can't remember. Well can you remember your credit card number?"
    },
    {
        "character": "Vivian",
        "line": "3 7 1 5-"
    },
    {
        "character": "Dean",
        "line": "Hold on, Vivian, we'll get you on with a rep, take down that number. Thanks for shoppin' with us and congratulations on the lovely 14 karat gold sapphire earrings. At that price you practically stole them from us. Ouch. Okay-"
    },
    {
        "character": "",
        "line": "Cartman's house, day. The boys are looking at Jewelry Bonanza in the living room and have just seen an old woman get swindled out of her money"
    },
    {
        "character": "Kyle",
        "line": "Dude, that's terrible!"
    },
    {
        "character": "Cartman",
        "line": "I told you guys. I've been watching all day."
    },
    {
        "character": "Stan",
        "line": "But, how do they get away with that?"
    },
    {
        "character": "Cartman",
        "line": "This is a new time. A new era of science that only the smartest can comprehend. [walks out]"
    },
    {
        "character": "Stan",
        "line": "What are you talking about?"
    },
    {
        "character": "Cartman",
        "line": "[standing next to a covered mobile whiteboard] For centuries alchemists have tried to come up with a formula to make gold. Whoever could do it would of course become rich, and now-! The chemical equation is right before our eyes. [unveils the equation]"
    },
    {
        "character": "Kyle",
        "line": "That's the chemical equation for gold?"
    },
    {
        "character": "Cartman",
        "line": "That's right. [goes through and denotes what each letter means] Guys with Cash For Gold Signs gets you People's Unwanted Crappy Jewelry, which when added to a Cable-Based Shopping Network divided by Demented Old people equals... Gold. [writes in an equal sign and \"GOLD\" at the end]"
    },
    {
        "character": "Kyle",
        "line": "...Kenny, will you tell Cartman to shut up?"
    },
    {
        "character": "Kenny",
        "line": "(Shut the fuck up, dude! You're a fuckin' asshole!)"
    },
    {
        "character": "Cartman",
        "line": "Oh, I'm an asshole for doin' math!"
    },
    {
        "character": "Dean",
        "line": "Oh my gosh, can you believe this? Somebody's about to get this $20,000 topaz and copper ring for just four thousand bucks. [a close-up of the ring] We've got our buyer on the line. You buyin' this as a gift, sir?"
    },
    {
        "character": "Caller",
        "line": "No, I'm buying it as a gift! For my grandson Billy!"
    },
    {
        "character": "Stan",
        "line": "Grandpa? [gets off the sofa and runs out the front door]"
    },
    {
        "character": "",
        "line": "Looming Sunset Assisted Living, night. Marvin is watching Jewely Bonanza. Onscreen is a necklace with a large emerald on it"
    },
    {
        "character": "Dean",
        "line": "How about that, folks? That is Brazilian emerald, finest emerald available. We're letting this oen go fer... fourteen ninety five [$1495.00 onscreen], EZ Pay. We call it that to save you time. EZ is an abbreviation of easy. Fourteen ninety five, EZ Pay an... What's that? Okay, alright, I just got word, we are droppin' the Z from EZ Pay. It's now just E Pay. [onscreen EZ Pay is erased, then E Pay appears] By usin' the word E Pay instead of takin' all that time to say EZ Pay, we're savin' you a second of time, and those seconds add up. Go ahead and try it: say E Pay five thousand times. That's five thousand seconds, nine hours... we just saved you here on J&G Shoppin' Network. [Grandpa's eyes begin to wander] Not wastin' your time here, you can't afford not to buy this one. You don't have a lot of time left. Literally. Pass this one down to your kids, your grandkids. [Stan appears at the doorway] Show 'em your life had meaning."
    },
    {
        "character": "Stan",
        "line": "Grandpa."
    },
    {
        "character": "Marvin",
        "line": "[turns his head to the left to look at Stan] Well you see that, Billy? That's an emerald on 14 karat gold. Don't you think your sister would like that? [smiles]"
    },
    {
        "character": "Stan",
        "line": "She doesn't like jewelry, Grandpa."
    },
    {
        "character": "Marvin",
        "line": "Ha! Well she will one day. She'll appreciate it. She's, she's just a baby after all."
    },
    {
        "character": "Stan",
        "line": "She's not a baby, Grandpa, she's thirteen."
    },
    {
        "character": "Marvin",
        "line": "Shelly's thirteen? Rihight. Right, boy... [faces the TV again, visibly shaken] Billy, did I ever tell you I used to have a border collie named Patches?"
    },
    {
        "character": "Stan",
        "line": "Yes, Grandpa."
    },
    {
        "character": "Marvin",
        "line": "[reminiscing with a smile] I loved that dog. She always made me so happy. When she died, I... I didn't let myself get too sad, 'cause I thought, thought I'd always have the memory of her slobberin' happy face. [the smile disappears] I can't remember what she looked like, Billy... Huh. Huohh. [gets a headache and rests his head on his left hand]"
    },
    {
        "character": "Stan",
        "line": "Don't worry, Grandpa. I'm gonna take care of this! [turns to his left and leaves with determination. Marvin is left looking distressed]"
    },
    {
        "character": "",
        "line": "South Park Elementary, playground, day. During recess, Butters twirls a sign around, while Cartman is decked out in all sorts of jewelry."
    },
    {
        "character": "Cartman",
        "line": "Hey Craig. Goin' on? Tolkien! Bet your mom has some old jewelry she wouldn't notice missing. Bebe! You got those rhinestones in your earrings, I'll have some walking cash! I can probably offer you a-"
    },
    {
        "character": "Butters",
        "line": "[loses control of the sign] Whoops! [it lands face up on the snow]"
    },
    {
        "character": "Cartman",
        "line": "[quickly analyzing the situation] Butters, what the fuck?!"
    },
    {
        "character": "Butters",
        "line": "[winces, then massages his right arm] Sorry. My arms hurt."
    },
    {
        "character": "Cartman",
        "line": "\"My arms hurt.\" Pick the fucking sign up, Butters! This is a business! [Butters picks the sign up and resumes twirling]"
    },
    {
        "character": "Leroy",
        "line": "Hey! How much will you give me for this? [shows him a ring with a huge rock on it]"
    },
    {
        "character": "Cartman",
        "line": "Oh ahhhh, three bucks."
    },
    {
        "character": "Leroy",
        "line": "Okay. [gives the ring to Cartman, who transfers it to his left hand. Cartman reaches into his back pocket and give Leroy the three dollars. Leroy turns and walks away]"
    },
    {
        "character": "Cartman",
        "line": "We got crappy jewelry Butters. Now all we need are some old people."
    },
    {
        "character": "",
        "line": "Jewelry Bonanza."
    },
    {
        "character": "Dean",
        "line": "And that's it, we just sold this bracelet to Ms. Marcia Tubbs. Marcia, thank you so much for your call. You just got yourself a heck of a deal on this one. You there Marcia?"
    },
    {
        "character": "Marcia",
        "line": "[over the phone] Yes. [a car honks at her] I'm lost. I'm lost walkin' on the freeway."
    },
    {
        "character": "Dean",
        "line": "Alright, you're lost walkin' on the freeway? Enjoy the Tiger's Eye Aquamarine bracelet. Alri- okay, what should we do next? Oh I see one. Here's a good'un. Lemme... [picks out a ring with a large yellow stone in the middle] Lemme... lemme set the stage for you here: you're goin' to that seniors' cocktail party? It's bingo night and you're lookin' for somethin' to wear? How about a 13 carat panzoto-panzanite ring. This is-oh! We got a caller already on this one! Hello sir, you must be a fan of panzoto-panzanite."
    },
    {
        "character": "Stan",
        "line": "Yeah, hi. Um, you should kill yourself?"
    },
    {
        "character": "Dean",
        "line": "...What's that?"
    },
    {
        "character": "Stan",
        "line": "I said, you should kill yourself? What you do is sort of, unjustifiable? And you know it's unjustifiable? And you don't care? You're the definition of evil? Kill yourself?"
    },
    {
        "character": "Dean",
        "line": "Okay, we're gonna sell this ring for just thirty-seven ninety five. [$3,795.00 onscreen] How's that? [puts the ring onto a woman's right ring finger.]"
    },
    {
        "character": "Stan",
        "line": "I just read that the day shopping networks make most of their money is on the day seniors pick up Social Security checks? Kill yourself."
    },
    {
        "character": "Dean",
        "line": "Alright, well you shouldn't say things like that 'cause... some host of a jewelry channel sure might up and do it, and then you'd feel really bad."
    },
    {
        "character": "Stan",
        "line": "No I wouldn't."
    },
    {
        "character": "Dean",
        "line": "Yes you would."
    },
    {
        "character": "Stan",
        "line": "No, because I really want you to kill yourself."
    },
    {
        "character": "Dean",
        "line": "Alright, well how about this?! If a jewelry network host goes home tonight and blows the brains out, you might be liable. That's a lawsuit worth ...2.7 million dollars? How's that sound?"
    },
    {
        "character": "Stan",
        "line": "I don't care what happens to me, I care about my grandfather, you morally empty corrupted maggot!"
    },
    {
        "character": "Dean",
        "line": "[long silence as the jewelry carousel goes around] Alright, I tell you what: I'll bring the lawsuit down to twenty-nine thirty-nine- [the $6,000,000 is erased and replaced by $2,939.00]"
    },
    {
        "character": "Stan",
        "line": "Nono, uh it doesn't matter what price you put on anything! Your only chance to right the wrongs you've done, and repay all the elderly people whose lives you've destroyed, is to kill yourself."
    },
    {
        "character": "Dean",
        "line": "[another long silence, then he clears his throat] Well, you think it's funny, but that's, that's callin' up and tellin' someone to kill themselves; that's not a joke."
    },
    {
        "character": "Stan",
        "line": "I'm not joking. [pause] Do it."
    },
    {
        "character": "",
        "line": "Eric Jewelry Cavalcade, with Eric. Now on the Old People's Shopping Network, founded by Eric Cartman. He's in his basement, behind a table with his own props and jewelry"
    },
    {
        "character": "Cartman",
        "line": "Okay, next item? Next item we're gonna do is uh, 5 5 2 1 6 uh 7, 7 5, 5 [actually 55-26177] This is-oh my God, look at this you guys. [shows off the ring Leroy sold him earlier] This is 200 carat Brazilian emerald and plasticine ring. I'm gonna start bidding for this ring at, um, let's see, eight billion dollars. Eight billion dollars, opening bid. We've gotta sell this ring today. Tell you what, I'm gonna take it down a little. We're gonna drop that price down to... $75.95. At this price it's not gonna last for lo-oh, we got a caller already, Butters? Butters? Look like- Did we sell it? Yep, seventy-five ninety-five, that's what the ring just sold for. Do we have the buyer on the line? Hello?"
    },
    {
        "character": "Caller",
        "line": "Hello?"
    },
    {
        "character": "Cartman",
        "line": "YES, you just bought this lovely 200-carat ring. How do you feel, Mrs...?"
    },
    {
        "character": "Mrs. Appleby",
        "line": "This is Mrs. Appleby on 24 Palmark Lane?"
    },
    {
        "character": "Cartman",
        "line": "Can I ask you something, Mrs. Appleby? Do you like fucking little boys?"
    },
    {
        "character": "Mrs. Appleby",
        "line": "[long pause] I'm sorry?"
    },
    {
        "character": "Cartman",
        "line": "Just wondering if you fuck kids all the time, 'cause that's what you just did with this deal. You just got an $8,000,000,000 ring for seventy-five ninety-five. You fucked me good, Mrs. Appleby. Congratulations, ma'am."
    },
    {
        "character": "Mrs. Appleby",
        "line": "Thank you."
    },
    {
        "character": "Cartman",
        "line": "Were you just flippin' through the channels and saw me selling this ring and thought \"Hm, I'd like to fuck that kid!\""
    },
    {
        "character": "Mrs. Appleby",
        "line": "...I thought it'd be a lovely gift for my granddaughter Jessica. She's captain of the debate team at Jefferson High School. see-"
    },
    {
        "character": "Cartman",
        "line": "Oh-kay, thanks for shopping with us. I gotta get the taste of old lady dick out of my mouth."
    },
    {
        "character": "Mrs. Appleby",
        "line": "Goodbye."
    },
    {
        "character": "Cartman",
        "line": "Bye! Man that's good acting. I should get an award."
    },
    {
        "character": "",
        "line": "A smelting plant. Shown is the Oscar for Best Actor: Sean Penn in Milk. The camera pulls back to reveal a pile of gold jewelry on which the Oscar sits. A shovel comes in and scoops it up with some other jewelry. The worker holding the shovel moves it to a vat of molten gold and dumps the jewelry into the vat. Escaping air makes a fart sound as the jewelry sinks into liquid gold, and then some bubbles popping follow"
    },
    {
        "character": "Stan",
        "line": "Do you have any idea what it would feel like to start losing your memories?! No! Because you don't have someone in your life suffering from Alzheimer's! Well I do!"
    },
    {
        "character": "Manager",
        "line": "Look, kid, if you've got a beef with the system, you're talkin' to the wrong people. All we do is smelter down what we get from the cash for gold places."
    },
    {
        "character": "Stan",
        "line": "Yeah?! Well there's an old Hindu saying: \"Whoever smelt it, dealt it!\""
    },
    {
        "character": "Kyle",
        "line": "Yeah!"
    },
    {
        "character": "Kenny",
        "line": "(Fuck yeah!)"
    },
    {
        "character": "Manager",
        "line": "We aren't the ones who denied you what your jewelry was really worth. The Hindu saying is actually \"Mayii nahii chahatapahnii\""
    },
    {
        "character": "Kyle",
        "line": "What does that mean?"
    },
    {
        "character": "Manager",
        "line": "\"Whoever denied it, [lowers his voice] supplied it.\" [the boys are stunned]"
    },
    {
        "character": "",
        "line": "The neighborhood park, day. Stan is now on a crusade to stop this madness, but he hasn't found the right target. Kyle has his arms crossed"
    },
    {
        "character": "Stan",
        "line": "YOU are the scums of the earth! Old people are victimized by shopping networks and YOU kick back in your fat-cat mansions, making billions!"
    },
    {
        "character": "Butters",
        "line": "[looks around at his fellow sign twirlers] We aren't makin' that much, fellas."
    },
    {
        "character": "Stan",
        "line": "You're not?"
    },
    {
        "character": "Twirler 1",
        "line": "Who don't you yell at the people who melt the gold down? The old Hindu saying is \"Whever smelt it dealt it\" [other twirlers agree with him: \"Yeah!\" \"That's right!\"]"
    },
    {
        "character": "Kyle",
        "line": "[leans forward] Nuh uh! It's \"Whoever denied it, supplied it!\""
    },
    {
        "character": "Twirler 2",
        "line": "You got it all wrong. The jewelry that those shopping networks sell don't even come from us! It's all made in India, where those Hindu rhymes come from!"
    },
    {
        "character": "Twirler 3",
        "line": "What are you saying, Gustav? My God, do you mean?"
    },
    {
        "character": "Twirler 4",
        "line": "That's right. Whoever made the rhyme did the crime."
    },
    {
        "character": "",
        "line": "Gems Wholesale, day. Cartman walks by with a briefcase"
    },
    {
        "character": "Cartman",
        "line": "Suck my balls, suck my balls... [enters the store] Hello!"
    },
    {
        "character": "Clerk 4",
        "line": "[An Asian woman] Ohhhh welcoooome! Welcome to discount jewelry stohhhhh! [her two assistants join her as Cartman takes a seat at the counter]"
    },
    {
        "character": "Cartman",
        "line": "[shoves his briefcase to one side] Yeah, listen, I'm running a resale business, but I can't get enough of people's unwanted crappy jewelry to keep up, so I'd like to buy some of yours."
    },
    {
        "character": "Clerk 4",
        "line": "[claps way too quickly] Ohhhhh you so good foh biiiziness! [points to her brain] You so clehhvahh."
    },
    {
        "character": "Cartman",
        "line": "I get by. Let's see, I'm gonna need some gold necklaces, diamond bracelets, and emerald earrings."
    },
    {
        "character": "Clerk 4",
        "line": "Okay, what emero do you rike?"
    },
    {
        "character": "Cartman",
        "line": "Oh, I don't know, I guess I'll take that ring there."
    },
    {
        "character": "Clerk 4",
        "line": "Ohhhh you make so good chooice! Oh it's beauuutiful! [shows her aides] Look it's beauuutiful! [they too clap way too quickly]"
    },
    {
        "character": "Cartman",
        "line": "And uh, maybe I'll that one for three hundred."
    },
    {
        "character": "Clerk 4",
        "line": "Oh, that's best one! You so clevohh! [claps quickly a few times] You take advantage o'my low pricess! [claps a few times]"
    },
    {
        "character": "Cartman",
        "line": "How about that panzanite bracelet for nine ninety five."
    },
    {
        "character": "Clerk 4",
        "line": "You got good eye, [points to her brain] You so clehhvahh. I getting taken advantaaage! You rike to fuck an Asian lady?"
    },
    {
        "character": "Cartman",
        "line": "[long pause] What d'ja say?"
    },
    {
        "character": "Clerk 4",
        "line": "I know, you walk by my stoh and you say \"Oh, there's a nice Asian lady. I think I go in and I fuck hurh,\" you Asian-lady fucker you!"
    },
    {
        "character": "Cartman",
        "line": "Wait a minute. How much do you pay for this stuff?"
    },
    {
        "character": "Clerk 4",
        "line": "Oh, I pay thousands! And you come heuh an' fuck me!"
    },
    {
        "character": "Cartman",
        "line": "Okay, quit the act! I'm not fucking you and you know it!"
    },
    {
        "character": "Clerk 4",
        "line": "Nono, you fucked me!"
    },
    {
        "character": "Cartman",
        "line": "Nono, you fucked me! Fuck you!"
    },
    {
        "character": "",
        "line": "India Manufacturing, Inc., a rainy day somewhere in India. A taxi pulls up to the plant, with Cartman and Butters inside."
    },
    {
        "character": "Cartman",
        "line": "My balls, my balls, suck 'em dry...[Butters opens his door and hops out, then opens Cartman's door. Cartman looks around and clears his throat to get Butters' attention.]"
    },
    {
        "character": "Butters",
        "line": "Oh sorry, sorry. [looks back at his seat and pulls out the sign. then points it at Cartman. Cartman then hops out and proceeds to the plant, with Butters following]"
    },
    {
        "character": "",
        "line": "Inside the plant. All the workers here are children working in cubicles, assembling new jewelry. A supervisor walks by collecting newly finished jewelry in a metal box. The receptionist shows Cartman and Butters in while one boy is sealing packages in another room"
    },
    {
        "character": "Cartman",
        "line": "[to the receptionist] You see, I'm looking to cut out the middle man. I want to buy my jewelry direct from you so that- [a disturbing sight stops him in his tracks] Motherfucker!"
    },
    {
        "character": "Stan",
        "line": "[railing at an older Indian boy] You should be ashamed of the people in America that you are exploiting! How dare you take advantage of those less fortunate?! [Kenny and Kyle are with him]"
    },
    {
        "character": "Cartman",
        "line": "[approaches the other boys] You dirty double-crossing assholes! You're trying to cut me out, huh?! You guys stole my formula, then tried to fuck me- Butters!"
    },
    {
        "character": "Butters",
        "line": "Sorry! [catches up to him]"
    },
    {
        "character": "Cartman",
        "line": " -and then tried to fuck me out of your business!"
    },
    {
        "character": "Kyle",
        "line": "We're not fucking you, they're fucking Stan's grandpa!"
    },
    {
        "character": "Cartman",
        "line": "No, they're getting fucked by Asian ladies!"
    },
    {
        "character": "Stan",
        "line": "Somebody is at the head of all this, and somebody needs to pay! All I want is some Goddamned retribution for my Goddamned grandpa! [the boy reaches for a necklace and offers it to Stan] No! Not a diamond-and-gold necklace! [the boy thinks about what to do with the necklace, then reaches for a small plastic pouch and puts it in. The boy motions to another boy]"
    },
    {
        "character": "Kyle",
        "line": "What's he doing?"
    },
    {
        "character": "",
        "line": "Montage. The boy tosses the necklace into a box being carried by another supervisor, then motions to someone else as the supervisor carries the box away. Outside, several workers load up a truck. The supervisor gives his box to one of the loaders. A planeload of jewelry leaves India and arrives at Atlanta. The box is then shipped by QDC to J&G headquarters. A J&G worker carries a gold ruby necklace to Dean at his Jewelry Bonanza set. He then puts the necklace on camera and sells it to an elderly woman who still lives at home. A FedExX truck arrives at her house and the driver delivers it to her personally. He tips his hat to her as he leaves. She opens the package right then and there, at her front door, and pulls out the necklace. She gives it to her daughter, who is quite happy to get it. The daughter goes to a Cash For Gold store and sells it to the clerk. He puts it into a box containing other jewelry, puts in more jewelry to fill the box up, then delivers it to an Industrial Smelting and Refining plant. He sells it to one of the workers there. The worker brings it into a room and splits the jewelry among his associates. They sort the gems by type as they dismantle the jewelry. The gold is sent to be melted down and made into gold bars. The gold and jewels are sent separately back to India, where an IPS truck goes to India Manufacturing to deliver the raw materials. The workers deliver the materials to the supervisors, who take them inside and distribute them among the child workers. The child workers assemble the raw materials into new jewelry, and the cycle starts again. Back in Atlanta, more packages are delivered to J&G headquarters by E-Z Delivery. A J&G worker delivers a gold amethyst necklace to Dean, who sells it to an elderly couple. An ADL truck arrives and the driver delivers it to the couple. The husband receives it and opens it. The driver tips his hat and leaves. The couple then offer the necklace to their daughter, who's overjoyed to get it. She and her husband take the necklace to a different cash for gold store and sell it to the clerk there. The necklace is dismantled into its various parts and the gold melted down again. IPS delivers the raw materials back to India Manufacturing. A supervisor dumps some gems onto the desk of a different child worker, who is working on a picture frame. He finishes the frame and walks up to the older boy. The older boy takes the picture frame to Stan and gives it to him."
    },
    {
        "character": "Stan",
        "line": "Oh, yeah. Actually, this might kind of work."
    },
    {
        "character": "",
        "line": "The park surrounding Looming Sunset, day. Stan is visiting Marvin, who's well enough to sit on the bench with him with the use of a cane"
    },
    {
        "character": "Stan",
        "line": "So the we went to India, which is pretty cool I guess. I've never been there before. And we basically learned that whoever smelt it, denied it, and rhymed it actually dealt it."
    },
    {
        "character": "Marvin",
        "line": "Ahh, sounds like you had a fun weekend."
    },
    {
        "character": "Stan",
        "line": "Yeah, I guess so. Anyway Grandpa, I wanted to give you something. [hands him the gift]"
    },
    {
        "character": "Marvin",
        "line": "Oh, for me? [takes the gift and unwraps it] Oh! My God. There she is. [a picture of Grandpa in younger days with his dog] Old Patches. There's that slobberin' happy face! Thank you Billy. That means a lot. [they smile at each other for a moment] Billy, that... that bolo tie you're wearing?"
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Marvin",
        "line": "I don't know where you got that, but it's fucking gay as fuck."
    },
    {
        "character": "Stan",
        "line": "Cool. I, I won't wear it anymore."
    },
    {
        "character": "Marvin",
        "line": "That's a good idea. [looks back at the picture and smiles. Stan looks down and away]"
    },
    {
        "character": "",
        "line": "Jewelry Bonanza with Dean. Onscreen is a pair of earrings selling for $2800.00"
    },
    {
        "character": "Dean",
        "line": "Folks, these are not your ordinary peridot craponite earrings, these are 18-karat gold! and we got-oh, do we have a buyer on the line? Hello?"
    },
    {
        "character": "Caller 1",
        "line": "[long pause] What are you waiting for? Kill yourself."
    },
    {
        "character": "Dean",
        "line": "Alright Goddamnit, we got another comedian. Ever since that little kid called up, now everybody wants to call and tell me I should kill myself."
    },
    {
        "character": "Caller 1",
        "line": "He was right. Do it."
    },
    {
        "character": "Dean",
        "line": "Folks, this is an 800 number. Every time you call and tell me to kill myself, it's costing us... two dollars and thirty six cents! So now, how about a caller who wants to buy jewelry ? Yes. Hello, sir?"
    },
    {
        "character": "Caller 2",
        "line": "You're too scared to do it, aren't-cha? You don't have the balls."
    },
    {
        "character": "Dean",
        "line": "Goddamnit I'm not scared to do it."
    },
    {
        "character": "Caller 2",
        "line": "New, you're scared. You got, you got lady balls. [hangs up. The dial tone is heard and Dean moves on to the next call]"
    },
    {
        "character": "Caller 3",
        "line": "Hello? I'm calling about the peridot earrings?"
    },
    {
        "character": "Dean",
        "line": "Yes ma'am!"
    },
    {
        "character": "Caller 3",
        "line": "They'd look good on your dead body. Why don't you kill yourself?"
    },
    {
        "character": "Dean",
        "line": "Alright, that's that! That there's the- the straw that broke the camel's back! I got a gun right here; whattaya think about that?!"
    },
    {
        "character": "Caller 3",
        "line": "Put it against your temple and pull the trigger. [long pause. The gun is cocked and then goes off. A thump is heard and blood lands all over the set. The soothing music plays on]"
    }
]