[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, hallway, day. The kids are milling around as Butters' wail is heard."
    },
    {
        "character": "Butters",
        "line": "[runs across the hallway] Fellas! Fellas! Fellas! [spots them in another hallway and runs to them] AAAAH, fellas!"
    },
    {
        "character": "Stan",
        "line": "What? [most of the fourth grade boys gather around]"
    },
    {
        "character": "Butters",
        "line": "[stops and catches his breath, then jabs his right index finger at the floor] Guess what Larry Barsky just told me?!"
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Butters",
        "line": "[jabs his finger again] Guess!"
    },
    {
        "character": "Kyle",
        "line": "Just tell us, Butters."
    },
    {
        "character": "Butters",
        "line": "There's a new girl that started school here today. And she's joined the cheerleading squad."
    },
    {
        "character": "Craig",
        "line": "Oh, we have a new cheerleader?"
    },
    {
        "character": "Clyde",
        "line": "What's she look like?"
    },
    {
        "character": "Kenny",
        "line": "(Yeah, what's her name?)"
    },
    {
        "character": "Cartman",
        "line": "[taking control of the situation] Alright guys, alright! If there is a new girl at our school, we're not gonna start putting claims on her and getting into big fights! It's gonna be her choice who she likes the most."
    },
    {
        "character": "",
        "line": "The school gym, moments later. Some double doors are open and Butters peeks in. The other boys gather behind him, and soon all their jaws drop."
    },
    {
        "character": "Butters",
        "line": "Look, look, there she is. [near the bleachers opposite the doors are five girls: Red, Wendy, Bebe, Lola, and Jenny. Between Wendy and Bebe are two pompoms waiting for a sixth cheerleader, who arrives shortly. It's a black girl. The other five girls begin talking to her all at once]"
    },
    {
        "character": "Cartman",
        "line": "Oh my God. Tolkien, aren't you stoked? [Tolkien looks over at him. The girls start practicing] Aww, that's awesome, Tolkien. I'm happy for you."
    },
    {
        "character": "Tolkien",
        "line": "[anger flashes across his face] Why?! Why are you happy for me?!"
    },
    {
        "character": "Cartman",
        "line": "Dude, I'm being seriously. You guys will be really cute together. What are you gonna say to her?"
    },
    {
        "character": "Tolkien",
        "line": "Nothing! [walks away]"
    },
    {
        "character": "Cartman",
        "line": "[confused] What the? ...Oh, Tolkien's shy. Oh my God, that is adorable."
    },
    {
        "character": "",
        "line": "Fourth Grade class, some time later. Mr. Garrison is at the blackboard teaching the class about Game of Thrones"
    },
    {
        "character": "Mr. Garrison",
        "line": "And so what we start to see now is a pattern in world history much like the Greeks and the Romans. Remember that there were seven families fighting for control of the land of Westeroth. The king of Westeroth was who? Robert Baratheon [circles BARATHEON on the board], and he asked Eddard, also known as, of course, Lord Stark, to serve as hand of the king. You remember that Lord Stark accepted, or course. The queen's family - that's the Lannisters - were really trying back then to take control, weren't they? So where were the Targaryens at this time? Well, they were across the sea. We all talked about how they were also trying to take the throne. So we've got the Greeks, the Romans, the Starks, Lannisters, Baratheons, Targaryens, all headed for a big blowout right in Season 2. Now, what I really wanted to get into today is what was going on in the north, because that's just a whole other mess- [during the lecture, the following takes place]"
    },
    {
        "character": "Cartman",
        "line": "[fairly whispering throughout, beginning when Mr. Garrison mentions Lord Stark. He sits between Tolkien and the new girl and grins as he looks at each of them by turn] Dude... Tolkien! [jerks his head a bit in the girl's direction and points at her] Tolkien. Dude. [Tolkien looks at him, then goes back to taking notes. Cartman smiles] Psst. Tolkien. [points to the girl again, but puts his right hand up so she doesn't notice. Tolkien is annoyed] Go ahead. Go ahead dude. Tolkien! Yeah, get in there."
    },
    {
        "character": "Kyle",
        "line": "[annoyed as well] Will you shut the hell up?! [goes back to taking notes. Cartman finally picks up his pen, but doesn't write anything]"
    },
    {
        "character": "Cartman",
        "line": "...Tolkien. You want me to pass her a jelly bean?"
    },
    {
        "character": "Tolkien",
        "line": "[whispers back] No!"
    },
    {
        "character": "Cartman",
        "line": "Huh?"
    },
    {
        "character": "Tolkien",
        "line": "[louder] No!"
    },
    {
        "character": "Mr. Garrison",
        "line": "[stops talking and turns to the class] Tolkien, is there a problem? [Tolkien is a loss for words, but Cartman fields this question]"
    },
    {
        "character": "Cartman",
        "line": "Ah, he's just a little sick, Mr. Garrison. He's got boneritis. [begins to laugh at his own joke] Right guys? [tries to hold the laugh in]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Everyone pay attention! [goes back to the board] Now, what I really wanna get into today is what was going on in the north, because that's just a whole other mess that's pretty hard to keep straight, isn't it? The Night's Watch- [while Garrison resumes his lesson, Cartman resumes his prodding]"
    },
    {
        "character": "Cartman",
        "line": "[quickly looks at the girl and at Tolkien] Tolkien. [leans back in his seat so Tolkien has a clear view of the girl] Dude, dude. Dude."
    },
    {
        "character": "",
        "line": "South Park Elementary, hallway. Bebe and Red are at Bebe's locker, talking."
    },
    {
        "character": "Red",
        "line": "So then Kelly I guess told Stacey that she wasn't invited, so now Stacey's pissed at us."
    },
    {
        "character": "Cartman",
        "line": "[approaching] Hey, guys? Can I talk to you?"
    },
    {
        "character": "Bebe",
        "line": "[shuts her locker] Why?!"
    },
    {
        "character": "Cartman",
        "line": "[motions to his left] Just, can I talk to you, real quick? [walks the girls over to the end of the hallway] What kind of stuff is the new girl saying about Tolkien?"
    },
    {
        "character": "Red",
        "line": "About Tolkien? Why?"
    },
    {
        "character": "Cartman",
        "line": "Well, Tolkien's really shy, so, I'm just here, sort of on his behalf 'cause, you know."
    },
    {
        "character": "Bebe",
        "line": "Tolkien likes Nichole?"
    },
    {
        "character": "Cartman",
        "line": "Yeah, of course. [the girls look at each other]"
    },
    {
        "character": "Red",
        "line": "Oh yeah, I don't think she has any idea."
    },
    {
        "character": "Cartman",
        "line": "Yeah, so, could you guys just let her know that, you know, she might have to make the first move?"
    },
    {
        "character": "Bebe",
        "line": "Okay."
    },
    {
        "character": "Cartman",
        "line": "Thanks, you guys."
    },
    {
        "character": "",
        "line": "Bebe's basement, day. She and the other five cheerleaders are playing the board game, Living. Lola rolls the dice and releases them."
    },
    {
        "character": "Lola",
        "line": "[moves up four steps] One two three four, sorry Bebe."
    },
    {
        "character": "Bebe",
        "line": "Oh, that's okay. [the girls laugh about it] So, Nichole, guess what? One of the boys here already has a crush on you."
    },
    {
        "character": "Lola, Jenny, Red, and Wendy",
        "line": "Ohhh."
    },
    {
        "character": "Nichole",
        "line": "Oh my gosh, who?"
    },
    {
        "character": "Red",
        "line": "That boy Tolkien."
    },
    {
        "character": "Wendy",
        "line": "Oh he's really nice, Nichole. I dated him for a little while. [the other girls chime in, showing their support. The camera pulls back a bit, and Cartman is shown eavesdropping just outside a basement window]"
    },
    {
        "character": "Nichole",
        "line": "Oh jeez, thanks you guys, but to be totally honest, I kinda think this other boy is cute."
    },
    {
        "character": "Bebe",
        "line": "[excited] Who? Whowhowhowho?"
    },
    {
        "character": "Nichole",
        "line": "That kid, with the orange coat and the green hat?"
    },
    {
        "character": "Wendy",
        "line": "Oh, you mean Kyle?"
    },
    {
        "character": "Nichole",
        "line": "Yeah."
    },
    {
        "character": "The Girls",
        "line": "Ooooh, Kyle."
    },
    {
        "character": "Cartman",
        "line": "WHAT?! KYLE?! [the girls don't hear him]"
    },
    {
        "character": "Bebe",
        "line": "Nichole loves Kyle! Nichole and Kyle sittin' in a tree."
    },
    {
        "character": "The Girls",
        "line": "K-I-S-S-O-M-G!"
    },
    {
        "character": "Nichole",
        "line": "Haha, shut up you guys! It's just a crush. [the girls laugh while Cartman gets livid]"
    },
    {
        "character": "Cartman",
        "line": "Motherfucker! [gets up and runs off]"
    },
    {
        "character": "",
        "line": "South Park Elementary, next day. The girls are practicing on the football field as three random boys watch from the bleachers"
    },
    {
        "character": "The Girls",
        "line": "We are Cows, proud and true! Count on South Park, moo moo moo! Goooo Cows! [Cartman approaches Nichole]"
    },
    {
        "character": "Cartman",
        "line": "Hey, ah, Nichole, right?"
    },
    {
        "character": "Nichole",
        "line": "Yeah. [Wendy stops practicing]"
    },
    {
        "character": "Cartman",
        "line": "Can I talk to you for a second, just for a second, right over here? [takes her to another set of bleachers nearby] Listen uh, I heard through the grapevine that you've got a thing for Kyle?"
    },
    {
        "character": "Nichole",
        "line": "[taken aback] Oh no, who told you that?"
    },
    {
        "character": "Cartman",
        "line": "Just, the grapevine. Um, there's something you should probably know. [fakes a sweat] Oh man this is hard. Um, the thing is, me and Kyle are kind of, you know ...together?"
    },
    {
        "character": "Nichole",
        "line": "Ohhh."
    },
    {
        "character": "Cartman",
        "line": "Yeah, he's my man. I'm more out than Kyle is, but... it sucks, because he acts like we're not a couple at school because he's embarrassed, but... we get home and he's the best boyfriend I've ever had."
    },
    {
        "character": "Nichole",
        "line": "Wow, I-I'm sorry. I totally respect that. [puts her right hand on his left shoulder] Hey, thanks a lot for telling me."
    },
    {
        "character": "Cartman",
        "line": "Cool, just, you know, don't touch me 'cause I'm not into girls, so it kind of grosses me out."
    },
    {
        "character": "Nichole",
        "line": "[withdraws her hand] Oh, I'm sorry."
    },
    {
        "character": "Cartman",
        "line": "Yeah, kewl. Anyway, thanks a lot and just, you know, stay away from my man, bitch. [snaps his fingers and walks away]"
    },
    {
        "character": "",
        "line": "The hallway, later. Kyle is at his locker putting some books away. Nichole approaches him"
    },
    {
        "character": "Nichole",
        "line": "Hey, uh, I just wanna let you know, if you ever need somebody to talk to, I'm here."
    },
    {
        "character": "Kyle",
        "line": "Oh, thanks. [smiles. Nichole turns and walks away, smiling. Kyle sees Craig and Timmy nearby and runs towards them] Dude, that new girl's into me!"
    },
    {
        "character": "",
        "line": "Another hallway. Cartman hides around the corner and makes like he's real cool, wearing shades and with hands in his jacket pockets, one foot resting on the wall. Butters walks past him on the cross-hallway without noticing"
    },
    {
        "character": "Cartman",
        "line": "Psst Butters. Butters! [Butters stops and notices, then walks over to Cartman] At the end of PE class, tell Nichole that the gym teacher wants some towels delivered to the boys' locker room."
    },
    {
        "character": "Butters",
        "line": "How come?"
    },
    {
        "character": "Cartman",
        "line": "[takes off his shades] Let's just say that by this time tomorrow, Tolkien and Nichole are gonna be practically married."
    },
    {
        "character": "Butters",
        "line": "Are you sure, Eric? I mean, maybe they just aren't meant for each other."
    },
    {
        "character": "Cartman",
        "line": "No no. [walks him towards the camera] Love is like taking a dump, Butters. Sometimes it works itself out, but sometimes, you've gotta give it a nice hard slimy push."
    },
    {
        "character": "",
        "line": "The football field, after PE. Nichole packs her pompoms away as Butters arrives with towels for Nichole to deliver"
    },
    {
        "character": "Butters",
        "line": "Oh hey, Nichole? Coach wants you to take these to the boys' locker room. [hands her the towels]"
    },
    {
        "character": "Nichole",
        "line": "Oh, he does? [Butters nods] Okay."
    },
    {
        "character": "",
        "line": "The boys' locker room. Tolkien is taking a shower alone when Cartman leans in to check on him, then walks away. The other boys are changing into their regular clothes."
    },
    {
        "character": "Cartman",
        "line": "Guys! Guys, get outside! It's the Bat-Mobile! Bat-Mobile, you guys! [the boys make a break for the front of the school and exit the front doors]"
    },
    {
        "character": "",
        "line": "In front of the school."
    },
    {
        "character": "Craig",
        "line": "Where?"
    },
    {
        "character": "Jimmy",
        "line": "I-I don't see a b-b-Bat-Mobile."
    },
    {
        "character": "",
        "line": "Back at the gym, Nichole reaches the boys' locker room, opens the door, and backs into the room. Cartman looks from around a corner and sees her go in. He has a chain and lock with him, and as soon as the door closes he goes and locks them with the chain"
    },
    {
        "character": "Nichole",
        "line": "[keeps walking, unaware of what Cartman just did] Hello??"
    },
    {
        "character": "Tolkien",
        "line": "[walks in dressed in a towel and drying his face with another] AAA!"
    },
    {
        "character": "Nichole",
        "line": "OH! Oh gosh I'm so sorry!"
    },
    {
        "character": "Tolkien",
        "line": "Where is everybody? What's goin' on??"
    },
    {
        "character": "Nichole",
        "line": "Coach wanted me to... [winces] I'm sorry. [drops the towels, turns and goes back to the doors. She tries to open them but can't]"
    },
    {
        "character": "",
        "line": "The neighborhood, afternoon. Some of the students are walking together: Kyle, Craig, and Timmy in back, Lola and Jenny up front."
    },
    {
        "character": "Kyle",
        "line": "Hey guys. Guys! Hold up. [runs up to the girls, who stop and turn to face him] Hey uhm, you're kind of friends with that Nichole girl, right?"
    },
    {
        "character": "Jenny",
        "line": "Yeah?"
    },
    {
        "character": "Kyle",
        "line": "Well... what kind of stuff does she like? Do you know?"
    },
    {
        "character": "Lola",
        "line": "She likes... movies, cats."
    },
    {
        "character": "Jenny",
        "line": "[to Lola] She likes basketball."
    },
    {
        "character": "Kyle",
        "line": "Ogh. Oh cool, she likes basketball? That's perfect! Thanks, you guys!"
    },
    {
        "character": "Lola",
        "line": "Well- Hey Kyle, [he stops and returns] we were gonna head over to the mall. You wanna go with us?"
    },
    {
        "character": "Kyle",
        "line": "Oh. Uh, can't right now, but maybe another time. See ya! [runs off]"
    },
    {
        "character": "Jenny",
        "line": "Guess he has a crush on Nichole."
    },
    {
        "character": "Lola",
        "line": "[looks away for a moment] I don't think so. I heard Kyle swings for the same team."
    },
    {
        "character": "Jenny",
        "line": "Really?!"
    },
    {
        "character": "Kyle",
        "line": "[back with Craig and Timmy] It's perfect! I could take her to a basketball game. [looks back at the girls, who look at him, then giggle as he turns back to the boys] Man, I-I don't know what's happenin', but... it seems like all the girls are... kind of into me lately. [looks back at the girls and waves. They grin and wave back]"
    },
    {
        "character": "",
        "line": "Back in the locker room, Tolkien tries to get himself and Nichole out, but groans and doesn't get anywhere"
    },
    {
        "character": "Tolkien",
        "line": "Hey! In here! [punches the door]"
    },
    {
        "character": "Nichole",
        "line": "You think the janitors are still here?"
    },
    {
        "character": "Tolkien",
        "line": "Don't worry. It's gonna be okay. We've got water, and, and maybe somebody even left some food laying around. Come on. [takes her around the locker room. Nichole notices a table with food and some other things on it]"
    },
    {
        "character": "Nichole",
        "line": "Look! [walks to the table] Somebody left a deli platter. [Tolkien joins her] And board games. And massage oil."
    },
    {
        "character": "Tolkien",
        "line": "Oh... Good."
    },
    {
        "character": "",
        "line": "The school, just after sunrise. Firefighters have arrived at the locker room and have snapped the chain in two with bolt cutters."
    },
    {
        "character": "",
        "line": "The school, out front. The firefighters have taken Tolkien and Nichole outside and left them alone as they leave."
    },
    {
        "character": "Nichole",
        "line": "Well that was sure an interesting night."
    },
    {
        "character": "Tolkien",
        "line": "It sure was."
    },
    {
        "character": "Nichole",
        "line": "Hey, thanks a lot for making me feel safe in there. That could have been really scary."
    },
    {
        "character": "Tolkien",
        "line": "Yeah. Now that it's over, I... I guess it was kind of fun. [smiles]"
    },
    {
        "character": "Nichole",
        "line": "Yeah, it kind of was. Maybe... I-I don't know. Maybe we should get some lunch tomorrow."
    },
    {
        "character": "Cartman",
        "line": "[hiding in the bushes, weeping silently] Oh my God, sooo cute."
    },
    {
        "character": "Tolkien",
        "line": "I'd like that."
    },
    {
        "character": "Nichole",
        "line": "Cool. Well... thanks again. [they hug each other]"
    },
    {
        "character": "Cartman",
        "line": "[sweetly] Ohhhhh my God."
    },
    {
        "character": "Cupid Me",
        "line": "[pops out of Cartman's head] We did it, Eric. We found them each other's ray of sunshine."
    },
    {
        "character": "Cartman",
        "line": "You're my ray of sunshine, Cupid Me. [tickles the little cupid]"
    },
    {
        "character": "Cupid Me",
        "line": "Teeheeheehee. [pops back into Cartman's head, leaving behind a trail of hearts]"
    },
    {
        "character": "",
        "line": "Montage. Cartman sings \"I Swear\" as Tolkien and Nichole get to know each other better."
    },
    {
        "character": "Cartman",
        "line": "I see the questions in your eyes\nI know what's weighing on your mind\nYou can be sure I know, my heart\nGirl I'll stand beside you through the years\nYou'll only cry those happy tears\nAnd though I make mistakes, I'll never break your heart\nI swear by the moon and the stars in the sky\nI'll be there\nI swear (I swear) like a shadow that's by your side (Keep it down, girl)\nI'll be there\nFor better or worse (better or worse), till death do us part (death do us part)\nI'll love you with every black beat of my heart\nAnd I swear. I swear. I s-we-e-e-ear Yeah, I swear. Straight up. What it do?\n\n\n"
    },
    {
        "character": "",
        "line": "South Park Elementary, playground, recess. As the kids play and chatter, Tolkien is pushing Nichole on a swing, then he tickles Nichole and she giggles. Cartman is rather pleased with how things are progressing between Tolkien and Nichole"
    },
    {
        "character": "Cartman",
        "line": "Did you see that? Tolkien was gonna push her, but then he tickled her instead. [behind him, on the merry-go-round, are Stan, Kenny, and Butters. Stan and Kenny are playing with a ball.]"
    },
    {
        "character": "Stan",
        "line": "Dude, why are you so into their relationship?"
    },
    {
        "character": "Cartman",
        "line": "I don't know, it's just so... perfect. [Stan and Kenny resume playing]"
    },
    {
        "character": "Kyle",
        "line": "You motherfucker! [runs into view and punches Cartman, who falls on his face]"
    },
    {
        "character": "Cartman",
        "line": "Kyle, Jesus Christ!"
    },
    {
        "character": "Kyle",
        "line": "What the hell are you doing telling people that we're a gay couple?!"
    },
    {
        "character": "Cartman",
        "line": "Oh, heard that through the grapevine, did you?"
    },
    {
        "character": "Kyle",
        "line": "The new girl liked me, and so you lied to her!"
    },
    {
        "character": "Cartman",
        "line": "Somebody had to intervene, Kyle! You were standing in the way of Tolkien and Nichole! They belong together!"
    },
    {
        "character": "Kyle",
        "line": "Just because two people are the same race doesn't mean they belong together, you fat racist piece of fucking garbage!"
    },
    {
        "character": "Cartman",
        "line": "Oh! Oh, I'm a racist, huh?! I'm a racist! It's how nature works, Kyle! Look! Look, what about Luke Covina and Maria Sanchez? [points to a Hispanic couple riding play elephants] Is it a coincidence they ended up together?!"
    },
    {
        "character": "Stan",
        "line": "Actually, I heard they're together because they got locked in the school gym overnight a few months ago."
    },
    {
        "character": "Cartman",
        "line": "Oh did they? I hadn't heard about that."
    },
    {
        "character": "Cupid Me",
        "line": "[reappears, and Cartman smiles at him] Teehee, that was us, remember, Eric?"
    },
    {
        "character": "Cartman",
        "line": "Shh, quiet, Cupid Me."
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "Nothing."
    },
    {
        "character": "Kyle",
        "line": "Who is Cupid Me?"
    },
    {
        "character": "Cartman",
        "line": "Nobody."
    },
    {
        "character": "Kyle",
        "line": "You are gonna tell everyone that you lied and that we aren't a couple!"
    },
    {
        "character": "Cartman",
        "line": "Why, Kyle?! So you can try and ruin things for Tolkien and Nichole?! Look at how happy they are! [can't fault him there. Nichole giggles again. Kyle looks defeated] Is it that you want to ruin that or are you just homophobic?!"
    },
    {
        "character": "Kyle",
        "line": "Goddamnit! [walks away angrily]"
    },
    {
        "character": "",
        "line": "Nichole's house, night. Inside, she and her parents are eating dinner: turkey, mashed potatoes, veggies. Nichole begins to fiddle with her food and look at the ceiling dreamily."
    },
    {
        "character": "Dad",
        "line": "[clears his throat] Nichole? Your mother tells me that you already have a boyfriend at school."
    },
    {
        "character": "Nichole",
        "line": "His name is Tolkien. He's really nice."
    },
    {
        "character": "Dad",
        "line": "Well that's good. But... your mother tells me that this boy is... black."
    },
    {
        "character": "Nichole",
        "line": "So?"
    },
    {
        "character": "Dad",
        "line": "Well, Nichole, it's just... You know, just because you're black doesn't mean you can only date black boys. It's just a little weird that we moved to this whole new place and you're immediately drawn to the one other black person."
    },
    {
        "character": "Mom",
        "line": "Oh stop, William. There's nothing wrong with her dating a black person."
    },
    {
        "character": "William",
        "line": "I'm not saying it's wrong, I'm just saying... she's gonna have to deal with racist people out there! People turning their heads and saying, \"Oh, look at the two black people together. That figures!\""
    },
    {
        "character": "Nichole",
        "line": "It's not like that, Dad. We just happen to like each other. I know it seems like a strange coincidence, but it really is. A coincidence."
    },
    {
        "character": "Mom",
        "line": "And we are very happy for you, sweetheart. Here, have some more turkey."
    },
    {
        "character": "William",
        "line": "Yeah, just try the white meat. I know it's a little dry, but... there's a lot more of it."
    },
    {
        "character": "",
        "line": "Cartman's house, night. He's pounding on the bathroom door."
    },
    {
        "character": "Cartman",
        "line": "Come on! [pounds on the door some more] Other people have to use the bathroom, you know? Can you hurry it up in there?! [pounds on the door some more. The door opens and Cupid Me floats out]"
    },
    {
        "character": "Cupid Me",
        "line": "Teeheeheehee, teehee."
    },
    {
        "character": "Cartman",
        "line": "Jesus Christ, Cupid Me, you givin' birth in there?!"
    },
    {
        "character": "Cupid Me",
        "line": "[giggles] Sorry. [Cartman goes in]"
    },
    {
        "character": "Cartman",
        "line": "That's- Oh, oh, Cupid Me! [covers his nose with his bath robe] Sick! What the fuck have you been eating?!"
    },
    {
        "character": "Cupid Me",
        "line": "Teeheeheeheeheehee."
    },
    {
        "character": "Cartman",
        "line": "Dude, at least flush the toilet! [walks over to it] Aww, it's cute, it's little chocolate hearts."
    },
    {
        "character": "Cupid Me",
        "line": "They're fudgey charms of sunshine."
    },
    {
        "character": "Cartman",
        "line": "You're my fudgey charm of sunshine. Come here, you! [tries to catch Cupid Me, but Cupid Me keeps away]"
    },
    {
        "character": "Cupid Me",
        "line": "Teeheeheehee, teeheeheeheehee. [flits here and there]"
    },
    {
        "character": "Cartman",
        "line": "I'm gonna get you! [chases Cupid Me out of the bathroom]"
    },
    {
        "character": "Cupid Me",
        "line": "Teeheehee, no! [flits on down the hall]"
    },
    {
        "character": "Cartman",
        "line": "I almost got you! Almost! [Liane walks out of her room with clean laundry, and there's no sign of Cupid Me]"
    },
    {
        "character": "Liane",
        "line": "[sees Cartman dancing around] Everything okay, sweetie?"
    },
    {
        "character": "Cartman",
        "line": "Everything's great, Mom. [to the invisible Cupid Me] No! Come back here and flush the toilet, you silly! Noohoho! [dances away]"
    },
    {
        "character": "",
        "line": "Nichole's room, evening. She checks out the teddy bear she thinks she got from Tolkien. She reads the tag: \"To My Boo.\" She turns the tag over and reads it, her smile vanishing: \"'Cuz Blacks Belong Together\""
    },
    {
        "character": "Nichole",
        "line": "Oh no..."
    },
    {
        "character": "",
        "line": "South Park Elementary, next day. Tolkien is at his locker in the hallway, and Nichole approaches him. Tolkien closes his locker door, not noticing her coming."
    },
    {
        "character": "Nichole",
        "line": "[sad] Hey Tolkien."
    },
    {
        "character": "Tolkien",
        "line": "[smiles and turns around] Hey Nichole."
    },
    {
        "character": "Nichole",
        "line": "Can I talk to you for a sec?"
    },
    {
        "character": "Tolkien",
        "line": "Sure! [she takes him to the same drinking fountain Kyle took Jenny and Lola to earlier] What's up?"
    },
    {
        "character": "Nichole",
        "line": "Listen, I... ugh, I don't think this is gonna work out."
    },
    {
        "character": "Tolkien",
        "line": "Oh."
    },
    {
        "character": "Nichole",
        "line": "I'm so sorry. It's just... I don't believe we're really on the same page, you know?"
    },
    {
        "character": "Tolkien",
        "line": "Okay..."
    },
    {
        "character": "Nichole",
        "line": "I think you're really great... W-w-we just..."
    },
    {
        "character": "Tolkien",
        "line": "I think... you're really great."
    },
    {
        "character": "Nichole",
        "line": "...I'm sorry."
    },
    {
        "character": "Tolkien",
        "line": "Yeah. I'm sorry too. I'll see you around. [turns and walks away sadly]"
    },
    {
        "character": "Nichole",
        "line": "Okay. [she turns towards the drinking fountain]"
    },
    {
        "character": "",
        "line": "Cartman's room, that afternoon. Cartman is devastated."
    },
    {
        "character": "Cartman",
        "line": "[crying inconsolably, sometimes sneezing into a tissue] It's not fair! They were so... happy!"
    },
    {
        "character": "Butters",
        "line": "[holding Cartman's right hand] It's gonna be okay, Eric."
    },
    {
        "character": "Cartman",
        "line": "It's NOT gonna be okay! Why did they break up?! They were meant for each other!"
    },
    {
        "character": "Butters",
        "line": "They'll find love somewhere else."
    },
    {
        "character": "Cartman",
        "line": "No, they won't!"
    },
    {
        "character": "Butters",
        "line": "Yes, they will."
    },
    {
        "character": "Cartman",
        "line": "No, they won't! Fuck you Butters, you're an asshole!"
    },
    {
        "character": "Cupid Me",
        "line": "[pops out again] Teeheehee. Looks like somebody could use a little arrow of sunshine."
    },
    {
        "character": "Cartman",
        "line": "And you! I should have never believed in you!"
    },
    {
        "character": "Butters",
        "line": "In... In who, Eric?"
    },
    {
        "character": "Cartman",
        "line": "[grabs the imaginary cupid] I never wanna see you again! [hurls it into his closet door. It flies low. Cartman gets out of bed, grabs a bat that's conveniently leaning against his bedroom door, and bashes the cupid over and over] Take! Your sunshine! And fuckin'! Die! [puts the bat up against the door and crawls back into bed. Butters takes Cartman's hand again and Cartman resumes crying]"
    },
    {
        "character": "",
        "line": "The park, late afternoon. Tolkien is sitting alone on the park bench. Kyle walks by and notices him there. A few seconds later, he walks up."
    },
    {
        "character": "Kyle",
        "line": "Hey man. You okay?"
    },
    {
        "character": "Tolkien",
        "line": "Yeah."
    },
    {
        "character": "Kyle",
        "line": "[sits next to him] What happened? It just didn't work out?"
    },
    {
        "character": "Tolkien",
        "line": "Yeah, I guess."
    },
    {
        "character": "Kyle",
        "line": "So, you guys are totally broken up then? It's... It's done?"
    },
    {
        "character": "Tolkien",
        "line": "[long sigh] Yeah."
    },
    {
        "character": "Kyle",
        "line": "[scratches his head behind the ear] So then, she's gonna be seeing other people? Is she, sort of, available?"
    },
    {
        "character": "Tolkien",
        "line": "Yeah, we're through."
    },
    {
        "character": "Kyle",
        "line": "Sooo, theoretically, if someone was to step in, it would beee, okayyy?"
    },
    {
        "character": "Tolkien",
        "line": "[getting the wrong idea] I'm sorry Kyle. I like girls. [gets off the bench and walks away]"
    },
    {
        "character": "Kyle",
        "line": "Huh? [suddenly remembers] Dude, what the fuck?"
    },
    {
        "character": "",
        "line": "Cartmans house, afternoon. Cartman is in the living room watching TV in the dark, wrapped in a blanket and eating chocolate fudge ice cream."
    },
    {
        "character": "Announcer",
        "line": "We'll be back with more of the Jeffersons right after this."
    },
    {
        "character": "",
        "line": "Commercial. A businessman finishes his work day."
    },
    {
        "character": "Man",
        "line": "[leaves his office] I work hard, so I need a laxative that works hard too! [walks off. Next he's on the ground floor] I can't be constipated on the job. [stops and holds up a box] That's why I need... Soft Serve. [at a tennis court. He serves] Because when I'm constipated, sometimes even a hard push isn't enough. [Cartman's interest is aroused. In the commercial the man is heading for the restroom. Another businessman comes out and the first one stops him] Don't give up. Get back in there and get to work! [now trying to poop in the toilet] 'Cause when the going gets tough, the tough gets going!"
    },
    {
        "character": "Cartman",
        "line": "That's right... That's right! [runs up to his room, goes into his closet and digs through his stuff until he finds the shoe box he put Cupid Me into after whacking him almost to death. He takes off the lid] Ohhh. [Cupid Me is shown laying face down battered and bruised, with a dry blood stream still near his mouth] I'm so sorry. I shouldn't have doubted you. Please come back. I know I got a little angry but... I believe in you. Do you hear me? I believe in you."
    },
    {
        "character": "Cupid Me",
        "line": "No, you don't."
    },
    {
        "character": "Cartman",
        "line": "Yes, I do, Cupid Me. Love is the bestest feeling in the world. I believe you can change everything."
    },
    {
        "character": "Cupid Me",
        "line": "No, you don't. [opens its right eye for a second]"
    },
    {
        "character": "Cartman",
        "line": "Please, I can't do this alone. They need us. And I need you. My little flicker of twinkle stars. [tickles the cupid]"
    },
    {
        "character": "Cupid Me",
        "line": "Teehee, stop it."
    },
    {
        "character": "Cartman",
        "line": "Come on, twinkle stars, we got work to do."
    },
    {
        "character": "Cupid Me",
        "line": "Teeheehee, teeheeheehee, [flies out of the box] teeheeheeheeheeheeheeheehee."
    },
    {
        "character": "",
        "line": "Nichole's house, day. Cartman pounds on her door, and her father William answers."
    },
    {
        "character": "Cartman",
        "line": "Hi, can I speak to Nichole please? It's very important."
    },
    {
        "character": "William",
        "line": "I'm sorry, but she's at the Denver Nuggets game."
    },
    {
        "character": "Cartman",
        "line": "Denver Nuggets game?"
    },
    {
        "character": "William",
        "line": "Yeah, she went with a nice white, Jewish boy."
    },
    {
        "character": "Cartman",
        "line": "[dolly zoom] NOOOOOOO! [runs away quickly]"
    },
    {
        "character": "",
        "line": "The Pepsi Center, around 7 pm. The bleachers are filled with cheering fans waiting for the game to begin."
    },
    {
        "character": "Announcer",
        "line": "Welcome to today's matchup between the Denver Nuggets and the Los Angeles Clippers. [the starting five from both teams take the court. A vendor hands Kyle two drinks, one of which he gives to Nichole. They look at each other fondly and take sips from their sodas.] And now, here to sing the National Anthem, country music star Brad Paisley. [he stands at center court and waves as a spotlight shines on him]"
    },
    {
        "character": "Brad Paisley",
        "line": "O! say can you see by the dawn's early light,\nWhat so proudly we hailed at the twilight's last gleaming,\nWhose broad stripes and bright stars- [As Brad sings, Kyle and Nichole look at each other and smile, then look at Brad. Nichole notices someone clear across the center. It's Tolkien, with Craig and Clyde. Tolkien still has a heavy heart, keeping his eyes focused on the floor while Craig and Clyde smile. Kyle looks at Nichole, who's still surprised to see Tolkien there, and grins at her. She looks back at Kyle and smiles.]\n\n\n"
    },
    {
        "character": "",
        "line": "Outside, a tour bus drops Cartman off near the center and Cartman runs for it."
    },
    {
        "character": "Cartman",
        "line": "Nooooooo!"
    },
    {
        "character": "",
        "line": "Inside."
    },
    {
        "character": "Announcer",
        "line": "Nuggets fans, please direct your attention to center court and the president of Halitosis Kidz. [she's shown on the MegaTron waving to the spectators behind four men who are holding a Halitosis Kidz banner], who invites you to join the Denver Nuggets in the fight against morbid halitosis in children. [POV change from MegaTron to center court] Here to attempt a three-point shot for adolescents with terminally bad breath is [two of the men leave with the banner and an obese girl steps forward] the poster child for Halitosis Kidz, Stacy Muleburg. [the two other men cover their noses with their Denver team jackets as one of them hands Stacy the ball. She rushes up and throws the ball, but it's a brick] And a good try. [the two Denver men, two cameramen, the announcer, and the HK president all gather round her]"
    },
    {
        "character": "Stacy",
        "line": "Aaahahahaaaa."
    },
    {
        "character": "Adults",
        "line": "Awww! [they all back away as fast as they can. The spectators clap for the effort. Kyle and Nichole clap as well]"
    },
    {
        "character": "Cartman",
        "line": "[running into the center] NOOOOOOO! [triggers an alarm]"
    },
    {
        "character": "Guard",
        "line": "Tickets please."
    },
    {
        "character": "Cartman",
        "line": "No time! NOOOOOOO!"
    },
    {
        "character": "Announcer",
        "line": "We're all set for the tipoff. [The ball is thrown into the air and a Clipper tips the ball. A Nugget - Arron Afflalo - grabs it and the game begins. Afflalo throws it to JaVale McGee for an alley-oop, and McGee makes the first shot. The crowd cheers]"
    },
    {
        "character": "Cartman",
        "line": "Attention! Attention please! [Kyle and Nichole are surprised to hear his voice. Cartman is on the MegaTron] This is a message for all of you out there who have just ended a relationship. Sometimes, love is hard. But you can't just run away from it. When you start to have something special you have to work at it! [Tolkien is surprised to see Cartman there too, but Craig and Clyde are unfazed] Even though it might seem like the world is against you, you still have to hold on! With both hands! [Nichole begins to take this in] Don't let society dictate who you can and can't be with. Kyle, I love you babe. You can run all you want, try to pretend you like girls, but damnit, when we kiss there's magic! Don't let it go, Kyle. [Kyle is getting pissed off]"
    },
    {
        "character": "Crowd",
        "line": "Awwwww. [everyone looks at Kyle]"
    },
    {
        "character": "Cartman",
        "line": "I want to hold you every morning and love you every night, Kyle. I promise you nothing but love and happiness.\nI swear by the moon and the stars and the sky\n[Cartman and Kyle are paired on the MegaTron and the lovecam is activated - a heart appears over their images, Cartman on the left, Kyle on the right]\nI'll be there, Kyle\nI swear [Crowd: \"Awwww.\" Kyle tries to push it all away] like the shadow that's by your side\nKyle, swear to God I'll be there.\nFor better or worse [Brad appears: \"better or worse\"], till death do us part [Brad: \"death do us part\"]\nI'll love you with [Cartman and Brad] every gay beat of my heart!\n\n\n"
    },
    {
        "character": "Brad",
        "line": "I swear, Kyle.\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "I swear, Kyle. [the crowd erupts in applause, as do the players. Kyle leaves his seat, steaming mad]"
    },
    {
        "character": "Nichole",
        "line": "Where are you going?"
    },
    {
        "character": "Kyle",
        "line": "That fat turd up there is the one who set up you and Tolkien 'cause he thinks blacks belong together! [walks away]"
    },
    {
        "character": "Nichole",
        "line": "He did that? Oh no."
    },
    {
        "character": "Cartman",
        "line": "Thank you! Thank you all. That's all I wanted to say. That and... The Bat-Mobile's outside. [now with urgency] Seriously you guys, you gotta see it. It's the Bat-Mobile! It's outside."
    },
    {
        "character": "Spectator",
        "line": "What? [leaves his seat. Soon everyone is leaving the center, including the players from both teams. Tolkien and Nichole find themselves looking at each other just outside the bleachers]"
    },
    {
        "character": "Nichole",
        "line": "Tolkien. Hey."
    },
    {
        "character": "Tolkien",
        "line": "Hi."
    },
    {
        "character": "Nichole",
        "line": "Tolkien, I'm so sorry. I thought you were only with me because I'm black."
    },
    {
        "character": "Tolkien",
        "line": "I'm sorry too. I wouldn't even talk to you at first because you were black. [they turn aside for a moment to avoid each other]"
    },
    {
        "character": "Both",
        "line": "Do you think we could... Do you still want to... [they smile at each other]"
    },
    {
        "character": "Nichole",
        "line": "Maybe we can give it another try?"
    },
    {
        "character": "Tolkien",
        "line": "There are still people who will look at us funny. And think we're supposed to be together."
    },
    {
        "character": "Nichole",
        "line": "Let them look. I don't care."
    },
    {
        "character": "Tolkien",
        "line": "I don't care, either. [Cartman has a camera trained on them, while he takes up the whole screen on the MegaTron, praying for this to work out]"
    },
    {
        "character": "Nichole",
        "line": "I just think you're a great person. The color of your skin doesn't matter."
    },
    {
        "character": "Tolkien",
        "line": "YAY! [they run to each other and hug each other]"
    },
    {
        "character": "Cartman",
        "line": "Oh my gohhhd, so cute! [runs out of the control room. Cupid Me appears]"
    },
    {
        "character": "Cupid Me",
        "line": "Teeheehee, a place for everything, and everything in its place."
    },
    {
        "character": "Cartman",
        "line": "That's right, Cupid Me. People who are the same belong together."
    },
    {
        "character": "Cupid Me",
        "line": "That's right, and I found somebody who's just the same as you!"
    },
    {
        "character": "Cartman",
        "line": "Really?!"
    },
    {
        "character": "Cupid Me",
        "line": "There she is! [points to Stacy, who turns around and growls at Cartman, showing her rotten teeth]"
    },
    {
        "character": "Cartman",
        "line": "What?! Fuck you, Cupid Me!"
    },
    {
        "character": "Cupid Me",
        "line": "Teeheeheeheehee, fuck you! [gives him the finger and then goes and shoots some arrows onto Stacy's face. Stacy's pupils become hearts]"
    },
    {
        "character": "Cartman",
        "line": "Hey, stop it!"
    },
    {
        "character": "Stacy",
        "line": "Haaagh! [Cartman spins around and runs. Stacy gives chase]"
    },
    {
        "character": "Cartman",
        "line": "Nooo!"
    },
    {
        "character": "Stacy",
        "line": "Haahahaagh!"
    }
]