[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "The Broflovski house, night. Upstairs, Gerald and Sheila relax in bed, watching TV. Well, Gerald is, anyway, with his hands behind his head. Sheila is reading a book."
    },
    {
        "character": "Announcer",
        "line": "Erectile dysfunction is a fact of life. You want to show her you love her, but you're old, and so is she. [A middle-aged man brings two cups of wine to the sofa and gives one of them to his middle-aged wife. Next, another middle-aged couple is shown in a row boat, with the husband rowing... slowly] The next time that special moment comes, don't let your sex drive fail you just because your wife looks like a shriveled prune. Fake it, with Cialis. [The Cialis logo scoots in from the right] It won't make her any harder, but it will make you not care for up to three hours. [A third couple is shown holding hands in his-and-her bathrubs on a deck... on the African savannah, with two elephants in the distance.] And then you can still have your own separate bathrub from her later on. [Gerald glances over at Sheila.]"
    },
    {
        "character": "Gerald",
        "line": "[Lowers his arms and leans in a bit] Hey Sheila. You feel like having some fun?"
    },
    {
        "character": "Sheila",
        "line": "Oh dear, did the Cialis commercial turn you on again?"
    },
    {
        "character": "Gerald",
        "line": "[Puts his left arm around her] How about I put on the uniform?"
    },
    {
        "character": "Sheila",
        "line": "[Gets excited and bashful] Oh, Gerald..."
    },
    {
        "character": "Gerald",
        "line": "Huh? What do you think? You know you like it."
    },
    {
        "character": "",
        "line": "Moments later, Sheila is in a negligee and puts some make up on. A knock is heard on her bedroom door and she answers it."
    },
    {
        "character": "Sheila",
        "line": "Oh, hello. [Strikes a sexy pose - right arm on the door, left arm on her hip]"
    },
    {
        "character": "Gerald",
        "line": "UPS man. I have a ...package from Amazon for you."
    },
    {
        "character": "Sheila",
        "line": "Oh, dear, but I'm barely dressed."
    },
    {
        "character": "Gerald",
        "line": "If you'll just... [Whips out a signature pad and presents it to her] sign right here. [Some time later, the bedroom door is closed, the lights are out, and Gerald is really delivering it to Sheila.]"
    },
    {
        "character": "Sheila",
        "line": "Oh, you're so rough with me, Mr. UPS man!"
    },
    {
        "character": "Gerald",
        "line": "Yeah? [Spanks her] Do you like your package, ma'am? [Unknown to them, Ike is standing at the doorway looking at them]"
    },
    {
        "character": "Sheila",
        "line": "Oh yes!"
    },
    {
        "character": "Gerald",
        "line": "Huh? [Followed by a series of grunts]"
    },
    {
        "character": "Sheila",
        "line": "Do it harder, UPS man!"
    },
    {
        "character": "",
        "line": "Ike's room, morning. Ike is at his desk crying, and he bangs his head on the desk/ Ike has been drawing something. Kyle walks by and notices"
    },
    {
        "character": "Kyle",
        "line": "Ike, what's the matter? [Waits a few seconds, then goes in.] Dude, you've been in here crying all morning. What's going on? [Ike finishes up and hands the sheet of paper to Kyle. Kyle looks and is suddenly alarmed. Ike has drawn a stick figure of his mom with a UPS man, with big boobs for his mom and a big penis for the UPS man. Ike goes back to crying] Oh. My. God. Ike, a-are you sure about this?"
    },
    {
        "character": "Ike",
        "line": "Yes! Yes!"
    },
    {
        "character": "Kyle",
        "line": "I-Ike, this is a big deal. You have to be absolutely, 100%-"
    },
    {
        "character": "Ike",
        "line": "I saw them, Kyle, I saw them!"
    },
    {
        "character": "Kyle",
        "line": "Oh no..."
    },
    {
        "character": "",
        "line": "Stan's house, later. Kyle is in Stan's room, and Cartman and Kenny have joined them. Stan is at his desk, Kenny is on Stan's bed, Cartman is standing up"
    },
    {
        "character": "Kyle",
        "line": "You guys can't tell anybody, all right? Not until I figure out what to do."
    },
    {
        "character": "Stan",
        "line": "Dude, what happened?"
    },
    {
        "character": "Kyle",
        "line": "Take a look. [Whips out the sheet of paper Ike drew upon]"
    },
    {
        "character": "Stan",
        "line": "What's this? [Takes the sheet and looks at it.]"
    },
    {
        "character": "Kyle",
        "line": "Ike found out last night. My mom's having sex with the UPS man."
    },
    {
        "character": "Stan",
        "line": "Whoa!"
    },
    {
        "character": "Cartman",
        "line": "Dude, no way!"
    },
    {
        "character": "Kyle",
        "line": "Yeah dude. [Out in the hall, Randy walks by with a cup of coffee, but he hears them and stops]"
    },
    {
        "character": "Stan",
        "line": "But are you sure they had sex, like, \"sex\" sex, or they actually had sex? [Randy sees a plant nearby, quickly dumps his coffee into it, and puts the cup against Stan's door]"
    },
    {
        "character": "Kyle",
        "line": "Yeah dude, like, full-on. Ike saw everything. It totally makes sense now. My mom's been ordering all kinds of stuff from Amazon lately. Sometimes, sh-she doesn't even remember what she's ordered. She's probably been having sex with the UPS man for a long time."
    },
    {
        "character": "Randy",
        "line": "[Barely audible] Ohhhh... [Hurries away]"
    },
    {
        "character": "Stan",
        "line": "Well are you gonna tell your dad?"
    },
    {
        "character": "Kyle",
        "line": "I don't know. I feel like I should confront my mom first. But it's so embarrassing."
    },
    {
        "character": "Cartman",
        "line": "[Walks up to him] Kyle, have you stopped to think that maybe the sex wasn't consensual?"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "Isn't it possible your mom was raped by the UPS man? We know nothing about this guy and he shows up to all of our houses. Think about it: what kind of sane, normal person would wanna have sex with Kyle's mom?"
    },
    {
        "character": "Stan",
        "line": "Cartman dude, not now."
    },
    {
        "character": "Cartman",
        "line": "No, hear me out, you guys. Haven't you seen those ADT commercials? \"Women these days get raped by perfectly normal-looking white guys in broad daylight.\" It may be too late for Kyle's mom, but I'm getting some God damned security!"
    },
    {
        "character": "",
        "line": "Skeeter's Bar and Cocktails, night. Aside from Skeeter, seven men are present. Jimbo, Randy, Stuart, and Stephen are at the bar. Mr. Tucker is at a table, while Steve Black and Mr. Testaburger stand"
    },
    {
        "character": "Randy",
        "line": "Look, look, the thing is, do we tell Gerald, or do we just stay out of it?"
    },
    {
        "character": "Jimbo",
        "line": "How do you tell him? \"Hey Gerald, Sorry, but the UPS man is bangin' your wife.\" It's really none of our business."
    },
    {
        "character": "Stuart",
        "line": "If my wife was having sex with the UPS man, I'd want you guys to tell me!"
    },
    {
        "character": "Stephen",
        "line": "How do you know she's not? I mean, think about it: this is a guy who visits all our houses during the day, who clearly has a kind of... insatiable lust... I mean, somebody who would have sex with Kyle's mom would have sex with just about anything!"
    },
    {
        "character": "Randy",
        "line": "Oh, come on, he can't be trying that with all our wives?"
    },
    {
        "character": "Mechanic",
        "line": "Wouldn't be the first time. [The other men face him] Hyeah, there's a price to be paid with having things convenient. Used to be... a man had to go to the store to buy himself a pitcher of milk. Hyeah, but men got lazy. They wanted that milk delivered right to the door. Only problem was, the guy deliverin' that milk end sup fuckin' your wife. Sure, you had your nice cold milk delivered right to your doorstep, but your wife was gettin' pounded out like a mallard duck. [takes his hat and heads for the entrance, then turns around] And now you got your Amazon. [puts on his hat] And the milkman's come back. [turns around] And none of ya are safe. [walks away, leaving the other men stunned]"
    },
    {
        "character": "",
        "line": "Cartman's house, day. A Wolf Security System truck is parked out front. In the living room, a security agent lists some things Liane and Cartman would need on their house to secure it well. Liane looks through the brochure."
    },
    {
        "character": "Security agent",
        "line": "And so you'd need the motion detectors in the living room and the kitchen, the touch pads at the front and rear doors, and break-in monitors on all windows. I'm afraid those are not secure at all."
    },
    {
        "character": "Cartman",
        "line": "Oh no, really?"
    },
    {
        "character": "Liane",
        "line": "Oh, I'm sorry, but I really don't think I can afford this."
    },
    {
        "character": "Cartman",
        "line": "Mom, do you wanna get raped?! Haven't you seen their commercials?! You can get raped by a white guy these days, Mom!"
    },
    {
        "character": "Liane",
        "line": "Ohhh..."
    },
    {
        "character": "Security agent",
        "line": "Yes, unfortunately it's not enough to just be fearful of strangers these days."
    },
    {
        "character": "Cartman",
        "line": "What-what do you mean?"
    },
    {
        "character": "Security agent",
        "line": "Well, many times, houses are burglarized by someone the victim knows."
    },
    {
        "character": "Cartman",
        "line": "Oh my God, I knew it! Kyle is always taking my stuff! Just yesterday I couldn't find my iPod headphones! That sneaky little Jew!"
    },
    {
        "character": "Security agent",
        "line": "We realize that's a lot of money, Mrs. Cartman, but really, how much is feeling secure in your own home worth?"
    },
    {
        "character": "Cartman",
        "line": "Yeah Mom! There's dangerous people trying to screw us both!"
    },
    {
        "character": "",
        "line": "The Marsh kitchen, morning. Randy waits at the breakfast table as Sharon washes dishes."
    },
    {
        "character": "Sharon",
        "line": "Don't you need to be getting to work, Rand?"
    },
    {
        "character": "Randy",
        "line": "No, I think I'll uh, ...just hang out a little longer. [The doorbell rings] I'll get it. [Rises quickly and heads for the front door]"
    },
    {
        "character": "UPS man",
        "line": "[Holding two boxes] Hey there, looks like I got a couple of packagers from Amazon for ya."
    },
    {
        "character": "Randy",
        "line": "[Warily] Oh, is that so?"
    },
    {
        "character": "UPS man",
        "line": "If I can just get your signature right [Whips out the signature pad] there?"
    },
    {
        "character": "Randy",
        "line": "[Signs the pad] Sure um... Chad, is it?"
    },
    {
        "character": "UPS man",
        "line": "Thad."
    },
    {
        "character": "Randy",
        "line": "Thad. Nice. You um, havin' a busy day?"
    },
    {
        "character": "UPS man",
        "line": "Oh you know, just, tryin' to get to everyone."
    },
    {
        "character": "Randy",
        "line": "Yeah I'll bet. [Gives him the pad back. Thad does a couple more things on the pad]"
    },
    {
        "character": "UPS man",
        "line": "[Gives Randy the packages and walks back to his truck] Well, have a good one."
    },
    {
        "character": "Randy",
        "line": "Yeah, you too, Thad. [Closes the door and walks back to the kitchen. He puts the packages down on the counter next to the sink] Hey Sharon, these came for you."
    },
    {
        "character": "Sharon",
        "line": "[Smiles] Ooooo, stuff from Amazon?"
    },
    {
        "character": "Randy",
        "line": "Yeah, w-what are they?"
    },
    {
        "character": "Sharon",
        "line": "You know, to be honest, I can't remember?"
    },
    {
        "character": "Randy",
        "line": "[In a deeper voice] You just... order stuff off of Amazon and you can't remember what?"
    },
    {
        "character": "Sharon",
        "line": "[Opens the larger box] Ohhh yeahyeahyeah, these are the paring knives I ordered. Sorry, I think I was a little tipsy. [puts the knives back in the box and opens the smaller box] oh, and this is the book Stan's been wanting; can you take it up to him?"
    },
    {
        "character": "Randy",
        "line": "Yeah, sure, 'cause... [backs out of the kitchen] people just order stuff from Amazon and... forget what they got. [goes upstairs]"
    },
    {
        "character": "",
        "line": "Stan's room, moments later. Randy enters the room with Stan's book."
    },
    {
        "character": "Randy",
        "line": "Stan, you got something from Amazon. [looks around and doesn't see Stan] Oh. [goes to Stan's desk and drops the book off there. He notices Ike's drawing and takes it, looks closely at it and gasps, thinking the drawing is of Sharon and the UPS man] Ooohhh shit."
    },
    {
        "character": "",
        "line": "Cartman's house, afternoon. Cartman comes home from school and sets off the alarm upon entering"
    },
    {
        "character": "Cartman",
        "line": "Oh fuck. [Goes to the touchpad by the door to shut it off] Oh what's the- God damn it! [The phone rings and he goes to answer it. He puts his left index finger in his left ear to hear from the right ear better] Hello?"
    },
    {
        "character": "",
        "line": "Wolf Security Systems, afternoon. It's a very nice office, but only one operator is there taking calls. Whenever the camera is on him, or on one of his colleagues later on, it moves around him to the left or right, never losing focus"
    },
    {
        "character": "Jeff",
        "line": "This is Jeff with Wolf Home Security. Is everything all right?"
    },
    {
        "character": "Cartman",
        "line": "Uh yeah, sorry, I live here, I just, I can't remember the code to turn off the alarm!"
    },
    {
        "character": "Jeff",
        "line": "That's okay. Do you have your security pass phrase you can tell me?"
    },
    {
        "character": "Cartman",
        "line": "Oh yeah yeah, my pass phrase is... Kyle is a dirty no-good Jew. [Thinks a moment] No wait, Kyle is a no-good lying Jew."
    },
    {
        "character": "Jeff",
        "line": "Okay, I've got something a little different here."
    },
    {
        "character": "Cartman",
        "line": "Uhhh, it is My friend Kyle is a no-good dirty...? Hang on, I've got it written down here somewhere."
    },
    {
        "character": "Jeff",
        "line": "No problem."
    },
    {
        "character": "Cartman",
        "line": "Sorry about this."
    },
    {
        "character": "Jeff",
        "line": "It's all right, it happens all the time."
    },
    {
        "character": "Cartman",
        "line": "'Kay, thanks, I... Wait! Hang on a second! What do you mean \"That's all right\"! What if I was somebody trying to rape my mom?!"
    },
    {
        "character": "Jeff",
        "line": "You want to rape your mom?"
    },
    {
        "character": "Cartman",
        "line": "[Liane appears at the top of the stairs and becomes coming down, but stops to hear what Eric is saying] That's nice, you're so cool about me triggering the alarm and not knowing the password, but how do you know I'm not making it up?! I could have raped my mom twice by now!"
    },
    {
        "character": "Jeff",
        "line": "You said you lived there."
    },
    {
        "character": "Cartman",
        "line": "[His mom goes back up the stairs] I do, but you don't know that! I could be Kyle trying to take more of my shit!"
    },
    {
        "character": "",
        "line": "Skeeter's Bar and Cocktails, night. The mechanic is back at his table. The shadows of a group of men creep up on him"
    },
    {
        "character": "Randy",
        "line": "How did you get rid of him? [The mechanic looks at him] How did you get rid of the milkman?"
    },
    {
        "character": "Mechanic",
        "line": "There's no getting rid of him. Not in any you folks would be prepared for. Noh, best you just let him go on fucking your wives. Maybe he'll get tired of it."
    },
    {
        "character": "Stephen",
        "line": "Damn you, it's not just our wives anymore! [The others look at him, he looks around] This morning, he came for me. I opened the door. It was the UPS man. He had a box from Amazon. I looked inside and found an adapter for an iPhone and then I remembered: I had ordered it! I ordered it the day before and I had barely any recollection. The UPS man is using his powers to try to have sex with me now."
    },
    {
        "character": "Randy",
        "line": "[Puts his hands on the table] You said we wouldn't be prepared to get rid of him. How did you?"
    },
    {
        "character": "Mechanic",
        "line": "We used a pretty blonde to lure him in. When she answered the door she told the milkman to follow her to the bathrub. She took off her clothes and... asked the milkman to fill the tub with milk. The milkman said, \"You want that milk pasteurize?\" And the blonde replied, \"No, just up to my boobs. I can splash it in my eyes.\" That's when we jumped 'im. It was over in minutes. Then we burned his body. You wanna get rid of the milkman? You gotta kill him and kill him good. And then you gotta go to the store for your stuff from then on."
    },
    {
        "character": "",
        "line": "Cartman's house, next day. A cat burglar with cigarette is at Cartman's front door"
    },
    {
        "character": "Cat Burglar",
        "line": "Hey, ey uh, [Takes a puff of cigarette] you want me to do this, you gotta pay up front, kid!"
    },
    {
        "character": "Cartman",
        "line": "You'll get your money when you finish doing what I asked you, all right? Now as soon as I lock the door, just give me a few seconds to arm the system, then you break in and try to rape my mom. Okay? You got it? [closes and locks the door, then arms the system, then goes to the phone to wait for Wolf Home Security to call. The cat burglar pounds a window until it gives way and he goes in. The alarm goes off a second later. Cartman gets pissed off when the burglar breaks a second window and there's no response from Wolf. Finally the call comes in, and Cartman answers it] Hello?"
    },
    {
        "character": "Michael",
        "line": "This is Michael with Wolf Home Security. Is everything all right?"
    },
    {
        "character": "Cartman",
        "line": "[The cat burglar appears as he goes towards the stairs. He then stops] Uh, no, a man just broke into our house and he's about to rape my mom. [Softly, to the cat burglar while muffling the mic] Go go, she's upstairs. [The cat burglar heads up the stairs] Hello, did you hear me? A rapist is here; he's white!"
    },
    {
        "character": "Michael",
        "line": "Oh-kay, should we contact the police?"
    },
    {
        "character": "Cartman",
        "line": "Yes you should contact the fucking police! My mom is about to get fucking raped!"
    },
    {
        "character": "Michael",
        "line": "Okay, we're contacting them now."
    },
    {
        "character": "Cartman",
        "line": "He's goin' up the stairs, dude, you'd better hurry!"
    },
    {
        "character": "Michael",
        "line": "Try and stay calm, the police are on their way."
    },
    {
        "character": "Cartman",
        "line": "Well that's nice, maybe they could bring some cigarettes and Gatorade, 'cause the guy's gonna be pretty wiped out! [Looks at the phone] The fuck?!"
    },
    {
        "character": "",
        "line": "The Stotch house. Stephen goes to the front door and opens it."
    },
    {
        "character": "UPS man",
        "line": "Hey there, misterrr Stotch. looks like another Amazon package. [Smiles]"
    },
    {
        "character": "Stephen",
        "line": "I know that what I feel for you is just some kind of spell."
    },
    {
        "character": "UPS man",
        "line": "[looks puzzled] ...Sss-sorry?"
    },
    {
        "character": "Stephen",
        "line": "Just let me sign. [the UPS man hands him the signature pad, Stephen signs it and gives it back and gets his package, and the UPS man leaves. Stephen opens the box and pulls out a Bane mask, still in the plastic package. Then he whips out a flip phone from his back pocket and talks into it] All right, he's coming to you."
    },
    {
        "character": "",
        "line": "The UPS truck, day. The UPS man gets into his truck and starts it up. A gun appears next to his face, ready to shoot at him. He's startled"
    },
    {
        "character": "Voice",
        "line": "Well hello there, Mr. UPS man!"
    },
    {
        "character": "UPS man",
        "line": "What are you-?"
    },
    {
        "character": "Randy",
        "line": "[wearing his own Bane mask] You should have left our wives alone. Now let's go for a drive."
    },
    {
        "character": "UPS man",
        "line": "[the UPS man releases the hand brake and drives off] Look, you can have whatever's in the back! Ih-ihit's all stuff from Amazon!"
    },
    {
        "character": "Randy",
        "line": "Oh no, pull in here."
    },
    {
        "character": "",
        "line": "A U-Stor-It storage facility, day. The UPS man drives into it"
    },
    {
        "character": "UPS man",
        "line": "Just let me go, huh?"
    },
    {
        "character": "Randy",
        "line": "Oh, and then we'd miss out on all the fun! [the driver's side door opens and the other men from the bar, also wearing Bane masks, drag the UPS man out]"
    },
    {
        "character": "UPS man",
        "line": "Aaawwgh! [they take turns kicking and punching him]"
    },
    {
        "character": "Stephen",
        "line": "You should have never come to our town! [punches him twice, the second one sending him to Stuart]"
    },
    {
        "character": "Stuart",
        "line": "A man's wife is his life, Mr. UPS man. [punches him three times, the third one sending him back to Stephen. The UPS man falls to the ground and the Banes start kicking him. A woman is heard screaming. She and her husband are shown]"
    },
    {
        "character": "Woman",
        "line": "Oh my God."
    },
    {
        "character": "Man",
        "line": "Come on honey! [they run off]"
    },
    {
        "character": "Randy",
        "line": "[whips out Ike's drawing and puts it in the man's face] Thought we wouldn't find out??? [drops it and the men scatter. Skeeter and Stephen go towards the camera and away, screen left. Stuart. Randy, and Mr. Testaburger run away from the camera, and Jimbo, Thomas, and Steve Black run off screen right. The UPS man is left alone, battered, bruised, and coughing up blood]"
    },
    {
        "character": "",
        "line": "Cartman's house, day. Someone knocks on his door five times, then tries to jiggle the locks open."
    },
    {
        "character": "Cartman",
        "line": "[stops] Who is there?"
    },
    {
        "character": "UPS man",
        "line": "[opens the door and stumbles in] Please! [still gasping for air]"
    },
    {
        "character": "Cartman",
        "line": "Oh?! Ohhh?! [backs away quickly. The phone rings, but Cartman goes to the kitchen to answer it] Yes? Yeah, hello?"
    },
    {
        "character": "Varashnu",
        "line": "[with Indian Accent] Hello, this is Varashnu wit Wolf Home Security."
    },
    {
        "character": "Cartman",
        "line": "A man just broke into my house and is- [looks at the phone] Varashnu? I didn't sign up to have some Indian guy call me- Are you even in the United States?!"
    },
    {
        "character": "Varashnu",
        "line": "...Uh yes, I am in United States."
    },
    {
        "character": "Cartman",
        "line": "Oh, that is bullshit! Put your manager on!"
    },
    {
        "character": "Varashnu",
        "line": "Okay, hold on. [transfers Cartman's call]"
    },
    {
        "character": "Cartman",
        "line": "Heh- hello?"
    },
    {
        "character": "Kevin",
        "line": "This is Kevin with Wolf Home Security. Is everything all right?"
    },
    {
        "character": "Cartman",
        "line": "No, everything's not all right. How come a guy from India is calling me when my house is being broken into?!"
    },
    {
        "character": "Kevin",
        "line": "We have alarms going off across the country fourteen times a minute. That takes a lot of employees manning phones."
    },
    {
        "character": "Cartman",
        "line": "Dude, I'm not paying all this money to have some guy on the other side of the Earth try and protect me!"
    },
    {
        "character": "Kevin",
        "line": "Sir, it doesn't matter where we call you from, we still contact the police in your neighborhood."
    },
    {
        "character": "Cartman",
        "line": "Oh really? Oh okay. Gosh I'm so relieved! Thanks. There's still just one little problem: How do you know I didn't break into this house, set off the alarm, and now I'm stalling by being upset about the Indian guy and have actually stolen a bunch of shit, raped my mom, and you people have done absolutely nothing about it?!"
    },
    {
        "character": "Kevin",
        "line": "I d-I d'uh... Wow, that just fucked my head."
    },
    {
        "character": "Cartman",
        "line": "Yeah I just fucked your head and the UPS guy just fucked my mom! [slams the phone on the floor]"
    },
    {
        "character": "",
        "line": "Park County Police Station, day. A crowd has gathered in front of the station. Sgt. Yates addresses the crowd's concerns."
    },
    {
        "character": "Sgt. Yates",
        "line": "All right, quiet down people, please! Quiet! [the crowd quiets down] I know you're all worried about your families' security. All I can tell you is that so far, Bane has not been caught. [the people begin to murmur amongst themselves]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh, what are we supposed to do? I mean if Bane is out there on the loose then none of us are safe. One Bane's bad enough, but apparently we got like, like seven Banes? Uhkay?"
    },
    {
        "character": "Gerald",
        "line": "And what do we tell our kids?! We can't leave them in the dark!"
    },
    {
        "character": "Randy",
        "line": "[aside to Gerald] Wouldn't be the only ones in your family completely in the dark."
    },
    {
        "character": "Gerald",
        "line": "What?"
    },
    {
        "character": "Randy",
        "line": "Huh? Nothing."
    },
    {
        "character": "Sgt. Yates",
        "line": "Now listen! There's nothing more we can do to protect your homes. But there's someone here who says he can. [makes way for the security agent who visited Cartman and his mom earlier]"
    },
    {
        "character": "Security agent",
        "line": "Hello folks, we're more than happy to get your homes safe and secure. Now, you're gonna be wanting monitors on all your doors and windows, motion detectors in the living areas, and I would also recommend you all get our newest personal security system to make sure your wives are safe outside the home."
    },
    {
        "character": "Randy",
        "line": "Whoawhoa, wait, wait. What do you mean?"
    },
    {
        "character": "Spokesman",
        "line": "[in a commercial] Protecting your home and your family is hard enough! But sometimes alarms on your doors and windows aren't enough! A new security system allows not only for your doors and windows to be monitored, but your fear levels as well. [a 3-D schematic of a house is shown, with a person in it] A security system that is actually inside you. It's called IN-security."
    },
    {
        "character": "Husband",
        "line": "[with wife and twin daughters] We'll never forget the day we took our twin daughters to the beach."
    },
    {
        "character": "Stranger",
        "line": "Hehey, what cute twins."
    },
    {
        "character": "Wife",
        "line": "Thanks."
    },
    {
        "character": "Stranger",
        "line": "They're so adorable [whips out a crowbar and assumes a menacing posture. The wife instinctively tries to protect the girls] that I'm gonna bash their fucking heads in! [the alarm goes off and the stranger runs away, dropping the crowbar. The husband receives the call]"
    },
    {
        "character": "Peter",
        "line": "This is Peter with INsecurity. Is everything all right?"
    },
    {
        "character": "Husband",
        "line": "A white man just tried to murder our twin girls."
    },
    {
        "character": "Peter",
        "line": "I have a police car on their way with blankets and cocoa. [Next shot is of the whole family in blankets and sipping cocoa at the beach, with police cars around them and police officers investigating]"
    },
    {
        "character": "Husband",
        "line": "I only hope other have people have INsecurity to protect their families."
    },
    {
        "character": "",
        "line": "A shoe store. A woman is getting her son new shoes"
    },
    {
        "character": "Shoe Salesman",
        "line": "Well, how's the shoe fit, pal?"
    },
    {
        "character": "Boy",
        "line": "I think it fits pretty good."
    },
    {
        "character": "Shoe Salesman",
        "line": "Well okayhehe, let's see if it fits better than this KNIFE THROUGH YOUR FUCKING SKULL, BASTARD! [gets out a large knife and slashes the air with it.]"
    },
    {
        "character": "Boy",
        "line": "Aaahh! [jumps into his mom's arms and the alarm goes off. The salesman drops the knife and runs off. The phone rings and the mom answers it]"
    },
    {
        "character": "Mom",
        "line": "Hello?"
    },
    {
        "character": "David",
        "line": "This is David with INsecurity. Is everything all right?"
    },
    {
        "character": "Mom",
        "line": "[voice breaking] No, a white shoe salesman tried to murder my son."
    },
    {
        "character": "David",
        "line": "Hold tight. Police are on their way with blankets and cocoa. [next scene, mom and son are in blankets and sipping cocoa while the police investigate]"
    },
    {
        "character": "Spokesman",
        "line": "Don't let your family become another statistic. Have piece of mind with... [the new company logo appears, with \"Custom installation for only $99.\"] INsecurity."
    },
    {
        "character": "",
        "line": "South Park Elementary, hallway, day. Kyle and Stan walk along to class"
    },
    {
        "character": "Kyle",
        "line": "It just keeps getting worse. I see stuff from Amazon almost every day. My poor dad has no idea."
    },
    {
        "character": "Stan",
        "line": "You're gonna have to tell him, dude."
    },
    {
        "character": "Kyle",
        "line": "I know..."
    },
    {
        "character": "Cartman",
        "line": "[runs up to them] HaHA Kyle! Let's see you try and take my iPod headphones HOW! [wears a little sign on his head showing that ]"
    },
    {
        "character": "Kyle",
        "line": "What?!"
    },
    {
        "character": "Cartman",
        "line": "Just wanted you to know that if you wanna steal somebody's stuff, you should look elsewhere."
    },
    {
        "character": "Kyle",
        "line": "Nobody wants any of your stuff, you fat bitch!"
    },
    {
        "character": "Cartman",
        "line": "Oh, fat bitch, huh?! [gets smug] Well it just so happens that this fat bitch has INsecurity now, Kyle, and so I'm protected from ALL you greedy little Jews until you and your people DIE OUT!"
    },
    {
        "character": "Kyle",
        "line": "The Jewish population isn't dying out, fatass! It's growing!"
    },
    {
        "character": "Cartman",
        "line": "What? [his alarm goes off, then he gets the call] Hello?"
    },
    {
        "character": "Marcus",
        "line": "This is Marcus with INsecurity. Is everything all right?"
    },
    {
        "character": "Cartman",
        "line": "Yeah yeah no, false alarm. I, I just heard some troubling news and it set off my INsecurity."
    },
    {
        "character": "Marcus",
        "line": "All right, could I just get your password please?"
    },
    {
        "character": "Cartman",
        "line": "Yeah, it's um... it's uloveboobs."
    },
    {
        "character": "Marcus",
        "line": "I love boobs?"
    },
    {
        "character": "Cartman",
        "line": "No, \"uloveboobs.\" Lower-case u love boobs."
    },
    {
        "character": "Marcus",
        "line": "How did you know that?"
    },
    {
        "character": "Cartman",
        "line": "My password is uloveboobs!"
    },
    {
        "character": "Marcus",
        "line": "Oh oh I get it. That's pretty funny."
    },
    {
        "character": "Cartman",
        "line": "You, it's fucking hilarious! Now can you shut off my INsecurity please?!"
    },
    {
        "character": "Marcus",
        "line": "Sure, here you go. [gets to resetting the system]"
    },
    {
        "character": "Cartman",
        "line": "Okay. So anyway, Kyle, you'd better watch ih-! [notices Kyle is gone, but looks around] Kyle? God damn it."
    },
    {
        "character": "",
        "line": "Skeeter's Bar and Cocktails, day. The men are back in the bar"
    },
    {
        "character": "Randy",
        "line": "And then I had to drive to Walgreens, Barnes & Noble AND Ace Hardware. I tell you, having to go around and buy stuff again sucks."
    },
    {
        "character": "Stuart",
        "line": "Yeah, but at least we never have to deal with that UPS driver again."
    },
    {
        "character": "Jimbo",
        "line": "[bursts through the front doors] He's back!"
    },
    {
        "character": "Stephen",
        "line": "What?!"
    },
    {
        "character": "Jimbo",
        "line": "[runs to the bar] I just came from Will Patterson's house! His mother got three packages from Amazon! And the UPS guy told her what he'd like to do to her!"
    },
    {
        "character": "Stephen",
        "line": "How?"
    },
    {
        "character": "Jimbo",
        "line": "He casually dropped this on his way out! [whips out a sheet of paper, and the other men gather to have a look. It's Ike's drawing]"
    },
    {
        "character": "Randy",
        "line": "[low voice] Oh my God! [now he and the men think the UPS man has made copies of that drawing and is dropping them off at every house]"
    },
    {
        "character": "Mechanic",
        "line": "Didn't kill 'im, did ya? [the other men turn around] Yea', I didn't think you had it in ya."
    },
    {
        "character": "Randy",
        "line": "We scared him! We thought that'd be enough!"
    },
    {
        "character": "Mechanic",
        "line": "Milkman don't get scared. Not with free pussy at every doorstep."
    },
    {
        "character": "",
        "line": "A stakeout. Someone is looking at the UPS man deliver a package through binoculars. A woman answers the door, takes her package from the UPS man, and closes the door. The UPS man looks around to make sure no one is out to hurt him any further. He goes to his truck, then checks under it to make sure it hasn't been rigged with a bomb, then he looks around once more"
    },
    {
        "character": "Stephen",
        "line": "Son of a bitch, it's him all right!"
    },
    {
        "character": "Randy",
        "line": "This guy doesn't know when to quit!"
    },
    {
        "character": "Stephen",
        "line": "He's stopping at another house. [the UPS man stops his truck, gets down with a new package, and goes to the next house, looking around]"
    },
    {
        "character": "Steve Black",
        "line": "Guess this guy's a lot tougher than we thought. Must be why our wives want him so bad."
    },
    {
        "character": "Randy",
        "line": "[his INsecurity goes off] Sorry sorry, that's me. [gets the call] Hello?"
    },
    {
        "character": "Alvin",
        "line": "This is Alvin with INsecurity. Is everything all right?"
    },
    {
        "character": "Randy",
        "line": "Yeah, sorry, false alarm. Pass phrase is tickle me homo. [the other men glance at him] It's a joke."
    },
    {
        "character": "",
        "line": "Kyle's house, day, living room. Kyle sits on the sofa between his parents"
    },
    {
        "character": "Kyle",
        "line": "Mom, Dad, you've always taught me that being direct and honest is a basic Jewish tenet."
    },
    {
        "character": "Sheila",
        "line": "That's right, Kyle."
    },
    {
        "character": "Kyle",
        "line": "And that applies to all of us, doesn't it? Even though it's convenient to have things done for you, sometimes it's best to deal with it yourself. [the doorbell rings and he sighs deeply, then goes to answer it. The UPS man is on the other side of the door]"
    },
    {
        "character": "UPS man",
        "line": "Uhh, hi, I got a delivery for ya?"
    },
    {
        "character": "Kyle",
        "line": "Yeah. Come in for a minute, would you?"
    },
    {
        "character": "UPS man",
        "line": "What?"
    },
    {
        "character": "Kyle",
        "line": "Please? I need you to come sit down for a second. [puzzled, the UPS man comes in and sits down on the armchair. Kyle returns to his spot between his parents, and silence follows for a couple of seconds] So... Here we all are. Mom, do you want to tell Dad something? [she stays quiet] Mom?"
    },
    {
        "character": "UPS man",
        "line": "What's going on?"
    },
    {
        "character": "Kyle",
        "line": "You know God damned well what's going on! This ends right now! We are a family, and you need to go somewhere else!"
    },
    {
        "character": "UPS man",
        "line": "Don't you think I want to?! [his UPS truck is shown in the background] I hate this damned town! Every day, things just keep getting weirder around here, and I'm just about sick of it![Randy and Stephen run out from behind the truck, and a few seconds later it blows up] Aaah! [runs to a window] Oh my God! [gets the call and answers it] Hello?"
    },
    {
        "character": "Brian",
        "line": "This is Brian with INsecurity, is everything all right?"
    },
    {
        "character": "UPS man",
        "line": "No! They blew up my car! They blew up my car!"
    },
    {
        "character": "Brian",
        "line": "I'm sending help. Police are on their way with blankets and cocoa."
    },
    {
        "character": "UPS man",
        "line": "[goes up the stairs] They're after me again! Do something!"
    },
    {
        "character": "Brian",
        "line": "Ho- hold on one second, sir, I have another emergency coming in. [switches calls] This is Brian with INsecurity, is everything all right?"
    },
    {
        "character": "Cartman",
        "line": "[in the perfume section of a store, with a saleswoman behind the counter] Yeah, no, false alarm again. I'm in the store and some fat bitch asked me if my dad likes cologne."
    },
    {
        "character": "Gerald",
        "line": "[opens the front door] What the hell's goin' on out here?! [Stephen and Jimbo lie in wait for the UPS man]"
    },
    {
        "character": "Jimbo",
        "line": "Stay out of this, Gerald! Some men care about what their wives are doing!"
    },
    {
        "character": "Gerald",
        "line": "What?! You don't even have a wife, Jimbo! [Jimbo's INsecurity goes off, his phone rings, and he answers it]"
    },
    {
        "character": "UPS man",
        "line": "[trying again to call INsecurity] Somebody answer me! You have to send help now!"
    },
    {
        "character": "Martin",
        "line": "Sir, we are sending help. Just stay calm. [another call comes in] Hang on sir, this is Martin with INsecurity."
    },
    {
        "character": "Randy",
        "line": "[on the phone] Yeah, I'm thinking maybe Gerald's house is nicer than mine is."
    },
    {
        "character": "Martin",
        "line": "Hello, this is Martin with INsecu-"
    },
    {
        "character": "Cartman",
        "line": "[outside a store] God damn it I've had it with you people! When I signed up, I thought I was getting CSI guys protecting my ass, but all of you answering the phones are complete retards![Martin is swamped with calls. Another one comes in] Hello? [his own INsecurity has gone off]"
    },
    {
        "character": "Mike",
        "line": "This is Mike with INsecurity. Is everything all right?"
    },
    {
        "character": "UPS man",
        "line": "[in the master bedroom] Hello?!"
    },
    {
        "character": "Kyle",
        "line": "[sees the open door and goes in] Dude, come down here!"
    },
    {
        "character": "UPS man",
        "line": "[panics] AAAAH! [jumps through the closed window to his death] Uf. [everyone else looks. Police arrive shortly with blankets and cocoa.]"
    },
    {
        "character": "Sgt. Yates",
        "line": "So you say this man killed himself because he was a psychopath who was forced to have sex with his mother? [holds a sheet of paper in his hand]"
    },
    {
        "character": "Stephen",
        "line": "Yes, we found that in his pocket. [points to the sheet, which the captain holds up. It's... Ike's drawing again]"
    },
    {
        "character": "Officer",
        "line": "Sir, we found this in the closet upstairs? [It's the UPS uniform Gerald uses in roleplaying]"
    },
    {
        "character": "Gerald",
        "line": "Yes, that's mine."
    },
    {
        "character": "Randy",
        "line": "Yours? What?"
    },
    {
        "character": "Sheila",
        "line": "[rips the uniform from the officer] Give me that! What we do in our bedroom is our business!"
    },
    {
        "character": "Kyle",
        "line": "Wait a minute, Dad was the UPS man?"
    },
    {
        "character": "Gerald",
        "line": "Uhh, Kyle, uh sometimes when people get older they need to play and pretend to keep things interesting. Iiit's just a way I can still be intimate with your mother without relying on silly sexual enhancement drugs. [all the other men's alarms go off, their phones ring, and they all answer them]"
    },
    {
        "character": "The men",
        "line": "Hello?"
    },
    {
        "character": "",
        "line": "Skeeter's Bar and Cocktails, night. The men return to the bar and find the mechanic at his table again"
    },
    {
        "character": "Randy",
        "line": "It's over. But you were wrong. We don't have to be afraid of Amazon. The only price to be paid for convenience is that we must be secure with ourselves."
    },
    {
        "character": "Mechanic",
        "line": "Yea'. Got yourselves some nice home security systems, don'tcha? Payin' a man to do your job of protecting your house. Only problem is, while you're out feelin' like your things are safe, that security man is fucking your wife."
    },
    {
        "character": "",
        "line": "Address 10228, day. The security agent is at the house talking to a woman"
    },
    {
        "character": "Security agent",
        "line": "Doors and windows should be armed and your motion detectors are up and running, just call me whenever you need me back. [the woman closes her door and the agent goes back to his van. He gets in and sits down, preparing to drive. A gun pops up next to him, and he's alarmed.] Ah! Who are you??"
    },
    {
        "character": "Cartman",
        "line": "[in Bane mask] It doesn't matter who we are, what matters is our plan. You should have respected my authoritay. [the men return in Bane masks to haul the agent out and beat him up]"
    },
    {
        "character": "Security agent",
        "line": "Hoo!"
    }
]