[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Walgreens, day. A line of people starts at the store entrance and goes out for blocks. Inside, two pharmacists sit at a folding table removing wristbands from people"
    },
    {
        "character": "Pharmacist",
        "line": "Next please. [one man gets off a stool and leaves, and another one steps up and sits in it] You are sure you want to do this?"
    },
    {
        "character": "Man",
        "line": "Of course I'm sure!"
    },
    {
        "character": "Pharmacist",
        "line": "[gets out some scissors and motions to the man] Okay, roll up your sleeve. [the man rolls up his sleeve as if he's going to receive a flu shot. The nurse sees the yellow bracelet the man is wearing and cuts it off, then puts it into a small tray to her right. The man looks a bit relieved]"
    },
    {
        "character": "",
        "line": "Outside, Cartman waits for his turn to get the wristband cut off"
    },
    {
        "character": "Cartman",
        "line": "[upset] I can't believe we all got duped. I've been wearin' this stupid things for months! I feel like such a tool."
    },
    {
        "character": "",
        "line": "Inside, Clyde gets his wristband removed"
    },
    {
        "character": "Clyde",
        "line": "Lying jerk! [hops off the stool and leaves. Mr. Mackey steps up and sits down on the stool, sobbing]"
    },
    {
        "character": "Pharmacist",
        "line": "[snipping off the wristband] Hold still please."
    },
    {
        "character": "Mr. Mackey",
        "line": "[stands up and turns to leave] I don't know what to believe in anymore, okay?! [walks away still sobbing]"
    },
    {
        "character": "Cartman",
        "line": "All right, let's do this! Make me believe in something that's bullshit, will you?! [begins to roll up his sleeve, but then] Oh, hold on. [takes off his jacket and lets it drop to the floor] Aah, let's see... that one. [the same yellow one the others are having cut off. She cuts that one off] Stupid fraud! [spits onto the band] Good riddance to YOU! [picks up his coat and puts it on, walks off, and another man replaces him. The pharmacists adds Cartman's wrist band onto the others]"
    },
    {
        "character": "Man 2",
        "line": "All right, I'm next! I'm next! Get this thing off of me! [the pharmacist does so.]"
    },
    {
        "character": "",
        "line": "Outside, Cartman walks out to find Kenny, Kyle, and Stan waiting for him"
    },
    {
        "character": "Kyle",
        "line": "Did you do it?"
    },
    {
        "character": "Cartman",
        "line": "Yep, it's done. You know I spent five bucks on that stupid thing?!"
    },
    {
        "character": "Kenny",
        "line": "(I told you it was a bad idea.)"
    },
    {
        "character": "Cartman",
        "line": "Oh don't even start, Kenny! Just because you guys didn't buy into the bracelets doesn't mean you're smarter than me, okay?! [Stan sighs and steps forward, turns right and walks away] What's wrong with him?"
    },
    {
        "character": "",
        "line": "The Marsh house, day. Stan walks in and sees Randy on the sofa with a bottle of beer in hand"
    },
    {
        "character": "Randy",
        "line": "Oh I feel like such an idiot."
    },
    {
        "character": "Stan",
        "line": "It's all right, Dad."
    },
    {
        "character": "Randy",
        "line": "But I wore that wristband everywhere, and the guy's a complete phoney! [turns on the TV and raises the volume] There's even more coming out about it today."
    },
    {
        "character": "Anchor Tom",
        "line": "These latest tests are once again confirming that the performance-enhancing drug HGH was in the body of Christ at the time of crucifixion. All over the country people are having their \"What Would Jesus Do\" wristbands cut off. It was just last week a team of scientists found traces of HGH on the Shroud of Turin [actual footage of a corner of the shroud being analyzed is shown] , along with several other illegal compounds and painkillers. [some lab testing is shown, then a panel of scientists addresses the issue]"
    },
    {
        "character": "Lead scientist",
        "line": "Without a doubt there was uh HGH in the body of Christ at the time of crucifixion. Jesus did not suffer for our sins, he was in fact very high."
    },
    {
        "character": "Randy",
        "line": "All the years of being told somethin'. It's just so unfair!"
    },
    {
        "character": "Anchor Tom",
        "line": "Priests and bishops have been working overtime to remove Jesus from the record books and from The Last Supper. [a painter is shown painting over part of Jesus' head. Next, Benedict XVI is shown speaking to the crowds at St. Peter's Basilica. The subs say \"It's really a shame that Christ had to bring this embarrassment onto the church. We cannot tolerate any deity who used illegal substances to perform his miracles.\"]"
    },
    {
        "character": "Randy",
        "line": "I know people that paid ten bucks for those bracelets. I bet they all feel pretty stupid now. [Stan lowers his head and walks away. He goes upstairs to his room, enters and closes the door, and sits at his desk. He rolls up his left sleeve and gazes at his WWJD bracelet. He sighs heavily.]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The school day starts with the kids entering the main building."
    },
    {
        "character": "Butters",
        "line": "Yeah, and so, and so then, I asked Preacher, \"Well, what about the New Testament?\""
    },
    {
        "character": "Cartman",
        "line": "Uh huh."
    },
    {
        "character": "Butters",
        "line": "And he says, \"Well you still should oughta read it, but you're gonna need to put an asterisk next to Jesus' name whenever it comes up.\""
    },
    {
        "character": "Cartman",
        "line": "So weak dude. Dark times, brah, dark times. [reaches his locker and opens it, then notices Stan. Butters walks over to Craig and another boy.] Dude, what the hell? You're wearing a \"What Would Jesus Do\" bracelet!"
    },
    {
        "character": "Stan",
        "line": "All right all right, I got it a few weeks ago. Big whoop."
    },
    {
        "character": "Cartman",
        "line": "The big whoop isn't that you have one, the big whoop is that you're still wearing it!"
    },
    {
        "character": "Butters",
        "line": "Yeah, Stan. Didn't you hear Jesus did all his miracles on drugs?"
    },
    {
        "character": "Stan",
        "line": "Yeah I know."
    },
    {
        "character": "Cartman",
        "line": "Well don't you care?! Jesus Asterisk Christ, Stan! People are feeling really cheated by all this!"
    },
    {
        "character": "Mr. Mackey",
        "line": "[walks by in a zombie-like fashion] Wuughhhuh. Where do I go? What do I do?"
    },
    {
        "character": "Craig",
        "line": "Cartman's right. If you care about fairness, Stan, then you really have to lose the bracelet."
    },
    {
        "character": "Stan",
        "line": "Look I just don't want to, you guys. Honestly, it's not that big a deal."
    },
    {
        "character": "",
        "line": "The Charlie Rose logo pops up on a TV"
    },
    {
        "character": "Announcer",
        "line": "It's the Charlie Rose show. Here's Chuck."
    },
    {
        "character": "Charlie Rose",
        "line": "We are here tonight with the only person in America who still wears his \"What Would Jesus Do\" wristband. Please welcome Stan Marsh."
    },
    {
        "character": "A Voice",
        "line": "Dick! [Stan looks around]"
    },
    {
        "character": "Charlie Rose",
        "line": "Stan, after everything that's come out, after all the facts have been proven, why do you still wear the wristband?"
    },
    {
        "character": "Stan",
        "line": "I don't know, [looks at his wristband] I just like it."
    },
    {
        "character": "Charlie Rose",
        "line": "You just like it."
    },
    {
        "character": "Stan",
        "line": "Yeah. I donno. I've had it a long time, I just don't feel like cutting it off."
    },
    {
        "character": "Charlie Rose",
        "line": "Well joining us now is just one of the billions of people who think that anyone who still wears their \"What Would Jesus Do\" wristband is doing all of society a disservice. Chris Martin you say that Stan Marsh is... a dick?"
    },
    {
        "character": "Chris Martin",
        "line": "Yeah, yeah, thanks Charlie. My problem with this kid is he doesn't care about the truth! Okay, if Jesus rose from the dead with the help of drugs, that's fine, but then he went on to say it was a miracle, and that is where it became dangerous! What about the Incas?! What about the Aztecs?! Millions of people who were murdered in Jesus's name, and then Jesus turns out to be a fraud! Wearing that bracelet is a slap in the face to everyone!"
    },
    {
        "character": "Charlie Rose",
        "line": "What do you say about that, Stan?"
    },
    {
        "character": "Stan",
        "line": "...I don't know. [checks his wristband again] I like it."
    },
    {
        "character": "Charlie Rose",
        "line": "All right, well we searched high and low to find my next guest who actually agrees with Stan Marsh, and thinks he's doing the right thing. Please welcome a retarded fish. [the fish, wearing a cycling helmet, babbles in the water] Now, Retarded Fish, you don't see any problem at all with someone keeping their bracelet [the fish babbles some more]"
    },
    {
        "character": "Chris Martin",
        "line": "That that's because, that's because you're a retarded fish, and you don't know any better! What about the Crusades?! The Inquisitions?! How many people were tortured to death for somebody who is a fake?! [the retarded fish lets out a short \"blat\"]"
    },
    {
        "character": "Charlie Rose",
        "line": "What about the Crusades, Stan? Does that enter into your decision at all?"
    },
    {
        "character": "Stan",
        "line": "No, I just, I don' know. No."
    },
    {
        "character": "Charlie Rose",
        "line": "Anything to add, Retarded Fish?"
    },
    {
        "character": "Retarded fish",
        "line": "Nnno, No, I'm good. Thank you."
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Stan walks down the hall and Mr. Mackey spots him"
    },
    {
        "character": "Mr. Mackey",
        "line": "Stan! Hey Stan, can I talk to you? [Stan stops as Mr. Mackey approaches him] Listen, Stan, ah I just wanna tell you... You've really been an inspiration m'kay?"
    },
    {
        "character": "Stan",
        "line": "I have?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Yeah. You know, I can't believe in Jesus anymore, 'cause he's a damned fraud, so what I'm gonna believe in is just bein' me, and bein' independent like you. So what I did is I got this brown bracelet to remind me of standing my ground, uhkay? And just believin' in the cause of bein' me."
    },
    {
        "character": "Stan",
        "line": "You're wearing a bracelet to think of me?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh I'm not the only one. There's lost of people doin' it. [Butters walks by] Hey Butters. Stand ground."
    },
    {
        "character": "Butters",
        "line": "[turns around and lift up his right arm] Stand ground, Mr. Mackey! [Stan is surprised to see Butters with a brown bracelet. Butters turns around and walks to his locker]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Anyway, thanks Stan. And... you know, just keep on, keep on standing your ground, okay? [walks away. Stan walks over to Butters]"
    },
    {
        "character": "Stan",
        "line": "You're wearing a brown bracelet, Butters?"
    },
    {
        "character": "Butters",
        "line": "Well yeah. [points to it with his left hand] It helps remind me that I shouldn't back down anymore when I feel pressure from other people. I just got really moved when I saw what did for all those farmers in Belarus. [switches folders]"
    },
    {
        "character": "Stan",
        "line": "...Farmers in where?"
    },
    {
        "character": "",
        "line": "A farm in Belarus, day. A group of farmers face down some bulldozers. A different language is spoken, but the subs say"
    },
    {
        "character": "Worker",
        "line": "Move aside, farmers! This land is no longer yours!"
    },
    {
        "character": "Farmer",
        "line": "We will not move aside! We will stand our ground! [shows off his bracelet] Like the child on the Charlie Rose show! [the other farmers cheer him on]"
    },
    {
        "character": "Stan",
        "line": "Dude, where are people getting all the brown wristbands?"
    },
    {
        "character": "Butters",
        "line": "I donno. I got mine down at 7-11. [takes Stan down to the store] See? Right here. [a small rotating stand stocked with Stanground Bracelets is shown]"
    },
    {
        "character": "Clerk",
        "line": "Hello, you interested in the Stanground braceleh-OH! Wow, it's you! [lifts up his right arm to show off his bracelet] Stanground, brah!"
    },
    {
        "character": "Stan",
        "line": "Wow, this is happening so fast."
    },
    {
        "character": "Steve Nelson",
        "line": "Hello Stan, Steve Nelson with Endorsement Management. Are you ready for your Nike commercial? [looks at Butters, who smiles back at him]"
    },
    {
        "character": "",
        "line": "The Nike commercial"
    },
    {
        "character": "Stan",
        "line": "[looking out over a river from a stone bridge] My friends told me I was crazy, [jogging down a sidewalk in a Nike jogging suit] that I was wasting my time. [holding court at a press conference. Cameras all around him take pictures] But my cause is to stand my ground. [sits in a park, then stands up as the sun sets] When others sat, I kept my bracelet on, because I stand... [faces the sun and raises his left arm, still wearing the bracelet. It begins to glow] for standing."
    },
    {
        "character": "",
        "line": "At a Sizzler"
    },
    {
        "character": "Waiter",
        "line": "Would you like to be seated?"
    },
    {
        "character": "Stan",
        "line": "No thanks. I'll stand."
    },
    {
        "character": "",
        "line": "At the movies"
    },
    {
        "character": "Moviegoer",
        "line": "Hey, you wanna siddown?"
    },
    {
        "character": "Stan",
        "line": "I'm good."
    },
    {
        "character": "",
        "line": "On a flight"
    },
    {
        "character": "Flight attendant",
        "line": "Sir, the captain has asked everyone to take their seats."
    },
    {
        "character": "Stan",
        "line": "Tell the captain to take off. [At the gym] People ask me, \"You never took the bracelet off? Not once?\" [outside, with a sunset behind him] No. Never. Not. Ever. [Three phrases pop up onscreen: \"STAN for something. STAN up. STAN ground.\"] What do I do? I Stan ground. [a double swoosh appears onscreen]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Mr. Garrison writes up a bunch of stuff on Dr. Drew"
    },
    {
        "character": "Mr. Garrison",
        "line": "Now, when Dr. Drew told Jeff Conway he was on a one-way street to nowhere, what tactics did he use to try and convince-? [a classroom door flies open and a bunch of men pour in. Among them is the lead scientist on the Shroud of Turin.]"
    },
    {
        "character": "Lawyer",
        "line": "Mr. Marsh, if you don't mine, we'd like to see your bracelet."
    },
    {
        "character": "Stan",
        "line": "For what?"
    },
    {
        "character": "Lead scientist",
        "line": "If you have nothing to hide, then please hand it over, Mr. Marsh."
    },
    {
        "character": "Kyle",
        "line": "What are you people talking about?"
    },
    {
        "character": "Field reporter",
        "line": "Are we good? We live? Tom, I'm here at South Park Elementary, where officials have barged their way in after reports of Stan Marsh of the Stanground Foundation did in fact at one point remove his yellow bracelet. Rumors have surfaced that Stan did not stan his ground as previously stated, and that the wristband is in fact superglued back together."
    },
    {
        "character": "Lead scientist",
        "line": "Please let us check your wristband for superglue."
    },
    {
        "character": "Stan",
        "line": "No! This is stupid!"
    },
    {
        "character": "Butters",
        "line": "He's the one person who doesn't do stuff like that! Why don't you leave him alone!"
    },
    {
        "character": "Lead scientist",
        "line": "Are you afraid we might find glue on your bracelet, Mr. Marsh?"
    },
    {
        "character": "Stan",
        "line": "No! I never cut if off!"
    },
    {
        "character": "Lead scientist",
        "line": "Then, let us ah-see it."
    },
    {
        "character": "Jimmy",
        "line": "[pounding his desk with his fist] This is an outrage! Who out there is saying that our friend Stan is a liar?"
    },
    {
        "character": "Lead scientist",
        "line": "I cannot say, but he is a reliable and credible source who is of the utmost prestige."
    },
    {
        "character": "Butters",
        "line": "Who?"
    },
    {
        "character": "Lead scientist",
        "line": "All right, it was Craig. [another scientist steps aside to show Craig]"
    },
    {
        "character": "Cartman",
        "line": "Craig?! You asshole!"
    },
    {
        "character": "Stan",
        "line": "What's the big idea, Craig?!"
    },
    {
        "character": "Craig",
        "line": "It just looked like you cut it off, that's all."
    },
    {
        "character": "Stan",
        "line": "You got nothin' better to do than try and knock me down?! You can't just say anything you want about people!"
    },
    {
        "character": "Butters",
        "line": "Ooo, look at him go, Stanning his ground!"
    },
    {
        "character": "The Class",
        "line": "Yeah!"
    },
    {
        "character": "Stan",
        "line": "You know what happens when you lie, Craig?! You hold that lie inside!"
    },
    {
        "character": "Butters",
        "line": "Go Stan!"
    },
    {
        "character": "Stan",
        "line": "And it grows and it grows, right in your balls, until they have to cut it out!"
    },
    {
        "character": "Butters",
        "line": "...A little unnecessary, but go Stan!"
    },
    {
        "character": "Stan",
        "line": "Go ahead and test it! Then let's just see what happens to this money-hungry, alcoholic prostitute!"
    },
    {
        "character": "The Class",
        "line": "Yeah!"
    },
    {
        "character": "Butters",
        "line": "Prostitute!"
    },
    {
        "character": "",
        "line": "Breaking News"
    },
    {
        "character": "Announcer",
        "line": "This is breaking news."
    },
    {
        "character": "Anchor Tom",
        "line": "The tests are done and the results are in. The little boy who claimed he never cut off his \"What Would Jesus Do\" bracelet did cut it off, and lied about it."
    },
    {
        "character": "Lead scientist",
        "line": "Not only did we find traces of ah-superglue, but of yellow magic ah-markeur as well. This is a dark ah-day for honest French-Swedish people everywheure."
    },
    {
        "character": "Anchor Tom",
        "line": "Though the tests seem conclusive, Stan Marsh continues to deny any cheating."
    },
    {
        "character": "",
        "line": "Stan's room, night. He's got posters of STANdground all over his walls, but he's pissed off. Someone knocks on his door"
    },
    {
        "character": "Stan",
        "line": "Yeah. [the door opens and Kyle enters]"
    },
    {
        "character": "Kyle",
        "line": "Hey dude, people are kind of pissed off at you."
    },
    {
        "character": "Stan",
        "line": "Thanks Kyle."
    },
    {
        "character": "Kyle",
        "line": "You probably should come clean and tell the truth. Did you superglue your bracelet?"
    },
    {
        "character": "Stan",
        "line": "Why does it matter?!"
    },
    {
        "character": "Kyle",
        "line": "Because you kind of made it matter."
    },
    {
        "character": "Stan",
        "line": "You know, I'm just, I'm just through with this whole thing! I just, I can't put my family through any more of this!"
    },
    {
        "character": "Kyle",
        "line": "S-so you did superglue it."
    },
    {
        "character": "Stan",
        "line": "[hops off his bed and walks over to his desk] Ugh, you know what's really sad?! That this is what matters to people! What nobody seems to remember are the farmers in Belarus! STANground is bigger than me! You wanna tell all those farmers in Belarus it's all bullcrap?!"
    },
    {
        "character": "Kyle",
        "line": "Dude, the sooner you eat your peas, the sooner you can try to win some of your friends back. Eh ya you need to Bill Clinton this."
    },
    {
        "character": "Stan",
        "line": "You really think I went through all that trouble, lying about my wristband and claiming to be something I wasn't, for what, Kyle?! For what?! [Kyle looks around at all the Nike merchandise] This is a witch hunt, dude! It's all that stupid French scientist! He's the fraud, and I'm gonna prove it!"
    },
    {
        "character": "",
        "line": "The lead scientist's mansion, night. He's dressed in pajamas and doing squats in his bedroom as his wife reads a book in bed"
    },
    {
        "character": "Wife",
        "line": "Would you mind getting me some water, darling?"
    },
    {
        "character": "Lead scientist",
        "line": "Can't you see I'm trying to do ah-my calisthenics?"
    },
    {
        "character": "Wife",
        "line": "But my throat is parched, dear, and I'm so scared of burglars."
    },
    {
        "character": "Lead scientist",
        "line": "[stops and turns towards the bedroom door] Is ah-tap water going to be okay, or do you want me to go down to Crystal Geyser and bring Her Highness some right from the spring?"
    },
    {
        "character": "Wife",
        "line": "Tap is fine, dear. [the scientist leaves]"
    },
    {
        "character": "",
        "line": "The lead scientist's mansion, night, outside. A shadow appears and approaches the front door."
    },
    {
        "character": "",
        "line": "The lead scientist's mansion, bedroom. The scientist gives his wife a glass of tap water and goes back to his calisthenics"
    },
    {
        "character": "Wife",
        "line": "What was that? I could have sworn I saw something outside."
    },
    {
        "character": "Lead scientist",
        "line": "It's ah-your imagination"
    },
    {
        "character": "Wife",
        "line": "[moments later] Oh darling, could you change the channel for me? The remote is dead. [the scientist glares at her, sighs heavily and goes to the TV, which is set to a show on the Jewelry & Gold Shopping Network]"
    },
    {
        "character": "Lead scientist",
        "line": "[feeling bossed around] You just want me to change the channel or should I go and make a TV program written ah-just for you?!"
    },
    {
        "character": "Wife",
        "line": "No, just change to channel 10, thanks."
    },
    {
        "character": "Lead scientist",
        "line": "It's ah-starting to feel like ah-The Carole Burnett Show in here. [clicks through the channels]"
    },
    {
        "character": "",
        "line": "The lead scientist's mansion, elsewhere. The shadow is now inside, and it bumps into a table on which a vase sits. The vase falls and shatters"
    },
    {
        "character": "Wife",
        "line": "What was that?! I think somebody's here!"
    },
    {
        "character": "Lead scientist",
        "line": "[back to his squats] Maybe it's ah-the peepee fairy so somebody can ah-take a peepee for you too."
    },
    {
        "character": "Wife",
        "line": "Please I'm terrified. Please go check it out. [the scientist again sighs heavily and leaves the room]"
    },
    {
        "character": "",
        "line": "The mansion, elsewhere. The shadow approaches a corner when Stan comes in from the other side of the screen. The shadow turns out to be Jesus."
    },
    {
        "character": "Stan",
        "line": "Jesus!"
    },
    {
        "character": "Jesus",
        "line": "Shhhh."
    },
    {
        "character": "Stan",
        "line": "What are you doing here?"
    },
    {
        "character": "Jesus",
        "line": "My child, the man who lives here has led a witch hunt to destroy my legacy. I am simply here to search for something I can use..."
    },
    {
        "character": "Stan and Jesus",
        "line": "...to discredit him too."
    },
    {
        "character": "Jesus",
        "line": "That's what I'm doing. [the lights come on]"
    },
    {
        "character": "Lead scientist",
        "line": "Oh, it's ah-Tweedle Dumb and ah-Tweedle Dee trying to break in-ah-to my house!"
    },
    {
        "character": "Stan",
        "line": "Jesus, everyone is claiming you were using drugs to resurrect. Why didn't you say anything?"
    },
    {
        "character": "Jesus",
        "line": "Sometimes it is best to say nothing, my son."
    },
    {
        "character": "Stan",
        "line": "Yeah, I've been kind of seein' that."
    },
    {
        "character": "Lead scientist",
        "line": "Ah-excuse me, I'm sorry to intrude, but do you want to please ah-leave or should I make you some kofel bread and ah-sausages?!"
    },
    {
        "character": "",
        "line": "The living room, later. They stay for bread and sausages."
    },
    {
        "character": "Stan",
        "line": "It all just happened so fast. The next thing I knew I had a Nike commercial."
    },
    {
        "character": "Jesus",
        "line": "Yeah, I know how it goes."
    },
    {
        "character": "Stan",
        "line": "Everyone hates me now, and it isn't fair."
    },
    {
        "character": "Jesus",
        "line": "I know. I just feel like if people could see me in action again, they'd they'd realize I'm not a fraud."
    },
    {
        "character": "Lead scientist",
        "line": "[returns in a maid outfit over his pajamas] Here you go, kofel bread and some sausage for you."
    },
    {
        "character": "Stan",
        "line": "Thanks a lot. [the scientist turns around and leaves.] Jesus, did you take HGH to do your miracles?"
    },
    {
        "character": "Jesus",
        "line": "NO! Pff! That's just... no! Okay? No. Everyone just lost their faith. Did you cut your wristband off, my son?"
    },
    {
        "character": "Stan",
        "line": "NO! Pff! No, that's no, okay? No. And anyway, it's not even the issue."
    },
    {
        "character": "Jesus",
        "line": "Pff, I know, right?"
    },
    {
        "character": "Stan",
        "line": "Pff it's like, that's here [puts his hand up, palm down, about two inches above the bread] and..."
    },
    {
        "character": "Jesus",
        "line": "Pfyeah and we're, like, you know, p-yeah, here. [briefly raises his left hand, palm down, to about six inches above Stan's head]"
    },
    {
        "character": "Stan",
        "line": "Pff, there's there's farmers in Belarus who are in a life and death struggle. THAT's what should be important!"
    },
    {
        "character": "Jesus",
        "line": "P-yeah! Instead of focusing on us, we need to get everyone focusing on what matters! Where's Belaruh-ruh-roos?"
    },
    {
        "character": "Stan",
        "line": "Exactly! People don't even know where it is."
    },
    {
        "character": "Jesus",
        "line": "Maybe, if we could get people to care about it, then I could go and save it, and people would be stoked on me again!"
    },
    {
        "character": "Stan",
        "line": "How can we raise awareness?"
    },
    {
        "character": "Jesus",
        "line": "We need to get some bracelets."
    },
    {
        "character": "",
        "line": "Something straight out of Dr. Seuss, day, Scauses Factory. Inside a fantastic building sits a man behind a warped desk. Stan and Jesus sit on two thrones opposite him"
    },
    {
        "character": "P.F. Pityef",
        "line": "Welcome, welcome, to the P.F. Pityef Bracelet Factory. How can I be of service?"
    },
    {
        "character": "Stan",
        "line": "Well, we wanted to start a new movement, and we thought since your company makes all the bracelets..."
    },
    {
        "character": "P.F. Pityef",
        "line": "Ah, I see you're wearing one of our brown scauses already. Delightful. What color would you like your new scause to be?"
    },
    {
        "character": "Stan",
        "line": "Our... scause?"
    },
    {
        "character": "P.F. Pityef",
        "line": "Well of course! You came for a scause to wear on your paws. And you want others to wear yours upon thaurs."
    },
    {
        "character": "Jesus",
        "line": "I'm confused."
    },
    {
        "character": "P.F. Pityef",
        "line": "Hm. Perhaps I should start from the beginning. [Stan and Jesus look at each other. What follows is a montage of Seussian animation elaborating on the poem below]\nIn the modern age there are those who believe\nThat a cause is a thing to be worn on one's sleeve. [the time frame here is the 1920s, based on the style of dress. everyone has their arms raised to show off their scauses]\nAnd so, we sell a cause. It's called a scause.\nAnd wearing a scause gets you lots of applause. [opens some doors to show some clapping machines]\nWe start with some plastic which is shirped by our shirpist\nThen dip it in colors that show off your purpose.\nThere are green scauses for recycling, blue scauses for kitties, [Animal Rights]\nAnd pink scauses that focus on nothing but titties. [Breast Cancer]\nDo you hate abortion? Ah! Then a white scause is for you! [Pro Life]\nWhy not champion your scause with some sparkles and glue?\nWe make scauses for this! We make scauses for that! [Chilean Miners, then Save The Dolphins, then Stop Water Pollution]\nWhy there's even a scause for just being fat! [Test Subject, with a Tree Hugger on the side]\nWhat's the matter? Can't think of a scause? [talking to Jesus]\nHow about raising awareness for the hairs in your schnozz?\nLet's just think of the thing that you care about most. [talking to Stan, so Belarus]\nThen let's make it orange, like marmalade toast!\nAnd now I'd like to say \"thank you\" for your coming down.\nI'm off to go sell these in your little town!\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Dude, the hell just happen?"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The students mill around in the hallway before class. Mr. Mackey walks among them."
    },
    {
        "character": "Mr. Mackey",
        "line": "Kids? Kids, okay, I need to talk to you about a serious matter. [the group he addresses includes Red, Bebe, Butters, Jimmy, Craig, and Clyde] You probably all noticed my orange wristband [shows it off], mkay? It's to show my solidarity with the people of Belarus. [Stan is at his locker and notices, then turns toward the locker and smiles to himself] Mkay, you should know that the Belarusian government is right now trying to-"
    },
    {
        "character": "Craig",
        "line": "We know, Mr. Mackey. We all have our Belarus bracelets too. [the kids raise their arms to prove it]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh you do? Ya you got you got those? Okay, okay, that's good! Good you're doin' something about it, m'kay. [sees another group of kids and goes towards it] Uh hey kids. Kids over here..."
    },
    {
        "character": "Cartman",
        "line": "[meets the first group] Dude, what's this about orange bracelets? Where do you get them?"
    },
    {
        "character": "Clyde",
        "line": "There's a guy selling them downtown. But they're not made from recycled plastic."
    },
    {
        "character": "Cartman",
        "line": "Dude, I don't give a crap about using recycled plastic!"
    },
    {
        "character": "Clyde",
        "line": "Yes you do. [tugs on the yellow wristband]"
    },
    {
        "character": "Cartman",
        "line": "...Oh, I guess I do care about that. Huh."
    },
    {
        "character": "Butters",
        "line": "[approaches Stan] Hey Stan, well, some people are sayin' that you knew what you were doing all along. That, that you, you cut off your wristband on purpose to shed light on the Belarusian farmers."
    },
    {
        "character": "Stan",
        "line": "People are saying that? [pleased]"
    },
    {
        "character": "Butters",
        "line": "Yeeah. Is it true?"
    },
    {
        "character": "Stan",
        "line": "Wow! You know, whatever it takes, Butters. People are aware of the problems in Belarus; maybe I did it all on purpose or maybe it was just a coincidence."
    },
    {
        "character": "Butters",
        "line": "Heyah, whatever Stan. Yeah I thought you were a butthole, [pokes Stan in the belly] but n-now I think you're a good sneaky little butthole. [smiles, turns and walks away]"
    },
    {
        "character": "Stan",
        "line": "[looks heavenward] We did it. [Butters goes around a corner and out of view]"
    },
    {
        "character": "",
        "line": "The news."
    },
    {
        "character": "Anchor Tom",
        "line": "It has become the biggest concern for most people. The farmers of Belarus and their plight against their government. And now one person is taking it upon himself to end the crisis. His name? Jesus."
    },
    {
        "character": "",
        "line": "Belarus, day, a field. A group of farmers faces bulldozers and tanks."
    },
    {
        "character": "Jesus",
        "line": "These are very troubling times and these farmers are literally fighting for their lives. You know I'm uh, ah-I'm here just to do whatever I can."
    },
    {
        "character": "Field reporter",
        "line": "Jesus, some people might be thinking you're doing this as some kind of a publicity stunt to put to rest the rumors of your drug use?"
    },
    {
        "character": "Jesus",
        "line": "You know, ah I don't even have time to think about that. This is a crisis that needs my attention and I'm just here to do whatever I can. I've talked to the government here and I've talked to the farmers, and I think we have everything just about worked out. [a tank unleashes a bomb and a bunch of farmers are killed]"
    },
    {
        "character": "Farmers",
        "line": "AAAAH!! [the tanks open fire with machine guns; more farmers are killed, until the last one falls]"
    },
    {
        "character": "Jesus",
        "line": "You know, whatever stupid rumors people wanna believe about me, it doesn't change the fact that the people of Belarus need my help."
    },
    {
        "character": "Field reporter",
        "line": "Ah I believe it's Belarus, Jesus."
    },
    {
        "character": "Jesus",
        "line": "Yes, it very well may be if we don't do something now. [the tanks and bulldozers move forward to crush the corpses of the farmers]"
    },
    {
        "character": "Field reporter",
        "line": "Um, so you think you've something here to keep the conflict from escalating, is that right?"
    },
    {
        "character": "Jesus",
        "line": "I'm just doing what I've always done. People wanna know what I'm on. What am I on? I'm on a farm in Belarus busting my ass! What are you on?!"
    },
    {
        "character": "Field reporter",
        "line": "Uh huh, and now that the Belarusian farmers are all dead, what will you try next?"
    },
    {
        "character": "Jesus",
        "line": "What? [turns around] Aw, shit!"
    },
    {
        "character": "",
        "line": "South Park, day. P.F. Pityef is in town and has set up a makeshift Scauses stand on an empty lot between two other buildings. A small crowd is in front of the stand. In the crowd are Cartman, Butters, Craig, and Mr. Mackey"
    },
    {
        "character": "P.F. Pityef",
        "line": "One at a time, please. One at a time."
    },
    {
        "character": "Mr. Mackey",
        "line": "Look, I want to return this orange bracelet, m'kay?! [it looks like everyone else does too.] It's worthless now!"
    },
    {
        "character": "P.F. Pityef",
        "line": "Not a problem, you can return your scause and for just five dollars I'll give you two more!"
    },
    {
        "character": "Cartman",
        "line": "[steps up] Okay, I need a violet one for domestic violence, a lime one for herpes, and a jade green one for how much I hate Kyle."
    },
    {
        "character": "P.F. Pityef",
        "line": "Absolutely! Five dollars please."
    },
    {
        "character": "",
        "line": "Stan stands across the street from the stand, and Kyle walks up to him."
    },
    {
        "character": "Kyle",
        "line": "Heidi Turner said you asked her to borrow superglue last week."
    },
    {
        "character": "Stan",
        "line": "[glares at Kyle] Are you still on that dude?! Have you ever heard of ends justifying means?! [a bouncy noise is heard]"
    },
    {
        "character": "P.F. Pityef",
        "line": "Oh my, it's the sound!"
    },
    {
        "character": "Butters",
        "line": "Wu-what sound?"
    },
    {
        "character": "P.F. Pityef",
        "line": "Of all sounds in all sounddom this one's most profound. [puts his ear against a funnel in which a penny circles round] That's the sound that means I must pack up my tent. It's the sound of the last cent being spent. [quickly goes to a control panel and starts pressing buttons, and his stand collapses into a truck. He gets in and drives off] My work here is done, and just look at you now! You're all covered in scauses from your hoof to your brow. Enjoy all your scauses. You look great in your cause. Be sure to give each other lots of applause. I'm off to the next town in my little truck. Have a nice day! Toot a loo!"
    },
    {
        "character": "Cartman",
        "line": "...Fuck! Dude, weak. [the town is covered in scauses and looks like a Dr. Seuss town]"
    },
    {
        "character": "",
        "line": "Stan's house. Jesus and Stan sit on the sofa looking dejected"
    },
    {
        "character": "Stan",
        "line": "It's almost like... like, that guy had this figured out all along."
    },
    {
        "character": "Jesus",
        "line": "Yeah..."
    },
    {
        "character": "Stan",
        "line": "We were trying to do good. But we got everyone duped by a bracelet company."
    },
    {
        "character": "Jesus",
        "line": "Yeah, well, I guess we're just gonna have to accept that people aren't gonna think very highly of us."
    },
    {
        "character": "Stan",
        "line": "Well... we can't just let that guy get away with taking everyone's money."
    },
    {
        "character": "Jesus",
        "line": "What can we possibly do?"
    },
    {
        "character": "Stan",
        "line": "[after a long while] What would Jesus do? [Rocky fanfare plays and Jesus slowly gets energized. He gets off the sofa and walks to the dining room table, reaches into his robe and pulls out a big bottle of HGH. He plants it on the table and opens it. He pours some into the cap and drinks it. He transforms into a superhuman and flips the dining room table over. He turns and breaks through the front wall, obliterating the front door, and runs off to find the charlatan. Stan looks on] Yeheah! [Jesus goes to the Scauses factory and flips over every truck he finds in his way, then bursts into the factory. He beats up all the workers there]"
    },
    {
        "character": "Jesus",
        "line": "Vengeance is mine! [he destroys the assembly line]"
    },
    {
        "character": "P.F. Pityef",
        "line": "No please! Please show mercy!"
    },
    {
        "character": "Jesus",
        "line": "Get out! [picks him up and shoves him into a grinder. P.F. Pityef is ground up, but his remains clog up the grinder and raise the pressure throughout the factory. Soon the factory blows up. Everyone in town has shown up to see this and burst into applause. Later, Jesus is back to normal and on a small hill - a mount - and speaks to the crowd]"
    },
    {
        "character": "Jesus",
        "line": "Thank you my children. [the crowd quiets down] We've all been through a lot. We got caught up in scauses... that didn't mean squat. They turned my message away from the teachings it hid, and made it about me and the things that I did. Which of course I didn't do. And even if I did use performance-enhancing drugs, so did all the other prophets. But I didn't. So what have we learned from this great wristband theft? Maybe, that when stripped of our scauses, only causes are left. And causes shouldn't be worn on our wrists with a sneer. Let's keep our causes where they belong, which is [places his hands over his heart] right here. On T-shirts! [opens his robe enough to show his cause] Free Pussy Riot! [the crowd begins to clap and cheer]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Free Pussy Riot!"
    },
    {
        "character": "The boys",
        "line": "[look at each other and then] Yeah!"
    }
]