[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "A shot of Denver, Colorado, Tuesday. It's election day, 8:05 in the morning, Mountain Standard Time. At a Baptist church, a line of people waits to vote."
    },
    {
        "character": "Denver poll worker",
        "line": "Okay, Mr. Thompson, voting line is right over there. [Mr. Thompson walks off] Next, please. [Cartman shows up dressed up in his festival best - dress shirt, suspenders, hat with a ribbon on it, and an all-day sucker. He's going to play on the sympathies of the elderly poll workers]"
    },
    {
        "character": "Cartman",
        "line": "Mom? Mommy? Where's my mommy?"
    },
    {
        "character": "Denver poll worker",
        "line": "Oh dear, did you lose your mother, little boy?"
    },
    {
        "character": "Cartman",
        "line": "MOM!"
    },
    {
        "character": "Denver poll worker",
        "line": "Security?"
    },
    {
        "character": "Denver guard",
        "line": "[shuffles up to the poll worker] Heaah?"
    },
    {
        "character": "Denver poll worker",
        "line": "This little boy lost his mom."
    },
    {
        "character": "Cartman",
        "line": "She said to wait for her by the... plastic boxes if I got lost."
    },
    {
        "character": "Denver guard",
        "line": "It's all right, come on. [takes Cartman's hand and walks him away]"
    },
    {
        "character": "",
        "line": "a plane zooms through the sky. Cartman has an aisle seat, and he checks his watch."
    },
    {
        "character": "",
        "line": "North Carolina, 12:18 pm Eastern (or 10:18 am Mountain, for reference). At the Charlotte Community Center, Cartman runs in, still in costume"
    },
    {
        "character": "Cartman",
        "line": "Mom? Where's my mom?"
    },
    {
        "character": "Charlotte poll worker",
        "line": "Oh dear. Did you lose your mommy, little boy?"
    },
    {
        "character": "",
        "line": "a Jetstream Air zooms through the sky. Cartman has a middle seat. A flight attendant walks by and stops."
    },
    {
        "character": "Flight attendant 1",
        "line": "[to the aisle passenger] Would you like some warm nuts, sir?"
    },
    {
        "character": "Cartman",
        "line": "[wriggles in his seat and laughs] \"Warm nuts\", she said."
    },
    {
        "character": "",
        "line": "Florida, 3:40 pm Eastern (or 1:40 pm Mountain). At a polling station in Citrus County, Cartman stops in and clears his throat"
    },
    {
        "character": "Cartman",
        "line": "Mom?! I lost my Mooohhm!"
    },
    {
        "character": "",
        "line": "a plane zooms through the sky. Cartman has an aisle seat again, and a flight attendant walks his way with snacks."
    },
    {
        "character": "Flight attendant 2",
        "line": "Warm nuts, sir? Warm nuts?"
    },
    {
        "character": "Cartman",
        "line": "[breaks into a smile and laughs] No way dude. No way."
    },
    {
        "character": "",
        "line": "Ohio, 5:00 pm CST (The correct time zone should have been Eastern, 3 pm Mountain)"
    },
    {
        "character": "Cartman",
        "line": "MOOOM! I can't find my mooom!"
    },
    {
        "character": "",
        "line": "a plane zooms through the sky. Cartman has a middle seat again, and a flight attendant stops to offer the aisle passenger something."
    },
    {
        "character": "Flight attendant 3",
        "line": "Would you like warm nuts, sir? [the man accepts the nuts and smiles]"
    },
    {
        "character": "Cartman",
        "line": "Ahaha, okay okay it's getting old. [both passenger and attendant frown at him]"
    },
    {
        "character": "",
        "line": "Las Vegas, 3 pm Pacific (4 pm Mountain). Cartman runs through the polling station, and then back"
    },
    {
        "character": "Cartman",
        "line": "MOOOMMM! MOOOMMM!"
    },
    {
        "character": "",
        "line": "Wednesday, the day after, Kyle's house. In the living room, Kyle and Ike sit on the sofa, with Ike crying."
    },
    {
        "character": "",
        "line": "News"
    },
    {
        "character": "Anchor",
        "line": "The people have spoken, and the President of the United States is once again, Barack Obama."
    },
    {
        "character": "President Obama",
        "line": "I assure you all, I am heading back to the White House more motivated - more titillated - than ever. [Ike begins to bawl.]"
    },
    {
        "character": "Kyle",
        "line": "Don't be sad, Ike. Just be happy that you live in a country where people get to elect a president at all. [the phone rings and he answers it.] Hello?"
    },
    {
        "character": "Cartman",
        "line": "[from the Cartman kitchen] Hey Kyle. What's up?"
    },
    {
        "character": "Kyle",
        "line": "Nothing, watching the election results."
    },
    {
        "character": "Cartman",
        "line": "Yeah, I figured. It's the day after the election, so you're probably sitting on the couch telling your little brother how great it is to live in a democratic society. [Kyle glances at Ike.] Listen, Kyle, could you come over for a second? I got somethin' I need to show you."
    },
    {
        "character": "Kyle",
        "line": "What?!"
    },
    {
        "character": "Cartman",
        "line": "Please, Kyle. It's kind of important."
    },
    {
        "character": "",
        "line": "Cartman's house, moments later. Cartman leads Kyle upstairs to his room"
    },
    {
        "character": "Kyle",
        "line": "Alright, what is this all about, fatass?!"
    },
    {
        "character": "Cartman",
        "line": "You happy with the election results last night, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "It doesn't matter if I am or not. People voted and I stand behind the president."
    },
    {
        "character": "Cartman",
        "line": "Oh, that's such a democratic thing to say, Kyle. What if I were to tell you that I have something in my room that could change the entire election? [beams]"
    },
    {
        "character": "Kyle",
        "line": "Sure you do!"
    },
    {
        "character": "Cartman",
        "line": "What if I did, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "Chr, what could you possibly have in your room that could change the outcome of the election? [Cartman smiles and opens his bedroom door, then shows him in. Inside are stacks and stacks of ballots Cartman has stolen from various states: Nevada, Florida, Idaho, Colorado, Virginia, Wisconsin, and North Carolina. Kyle's jaw drops]"
    },
    {
        "character": "Cartman",
        "line": "Pretty sweet, huh?"
    },
    {
        "character": "Kyle",
        "line": "What the hell is this?"
    },
    {
        "character": "Cartman",
        "line": "What's it look like? Hundreds of thousands of votes from all the swing states."
    },
    {
        "character": "Kyle",
        "line": "I don't believe it."
    },
    {
        "character": "Cartman",
        "line": "No, really. There are states full of swingers. Bunch of perverts if you ask me."
    },
    {
        "character": "Kyle",
        "line": "Why do you have these?"
    },
    {
        "character": "Cartman",
        "line": "[walks up to a stack] Funny how voting works in this country, isn't it, Kyle. [holds up a ballot] Each one of these, a person. Someone who actually took the time to get themselves informed. Actually got up and drove to a voting area to make sure their voice was heard. [tears the ballot in two, lets the pieces fall, and fakes a shocked face]"
    },
    {
        "character": "Kyle",
        "line": "Dude!"
    },
    {
        "character": "Cartman",
        "line": "[Walks over to another stack] Here's another patriotic American. He probably spent hours listening to all those presidential ads and tuned in to every debate. [tears up that ballot]"
    },
    {
        "character": "Kyle",
        "line": "Knock it off, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Now, believe it or not, Kyle, I actually need your help. But first you have to promise not to tell anyone."
    },
    {
        "character": "Kyle",
        "line": "You're not getting away with this, you fat turd! [turns around and walks out. Cartman waits a few seconds and walks to his window. He sees Kyle walk to the sidewalk, then turn right and go down the street.]"
    },
    {
        "character": "Cartman",
        "line": "Run now, little firefly. It's all part of the plan."
    },
    {
        "character": "Liane",
        "line": "[steps in] Sweetie, there's a Mr. Pun Li Tsiao on the phone for you?"
    },
    {
        "character": "Cartman",
        "line": "Thanks Mom, [she leaves] I'll take that in the study. Do I have a study? I don't think I have a study. That's fine."
    },
    {
        "character": "",
        "line": "The White House, day. A Secret Service agent runs down the hall towards the Oval Office, opens the doors, and goes in"
    },
    {
        "character": "Agent",
        "line": "Mr. President?"
    },
    {
        "character": "President Obama",
        "line": "Yes?"
    },
    {
        "character": "Agent",
        "line": "Line 2 from China for you, sir. It's General Tso."
    },
    {
        "character": "President Obama",
        "line": "[picks up the receiver and presses the Line 2 button] Yes, hello General."
    },
    {
        "character": "General Tso",
        "line": "We assume you are preased with the erection results?"
    },
    {
        "character": "President Obama",
        "line": "Very pleased. Thank you for your help."
    },
    {
        "character": "General Tso",
        "line": "And you no doubt will now begin filling your side of the bargain."
    },
    {
        "character": "President Obama",
        "line": "You'll have what you want. I'll meet you in three hours. [hangs up and slumps in his chair a little]"
    },
    {
        "character": "Agent",
        "line": "Sir, the election may have gone the way they said, but we can't possibly give the Chinese what you promised."
    },
    {
        "character": "President Obama",
        "line": "[rises and goes to a window] I don't know how they did it, but the Chinese secured my victory. I have to fulfill my obligation."
    },
    {
        "character": "Agent",
        "line": "And what if General Tso suddenly gets the courage to go to the press with all this?"
    },
    {
        "character": "President Obama",
        "line": "Don't worry. Everyone knows General Tso's chicken."
    },
    {
        "character": "",
        "line": "Cartman's house, day. Kyle is at the front door with two police officers. One of the officers knocks, and Cartman answers the door."
    },
    {
        "character": "Officer 1",
        "line": "Eric Cartman? We have a report you might be involved in voter fraud?"
    },
    {
        "character": "Cartman",
        "line": "[strokes his chin] Hmmm, no."
    },
    {
        "character": "Officer 2",
        "line": "You mind if we search your room?"
    },
    {
        "character": "Cartman",
        "line": "I'm sorry, but I know my rights. You can't search my room without a warrant. And I'm afraid I can't give you permission."
    },
    {
        "character": "Kyle",
        "line": "This isn't a joke, Cartman! You have to believe me, officer. The outcome of the election depends on it."
    },
    {
        "character": "Officer 1",
        "line": "Let's just see. [the officers go in, and Kyle follows]"
    },
    {
        "character": "Cartman",
        "line": "Ey! You can't do that! Ey!"
    },
    {
        "character": "Kyle",
        "line": "Upstairs! First door to the left!"
    },
    {
        "character": "",
        "line": "Upstairs. The officers have reached Cartman's room. Officer 1 opens the door"
    },
    {
        "character": "Cartman",
        "line": "I know my rights! Stop right now! [Kyle and the officers go in... and find nothing]"
    },
    {
        "character": "Kyle",
        "line": "But... they were here. Ah I swear it. Stacks and stacks of ballots from states all over the country!"
    },
    {
        "character": "Cartman",
        "line": "I was always told that... we lived in a country based on freedom. That the one thing that made America different was that government could never barge into our lives unwarranted. But it's all changing, isn't it? Ever since Obama was first elected, it's all changing."
    },
    {
        "character": "Officer 2",
        "line": "Oh my God, what have we done?"
    },
    {
        "character": "Officer 1",
        "line": "Guess this country is changing. We're sorry little boy, we're SO sorry. [The officers walk out]"
    },
    {
        "character": "Kyle",
        "line": "Please you've, you've got to believe me! They've still gotta be here somewhere! Uh we've got to find them!"
    },
    {
        "character": "Cartman",
        "line": "But where could they be? Where? And why would I care so much about the election results? So may questions, Kyle. So... little time. [Kyle turns right and runs down the stairs]"
    },
    {
        "character": "",
        "line": "The neighborhood park, day. Seven kids are shown playing basketball: Timmy and Jimmy are there, as are Stan, Tolkien, Craig, Butters, and Kenny. Stan has the ball and tosses it to Craig, who makes a basket. Butters catches the ball. In the background, Kyle runs up to the entrance"
    },
    {
        "character": "Kyle",
        "line": "Guys! You guys! [runs into the group] Listen: Cartman has tens of thousands of voter ballots hidden somewhere. He's changed the outcome of the election!"
    },
    {
        "character": "Stan",
        "line": "Wow, really? That's pretty impressive."
    },
    {
        "character": "Kyle",
        "line": "Come on guys! He's hidden them somewhere and we have to find them!"
    },
    {
        "character": "Stan",
        "line": "But I thought Obama won pretty easily last night."
    },
    {
        "character": "Kyle",
        "line": "Dude, because of the electoral college these votes in swing states can really matter."
    },
    {
        "character": "Stan",
        "line": "I don't understand that stuff at all. I need Morgan Freeman to explain it to me."
    },
    {
        "character": "Jimmy",
        "line": "Yeah, I love when Morgan Freeman explains stuff."
    },
    {
        "character": "Craig",
        "line": "Whenever I'm confused about what's going on in a movie, I'm always so relieved when Morgan Freeman shows up and explains the plot to me."
    },
    {
        "character": "Kyle",
        "line": "God damn it this is serious, you guys! Cartman has stolen the election!"
    },
    {
        "character": "Butters",
        "line": "Well, mmmaybe Cartman had a good reason."
    },
    {
        "character": "Kyle",
        "line": "[stares at Butters for a while] Butters, you know something, don't you?!"
    },
    {
        "character": "Butters",
        "line": "Huh? Wha? NO. Uhuh, why?"
    },
    {
        "character": "Kyle",
        "line": "[walks towards Butters] What did Cartman tell you?!"
    },
    {
        "character": "Butters",
        "line": "He didn't tell me nothin'. Annd I'm sworn to secrecy. Ih-it's really important, Kyle, and it isn't what you think. [glances over his shoulder and gasps] Uh, don't make me say any more!"
    },
    {
        "character": "Kyle",
        "line": "Tell us what you know right now!"
    },
    {
        "character": "Butters",
        "line": "I can't! Don't you see?! [feels around his body for something, and finally finds it: a small bottle. He opens it up and pulls out a blue M&M.] Don't make me swallow this! Wa-I'll do it"
    },
    {
        "character": "Stan",
        "line": "Is that an M&M?"
    },
    {
        "character": "Butters",
        "line": "[his voice trembles] It's an almond M&M. Ah-I'm very allergic to almonds. Please, just leave me alone."
    },
    {
        "character": "Kyle",
        "line": "Then you have to tell us!"
    },
    {
        "character": "Butters",
        "line": "Well... hah... HWAAAH! [quickly swallows the pill and makes sure he doesn't throw up]"
    },
    {
        "character": "Kyle",
        "line": "Oh shit! Don't let him swallow it! [Butters falls back, stiff]"
    },
    {
        "character": "Stan",
        "line": "Pry his mouth open!"
    },
    {
        "character": "Craig",
        "line": "He ate it!"
    },
    {
        "character": "Kyle",
        "line": "Butters, where are the ballots going?! Where are they going?!"
    },
    {
        "character": "Butters",
        "line": "Ah! Bah! I hate almonds. [passes out]"
    },
    {
        "character": "",
        "line": "Red Lobster, later. Cartman is at a table eating lobster legs. He's working on one plate while three others and a bucket of lobster legs await his appetite"
    },
    {
        "character": "Waitress",
        "line": "More melted butter, sir?"
    },
    {
        "character": "Cartman",
        "line": "Mm, mhm, mhm."
    },
    {
        "character": "General Tso",
        "line": "[lets out an exasperated sigh] Little boy, the President is on his way to pick up the ballots. Where are they?!"
    },
    {
        "character": "Cartman",
        "line": "They're nearby. Very safe and sound. I just might want to... alter our deal a little bit."
    },
    {
        "character": "General Tso",
        "line": "Alter our... The President will be here in moments with what we want!"
    },
    {
        "character": "Cartman",
        "line": "Yes. Tell me again exactly what you plan on doing with it?"
    },
    {
        "character": "A Diner",
        "line": "Oh my God, it's the President! [the President comes in with his Secret Service detail and diners come up to greet him]"
    },
    {
        "character": "President Obama",
        "line": "Thank you, thank you all for your votes of confidence. If I could... just be a little rude and ask for a nice quiet meal in private?"
    },
    {
        "character": "Diner 1",
        "line": "Oh, of course. Come on, let's let the President have some peace and quiet. [the diners begin to leave the restaurant]"
    },
    {
        "character": "Diner 2",
        "line": "Wow, the President eats at Red Lobster. He's just a normal guy like me."
    },
    {
        "character": "Diner 3",
        "line": "Come on guys. President says \"get out.\" [chuckles]"
    },
    {
        "character": "Diner 4",
        "line": "I didn't actually vote for him. [chuckles. Two agents guard the doors until the diners are gone, then close the doors, while two other agents join President Obama at the table]"
    },
    {
        "character": "President Obama",
        "line": "All right. Where are the ballots? [Cartman cracks open a lobster leg.]"
    },
    {
        "character": "",
        "line": "The ER, somewhere, day. The boys are there to visit Butters and the doctor is with them."
    },
    {
        "character": "Doctor",
        "line": "Your friend has had a severe allergic reaction."
    },
    {
        "character": "Kyle",
        "line": "Can we please just try and talk to him?"
    },
    {
        "character": "Doctor",
        "line": "All right, but don't take too long. [the boys go in]"
    },
    {
        "character": "Butters",
        "line": "[hard to understand with his face puffed up] What's up fellas?"
    },
    {
        "character": "Kyle",
        "line": "Butters, you have to tell us what Cartman is up to!"
    },
    {
        "character": "Butters",
        "line": "Bleh, ogayedmi."
    },
    {
        "character": "Kyle",
        "line": "I didn't wanna have to do this. [opens his flip phone and presses some keys] but if you don't tell us, I'm gonna tell your dad you helped get the wrong person elected President!"
    },
    {
        "character": "Butters",
        "line": "AGH! No! Please! You can't!"
    },
    {
        "character": "Kyle",
        "line": "Then just tell me what Cartman is up to!"
    },
    {
        "character": "Butters",
        "line": "Okay! Okay! He's helping the Chinese get something they want."
    },
    {
        "character": "Stan",
        "line": "What'd he say? [Kenny mumbles his reply and Stan understands that] Oh. Well what do you mean the election isn't the biggest thing that happened this week?"
    },
    {
        "character": "Butters",
        "line": "Because the Chinese actually want to protect something that's important."
    },
    {
        "character": "Kyle",
        "line": "What? [Kenny mumbles his translation] You mean the missile defense program?! [to Butters] Butters, where's Cartman supposed to hand over the ballots?!"
    },
    {
        "character": "Butters",
        "line": "At Red Robster. [Kyle looks at Kenny]"
    },
    {
        "character": "Kenny",
        "line": "(At Red Lobster.)"
    },
    {
        "character": "Kyle",
        "line": "[still not getting it] Where?"
    },
    {
        "character": "Butters",
        "line": "[enunciating as best he can] Red Lobster!"
    },
    {
        "character": "Stan",
        "line": "Huh?"
    },
    {
        "character": "Jimmy",
        "line": "He said \"at Ruh ruh rruh ruh Reh Red\""
    },
    {
        "character": "Butters",
        "line": "[enunciating as best he can] Red Lobster!"
    },
    {
        "character": "Kenny",
        "line": "(Red Lobster!)"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Jimmy",
        "line": "Ruh Rehh... Red"
    },
    {
        "character": "Butters",
        "line": "[stressing] Red Lobster!"
    },
    {
        "character": "Kenny",
        "line": "(Red Lobster!)"
    },
    {
        "character": "Stan",
        "line": "Oh, Red Lobster."
    },
    {
        "character": "",
        "line": "Red Lobster, later. The high-level meeting continues"
    },
    {
        "character": "President Obama",
        "line": "General Tso, do you have the missing ballots or not?"
    },
    {
        "character": "General Tso",
        "line": "Sssure, we have the ballots, but we don't have them right here with us now. [Obama looks at the general, then glances at Cartman]"
    },
    {
        "character": "President Obama",
        "line": "Okay, you want me to come in again, we can start over, what the fuck is this?!"
    },
    {
        "character": "Kyle",
        "line": "All right, where are the missing ballots?! [noticing the President] President Obama?"
    },
    {
        "character": "Cartman",
        "line": "Oh God damn it Kyle, I was just about to get what I wanted."
    },
    {
        "character": "General Tso",
        "line": "Mr. President, we got you reelected! Now you will give us the Star Wars technology so that we can make the sequels!"
    },
    {
        "character": "President Obama",
        "line": "I told you China would get the rights to Star Wars from Disney as long as my Presidency was secure! [looks at Cartman] Until I have those ballots [looks at the general] it is not secure!"
    },
    {
        "character": "Kyle",
        "line": "Wait a minute, the rights to Star Wars, the movies? What the hell is going on here?!"
    },
    {
        "character": "Morgan Freeman",
        "line": "[voice only] What's going on is the sale of America's greatest asset. [music plays as he walks into view] You see, when the United States created Star Wars it made this country incredibly powerful."
    },
    {
        "character": "General Tso",
        "line": "Morgan Freeman?"
    },
    {
        "character": "Morgan Freeman",
        "line": "[pacing back and forth] Earlier this week, Lucas signed the rights to Star Wars over to Disney, and the Chinese saw a way to obtain it for themselves. The Chinese government knew that President Obama would help them take the rights from Disney if they helped him get reelected."
    },
    {
        "character": "Craig",
        "line": "Ohhhh."
    },
    {
        "character": "Morgan Freeman",
        "line": "But the child who actually stole the ballots has hidden them, and won't give them to anyone until his demands are met. You've all got quite a mess on your hands. I wish you well with it. [turns around and goes back the way he came in]"
    },
    {
        "character": "Stan",
        "line": "Hey just one thing, Morgan Freeman: [Freeman turns around and faces the group] How come every time something convoluted needs explaining, you show up?"
    },
    {
        "character": "Morgan Freeman",
        "line": "Because every time I show up and explain something, I earn a freckle. [a sparkle lights up on his right cheek as a small bell sounds, fades, and leaves a new freckle there. He turns around and resumes his departure]"
    },
    {
        "character": "Cartman",
        "line": "So here's the deal, General Tso, Mr. President, when the Chinese make the sequels, I get to play the part of Luke Skywalker's son. Cartman Skywalker."
    },
    {
        "character": "General Tso",
        "line": "That was not the deal! We will not be a-bullied by you!"
    },
    {
        "character": "Cartman",
        "line": "Well then, I guess we're about to play a game of Chicken, General Tso. [takes out a small ball-shaped bomb, smashes it against the table, and disappears in the resulting smoke.]"
    },
    {
        "character": "Jimmy",
        "line": "Heheh, I get it. General Tso's chih-chih-chicken."
    },
    {
        "character": "",
        "line": "Two secret service agents walk down a hallway somewhere"
    },
    {
        "character": "Mike",
        "line": "You are absolutely sure about this?"
    },
    {
        "character": "Agent 2",
        "line": "It's been confirmed, Mike. My God, we might have won this thing. [they reach the end of the hall]"
    },
    {
        "character": "Mike",
        "line": "[knocks three times, then opens the double doors and goes in] Sir? Sir, we have some... incredible news. There are rumors of hundreds of thousands of stolen ballots. You might have won the election after all. [Duck President is shown. He lets out a loud quack with shit spewing out his mouth]"
    },
    {
        "character": "",
        "line": "Cartman's house, evening. Stan, Kyle, Kenny, and Tolkien are in Cartman's living room rummaging through boxes of clothes looking for the ballots. Craig rips open the sofa cushions to look for them"
    },
    {
        "character": "Stan",
        "line": "There's nothing here, Kyle. [Jimmy walks in from the dining room]"
    },
    {
        "character": "Kyle",
        "line": "Anything in the basement, Jimmy?"
    },
    {
        "character": "Jimmy",
        "line": "Just old junk, and boxes of Eric's mom's d-dildos"
    },
    {
        "character": "Kyle",
        "line": "Well keep looking."
    },
    {
        "character": "Liane",
        "line": "[walks in with some items] Oh my goodness, what's going on?"
    },
    {
        "character": "Kyle",
        "line": "Sorry Ms. Cartman, but your son took some things that didn't belong to him."
    },
    {
        "character": "Liane",
        "line": "Oh, I've told him to respect people's property. What did he take?"
    },
    {
        "character": "Stan",
        "line": "He stole ballots in all the swing states so the wrong person was elected President."
    },
    {
        "character": "Liane",
        "line": "[walks towards the kitchen] Oh well, no TV for him for a few days."
    },
    {
        "character": "Jimmy",
        "line": "There's nothing here, Kyle. Not even one s-s-scooby clue."
    },
    {
        "character": "Stan",
        "line": "Oh my God you guys, look! [points across the street. The boys walk out as the sound of a large vehicle is heard] Dude, it's Boba Fett's ship! [Indeed. The ship arrives and positions itself for landing, then descends onto the road. After a big thud, the ship's door opens... and out swaggers Mickey Mouse]"
    },
    {
        "character": "Mickey Mouse",
        "line": "Just what the Dickens is going on here, haha?!"
    },
    {
        "character": "Stan",
        "line": "Aw shit, it's him again."
    },
    {
        "character": "Mickey Mouse",
        "line": "What's this about a deal with the Chinese?! I own all this shit now! I own the Death Star! I own Tatooine! It's all MINE, haha! All right fuckers, where are the missing ballots? Haha."
    },
    {
        "character": "",
        "line": "The hospital, night. Butters is still in recovery, and his face is still puffy. He's asleep"
    },
    {
        "character": "Cartman",
        "line": "Butters. [Butters jumps up and is wide awake] You just couldn't keep your mouth shut, could you Butters?"
    },
    {
        "character": "Butters",
        "line": "I didn't say anything. I promise."
    },
    {
        "character": "Cartman",
        "line": "I guess we learned that when it comes to Star Wars, we can't trust anyone. Not the President, not the Chinese, and not you."
    },
    {
        "character": "Butters",
        "line": "Please, Eric! I tried to be quiet, I swear!"
    },
    {
        "character": "Cartman",
        "line": "Shhh, it's okay, Butters. [brings forth an M&M bag and opens it] Nobody's gonna find the election ballots. [pulls out a blue almond M&M.] I have them hidden away somewhere... nobody would ever look. [places the M&M in Butters' mouth and closes it] A place in town people barely even know exists."
    },
    {
        "character": "",
        "line": "A Hummer outdoor dealership. The salesman stands around waiting for customers. Behind him is a lot full of pristine Hummers"
    },
    {
        "character": "Salesman",
        "line": "Hey guys. Lookin' to buy a Hummer today? [a family leaving the KFC across the street heads for its car in the KFC parking lot] We're havin' a Rocktober sales event day that's goin' into Rockvember. [the family piles into the car, the father starts it, and the family drives away. The salesman watches the family leave, then turns around and walks to a different spot - next to the missing ballots.] Hey there! Interested in test-drivin' a Hummer today? [a lone man walks slowly down the sidewalk on a cross street. Mr. Hummer takes out his hands and starts gesturing] I can see you, with the Ray-Bans, got that nice bicep haning' out the window rolled down, whattaya think? [the man looks at him, then begins to walk faster] Rockvember sales event, guys! Every Hummer comes with a free Segway."
    },
    {
        "character": "Café Monet diner",
        "line": "[at a Café Monet across a third street.] Hey why don't you shut up?!"
    },
    {
        "character": "Salesman",
        "line": "I'm just excited about all these deals, that's all. [puts his hands in his pockets]"
    },
    {
        "character": "",
        "line": "Disneyland, night. The park has closed. AT-STs patrol the grounds as TIE fighters zoom by overhead. Mickey walks through Cinderella's castle towards a door as it opens upward and reveals two storm troopers escorting Cartman, in handcuffs, to him"
    },
    {
        "character": "Storm Trooper",
        "line": "We found him sir, but still no sign of the missing ballots."
    },
    {
        "character": "Mickey Mouse",
        "line": "Go on! Leave us alone! Haha. [the storm troopers step outside and the door comes down behind them. Mickey and Cartman walk away from the door] Now listen, little boy, the reason this country works is because people go out to vote. Every vote counts. And you need-"
    },
    {
        "character": "Cartman",
        "line": "Cut the crap, Mouse! You only care about the election results because Romney would have been tougher on the Chinese!"
    },
    {
        "character": "Mickey Mouse",
        "line": "Why don't you just tell me where the missing ballots are?! It will make your death a lot less painful! Haha."
    },
    {
        "character": "Cartman",
        "line": "Trust me: they're somewhere nobody will ever find them! If you kill me, then Obama will stay President and you will lose Star Wars to the Chinese forever!"
    },
    {
        "character": "Mickey Mouse",
        "line": "[whips out his light saber] Pretty neat, huh? How would you like to have one?"
    },
    {
        "character": "Cartman",
        "line": "I can get those at K-Mart! If you want me to switch sides, you'll have to do better than that!"
    },
    {
        "character": "Mickey Mouse",
        "line": "[turns off his light saber] Like what?!"
    },
    {
        "character": "Cartman",
        "line": "I want a part in the new movies!"
    },
    {
        "character": "Mickey Mouse",
        "line": "[brightens up] Well then, why didn't you just come to me in the first place? If you wanna be in the next Star Wars, I'm your guy! Haha."
    },
    {
        "character": "Cartman",
        "line": "I get to be Luke Skeywalker's son. And there has to be a character called Jewbacca."
    },
    {
        "character": "Mickey Mouse",
        "line": "You can be Luke's son, you can be Han Solo's son, I don't give two shits and a popsicle."
    },
    {
        "character": "Cartman",
        "line": "Really? Well then, I suppose that making the votes public IS the right thing to do. I can get the ballots for you. But if I'm gonna smuggle them here, I'm gonna need a blaster and a tauntaun."
    },
    {
        "character": "Mickey Mouse",
        "line": "Sure thing. I've got tauntauns comin' out my asshole, haha."
    },
    {
        "character": "Cartman",
        "line": "Haha."
    },
    {
        "character": "Mickey Mouse",
        "line": "Haha."
    },
    {
        "character": "Cartman",
        "line": "Haha. [and a new partnership is formed.]"
    },
    {
        "character": "",
        "line": "Breaking Election News."
    },
    {
        "character": "Wolf Blitzer",
        "line": "This is Breaking Election News. Hold that phone! The election may be over, but rumors are running rampant that hundreds of thousands of ballots for Mitt Romney were stolen!"
    },
    {
        "character": "Kyle",
        "line": "[with a field reporter at City Hall, with the other boys behind them] We need everyone's help here. What you're looking for are big boxes of ballots. Hundreds of them. Please check your basement, your attic, and-"
    },
    {
        "character": "Field reporter",
        "line": "And and you claim that a General Tso hired your friend, Fatass, to steal the ballots, but so far the Chinese are refusing to speak with us."
    },
    {
        "character": "Kyle",
        "line": "Yeah, probably 'cause General Tso's chicken. [sirens and bells sound]"
    },
    {
        "character": "Field reporter",
        "line": "Is that it? Did he just? Did he just?"
    },
    {
        "character": "Wolf Blitzer",
        "line": "Yup. Chris, we're getting confirmation that was the millionth time."
    },
    {
        "character": "Chris",
        "line": "Excitement and revelry at South Park as a little boy has just made the General Tso's chicken joke for the one millionth time. [confetti and balloons float down from the sky]"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Field reporter",
        "line": "Little boy, the General Tso's chicken joke, a favorite for years, you've just hit the magic number, how does it feel?"
    },
    {
        "character": "Kyle",
        "line": "[quite confused] I... what? [a woman comes in from screen left with a check for five thousand dollars from P.F. Chang while another woman comes in from screen left with a sign saying \"ONE MILLION TIMES!!!!!\"]"
    },
    {
        "character": "Field reporter",
        "line": "He's being presented with the check now, a five thousand dollar gift certificate to P.F. Chang's. [Kyle holds the check up and the reporter gets closer to the camera] This has been a long campaign, but someone's finally done it, Wolf."
    },
    {
        "character": "",
        "line": "South Park, later. The boys are sitting on the curb near Tele's, eating Chinese food"
    },
    {
        "character": "Stan",
        "line": "Well, we tried, dude."
    },
    {
        "character": "Kyle",
        "line": "It just seems so unfair. People won't ever even know that the wrong man is in the White House."
    },
    {
        "character": "Stan",
        "line": "Well, I mean, look at it this way: Almost half the country did actually vote for Obama. If the election really just came down to a bunch of boxes Cartman stole, then, does it matter that much?"
    },
    {
        "character": "Kyle",
        "line": "It matters, Stan. It it matters."
    },
    {
        "character": "A Santa",
        "line": "[voice only] Ho ho ho hoo! [Kyle glances at the TVs and walks over to get a better look] Come on down to Stevenson Hummer for our big Christmas in Humvember Sale! [same dealership as earlier, with Mr. Hummer wearing Santa facial hair and cap, ringing a bell and shaking a rattle stick] Not sure what to get your loved one this holiday season? Why not give them a nice Hummer? Nothing beats a Hummer on Christmas morning! [dances a bit. Stan joins him at Tele's picture window]"
    },
    {
        "character": "Stan",
        "line": "Stan, when was the last time you saw somebody drive a Hummer?"
    },
    {
        "character": "Stan",
        "line": "Uhhh, forever ago, like, 2010?"
    },
    {
        "character": "Kyle",
        "line": "[realizing where the ballots could be] Oh my God."
    },
    {
        "character": "",
        "line": "Stevenson's Hummer, day. A diner leaves Café Monet and walks down the street."
    },
    {
        "character": "Mr. Stevenson",
        "line": "[the salesman] Hey, looking for a Hummer today? Got some 2009s here. Never been driven. ...Ever. [a crow lands on a blue Hummer. Mr. Stevenson notices, turns around and moves towards it] Go on, get out of here! Shoo! [the crow leaves as Kyle and friends show up and enter the lot]"
    },
    {
        "character": "Kyle",
        "line": "Look! There they are!"
    },
    {
        "character": "Mr. Stevenson",
        "line": "Hey, hi there! You kids like Hummers, huh? Let me show you these babies!"
    },
    {
        "character": "Kyle",
        "line": "We found it, you guys! [hears some vehicles showing up and looks] Oh no, they followed us! [several black cars pull up and the Chinese pour out of them]"
    },
    {
        "character": "Mr. Stevenson",
        "line": "Oh hell yes! Asians! Hey guys!"
    },
    {
        "character": "General Tso",
        "line": "Get out of our way!"
    },
    {
        "character": "Kyle",
        "line": "No! These don't belong to you! They belong to the people!"
    },
    {
        "character": "General Tso",
        "line": "[pulls out a pistol from his pocket and aims it at Kyle] I am tired of playing games! This little farce is ovah! [a shot from a ray gun obliterates the pistol]"
    },
    {
        "character": "Cartman",
        "line": "[on a tauntaun] I don't think so, General Tso! This way, officers! [police cars show up]"
    },
    {
        "character": "Mr. Stevenson",
        "line": "Oh my God it's a sales rush! [the police pour out of their cars]"
    },
    {
        "character": "Officer 2",
        "line": "Oh my God. Are those what I think they are?"
    },
    {
        "character": "Cartman",
        "line": "Yes, we must show these to the public! For democracy's sake, right Kyle?"
    },
    {
        "character": "Officer 3",
        "line": "Sir, we've found something, at the Hummer sales lot outside of town."
    },
    {
        "character": "General Tso",
        "line": "You don't understand. We are trying to protect the greatest film series ever made!"
    },
    {
        "character": "Kyle",
        "line": "Protect it?"
    },
    {
        "character": "Officer 4",
        "line": "What the hell is going on here?!"
    },
    {
        "character": "Morgan Freeman",
        "line": "[voice only. The officers all face him] Perhaps I can explain it to you. [appears between the Hummers and walks up to the group] You see, it turns out the only reason the Chinese so desperately wanted Star Wars is because they're afraid that Disney might not be the right place for it. The Chinese simply want to guard Star Wars impeccable legacy."
    },
    {
        "character": "Officer 5",
        "line": "Is that Morgan Freeman?"
    },
    {
        "character": "Morgan Freeman",
        "line": "And now we're at a crossroads. If these ballots are made public, then the man the people voted for will be President, but he will no doubt keep Star Wars from the Chinese, and allow Disney to keep it instead. And so we have to ask ourselves, \"What's more important? That the right man is elected President, or that Star Wars is with people who will protect it most?\" [six new freckles appear on his face, and he caresses his right cheek]"
    },
    {
        "character": "An Officer",
        "line": "[through a walkie-talkie] Unit 4, what is it?! Over."
    },
    {
        "character": "Officer 1",
        "line": "Well kid?"
    },
    {
        "character": "Kyle",
        "line": "Well... if you put it that way..."
    },
    {
        "character": "An officer",
        "line": "Come in Unit 4! What have you found?!"
    },
    {
        "character": "Officer 1",
        "line": "Nothing sir. We just found some tremendous deals on cars nobody wants, that's all. Barkley out. [Stan walks up to the ballots with a match, strikes the match against the asphalt and lights it, and sets fire to the ballots]"
    },
    {
        "character": "Cartman",
        "line": "No! But Obama wasn't really elected! Don't you people care?! [the Chinese, the police officers, and the boys all hold hands around the bonfire and begin to chant]"
    },
    {
        "character": "Group",
        "line": "Obama is President again. [as the smoke gathers in the sky, a real-life image of President Obama appears and sways slowly back and forth.]\n\n\n"
    }
]