[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Henrietta's room, night. She's holding a dramatic Edgar Allan Poe reading there with her fellow Goths. On a small table nearby sits three candles, two books, a statue, and a black and white picture of a freak show with a sign on it: HUMAN FREAK EXHIBIT"
    },
    {
        "character": "Henrietta",
        "line": "So I cast my body into the trails of blood.\nThe knife pierces deep, deep into my lonely eyes.\nSo I can see this black world... no more.\n\n\n"
    },
    {
        "character": "Pete",
        "line": "Whoa... That's pretty hardcore. [taps some ashes off his cigarette into his ashtray, then flips his hair]"
    },
    {
        "character": "Michael",
        "line": "That's real pain right there. [taps some ashes off his cigarette into his ashtray]"
    },
    {
        "character": "Henrietta",
        "line": "That's how I feel when my mother abuses me. I just wanna escape, so she can't hurt me anymore. [Mrs. Biggle knocks three times on Henrietta's door, then opens it]"
    },
    {
        "character": "Mrs. Biggle",
        "line": "[sing song] Henrietta, sweetie."
    },
    {
        "character": "Henrietta",
        "line": "[glares at her] Shut up, Mom! Go away!"
    },
    {
        "character": "Mrs. Biggle",
        "line": "Oh, but remember, Daddy wanted to talk to you in the living room, my dark little princess."
    },
    {
        "character": "Henrietta",
        "line": "Stop calling me a princess! I'm not a beauty queen in a Disney movie!"
    },
    {
        "character": "Mrs. Biggle",
        "line": "We'll be waiting in the living room."
    },
    {
        "character": "Henrietta",
        "line": "[rolls her eyes] God, she just never stops!"
    },
    {
        "character": "",
        "line": "The living room, moments later."
    },
    {
        "character": "Mrs. Biggle",
        "line": "Oh goodness I am so nervous. [Henrietta enters the living room]"
    },
    {
        "character": "Henrietta",
        "line": "What?!"
    },
    {
        "character": "Mr. Biggle",
        "line": "Have a seat, Henrietta. [Henrietta sits on the chair]"
    },
    {
        "character": "Mrs. Biggle",
        "line": "Oh, a little family chit-chaaat."
    },
    {
        "character": "Henrietta",
        "line": "Shut up, Mom!"
    },
    {
        "character": "Mr. Biggle",
        "line": "Henrietta, as you know, your mother and I have been concerned about your behavior for some time."
    },
    {
        "character": "Henrietta",
        "line": "Are we really doing this again?!"
    },
    {
        "character": "Mr. Biggle",
        "line": "We've had a hard time coping with the dark things you're into, but we've finally had some counseling, and apparently we're not the only parents who have a child that is... emo."
    },
    {
        "character": "Henrietta",
        "line": "What?!"
    },
    {
        "character": "Mrs. Biggle",
        "line": "But Daddy and I love our little muffin, even if she's emo or not."
    },
    {
        "character": "Henrietta",
        "line": "I'm not a fucking emo! Don't you even know the fucking diff!"
    },
    {
        "character": "Mr. Biggle",
        "line": "Do you know how your foul language breaks your mother's heart?"
    },
    {
        "character": "Mrs. Biggle",
        "line": "Like calling Mommy Demon Jizz."
    },
    {
        "character": "Mr. Biggle",
        "line": "So listen, sweetie, we've found a camp. [her mom brings out a brochure]"
    },
    {
        "character": "Henrietta",
        "line": "Noo..."
    },
    {
        "character": "Mr. Biggle",
        "line": "A camp which is for troubled kids like you, and you get to work outside and learn about responsibility."
    },
    {
        "character": "Henrietta",
        "line": "[stands up, ready to leave the room] I'm not going to any fucking camp!"
    },
    {
        "character": "Mr. Biggle",
        "line": "It's for two weeks, and when you come back we can talk about earning back some of your privileges."
    },
    {
        "character": "Henrietta",
        "line": "I won't come back because I'll be fucking dead. I'll walk out of that camp and I'll walk the streets until I probably get picked up and gangbanged by criminals until I'm bleeding out my fucking eyes!!"
    },
    {
        "character": "Mrs. Biggle",
        "line": "Theeeey have a horseshoe pit where you can challenge the other kids to horsehoooes."
    },
    {
        "character": "",
        "line": "The loading dock at the side of the school, day, the goths' usual gathering spot"
    },
    {
        "character": "Pete",
        "line": "And that's all you know? what else did she say?"
    },
    {
        "character": "Michael",
        "line": "She said that her parents called her an emo and she had to go to this camp for two weeks."
    },
    {
        "character": "Pete",
        "line": "[flips hair] Oh my God, for two weeks?"
    },
    {
        "character": "Firkle",
        "line": "Is she at the camp now?"
    },
    {
        "character": "Michael",
        "line": "I don't know. [scrolls through his text messages] She texted from the bus they put her on, then she said she wasn't even allowed to have her cell phone where she was going. Then all of a sudden her texts went dark."
    },
    {
        "character": "Pete",
        "line": "[softly] Whoa..."
    },
    {
        "character": "Firkle",
        "line": "That's fucking creepy man."
    },
    {
        "character": "Michael",
        "line": "[gets up and walks a bit] I just can't believe it. I can't believe parents would do that to their child."
    },
    {
        "character": "",
        "line": "Child Protective Services, day. The three remaining Goths go to talk to a worker there"
    },
    {
        "character": "Worker",
        "line": "Alright now, you say that you witnessed your friend being abused by her parents."
    },
    {
        "character": "Michael",
        "line": "Yes. They called her an emo."
    },
    {
        "character": "Worker",
        "line": "What's wrong with that?"
    },
    {
        "character": "Michael",
        "line": "Emos suck! They're vile, self-pitying, depressed assholes!"
    },
    {
        "character": "Worker",
        "line": "So, why do you think they called her that?"
    },
    {
        "character": "Michael",
        "line": "Because she's Goth, and some ignorant people don't know the difference!"
    },
    {
        "character": "Worker",
        "line": "What is the difference?"
    },
    {
        "character": "Pete",
        "line": "Oh my God! They're totally different!"
    },
    {
        "character": "Worker",
        "line": "Okay, different how?"
    },
    {
        "character": "Pete",
        "line": "They're, uhm, you know, one is good and- and emos are horrible! [flips hair] They're, you know... They're posers!"
    },
    {
        "character": "Firkle",
        "line": "Emos suck my Goth balls."
    },
    {
        "character": "Michael",
        "line": "Alright alright, think of it this way: a goth believes that deep down the world is totally fucked up. But an emo thinks that deep down, they are totally fucked up."
    },
    {
        "character": "Worker",
        "line": "That's not much of a difference."
    },
    {
        "character": "Pete",
        "line": "That's a huge fucking difference!"
    },
    {
        "character": "Michael",
        "line": "Okay okay, look, emos are more prone to suicide."
    },
    {
        "character": "Pete",
        "line": "This fuckin' bitch, man."
    },
    {
        "character": "Michael",
        "line": "But goths are more prone to be depressed that so many people commit suicide."
    },
    {
        "character": "Pete",
        "line": "Goth's darkness is nihilistic whereas Emo's is cynical."
    },
    {
        "character": "Michael",
        "line": "Wait, I thought we were cynical. ...Whatever, it doesn't matter."
    },
    {
        "character": "Pete",
        "line": "No, see, you're nihilistic."
    },
    {
        "character": "Michael",
        "line": "Oh yeah, you're right."
    },
    {
        "character": "",
        "line": "Troubled Acres Rehab for at-risk teens (with emotional problems... who need structure), day. It's a secluded camp with a large greenhouse in the middle. In a white room is Henrietta, with only a bed and blankets to keep her company. There's an emergency light above the door and a security camera in one upper corner of the room. She kicks and bangs on the door"
    },
    {
        "character": "Henrietta",
        "line": "Hel-lo?! Somebody let me out of here! You can't treat people like this! [notices the camera and looks at it.] This is fucking ridiculous! What's wrong with you?! I'm gonna go to the fucking cops when I get out of here! [the floor opens up behind her. She turns around to see what's going on, and a plant rises into the room. She looks at the plant, puzzled. It begins to shake like a rattle, then stops]"
    },
    {
        "character": "",
        "line": "A South Park Transit bus stop, day. The three goths await Henrietta's return. Firkle holds a sign that reads \"WELCOME BACK BITCH\""
    },
    {
        "character": "Pete",
        "line": "What if she comes back, and she's all preppy and conformist?"
    },
    {
        "character": "Michael",
        "line": "She's only been there two weeks. They can't have changed her that much. Can they have? [the bus arrives and they all turn to look at its stop. The rear doors open and they look in. Henrietta appears and they gasp.]"
    },
    {
        "character": "Firkle",
        "line": "Oh. My. God. [Henrietta steps off, and boy has she changed!]"
    },
    {
        "character": "Henrietta",
        "line": "Hey guys. [she now wears a green headband, pink highlights in her hair, and additional pink makeup around her eyes. The left eye is made to look as though it's been crying. Her gloves are pink and black and instead of her cross necklace, she wears a necklace where the pendant is shaped like a bat]"
    },
    {
        "character": "Pete",
        "line": "What the hell have they done to you?"
    },
    {
        "character": "Henrietta",
        "line": "What do you mean? They couldn't do anything. They can't fix me. They don't even understand me. [walks away. The other three move a bit to get a better look at her leaving]"
    },
    {
        "character": "Michael",
        "line": "Oh my God. It's worse than we thought! They made her emo!"
    },
    {
        "character": "",
        "line": "The school gym, day. The kids are tossing basketballs at each other. Kenny tries to climb a rope while a girl looks on. The coach blows his whistle and moves off-screen. As he does so, the Goths are revealed on the bleachers"
    },
    {
        "character": "Michael",
        "line": "[concerned] Has she said one word to either one of you guys?"
    },
    {
        "character": "Pete",
        "line": "Nothing. It's like she's a totally different person. [flips hair]"
    },
    {
        "character": "Michael",
        "line": "She won't even look at us. All she does now is hang out with the douchebag emo kids. [the camera pans right, across the aisle, and shows Henrietta with her new friends, the Emos]"
    },
    {
        "character": "Emo Boy",
        "line": "God, PE class is for such wannabe posers."
    },
    {
        "character": "Emo Girl",
        "line": "I'd rather kill myself than put on gym shorts."
    },
    {
        "character": "Henrietta",
        "line": "I wish there would just be an earthquake, so we could all die."
    },
    {
        "character": "Pete",
        "line": "Uugh, how could she hang out with them??"
    },
    {
        "character": "Michael",
        "line": "There must something else going on here."
    },
    {
        "character": "",
        "line": "Henrietta's room. She's listening to music on her iPod dock while drawing a picture titled \"I Am Alone.\" Someone knocks on her door."
    },
    {
        "character": "Henrietta",
        "line": "Not now Mom! I'm suicidal!"
    },
    {
        "character": "Michael",
        "line": "[enters] It's not your mom, it's me."
    },
    {
        "character": "Henrietta",
        "line": "Oh, hey. [lowers the volume.]"
    },
    {
        "character": "Michael",
        "line": "What did they do you? At that camp?"
    },
    {
        "character": "Henrietta",
        "line": "What do you mean? Just the usual group therapy crap."
    },
    {
        "character": "Michael",
        "line": "Don't take this the wrong way, but... I think that place turned you into an emo."
    },
    {
        "character": "Henrietta",
        "line": "That's ridiculous. I'm not anything. I don't fit in anywhere. I'm not emo, okay?"
    },
    {
        "character": "Michael",
        "line": "Then why are you listening to Sunny Day Real Estate? [she stops what she is doing and then turns off the iPod] I was thinking, maybe they just made you confused at that place. Maybe they didn't know what they were doing. But then I started thinking, maybe that place... turned you emo on purpose. Like maybe they knew what they were doing."
    },
    {
        "character": "Henrietta",
        "line": "[getting cross, then turns her chair around slowly] You should probably stop digging for answers."
    },
    {
        "character": "Michael",
        "line": "What?"
    },
    {
        "character": "Henrietta",
        "line": "There's no winning this for you. [gets off her chair and walks towards him] Soon the entire world will be emo. It is our time."
    },
    {
        "character": "Michael",
        "line": "Nooo waaaaay."
    },
    {
        "character": "Henrietta",
        "line": "Nobody understands us. And they won't understand until it is faaar tooo late."
    },
    {
        "character": "Michael",
        "line": "Omigodnowaaaaaaaaay."
    },
    {
        "character": "Henrietta",
        "line": "Do not fight it, Michael. Is being emo really all that different from being goth? [sataniccally] Join us!"
    },
    {
        "character": "Michael",
        "line": "[runs out of the house] No waaay! [runs out of the house and across the street and throws his cane away to the ground] No way no waaaaaay!"
    },
    {
        "character": "",
        "line": "A tiny diner, night. Pete is reading a book titled \"The Sinking Girl\" on an armchair"
    },
    {
        "character": "A ring tone",
        "line": "Death and despair! Death and despair! Death and despair! Death and desp-"
    },
    {
        "character": "Pete",
        "line": "[answers it] Hello?"
    },
    {
        "character": "Michael",
        "line": "It's worse than we thought."
    },
    {
        "character": "Pete",
        "line": "What is? Everything? [flips hair]"
    },
    {
        "character": "Michael",
        "line": "No! I mean Henrietta. I confronted her and she was all like \"I am emo! And emos are going to rule the world\" and I was like \"No waaay!\" and she was like \"Yeah, soon it will be too late.\" and I was all \"No waaay!\""
    },
    {
        "character": "Pete",
        "line": "No way."
    },
    {
        "character": "Michael",
        "line": "Yeah, so listen: call up Firkle and meet me at Village Inn. I gotta run home, but I'll be there in ten minutes. [rushes home and closes the front door, then runs up the stairs.]"
    },
    {
        "character": "",
        "line": "Michael's house, night. He runs upstairs..."
    },
    {
        "character": "Mom",
        "line": "Michael! Michael! [Michael leans over the rail]"
    },
    {
        "character": "Michael",
        "line": "Can't now, Mom! I've got an emergency!"
    },
    {
        "character": "Dad",
        "line": "In the dining room Michael! Let's go! [Michael goes down reluctantly and enters the dining room] Have a seat, son. [Michael takes a seat opposite his dad.] Your mom and I have decided you're going to go away for a little while."
    },
    {
        "character": "Michael",
        "line": "What??"
    },
    {
        "character": "Dad",
        "line": "[holds up the same brochure Mrs. Biggle held up two weeks earlier] We've been put in touch with this camp for troubled kids like you and-"
    },
    {
        "character": "Michael",
        "line": "What the hell are you talking about?!"
    },
    {
        "character": "Mom",
        "line": "This place gonna fix you, make you normal child! [moments later his dad takes him outside and toward the truck]"
    },
    {
        "character": "Michael",
        "line": "No! You've gotta listen to me! You don't know what you're doing!! [Dad throws him into the car] You fucking conformists! [the truck starts up and backs out of the driveway. Michael looks across the street and sees Henrietta with her emo friends, two of whom are new. He gasps. As the truck pulls away he screams through the closed window] They're eviillll!"
    },
    {
        "character": "",
        "line": "The Village Inn, night. Pete and Firkle are in a booth drinking coffee and smoking."
    },
    {
        "character": "Pete",
        "line": "I never thought it would end like this. I never thought that Goths would just be slowly replaced by Emos."
    },
    {
        "character": "Firkle",
        "line": "Pete... if they get me... if I get sent to that camp... and I come back Emo... kill me. Promise that you'll kill me."
    },
    {
        "character": "Pete",
        "line": "[flips hair] I promise."
    },
    {
        "character": "Waitress",
        "line": "Hey, you kids need to order somethin' or you need to go. [pours some coffee into Firkle's mug.]"
    },
    {
        "character": "Pete",
        "line": "Not now, lady, we're really depressed."
    },
    {
        "character": "Waitress",
        "line": "So what else is new?"
    },
    {
        "character": "Pete",
        "line": "This is different, okay?! Our two friends are being bodysnatched by Emos! [flips hair] There's only one other group who understands Emos like we do. We're gonna have to team up with the Vampires."
    },
    {
        "character": "Firkle",
        "line": "Are you crazy?"
    },
    {
        "character": "Pete",
        "line": "[leaves the booth] What choice do we have?!"
    },
    {
        "character": "Firkle",
        "line": "The Vampires are our sworn enemy. We beat up their leader and burned down their lair. Don't you remember?"
    },
    {
        "character": "Pete",
        "line": "Yeah I remember. And it may be a suicide mission, but we have to walk right in the middle of the Vampires, and ask them for help."
    },
    {
        "character": "",
        "line": "Conference room B, the noon hour. Vamp kids file in and take seats. The hour is set aside for Vamp kids and Twilight fans"
    },
    {
        "character": "Vampire",
        "line": "Okay, let's all be seated please? [the kids quiet down] This is thee noon meeting of the Vamp kids? I am Mike, your lord and dark master, per se."
    },
    {
        "character": "Vamps",
        "line": "Hail Mike."
    },
    {
        "character": "Mike",
        "line": "Okay, uhhh, our main order of business is of course the Halloween social. We're still looking for volunteers to make the- [a round of snarls goes up as Pete and Firkle enter the meeting]"
    },
    {
        "character": "Mohawk Vamp",
        "line": "It's the Goth kids! [moves aside. The other Vamps turn to look at the Goths and take to hissing and snarling at them. A boy Vamp steps forward and snarls at Pete as Pete and Firkle head for the podium]"
    },
    {
        "character": "Pete",
        "line": "Ugh! You spit on me, Larry. [Mike steps down so Pete can address the Vamps] Uhh, hey everybody, uuhm, I know we aren't on the greatest terms right now. We realize we called you all queermos, and we're sorry we burned down the Hot Topic at the mall."
    },
    {
        "character": "Firkle",
        "line": "Sorry."
    },
    {
        "character": "Pete",
        "line": "But, uhhh, we have a bigger problem here, and it's ALL of our problem."
    },
    {
        "character": "Mike",
        "line": "You've got a lot of nerve coming here!"
    },
    {
        "character": "Pete",
        "line": "Yeah, shut up Mike. Listen, okay? There's a camp that kids like us are being sent to, a-and somehow this place is taking kids like us and... turning them Emo. [the Vamps start talking amongst themselves] Yeah. You might not even be able to tell at first. It could have already happened. One of you might already be turned."
    },
    {
        "character": "Black Vamp",
        "line": "Okay hold up! Hold up! You mean that one of us might not really be a Vamp kid? [silence]"
    },
    {
        "character": "Pete",
        "line": "Uhhhhh, right."
    },
    {
        "character": "Black Vamp",
        "line": "[steps into the aisle and moves forward] Well whoever you is, you better get yo' ass ready to run, muthafucka, 'cause you're a damn traitor! And I bet you it's this little n*gga right here![stops by a Vamp in a skeleton sweater named \"Vladimir\"]"
    },
    {
        "character": "",
        "line": "Henrietta's house, night. She's in her bedroom with a lot of new Emo friends."
    },
    {
        "character": "Henrietta",
        "line": "Are you guys getting into that Fall Out Boy concert?"
    },
    {
        "character": "Emo Girl",
        "line": "I can't. I'm too depressed. I keep cutting myself."
    },
    {
        "character": "Henrietta",
        "line": "Yeah. I'm cutting myself to hurt this worthless body that I'm in. [a knock is heard at her door]"
    },
    {
        "character": "Mrs. Biggle",
        "line": "[sing-song] Henrietta, I baked cookies for your new little Emo friends."
    },
    {
        "character": "Henrietta",
        "line": "Not now, Mom! Can't you see I'm hurting?! [gets sarcastic] I'm sorry I'm such a disappointment! Sorry I'm not the pretty cheerleader ya always wanted! [her mom takes the cookies back and closes the door. She goes to the living room]"
    },
    {
        "character": "Mr. Biggle",
        "line": "Does she still seem better?"
    },
    {
        "character": "Mrs. Biggle",
        "line": "Oh, much better! She didn't call me a bitch, and she actually apologized to me."
    },
    {
        "character": "Mr. Biggle",
        "line": "Well that's more like it."
    },
    {
        "character": "Emo Boy 1",
        "line": "You know what we should do? After us Emos take over the Earth? We should um, paint the White House black. And we should have Fall Out Boy at the Super Bowl. [Mike rises from under the window sill. The Emos don't notice]"
    },
    {
        "character": "Emo Boy 2",
        "line": "We're Emos. [the cowlick Vamp which was called \"Larry\" by Pete rises next to Mike] When we rule the Earth we're not gonna have football."
    },
    {
        "character": "Emo Boy 1",
        "line": "Oh yeah. [outside, three other Vamps hold up the two boys peering inside the window. Pete and Firkle sit on the roof nearby. The Vamps have seen enough and withdraw from the window]"
    },
    {
        "character": "Mike",
        "line": "And you say she just showed up like this?"
    },
    {
        "character": "Pete",
        "line": "You know Henrietta; that thing in there is not Henrietta!"
    },
    {
        "character": "Cowlick Vamp",
        "line": "That blonde Emo is Sarah Collins. She was a Vamp kid two weeks ago."
    },
    {
        "character": "Black Vamp",
        "line": "You want me to go in there and waste these mothafuckas?! I'll do it!"
    },
    {
        "character": "Pete",
        "line": "We can't just go in there and kick their asses. We have to stop this thing at its source."
    },
    {
        "character": "Mike",
        "line": "Indeed. If there is some kind of black magic at work creating these monsters, then we will have to use our most powerful Vampiric abilities to stop it."
    },
    {
        "character": "Cowlick Vamp",
        "line": "Do you mean?"
    },
    {
        "character": "Mike",
        "line": "Yes, my child of darkness. We must call upon the powers of the Vamp kids' most sacred entity, per se. Only he can help us in this darkest time. This calls... for a summoning."
    },
    {
        "character": "",
        "line": "The South Park Elementary Library, night. The Goths and Vamps are gathered at a table there, complete with candles"
    },
    {
        "character": "Mike",
        "line": "We call upon the creator of all that is dark! The godfather of Death and Despair! Edgar Allan Poe, your followers in darkness beg for your help! [everyone looks around, but nothing happens] We summon to the world of the living the great Edgar Allan Poe! Knower of all that is misery! Your children need special guidance! Per se."
    },
    {
        "character": "Pete",
        "line": "This, is your plan? Try to summon Edgar Allan Poe back from the dead?!"
    },
    {
        "character": "Mike",
        "line": "Edgar Allan Poe was the original Vamp kid."
    },
    {
        "character": "Pete",
        "line": "No, he was the original Goth, but he'd been dead for 150 years!"
    },
    {
        "character": "Black Vamp",
        "line": "Ey, look man! All genres of Gothic subcultures are derivatives of Poe's work. Muthafucka!"
    },
    {
        "character": "Pete",
        "line": "Look, we came to you for help, and all you've done since then is waste our time! [a violent thunderclap and lightning immediately follow, and a vortex opens up on the ceiling]"
    },
    {
        "character": "Cowlick Vamp",
        "line": "Holy shit look! [Edgar Allan Poe appears and the vortex vanishes]"
    },
    {
        "character": "Poe",
        "line": "Where am I? What is this place?"
    },
    {
        "character": "Firkle",
        "line": "It's him! It's Edgar Allan Poe."
    },
    {
        "character": "Poe",
        "line": "Why have the living summoned me from my rest? [Mike taps Pete to signal that it's his turn to speak]"
    },
    {
        "character": "Pete",
        "line": "Uhhhhh, okayokay, listen: there's this camp for troubled kids, right? Only they aren't helping kids, they're, they're purposefully turning them into Emos."
    },
    {
        "character": "Poe",
        "line": "Emos? ...Ew oh my God, Emos are such wannabe conformists."
    },
    {
        "character": "Mike",
        "line": "Yeah, oh yes!"
    },
    {
        "character": "Pete",
        "line": "Right!"
    },
    {
        "character": "Poe",
        "line": "Children of Darkness, I would help you, but I fear I cannot be seen with a bunch of douchey Vamp kids and their poser-ass plastic fangs."
    },
    {
        "character": "Pete",
        "line": "Thank you!"
    },
    {
        "character": "Mike",
        "line": "Hey!"
    },
    {
        "character": "Pete",
        "line": "I'm just saying it's nice to know that Edgar Allan Poe agrees with us."
    },
    {
        "character": "Poe",
        "line": "Agrees with who? Is that red dye in your hair or did a blood demon take a shit on your head, poser?"
    },
    {
        "character": "Black Vamp",
        "line": "Ah ah! He got you there, n*gga!"
    },
    {
        "character": "Pete",
        "line": "Okay, look, we're running out of time. You have to help us stop the Emos."
    },
    {
        "character": "Poe",
        "line": "Why should I? Just 'cause you summoned me doesn't mean you're the boss of me!"
    },
    {
        "character": "Pete",
        "line": "Uh, yeah, it kind of does."
    },
    {
        "character": "Poe",
        "line": "[floats away, mocking] Oh okay, Mom. Let's go fight the Emos, Mom."
    },
    {
        "character": "",
        "line": "Back at Troubled Acres, night. The greenhouse is lit. Inside, Michael is in a chair asleep, tied down to it by thick ropes."
    },
    {
        "character": "Michael",
        "line": "What? Where are you ta- No! NO!! [jerks around and wakes up, assessing his situation] What the hell?? ...Oh my God. [he realizes where he is and tries to shake himself loose from the ropes] Get me out of here! Let me go!"
    },
    {
        "character": "Howard",
        "line": "Shhhhh. [Michael sees him] It's best you don't upset them. [goes to water another plant]"
    },
    {
        "character": "Michael",
        "line": "What the hell are you doing to people?!"
    },
    {
        "character": "Howard",
        "line": "Not me. I just work for them. They're not evil, you know? They're just misunderstood. All I do is help the Emos get into their human hosts. They promised me when they take over Earth I can have a cabin on the lake, and all the steak I can eat."
    },
    {
        "character": "Michael",
        "line": "Wait a minute. Emos are plants? [the plants begin to rattle in their pots.]"
    },
    {
        "character": "Howard",
        "line": "Shhh, shhh, it's okay. Not just any plants. They're very unique. Very special. Nobody understands them. Emoclarus americanus. Wonderful species. Except for their tendencies of self-mutilation and the need for other species to acknowledge their pain."
    },
    {
        "character": "Michael",
        "line": "Oh, it all makes sense now! [A giant emoclarus rattles into view]"
    },
    {
        "character": "Howard",
        "line": "Oh! I'm sorry. Sorry, Emo King. [holds a conversation with it] Oh no, I wasn't talking to him. I mean, I was, but- Y-yes! Yes, I understand. [walks back to a smaller plant] Right away.[takes the potted plant and walks over to Michael]"
    },
    {
        "character": "Michael",
        "line": "No. [Howard sets the plant down next to him] What are you doing?! I don't wanna be emo!"
    },
    {
        "character": "Howard",
        "line": "[walks away, then turns around] You just don't understand. You'll understand them soon."
    },
    {
        "character": "Michael",
        "line": "What the...? [the plant begins to rattle]"
    },
    {
        "character": "Howard",
        "line": "It's quicker if you don't fight it."
    },
    {
        "character": "Michael",
        "line": "No, NOOOOOOOOO! [begins to rattle with the plant]"
    },
    {
        "character": "",
        "line": "The road, night. The Vamps and Goths are heading to Troubled Acres. Pete is driving"
    },
    {
        "character": "Pete",
        "line": "Alright, listen up. Once we find our friend, we've gotta torch the place and get out."
    },
    {
        "character": "Firkle",
        "line": "[coughs] Dude, Edgar, can you not smoke in the car?"
    },
    {
        "character": "Poe",
        "line": "You can't tell me what to do! Who elected you the mayor of me?!"
    },
    {
        "character": "Pete",
        "line": "Cut it out, Edgar! It's annoying everybody!"
    },
    {
        "character": "Poe",
        "line": "God, you guys are so lame! [tosses his cigarette out the window] And if you want my help, you'd better all stop calling me Edgar."
    },
    {
        "character": "Black Vamp",
        "line": "Well that's your name, isn't it?"
    },
    {
        "character": "Poe",
        "line": "That's the name my stupid parents gave me! I like to be called by my Goth name: Nightpayne."
    },
    {
        "character": "Black Vamp, Mike, and Pete",
        "line": "Oh God..."
    },
    {
        "character": "Poe",
        "line": "What? You guys are posers!"
    },
    {
        "character": "Black vVmp",
        "line": "Ey, just so you all know, if one of you ain't who you say they is, and we get inside that base and you reveal you're actually one of them Emo muthafuckas in disguise, I WILL go crazy on yo' ass!"
    },
    {
        "character": "Poe",
        "line": "If one of us is a traitor, it's probably your wannabe vampire leader."
    },
    {
        "character": "Mike",
        "line": "Oh, fuck off, Nightpayne."
    },
    {
        "character": "Poe",
        "line": "Make me, poser."
    },
    {
        "character": "",
        "line": "Troubled Acres, night, at the greenhouse. A security camera follows the car as it enters the rehab center. Everyone exits the car. Another camera shows Michael rattling with the emo plant. A third camera catches the group going down one hallway."
    },
    {
        "character": "Pete",
        "line": "Michael?! You here?"
    },
    {
        "character": "Mike",
        "line": "I feel like we're being watched. [yes they are, by the Security Cam 3000. A fourth camera shows Henrietta's former room. Zooming out reveals an emoclarus looking over a desk with video cameras all around. The king emoclarus looks on. It leans over and seems to whisper to the security emoclarus. In the greenhouse, the group reaches Michael, who has become delirious and is now groaning]"
    },
    {
        "character": "Pete",
        "line": "Dude! Michael, are you okay?"
    },
    {
        "character": "Michael",
        "line": "Kick it over! Stop the plant! [Mike walks over and kicks the plant away, then gets into a karate stance. Firkle disappears] Oh! Oh, thank God you're here. Emos are plants and they're invading human bodies."
    },
    {
        "character": "Pete",
        "line": "Alright, we're gonna get you out of here, and then we're gonna burn this whole place down. [a gun is cocked and everyone looks at the source]"
    },
    {
        "character": "Firkle",
        "line": "I'm sorry, but I'm afraid that's not the plan."
    },
    {
        "character": "Howard",
        "line": "[appears behind him and approaches the group] You did very good. The emo plants are very pleased with your dedication."
    },
    {
        "character": "Michael",
        "line": "Firkle! All this time I thought you were Goth! How long have you been Emo? [Firkle takes off his jacket and ... wig.]"
    },
    {
        "character": "Firkle",
        "line": "Don't you see we can't stop them? We might as well join' em. [The Emo King shows up and starts rattling. Howard turns around and walks toward it]"
    },
    {
        "character": "Howard",
        "line": "Yes Emo King, right away. [turns around again] The Emo King wants us to proceed at once. [moments later the black Vamp, Mike, and Pete are tied to chairs and plants are placed in front of them]"
    },
    {
        "character": "Pete",
        "line": "Ugh! Let us go, you ultimate conformists!"
    },
    {
        "character": "Howard",
        "line": "Don't fight it. It's quicker that way. [the plants begin to rattle]"
    },
    {
        "character": "Mike",
        "line": "Oh God! I'm starting to feel Emo."
    },
    {
        "character": "Pete",
        "line": "Wait a minute. Where the hell is Edgar Allan Poe?"
    },
    {
        "character": "Mike",
        "line": "He said he was over this, and was gonna hang out at the Village Inn."
    },
    {
        "character": "Pete",
        "line": "What?!"
    },
    {
        "character": "",
        "line": "The Village Inn, night. The Ghost of Goth Past sits in the same booth the Goth kids sit in, sipping coffee and smoking"
    },
    {
        "character": "Waitress",
        "line": "[approaches] Hey, are you gonna order any food, or are you just gonna sit there and drink coffee all day?"
    },
    {
        "character": "Poe",
        "line": "Leave me alone! I just want coffeh."
    },
    {
        "character": "Waitress",
        "line": "[turns around and leaves] Little prick."
    },
    {
        "character": "Poe",
        "line": "Bitch."
    },
    {
        "character": "Pete",
        "line": "[voice only] Poe? Edgar Allan Poe, where are you? [his face appears in Poe's coffee] What the hell are you doing?! You're supposed to be helping us!"
    },
    {
        "character": "Poe",
        "line": "I can't right now. I'm dealing with a lot and I just have a lot of anxiety."
    },
    {
        "character": "Pete",
        "line": "Look, we [flips hair] summoned you to help us save the world!"
    },
    {
        "character": "Poe",
        "line": "What's the point? Save some people so some other people can be lame? And then those lame-os can be lamer to some other posers?"
    },
    {
        "character": "Pete",
        "line": "God, he is such a downer! [the plants rattle again]"
    },
    {
        "character": "Howard",
        "line": "Just let the spores inside you. Stop fighting it."
    },
    {
        "character": "Mike",
        "line": "Wait. Look!"
    },
    {
        "character": "Poe",
        "line": "[floating in] Okay, I'm here, posers."
    },
    {
        "character": "Pete",
        "line": "Nightpayne! Destroy the plant leader! The leader over there! [Poe descends and lands next to the Emo King]"
    },
    {
        "character": "Poe",
        "line": "What do you want me to do?"
    },
    {
        "character": "Mike, Michael, and Pete",
        "line": "Shoot it!"
    },
    {
        "character": "Poe",
        "line": "Really? Shoot a plant?"
    },
    {
        "character": "Michael",
        "line": "Shoot it! [Poe obliges, but nothing happens to the plant. A piece of its pot might have come off. Poe just shrugs.]"
    },
    {
        "character": "Poe",
        "line": "Wait a minute. What is this? [walks over and pulls out the plant's tag] This says it was bought at Lowe's Home and Garden for $29.95. [it's a common ficus]"
    },
    {
        "character": "Howard",
        "line": "Lowe's Home and Garden?"
    },
    {
        "character": "Pete",
        "line": "Hey, these are just plants."
    },
    {
        "character": "Howard",
        "line": "No they- they talk to me!"
    },
    {
        "character": "Poe",
        "line": "No, they're just, like, ficus plants and vibrating pots."
    },
    {
        "character": "Howard",
        "line": "But-"
    },
    {
        "character": "Voice",
        "line": "Looks like it's over, Harold Flannigan. So we have just one question for you: are you scared?!"
    },
    {
        "character": "Howard",
        "line": "[frozen in fear] What do you mean?"
    },
    {
        "character": "Voice",
        "line": "ARE YOU SCARED?!"
    },
    {
        "character": "Howard",
        "line": "YES!!! [Pete flips his hair]"
    },
    {
        "character": "Voice",
        "line": "That's good! 'Cause you're on... \"Yes, I Was Scared!\" [music plays and the lights come on]"
    },
    {
        "character": "Pete",
        "line": "What?? [the cast and crew of that show come out of the plant work.]"
    },
    {
        "character": "Host",
        "line": "Look! Look at the camera right there!"
    },
    {
        "character": "Howard",
        "line": "Oh my God, are you serious? [grins.]"
    },
    {
        "character": "Host",
        "line": "Your wife Sarah put you up to this."
    },
    {
        "character": "Sarah",
        "line": "[pops in next to Harold] Haha I got you! [giggles some more]"
    },
    {
        "character": "Firkle",
        "line": "This is a prank?"
    },
    {
        "character": "Black Vamp",
        "line": "Oh man that's good! They got us good!"
    },
    {
        "character": "Firkle",
        "line": "I turned traitor for no reason?"
    },
    {
        "character": "Pete",
        "line": "[to Michael] Did you know about this?"
    },
    {
        "character": "Michael",
        "line": "I have no idea what's going on."
    },
    {
        "character": "Host",
        "line": "Howard, did you suspect at all that a gardener job at a camp for troubled teens was a setup?"
    },
    {
        "character": "Howard",
        "line": "No, they really had me convinced!"
    },
    {
        "character": "Host",
        "line": "And you didn't suspect anything when we had plants tell you to turn Goths and Vamp kids into Emos when really they're exactly the same thing?"
    },
    {
        "character": "Howard",
        "line": "I guess I should have figured it out. I'm an idiot. [laughs]"
    },
    {
        "character": "Host",
        "line": "Tune in again next week, when we make a woman from Milwaukee think she's working at a haunted abortion clinic."
    },
    {
        "character": "",
        "line": "Henrietta's room, night. Henrietta's working on a new picture, featuring a gallows noose. A knock is heard at her door, and Pete walks in with Michael"
    },
    {
        "character": "Henrietta",
        "line": "So, my friends. Have you made the transformation?"
    },
    {
        "character": "Pete",
        "line": "Uhhhh, Henrietta, we have some bad news. The plants you think took over your body and made you emo? They're just plants. [she stops drawing] From Lowe's Home and Garden."
    },
    {
        "character": "Michael",
        "line": "It was all a prank by some douchey network reality show."
    },
    {
        "character": "Henrietta",
        "line": "Nnnnoooo, there's an organic spore in my head that made me switch cliques so easily."
    },
    {
        "character": "Michael",
        "line": "No, you just kind of did it on your own."
    },
    {
        "character": "Henrietta",
        "line": "Oh my Gawd... [closes her eyes, drops her pen on the table, and pinches her nose at the bridge] This is so... embarrassing."
    },
    {
        "character": "Pete",
        "line": "Ahh, hang on. What I meant to say was [flips his hair] we just infiltrated the Emo lair and... we torched the plant leader."
    },
    {
        "character": "Henrietta",
        "line": "Oh. [sudden relief] Oh! [she begins convulsing, then turns around in her chair] Ihihit's meee-e! I'm- I'm me again! [gets off her chair and walks to the boys] Oh my God I'm... all better. Thanks, you guys."
    },
    {
        "character": "Mrs. Biggle",
        "line": "[peeks into the room] Henrietta, I have dinner ready."
    },
    {
        "character": "Henrietta",
        "line": "Shut up, Mom! Leave me alone, you conformist bag of demon jizz!"
    },
    {
        "character": "Mrs. Biggle",
        "line": "...Fatty. [closes the door.]"
    }
]