[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day, Mr. Garrison's classroom. Mr. Mackey is present, showing the class a new computer system he's had installed at school"
    },
    {
        "character": "Mr. Mackey",
        "line": "Students, I would like to introduce you all to the future. [holds a laptop with an IntelliLink logo on it] M'kay. Starting today, our school will be operating entirely on IntelliLink. [presses a key that brings up the splash screen] Now whenever you need to see the school nurse, or talk to me, your counselor, you can simply sign up using this simple, integrated portal. [presses the space bar] M'kay... [presses it again. Presses is twice more, and the main menu pops up] You can use a computer or any of the IntelliLink panels which are located throughout the school. [one such panel is shown next to the window] Lat's say you're in the cafeteria, m'kay. You start cougin' up blood and need to see the nurse. You just click on \"school clinic\"[presses a button, and the school clinic menu pops up.] Mkay, see nurse. [selects it and a box appears on the right side with fields for teachers, student, note, and some checkboxes.]M'kay. Respiration problems. [presses a button, and \"All Night Long\" plays] Uh, okay, I must have I must have been in the wrong menu, uhkay. As you can see, you can control the sound system as well. Okay. [presses a key, and the song is cut off] It's all integrated and smartlinked, and this is a great idea, m'kay. Let's look at the message board. [press, and gets to the main menu] Mesage... board. [moves the cursor to the message board icon and loads the board] Here you can easily write messages to each other or to the faculty, m'kay? For instance, [sees the first thread title that loads] here we go. Here's a message from Kyle's little brother, Ike Broflovski. [loads the message] Okay, little Ike says \"My brother is a homo\"[Cartman cackles and Kyle is startled] Ike made a little drawing of his brother too. [loads the drawing] Drew a nice picture with a... nice bird hangin' off Kyle's forehead, m'kay, that's nice. [Cartman cackles again, and Kyle looks annoyed] It's a nice... crane, a nice whoopin' crane comin' off Kyle's head there."
    },
    {
        "character": "Cartman",
        "line": "That's not a crane, it's a dick and balls."
    },
    {
        "character": "Butters",
        "line": "Heheh, yeah. [chuckles to himself. Kyle is now annoyed and embarrassed]"
    },
    {
        "character": "",
        "line": "The Broflovski house, day, kitchen. Sheila is washing dishes when Kyle appears and enters"
    },
    {
        "character": "Kyle",
        "line": "Mom, Ike did it again. I don't know what's going on with him, but, it's like he hates me."
    },
    {
        "character": "Sheila",
        "line": "Oh, Kyle, your little brother is, getting older. He's not a baby anymore."
    },
    {
        "character": "Kyle",
        "line": "I know, but he posted a message of me with a schlong on my head."
    },
    {
        "character": "Sheila",
        "line": "It's natural, bubbe. Part of getting older is finding ways to assert your independence. You know. Why don't you go and try to talk to him - you can win him over again. [Kyle thinks it over and walks out]"
    },
    {
        "character": "",
        "line": "Ike's room, moments later. Kyle opens the door and enters"
    },
    {
        "character": "Kyle",
        "line": "Hey Ike, how's it going?"
    },
    {
        "character": "Ike",
        "line": "[looks over his left shoulder] Get out of my room, Kyle! I'm on my computer! [turns back to his computer]"
    },
    {
        "character": "Kyle",
        "line": "I just wanted to see if maybe you want to do fingerpaints with me."
    },
    {
        "character": "Ike",
        "line": "Do I look like I wanna do fuckin' fingerpaints?! [looks over his shoulder again] Look at the fuckin' zits on my face!"
    },
    {
        "character": "Kyle",
        "line": "Ike, I just want us to be friends again."
    },
    {
        "character": "Ike",
        "line": "Then stop harassing me, bro! You don't know what it's like to be a baby goin' through puberty! I don't know whether to watch Yo Gabba Gabba or go out and tame some strange!"
    },
    {
        "character": "Kyle",
        "line": "Yeah, let's watch Yo Gabba Gabba, like old times."
    },
    {
        "character": "",
        "line": "Living room, moments later. Kyle and Ike sit on the sofa watching Yo Gabba Gabba. The troupe performs \"Come On And Dance.\" Toodee steps forward to dance a bit"
    },
    {
        "character": "Ike",
        "line": "Dancy Dance is my favorite."
    },
    {
        "character": "Kyle",
        "line": "It always has been. See? This is nice. [Foofa steps forward]"
    },
    {
        "character": "Ike",
        "line": "Who would you rather fuck? [Kyle is stunned] Foofa or Toodee?"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Ike",
        "line": "I wanna fuck Foofa. [a closeup of Foofa dancing] I wouldn't wanna fuck Toodee. She's a dike. You can tell. But Foofa, man. [whips out a can of chewing tobacco, opens it, and scoops some tobacco out] I bet she's got some sweet strange. [puts the tobacco in his mouth] I don't even know what the fuck Muno is."
    },
    {
        "character": "Kyle",
        "line": "Ike, is that chewing tobacco?"
    },
    {
        "character": "Ike",
        "line": "What?! You gonna fuckin' narc and tell Mom?!"
    },
    {
        "character": "Kyle",
        "line": "No, I just don't think it's healthy."
    },
    {
        "character": "Ike",
        "line": "That's 'cause you don't understand shit! [stands on the sofa] I knew this was a bad idea! [leaves the sofa and walks away] I'm gonna watch Yo Gabba Gabba in my roomsy!"
    },
    {
        "character": "",
        "line": "Mr. Mackey's office, a few days later. Someone knocks on his door."
    },
    {
        "character": "Mr. Mackey",
        "line": "Come in, m'kay."
    },
    {
        "character": "Kyle",
        "line": "[opens the door and peeks in] Mr. Mackey, can I talk to you?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh-kay, have you set up a counseling appointment on IntelliLink?"
    },
    {
        "character": "Kyle",
        "line": "[goes all the way in] No."
    },
    {
        "character": "Mr. Mackey",
        "line": "Ookay, that's fine, that's fine. We can use IntelliLink to see what's available. Let's see, counseling request. Students. Make appointment. [presses a key and his window blind goes down, and Kyle notices] Okay, ah whoops. Okay, uh sume, uh students make appoint-alala here we go. Make, make appointment. [presses a key and the lights go out. He looks around] Uhkay, here we go. Uhkay, what do you need counseling with?"
    },
    {
        "character": "Kyle",
        "line": "It's my little brother. He's really changing and I feel like-"
    },
    {
        "character": "Mr. Mackey",
        "line": "Okay, I'll click on family issues. What time did you want counseling?"
    },
    {
        "character": "Kyle",
        "line": "Right now."
    },
    {
        "character": "Mr. Mackey",
        "line": "Oo-kay, aaand, what is your brother's Intelligrated smart name?"
    },
    {
        "character": "Kyle",
        "line": "I don't know."
    },
    {
        "character": "Mr. Mackey",
        "line": "Alright, I can do a lookup for the name. Uh go back. Main menu. [\"The Heat Is On\" begins to play, and Mr. Mackey has lost control] Oh... Damnit. Okay now, back. [mumbles to himself as he tries to set things right] Set- no, set appointment. Okay, speakers off. [his blind rises] Okay, uh... Okay, what is your smart name, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Sorry, Kyle, we're gonna need to maybe go somewhere else. Uh... find an IntelliLink panel somewhere."
    },
    {
        "character": "",
        "line": "The boys' restroom. Mr. Mackey is on the toilet with an IntelliLink panel to his left, on the wall"
    },
    {
        "character": "Mr. Mackey",
        "line": "Okay, let's see, lights. [presses the light icon and some other icons pop up] Mood. [presses the mood icon and a timer pops up] Start counseling timer. [sets it for 15 minutes and starts it] Okay there we go. Okay, we got it. [smiles] Okay now, Kyle, you had some concerns about your little brother?"
    },
    {
        "character": "Kyle",
        "line": "[takes a moment to gather them] He's just... changing a lot. He walks around angry, telling me I'm stupid and, and all he talks about is sex."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well it sounds like he's hittin' puberty."
    },
    {
        "character": "Kyle",
        "line": "Yeah, he just seems so young."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well, your brother is Canadian. Perhaps Canadian puberty is a little different. Why don't you educate yourself about Canadian puberty and it could be somethin' yeeyou and your brother can actually do together. M'kay? [plop] You know, this is the first time I've been able to do counseling aaand go to the bathroom at the same time. IntelliLink is amazing."
    },
    {
        "character": "",
        "line": "A live program. The Canadian Board of Health Presents, \"What Are These Changes?\" A Guide To Puberty In Canada"
    },
    {
        "character": "Minister",
        "line": "Hello young people, and welcome to the most fascinating time of your life. You have braved the trials of childhood, and now you are reaching Canadian puberty. By now, you've probably noticed some changes in your body. For instance, when you fart your dick gets hard. [a long pause] Other physical changes are happening to your body as well. If you're a boy you may notice that your testicles ache, or if you're a girl, you may notice a tingling sensation in your strange."
    },
    {
        "character": "Ike",
        "line": "This is stupid, bro! I already know all this!"
    },
    {
        "character": "Kyle",
        "line": "Let's just give it a chance, Ike."
    },
    {
        "character": "Minister",
        "line": "Going through Canadian puberty, you may notice that your voice is starting to change as well. You're saying things like \"hey boddy\" and \"hey guy\" because now that you're older you're discovering that someone who was once your buddy is now your guy, and someone who you used to call \"guy\" is quickly becoming your friend. [A shot of Kyle and Ike looking at each other] But now let's discuss how a man and a woman make love. [an animated stick-figure cartoon follows] First, a man and a woman fall in love. Then the man farts on the woman's strange, [That is shown, with audio] filling the woman's strange with air so that the woman can queef on the man's face. [shown, with audio] And, a baby is born. [pop] The entire process can take up to six months a- [turns to his right to listen...] It's what? ... That's not how a baby is born? ... What's semen? ... Well then, why did my wife queef on my face? ... She said it was to- ... [gets mad] Well then why would sh-?! ... I'm gonna get to the bottom of this! [pounds on the desk and leaves]"
    },
    {
        "character": "",
        "line": "The street, near his residence, day. The host marches home"
    },
    {
        "character": "Minister",
        "line": "Make me look like an idiot, will you?!"
    },
    {
        "character": "",
        "line": "At home. The double doors open and the host comes in. His wife is sitting on the sofa sipping tea"
    },
    {
        "character": "Minister",
        "line": "Ey! You told me you queefed on my face because because that's how babies are born!"
    },
    {
        "character": "Wife",
        "line": "I was being sarcastic."
    },
    {
        "character": "Minister",
        "line": "Being sarcastic?! I just told a million Canadian teenages that's how it's done!"
    },
    {
        "character": "Wife",
        "line": "I was angry because you never listen to me. Because I wanted you to go with me to therapy and you never go."
    },
    {
        "character": "Minister",
        "line": "Fine! You want me to go with you to therapy?! Fine!"
    },
    {
        "character": "",
        "line": "The host goes to a therapy session with his wife."
    },
    {
        "character": "Minister",
        "line": "Totally embarrassing and degrading! She queefed right in my face!"
    },
    {
        "character": "Therapist",
        "line": "Well, maybe you should spend less time at work making public health films and more time at home."
    },
    {
        "character": "Kyle",
        "line": "What the fuck is going on?!"
    },
    {
        "character": "Ike",
        "line": "[hops off the sofa...] You're fucking stupid, Kyle! [...and walks away]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day, Room 7. The class is in the dark listening to \"All Night Long\" again. Mr. Garrison his his fingers in his ears to block out the song"
    },
    {
        "character": "Kyle",
        "line": "I don't know what else to do, dude. No matter what I try, me and Ike just seem to drift further apart!"
    },
    {
        "character": "Stan",
        "line": "He doesn't ever want to play with you anymore?"
    },
    {
        "character": "Kyle",
        "line": "He doesn't even let me near him!"
    },
    {
        "character": "Cartman",
        "line": "That sucks, dude."
    },
    {
        "character": "Kyle",
        "line": "What??"
    },
    {
        "character": "Cartman",
        "line": "I said THAT SUCKS, DUDE."
    },
    {
        "character": "Kyle",
        "line": "Oh, thanks! [Mr. Mackey is at the IntelliLink panel trying to set things right. The music stops and he stands up]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Okay, there we go. That's cut the speakers off. Now what was it you were trying to do, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "I was trying to make an appointment to see the principal about getting excused on Friday. So I can take my brother to go see Yo Gabba Gabba Live."
    },
    {
        "character": "Mr. Garrison",
        "line": "Mr. Mackey, can he just go talk to the principal?"
    },
    {
        "character": "Mr. Mackey",
        "line": "No, this is gonna work! I called IntelliLink and they said they were sending over an engineer. [someone knocks on the door.]"
    },
    {
        "character": "Cody",
        "line": "[looks in] Is this Classroom 7?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Yes!"
    },
    {
        "character": "Cody",
        "line": "My name's Cody. I'm your smartnician. You're havin' some intelliproblems with your astutelinks?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Yeah, a student is trying to make an appointment to see the principal. M'kay?"
    },
    {
        "character": "Cody",
        "line": "[taps the screen a few times] Uh huh, well here's the problem: your amsrtnames aren't intelligrated. [shows him the error screen]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh I see."
    },
    {
        "character": "Cody",
        "line": "If you wanna have those intelligrated with EasyLink, you might wanna upgrade your system to the silver package."
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh, I I needed the silver package? Okay okay? Can we do that?"
    },
    {
        "character": "Cody",
        "line": "Let my call my supervisor on the intelliphone. [calls in]"
    },
    {
        "character": "",
        "line": "Ike's room, day. He's playing with his toy trucks - a fire engine and a dump truck. He crashes them into each other. Kyle knocks on the door and then enters"
    },
    {
        "character": "Kyle",
        "line": "Hey Ike."
    },
    {
        "character": "Ike",
        "line": "Get out of my room, Kyle! I'm playing trucks!"
    },
    {
        "character": "Kyle",
        "line": "Ike, I'm sorry, but I couldn't get us out of school Friday. I can't take you to Yo Gabba Gabba Live."
    },
    {
        "character": "Ike",
        "line": "You promised!"
    },
    {
        "character": "Kyle",
        "line": "I couldn't get in to see the principal, Ike."
    },
    {
        "character": "Ike",
        "line": "Well what am I supposed to do?! See it myself?! I'm a little baby! Who's gonna hold my fuckin' hand?! You don't give a shit about how I feel!"
    },
    {
        "character": "Kyle",
        "line": "Ike, I do! I just-"
    },
    {
        "character": "Ike",
        "line": "You just love pushing me around! Is that what you wanna do, Kyle?! Kick the baby?! Well alrighty bro! Come on, Kyle! Kick the baby! [Kyle just looks at him, Ike takes off his shirt] Come on bro! Kick the fuckin' baby! Let's see you try it, wuss!"
    },
    {
        "character": "",
        "line": "The Pepsi Center in Denver, day. Yo Gabba Gabba Live is starting. Next, a live performance of \"Don't Bite People\""
    },
    {
        "character": "Plex",
        "line": "Hey Muno, what should we do now?"
    },
    {
        "character": "Muno",
        "line": "Let's play Cool Cool Trick."
    },
    {
        "character": "Plex",
        "line": "Aaaall right! Who out in the audience has a cool cool trick to show us? [a line of kids is already in place. A boy steps forward] What's your name, little boy?"
    },
    {
        "character": "Ryan",
        "line": "My name is Ryan!"
    },
    {
        "character": "Plex",
        "line": "And what is your cool cool trick, Ryan?"
    },
    {
        "character": "Ryan",
        "line": "My cool cool trick is that I can jump in the air. [the kids in the audience cheer. Kyle notices that Ike has left his seat] Let's see you... jump in the air! [Ryan jumps, and the troupe cheers him on. Ike cuts in line and steps forward]"
    },
    {
        "character": "Plex",
        "line": "And what's your name, little boy?"
    },
    {
        "character": "Ike",
        "line": "Ike Broflovski."
    },
    {
        "character": "Plex",
        "line": "Do you have a cool trick?"
    },
    {
        "character": "Ike",
        "line": "Yeah, for my cool cool trick I'm gonna tame Foofa's strange."
    },
    {
        "character": "Plex",
        "line": "Tame mo what?"
    },
    {
        "character": "Ike",
        "line": "I can tame Foofa's strange, bro."
    },
    {
        "character": "Plex",
        "line": "Uhhh, alright. Let's see our friend Ike tame Foofa's strange! [Ike walks up to Foofa]"
    },
    {
        "character": "Kyle",
        "line": "[running towards the stage] Ike no! Stop!"
    },
    {
        "character": "Plex",
        "line": "Oh, I see. You're actually- [shakes his head] Wait! Oh my God, what are you doing?! No no no! [parents in the audience quickly cover their kids' eyes] What are you doing to Foofa?! No!"
    },
    {
        "character": "",
        "line": "The green room, after the show. Kyle and Ike sit on a sofa flanked by two officers"
    },
    {
        "character": "Plex",
        "line": "Now you listen here, little boy! It is never okay to take off your clothes and grind on another person!"
    },
    {
        "character": "Toodee",
        "line": "No, that's wrong!"
    },
    {
        "character": "Plex",
        "line": "Don't do it."
    },
    {
        "character": "Brobee",
        "line": "Uh uh."
    },
    {
        "character": "Kyle",
        "line": "We're so sorry. Please forgive my little brother. He's going through puberty."
    },
    {
        "character": "Muno",
        "line": "A little young for that, isn't he?"
    },
    {
        "character": "Kyle",
        "line": "That's what I thought."
    },
    {
        "character": "Ike",
        "line": "This is stupid, bro. [takes out some chewing tobacco] Foofa shouldn't be limiting herself to little kids. She's fuckin' fine, dude. [puts it in his mouth]"
    },
    {
        "character": "Plex",
        "line": "What you did was very traumatic for Foofa. Isn't that right, Foofa? [Foofa is frowning, but stays silent] Foofa?"
    },
    {
        "character": "Foofa",
        "line": "He's right, Plex. We're getting older. I don't wanna do the little kid thing the rest of my life."
    },
    {
        "character": "Brobee",
        "line": "Foofa, what are you talking about?"
    },
    {
        "character": "Foofa",
        "line": "It's time for us to start playing to older people. Maybe we need to be edgier. Have a little sex appeal."
    },
    {
        "character": "Toodee",
        "line": "Foofa, no!"
    },
    {
        "character": "Foofa",
        "line": "I'm an artist. And if all I ever do is play to kids, then I'll be a joke. [turns around and walks towards the door] I have to move on. [walks out of the room]"
    },
    {
        "character": "Plex",
        "line": "Oh God. What has this little boy done??"
    },
    {
        "character": "",
        "line": "A Canadian pub. The minister of health is sitting with an older man at table"
    },
    {
        "character": "Minister",
        "line": "I try not to think about it, Rick. I try to just forget aboot it and then move on, but I can't. I mean... she queefed right in my face!"
    },
    {
        "character": "Rick",
        "line": "Have you and your wife seen a therapist together?"
    },
    {
        "character": "Minister",
        "line": "Yes, we went but... I just can't erase the memory of my helpless face being queefed on like that. Who's to say she won't do it again?"
    },
    {
        "character": "Rick",
        "line": "Don't you think this has something to do with your new job?"
    },
    {
        "character": "Minister",
        "line": "What do you mean?"
    },
    {
        "character": "Rick",
        "line": "There's more to this, Terry. A lady never queefs in her lord's face without some major cause. You started as the Canadian Minister of Health and three months later your wife queefed in your face. There's a connection."
    },
    {
        "character": "Terry",
        "line": "I took the job to try and make Canada's health care system better. What could that have to do with my wife?"
    },
    {
        "character": "Rick",
        "line": "Terry, I'm your friend. And I'm not just your friend, I'm also your boddy"
    },
    {
        "character": "Terry",
        "line": "Thanks, guy."
    },
    {
        "character": "Rick",
        "line": "[points a finger at him] And I'm telling you there's more to this than you think! [crosses his arms] And if you want to save your marriage, and your face, you need to figure it out quick."
    },
    {
        "character": "",
        "line": "South Park Elementary Faculty Lounge, day. Principal Victoria has called a staff meeting, with Mr. Mackey as the man in the hot seat"
    },
    {
        "character": "Principal Victoria",
        "line": "Mr. Mackey, so far the school has spent [reads the bill] $22,000 on the IntelliLink system, and so far it's been an unmitigated disaster."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well yeah, but see, the problem is not everyone is not everyone is signed on to it yet."
    },
    {
        "character": "Mr. Adler",
        "line": "They can't sign on to it because every time they try they make the sprinklers go off!"
    },
    {
        "character": "Mr. Mackey",
        "line": "I know that IntelliLink has had some... hiccups... uhkay. But I've hired a new faculty member whose sole responsibility will be to oversee the IntelliLink system and make sure it runs smoothly. I want you all to meet Pat Conners. [she enters and takes a seat next to Mr. Mackey]"
    },
    {
        "character": "Pat",
        "line": "Hello everyone."
    },
    {
        "character": "Mr. Mackey",
        "line": "[immediately points a finger at her] Don't \"Hello\" us, Pat! This system that you're responsible for now isn't working out! So [pounds his fist on the table] what the hell are you gonna do about it?!"
    },
    {
        "character": "Pat",
        "line": "Oh. Well, I'm just sort of getting acclimated to the situation and I-"
    },
    {
        "character": "Mr. Mackey",
        "line": "Getting acclimated?! [stands up in anger] Do you know how much money we wated on that thing?! How about you take some damned responsibility! Get the hell out of here, Pat! You're fired! Get out! [Pat takes her briefcase and walks out] Well. How the hell are we gonna clean up Pat's mess? I guess, I dunno, I guess we got no choice, m'kay. We're just gonna need to the upgrade to the IntelliLink Gold Package. [opens his laptop to show the splash screen]"
    },
    {
        "character": "Principal Victoria",
        "line": "Oh noo!"
    },
    {
        "character": "Mr. Mackey",
        "line": "No, see, it's a $10,000 upgrade, but it should clean up all of Pat's mistakes."
    },
    {
        "character": "Coach",
        "line": "Mr. Mackey, let's be clear. IntelliLink was your idea. You should admit it was a bad one and stop being so defensive."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well ih it's good to be a little defensive around you, Miles, m'kay. Let's, let's not forget that your wife died of an \"accident\" while you were \"drinking\" on a \"hike,\" \"N'kay!\""
    },
    {
        "character": "Miles",
        "line": "Hey now listen here-!"
    },
    {
        "character": "Mr. Mackey",
        "line": "No! Now you listen to me! [pounds his fist on the table] IntelliLink is a great idea, and we just need the Goddamned Gold Package! We are doublin' down!"
    },
    {
        "character": "",
        "line": "E! News segment"
    },
    {
        "character": "Anchor",
        "line": "[voice only] You're watching E! Entertainment News. God knows why. [video added] She's all grown up and she wants you to know it. From kids show star to sex symbol, Yo Gabba Gabba's Foofa is ready to rock! [a montage of Foofa magazine covers and poses] She's been seen out partying, photographed smoking pot, and now, Foofa has announced a raunchy performance on the MTV Video Music Awards. Foofa's new manager claims the MTV performance will be one for the record books."
    },
    {
        "character": "Ike",
        "line": "[At a bar via satellite, drinking, smoking AND chewing tobacco.] Foofa's got that nice shaved strange that you just wanna get in and tame the second you see it."
    },
    {
        "character": "Anchor",
        "line": "The video awards are at 8 pm tomorrow."
    },
    {
        "character": "",
        "line": "The Broflovski living room, evening. Ike and Foofa are watching E! from the sofa."
    },
    {
        "character": "Foofa",
        "line": "Oh this is so exciting!"
    },
    {
        "character": "Ike",
        "line": "Told you it'd go over well."
    },
    {
        "character": "Kyle",
        "line": "[walks in from the kitchen and stares at both of them, then firmly says] Excuse me, but Ike has homework he's supposed to be doing."
    },
    {
        "character": "Ike",
        "line": "Shut up, Kyle! Just ignore my little brother."
    },
    {
        "character": "Kyle",
        "line": "I'm your big brother, Ike! [the doorbell rings]"
    },
    {
        "character": "Ike",
        "line": "Answer the door, twerp! [Kyle is angry, but there's not much he can do, so he answers the door. He sees Plex]"
    },
    {
        "character": "Plex",
        "line": "Can I talk to you?"
    },
    {
        "character": "Kyle",
        "line": "I'm sorry, but right now I'm feeling-"
    },
    {
        "character": "Plex",
        "line": "Foofa! [runs in, followed by the other Gabbers]"
    },
    {
        "character": "Brobee",
        "line": "Thank you, dude."
    },
    {
        "character": "Muno",
        "line": "Oh thank God."
    },
    {
        "character": "Toodee",
        "line": "Heey."
    },
    {
        "character": "Kyle",
        "line": "Hey!"
    },
    {
        "character": "Plex",
        "line": "Foofa, what is this about you going on the MTV Video Awards?"
    },
    {
        "character": "Foofa",
        "line": "I'm done being a kiddie star!"
    },
    {
        "character": "Plex",
        "line": "Foofa, you don't have to show your strange to get attention."
    },
    {
        "character": "Ike",
        "line": "You just don't get it 'cause you're a robot, Plex."
    },
    {
        "character": "Plex",
        "line": "Alright, you won't listen to us, but maybe you'll listen to our special guest, Sinéad O'Connor! [the rest of thte troupe welcome her as she walks up to them]"
    },
    {
        "character": "Sinéad",
        "line": "Don't do it, Foofa, Don't sell out your strange to those corporate bastards."
    },
    {
        "character": "Ike",
        "line": "Awww, screw off, Sinéad O'Connor. No one gives a crap about you."
    },
    {
        "character": "Plex",
        "line": "Don't show your strange on TV."
    },
    {
        "character": "Troupe",
        "line": "Don't show your strange."
    },
    {
        "character": "Plex",
        "line": "Your strange is for your husband, not for all the world to see."
    },
    {
        "character": "Troupe",
        "line": "Don't show your strange on TV"
    },
    {
        "character": "Sinéad",
        "line": "I'm looking for a boyfriend. Looking for a boyfriend."
    },
    {
        "character": "Kyle",
        "line": "Will you get out of my living room, please?! [the phone rings and he answers it] Hello?!"
    },
    {
        "character": "Terry",
        "line": "[calling in from Canada] ...Have you ever had someone you love queef in your face? [serves himself some Canadian port]"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Terry",
        "line": "I'm sorry, I'm calling everyone in the Canadian health care system to find out if they're pleased with their health care. Is this [checks his monitor] Ike Broflovski?"
    },
    {
        "character": "Kyle",
        "line": "No, this is his brother."
    },
    {
        "character": "Terry",
        "line": "Your brother receives his medication from us, so we just wanna be sure he's satisfied with the service."
    },
    {
        "character": "Kyle",
        "line": "Satisfied with- [thinks a bit] Wait a minute. What medication?!"
    },
    {
        "character": "",
        "line": "Canadian Health Department, day."
    },
    {
        "character": "Terry",
        "line": "Before this meeting continues, I should have you be aware that my face has tested positive for queefie sores."
    },
    {
        "character": "Kyle",
        "line": "[confused] Ah I'm sorry, but I don't really care. I just want to know what medication my little brother has been getting from you, and why?!"
    },
    {
        "character": "Terry",
        "line": "People all over the world get their medication from Canada."
    },
    {
        "character": "Kyle",
        "line": "Yeah, but something is wrong with my brother and it might be your fault!"
    },
    {
        "character": "Terry",
        "line": "That's impossible! The Canadian health care system is completely integrated and streamlined with IntelliLink. [this alarms Kyle]"
    },
    {
        "character": "Kyle",
        "line": "You use IntelliLink?? Oh my God! Will you check his records please?"
    },
    {
        "character": "Terry",
        "line": "Sure, no problem. [gets to work] Now, what is your brother's Canadian Medicare's smartname?"
    },
    {
        "character": "Kyle",
        "line": "I dunno! [thinks a bit] Try \"strangetamer.\""
    },
    {
        "character": "Terry",
        "line": "\"strangetamer\" [the lights go out, a window shade comes down] Uh, yep, there it is. [presses a key and the lights come on] Ahh yes, here we go. I see your little brother has a constipation problem and has been taking a daily laxative since last May. [check again] Ah, yes, I'm afraid IntelliLink mixed that up and your brother has been receiving large doses of hormones that were supposed to go to an athlete in the northeast."
    },
    {
        "character": "Kyle",
        "line": "Are you saying that Ike has been given regular doses of hormones because of an IntelliLink screwup?!"
    },
    {
        "character": "Terry",
        "line": "Yes, that's right."
    },
    {
        "character": "Kyle",
        "line": "That system is totally screwed up and does nothing but wreak havoc!"
    },
    {
        "character": "Terry",
        "line": "It's fine! [pounds the table with his fists] It works fine! Just give it some time! [stands up] God, you sound like my wife! [turns left and walks away from the chair.] My... my wife."
    },
    {
        "character": "Rick",
        "line": "[sitting in an armchair nearby] That must be it. Don't you see, Terry? That health care integration system has made you defensive and hostile, and your wife's been puttin' up with it."
    },
    {
        "character": "Terry",
        "line": "[thinking out loud, in a stammer] And... that's why she queefed in my face."
    },
    {
        "character": "Kyle",
        "line": "Ex-cuse me?! If my little brother has been getting some athlete's hormones, then who has been getting Ike's medication?!"
    },
    {
        "character": "",
        "line": "A Patriots vs. Broncos game, day"
    },
    {
        "character": "Announcer",
        "line": "Tom Brady looking sluggish again today. Not sure what his problem has been lately."
    },
    {
        "character": "Tom Brady",
        "line": "Blue 28! ... Blue 28!"
    },
    {
        "character": "Commentator",
        "line": "Yeah, definitely not looking as strong and virile as he has in the past, Tom."
    },
    {
        "character": "Tom Brady",
        "line": "[his pants begin filling with poop] Huthuuuut [more poop comes out. The more he says it, the more his pants fill with poop] Hike!"
    },
    {
        "character": "Announcer",
        "line": "Brady steps back to pass. [Brady makes sure not to trip over his poop] He's got an open man at the 40 yard line! [Tom throws the ball, but it goes straight to the ground]"
    },
    {
        "character": "Commentator",
        "line": "And whatever is wrong with Tom Brady just seems to be getting worse. [Exhausted, Brady just sits on top of his poop and then sinks into it] Go Broncos."
    },
    {
        "character": "",
        "line": "South Park Elementary cafeteria, day. The sprinklers haved turned on and drenched everything. \"The Heat Is On\" plays on the PA system. Mr. Mackey sits on the floor in the same position Brady was in. The emergency lights flash on and off, and the kids are still eating lunch, despite being drenched. Suddenly, the music, lights, and sprinklers stop"
    },
    {
        "character": "Cody",
        "line": "Okay, there we go. [Mr. Mackey lifts his head up, disgusted] Your students can buy school lunches now, but they won't be able to get grades."
    },
    {
        "character": "Mr. Mackey",
        "line": "No, they have to be able to get grades!"
    },
    {
        "character": "Cody",
        "line": "Well, what you probably wanna do is upgrade to IntelliLink Platinum."
    },
    {
        "character": "Mr. Mackey",
        "line": "No! There's no more upgrades, m;kay?! I just want this [points to a panel] to work!"
    },
    {
        "character": "Cody",
        "line": "...What exactly do you mean by \"work\"?"
    },
    {
        "character": "Mr. Mackey",
        "line": "I just want students to be able to make appointments to see the counselor, be able to see the school norse in the easiest, most streamlined fashion!"
    },
    {
        "character": "Cody",
        "line": "Oh, you want the Centurion package. That's where we take all the IntelliLink panels and we rip them off the walls and we burn them. Then we wipe all the computers of IntelliLink software and you never deal with us again."
    },
    {
        "character": "Mr. Mackey",
        "line": "[walks away and thinks it over] Alright, upgrade me to the Centurion package."
    },
    {
        "character": "Cody",
        "line": "Right away. [goes to Room 7 to rip off the panel from the wall as Mr. Garrison watches from his desk, goes to the bathroom and rips the panels off the walls, goes to the various school offices and tears the panels off there, makes a bonfire in a steel drum out on the playground, and dumps all the IntelliLink hardware into it. He returns to the cafeteria and joins Mr. Mackey again, offering him a clipboard] Well alright sir, here's a clipboard you can use for students to sign up for counseling, [Mr. Garrison takes the clipboard] and I wanna thank you for choosing IntelliLink. [reaches into his back pocket, takes out a gun, and blows his brains out. He falls down, dead. All the students as well as Mackey are stunned]"
    },
    {
        "character": "",
        "line": "The MTV VMAs, night"
    },
    {
        "character": "Announcer",
        "line": "The MTV Video Music Awards will be back with a performance from Yo Gabba Gabba's Foofa singing, \"Pound My Sweet Strange.\""
    },
    {
        "character": "",
        "line": "backstage, Foofa and Ike wait for her cue"
    },
    {
        "character": "Stage hand",
        "line": "Two minutes, Foofa."
    },
    {
        "character": "Foofa",
        "line": "Thanks. Oh my, here we go! [Kyle appears at the far end of the room]"
    },
    {
        "character": "Kyle",
        "line": "Ike! [runs up to him] Wait! [the rest of Yo Gabba Gabba show up]"
    },
    {
        "character": "Ike",
        "line": "Get out of here, dude!"
    },
    {
        "character": "Kyle",
        "line": "Ike, there's been a mistake. You don't understand."
    },
    {
        "character": "Ike",
        "line": "No, you don't understand, wuss! Why can't you just let me grow up?! Why do you keep harassing me?!"
    },
    {
        "character": "Kyle",
        "line": "Because you're my little brother, Godddamnit! [Ike is awed at this] And even when I'm fifty and you're forty-five, you're still gonna be my little brother!"
    },
    {
        "character": "Host",
        "line": "All right, y'all, here comes our next big act!"
    },
    {
        "character": "Kyle",
        "line": "Ike, I don't care if you wanna grow up, I just wanna be by your side while you do it."
    },
    {
        "character": "Host",
        "line": "Give it up for the sexiest bitch on earth, it's Foofa!"
    },
    {
        "character": "Foofa",
        "line": "Come on, Ike. Ike?"
    },
    {
        "character": "Ike",
        "line": "He's right, Foof. Part of growing up is rebelling, but I'm gonna get older whether I like it or not. So why push it? I think I'm just gonna let it happen naturally. [walks to Kyle and the troupe]"
    },
    {
        "character": "Yo Gabba Gabba",
        "line": "Yaaaaay."
    },
    {
        "character": "Brobee",
        "line": "Foofa? [Foofa looks at the curtains, then at the group, then takes off her towel to reveal her domiatrix outfit, with two arrows pointing towards her strange, and walks out onto the stage]"
    },
    {
        "character": "Foofa",
        "line": "Come on, come on, and pound my strange. Pound it like this, [Yo Gabba Gabba reacts. Brobee covers his eyes] pound it like that."
    },
    {
        "character": "",
        "line": "Terry's mansion, day. He comes home, enters, and walks up to his wife"
    },
    {
        "character": "Terry",
        "line": "It was a mistake."
    },
    {
        "character": "Wife",
        "line": "What?"
    },
    {
        "character": "Terry",
        "line": "Trying to reform Canada's health care system and being too stubborn to admit that it wasn't working. And even when my wife said the system was too complicated, I wouldn't listen."
    },
    {
        "character": "Wife",
        "line": "Oh Terry, I was just trying to get your attention. I'm sorry I queefed in your face."
    },
    {
        "character": "Terry",
        "line": "I deserved it. Anyone who thinks streamlining health care into an integreated health care system would go smoothly deserves a giant queef in their face. Thank you, my lady."
    },
    {
        "character": "Wife",
        "line": "So IntelliLink is gone, my lord?"
    },
    {
        "character": "Terry",
        "line": "Yes, I've upgraded to the Gold package. Within no time, Canadians everywhere will be getting their correct medications, and going back to normal."
    },
    {
        "character": "",
        "line": "The Broflovski house, just before dawn. Kyle is asleep, but is awakened by chortles of laughter from downstairs. He gets up and goes to see what's happening"
    },
    {
        "character": "Kyle",
        "line": "Ike?"
    },
    {
        "character": "Ike",
        "line": "[back to his normal voice] Kyle! It's Dora the Explorer!"
    },
    {
        "character": "Dora",
        "line": "Come on, let's climb the mountain."
    },
    {
        "character": "Kyle",
        "line": "It sure is. Do you want me to watch it with you, Ike?"
    },
    {
        "character": "Ike",
        "line": "Yaaay! [Kyle is pretty happy too, and joins him on the sofa]"
    },
    {
        "character": "Dora",
        "line": "We made it all the way to the top."
    },
    {
        "character": "Ike",
        "line": "Oh man, I wouldn't mind hittin' that. I bet she's got that hot Puerto Rican strange. [Kyle's smile vanishes]"
    },
    {
        "character": "Kyle",
        "line": "Yeah, I bet she does."
    },
    {
        "character": "Ike",
        "line": "Yaaaay!"
    }
]