[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park, outside. The rising sun beats brightly on the town. Bouncy music plays as the boys' houses are visited.Cartman's room. He's awake, staring at the ceiling, thinking."
    },
    {
        "character": "Cartman",
        "line": "Boner balls. Boner balls-boner... Boner forest. Dense... boner forest."
    },
    {
        "character": "",
        "line": "Stan's kitchen. Stan is at the breakfast nook eating Astro Pops in milk, and he too is thinking."
    },
    {
        "character": "Stan",
        "line": "Pungent crotch sweat. Pungent milk- milky crotch spooge."
    },
    {
        "character": "",
        "line": "The bus stop. Cartman, Stan, Kyle, and Kenny await the bus."
    },
    {
        "character": "Kyle",
        "line": "Barking vaginal belch."
    },
    {
        "character": "Cartman",
        "line": "Protruding vaginal boner."
    },
    {
        "character": "Kenny",
        "line": "(Dilapidated titties incorporated.)"
    },
    {
        "character": "Cartman",
        "line": "Oh, I like that. [the bus rolls up and the boys get on board]"
    },
    {
        "character": "",
        "line": "Inside the bus."
    },
    {
        "character": "Butters",
        "line": "[pops up out of his seat and looks behind it] Rotten boobie turds!"
    },
    {
        "character": "Stan",
        "line": "Nah."
    },
    {
        "character": "Kyle",
        "line": "Bloody butt cough."
    },
    {
        "character": "Stan",
        "line": "[passively] Uh huh."
    },
    {
        "character": "",
        "line": "A Law Office. Stan reads possible site names from a list he compiled from his friends' suggestions to a live domain name registrar."
    },
    {
        "character": "Stan",
        "line": "Angry Clit Spasm"
    },
    {
        "character": "Registrar",
        "line": "[types the name into a who is and waits for results] Nope, sorry."
    },
    {
        "character": "Stan",
        "line": "Whooping Fart Balls."
    },
    {
        "character": "Registrar",
        "line": "Nnnnnope."
    },
    {
        "character": "Stan",
        "line": "Lubricated Titty Burgers."
    },
    {
        "character": "Registrar",
        "line": "That's taken too."
    },
    {
        "character": "Stan",
        "line": "[frustrated] Indifferent Rectal Semen Splooge!"
    },
    {
        "character": "Registrar",
        "line": "Sorry."
    },
    {
        "character": "Cartman",
        "line": "Indifferent Rectal Semen Splooge is taken too?! Come! On!"
    },
    {
        "character": "Kyle",
        "line": "How are we supposed to name our startup company if every name is already taken?!"
    },
    {
        "character": "Registrar",
        "line": "I told you, you just have to be really original with with your company name. There's a lot of startup company these days. [the boys look at each other]"
    },
    {
        "character": "Cartman",
        "line": "Furry Balls Plopped Menacingly On The Table, Incorporated!"
    },
    {
        "character": "Registrar",
        "line": "That's available! Congratulations!"
    },
    {
        "character": "",
        "line": "The Kickstarter Web site. A new project appears on it: \"Furry Balls Plopped Menacingly on the Table, INC.\""
    },
    {
        "character": "",
        "line": "Stan's room. There should be five boys there, but Cartman is missing."
    },
    {
        "character": "Kyle",
        "line": "It... doesn't... quite roll off the tongue."
    },
    {
        "character": "Stan",
        "line": "Dude, we're not gonna get any attention with that name."
    },
    {
        "character": "Butters",
        "line": "Man this sucks!"
    },
    {
        "character": "Randy",
        "line": "[opens the door and peeks in] Uhhh, Stan? Aren't you supposed to be in school?"
    },
    {
        "character": "Stan",
        "line": "No. Dad, we don't need school anymore. We're forming a startup company."
    },
    {
        "character": "Randy",
        "line": "A startup company? A company that does what?"
    },
    {
        "character": "Stan",
        "line": "No, we don't wanna do anything."
    },
    {
        "character": "Kyle",
        "line": "Yeah, that's why we wanna have a startup company."
    },
    {
        "character": "Butters",
        "line": "Yeah, we're sick of school! But all the good attention-getting startup names are taken."
    },
    {
        "character": "Randy",
        "line": "Wuhuhull, boys, there's more to starting a company than having a catchy name."
    },
    {
        "character": "Stan",
        "line": "...Nnnno, there isn't. [turns back to his computer and fleshes out the project]"
    },
    {
        "character": "",
        "line": "The neighborhood, day. Cartman runs down the sidewalk"
    },
    {
        "character": "Cartman",
        "line": "You guys! You guys, it's awesome! Holy shit you guys! [runs up to Stan's door and enters the house. He runs into Stan's room] You guys, I've got it!"
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "It's the greatest startup company name EVER! [Kyle and Stan move in closer to Cartman]"
    },
    {
        "character": "Kyle",
        "line": "What?! Tell us!"
    },
    {
        "character": "Cartman",
        "line": "Washington. Redskins. [Kyle and Stan look at each other]"
    },
    {
        "character": "Kyle",
        "line": "Washington Redskins?"
    },
    {
        "character": "Cartman",
        "line": "It's sooo sweet!"
    },
    {
        "character": "Stan",
        "line": "I'm pretty sure that's taken, Cartman."
    },
    {
        "character": "Cartman",
        "line": "It's not, dude! Some dumb court-thingy, and the trademark got pulled! You can use it! Aaand the logo!"
    },
    {
        "character": "Stan",
        "line": "[lowers his head and strokes his chin] Washington Redskins. [raises his head] I like it!"
    },
    {
        "character": "Kenny",
        "line": "(Me too!)"
    },
    {
        "character": "Kyle",
        "line": "What?!"
    },
    {
        "character": "Cartman",
        "line": "Dude! There's already brand name awareness and it's instantly recognizable!"
    },
    {
        "character": "Kyle",
        "line": "Wait. Guys, this, this doesn't seem legal."
    },
    {
        "character": "Cartman",
        "line": "Kyle, you're not hearing me! The trademark has been pulled! We can do whatever we want!"
    },
    {
        "character": "",
        "line": "And so the boys get busy setting up a Washington Redskins office in town. Stan and Cartman put up a Redskins banner behind the desk. Kenny decorates the front of the desk. Stan finishes his part of the work and climbs down."
    },
    {
        "character": "Stan",
        "line": "[walks up to Kyle] You alright dude?"
    },
    {
        "character": "Kyle",
        "line": "Yeah, I just... well I just thought our company name would be more like uh... or-original"
    },
    {
        "character": "Cartman",
        "line": "[climbs down the ladder and joins Stan and Kyle] It's a strong name, dude. It's like aggressive and masculine like Boner Forest, but Boner Forest was taken."
    },
    {
        "character": "Kyle",
        "line": "Yeah, but maybe we need a name that's more affirming, like, shows what we stand for."
    },
    {
        "character": "Cartman",
        "line": "We don't stand for anything. Remember our company plan, guys! [walks up to an easel with a 4 Point Plan on it] Start up, cash in, sell out, bro down."
    },
    {
        "character": "Kyle",
        "line": "I'm just not sure this is the name people are gonna give money to."
    },
    {
        "character": "Butters",
        "line": "[at the computer] We already got a dollar!"
    },
    {
        "character": "Stan",
        "line": "What?! [Cartman walks up to Butters]"
    },
    {
        "character": "Butters",
        "line": "One dollar pledge!"
    },
    {
        "character": "Kenny",
        "line": "(Yahoo!) [begins to dance]"
    },
    {
        "character": "Cartman",
        "line": "I told you guys! \"Washington Redskins\" totally gets people's attention!"
    },
    {
        "character": "Butters",
        "line": "Another two dollars!"
    },
    {
        "character": "Kyle",
        "line": "No way!"
    },
    {
        "character": "Cartman",
        "line": "Sittin' on our asses, here we come!"
    },
    {
        "character": "",
        "line": "News 4 Update"
    },
    {
        "character": "News 4 anchor",
        "line": "Another new startup company is gaining a lot of attention on the Internet. They're a company that does absolutely nothing, and they're called, the Washington Redskins. [the page loads and someone is scrolling through it] The Redskins started as what appeared to be some kind of adolescent prank, but almost overnight it has become one of the most heavily funded projects on Kickstarter. [scroll over, next is a teen boy] Why did you give five dollars to the Washington Redskins Kickstarter?"
    },
    {
        "character": "Teen boy",
        "line": "I dunno, I just. Uh. They don't do anything, that's pretty sweet. I dunno, I thought it was funny."
    },
    {
        "character": "Cartman",
        "line": "[on a video on the Kickstarter site] By pledging just one or two dollars, you are helping us in our fervent quest to not have to do stuff. If you pledge $10 or more, you will receive this luxurious company micro badge."
    },
    {
        "character": "News 4 anchor",
        "line": "It's called crowd-funding, using the Internet to raise money without having to pay back your investors, a tactic that some believe is unfair and impersonal."
    },
    {
        "character": "",
        "line": "The new Redskins office. Cartman takes a call"
    },
    {
        "character": "Cartman",
        "line": "Washington Redskins. Go fuck yourself. [Butters walks across the room] Sure, we'd be happy to take your money. Yup. Go to our Kickstarter page. Okay, nice, idiot. Uh huh, fuck you, bye bye."
    },
    {
        "character": "Businessman",
        "line": "[walks in with two other men] You are Eric Cartman?"
    },
    {
        "character": "Cartman",
        "line": "Yes, I know."
    },
    {
        "character": "Dan Snyder",
        "line": "My name is Dan Snyder. I'm the president and owner of the Washington Redskins"
    },
    {
        "character": "Cartman",
        "line": "Oh, cool. Please take a seat."
    },
    {
        "character": "Dan Snyder",
        "line": "Thank you, but I will stand."
    },
    {
        "character": "Cartman",
        "line": "Nice, I like that."
    },
    {
        "character": "Dan Snyder",
        "line": "Young man, we ask that you please stop using the name Washington Redskins for your organization."
    },
    {
        "character": "Cartman",
        "line": "Stop? But why?"
    },
    {
        "character": "Dan Snyder",
        "line": "Because we are the Washington Redskins, and we are a football team! You have NO right to use our name to get attention!"
    },
    {
        "character": "Cartman",
        "line": "Uhhh, the trademark got pulled so I'm totaly free to use the name, actually. [phone rings, Eric reacts] Um, Butters, could you get that?"
    },
    {
        "character": "Butters",
        "line": "[next to the phone, answers it. Stan is on his iPhone] Washington Redskins. Go fuck yourself."
    },
    {
        "character": "Dan Snyder",
        "line": "Look! Don't you see that when you call your organization \"The Washington Redskins\", its offensive to us?"
    },
    {
        "character": "Cartman",
        "line": "How is it offensive?"
    },
    {
        "character": "Coach",
        "line": "How is it offensive?! Jesus, what-?!"
    },
    {
        "character": "Dan Snyder",
        "line": "We are a proud team, Mr. Cartman! We have no wish to be associated with people who actively do nothing!"
    },
    {
        "character": "Coach",
        "line": "Makes us feel like a joke."
    },
    {
        "character": "Cartman",
        "line": "Guys, guys! We have total respect for you! When we name our company \"Washington Redskins,\" it was out of deep appreciation for your team and your people. [grins, knowing that's not the reason.]"
    },
    {
        "character": "Dan Snyder",
        "line": "Uh, I know I can't legally make you stop using our name, but, but won't you just do it out of decency?"
    },
    {
        "character": "Cartman",
        "line": "Mmmm, noooo, Because I don't want to. Aaaand we can't just change the name of our company 'cause it's like super hard. But hey, from one Redskin to another, go fuck yourself. [the men, dejected, turn and walk out the door]"
    },
    {
        "character": "",
        "line": "A Redskins jet in the sky. Snyder sits alone in it"
    },
    {
        "character": "Robin Meade",
        "line": "All around the world, people are saying they are inspired by the Washington Redskins. The Internet startup company has raised so much money in Kickstarter that now, more groups are doing the same."
    },
    {
        "character": "Reporter",
        "line": "[a reporter speaks as Snyder looks over hit masses pool] More news on the Washington Redskins tonight. Their defiant. F-You attitude has now caught the attention of the terrorist group ISIS. The terrorists said they admire the Washington Redskins and want to try it and follow their business model."
    },
    {
        "character": "A caller",
        "line": "[a newspaper falls out of a car, and Snyder picks it up and reads it] Well, let's not forget, Marsha that there's a people here, okay, who are not happy about the use of the name, the Football Washington Redskins!"
    },
    {
        "character": "Woman",
        "line": "Well yeah, but does anyone really care about them? [he turns to the camera and sheds a tear, in the manner of Indian Eyes Cody (Espera Oscar de Corti)]"
    },
    {
        "character": "",
        "line": "Back at Washington Redskins headquarters..."
    },
    {
        "character": "Cartman",
        "line": "Dude, this is sooo cool! We only have six days to go before all the money pledged to our company becomes liquid!"
    },
    {
        "character": "Kyle",
        "line": "[enters with Stan] Guys, we need to talk to you. I really don't think we wanna be a company that ISIS looks up to. We should maybe issue a statement saying that we don't sanction them."
    },
    {
        "character": "Cartman",
        "line": "Oh no. No, you guys. We started this company to do nothing. If we start doing stuff now, it'll put it all at risk!"
    },
    {
        "character": "Kyle",
        "line": "People aren't gonna support our company if we dig in our heels and say we don't care about anything!"
    },
    {
        "character": "Cartman",
        "line": "Digging in our heels and pissing on public opinion us what the Washington Redskins are all about! [pounds the desk a couple of times.] Now come on, guys! If you wanna be a successful business, then you have to be honest about what you are! [pound] Once you take a stand on something, you're pretending like your company is about more than money. Then all of a sudden you're the NFL and and your players get caught molesting little boys!"
    },
    {
        "character": "Kyle",
        "line": "That's the Catholic Church!"
    },
    {
        "character": "Cartman",
        "line": "NFL, Catholic Church, same thing! Okay, let's use the Catholic Church! You take a moral stand on issues, you say you're about honor and integrity, and the next thing you know, your clergymen are getting caught beating up their wives in an elevator!"
    },
    {
        "character": "Kyle",
        "line": "That's the NFL!"
    },
    {
        "character": "Cartman",
        "line": "It's the same thing, Kyle! The point is, if we as an organization claim to be about high morality, somebody is eventually going to get raped or beaten in an elevator and it's most likely going to be Butters."
    },
    {
        "character": "Butters",
        "line": "[gasps] Oh no!"
    },
    {
        "character": "Kyle",
        "line": "All right, I really don't want to have to do this, but... I'm not happy with the direction this company is taking."
    },
    {
        "character": "Cartman",
        "line": "Well, what are you gonna do? Go back to school? I'm not going back there, man!"
    },
    {
        "character": "Kyle",
        "line": "Maybe I'll start my own company."
    },
    {
        "character": "Cartman",
        "line": "Well that's fine! You can't call yourself \"Washington Redskins!\""
    },
    {
        "character": "Kyle",
        "line": "I don't want to! It's a stupid name! [eerie music plays for a few seconds]"
    },
    {
        "character": "Cartman",
        "line": "Well, I guess everything's out on the table now, huh Kyle?"
    },
    {
        "character": "Kyle",
        "line": "Yeah. I guess... I guess everything is."
    },
    {
        "character": "Cartman",
        "line": "Stan? Do you think our name is stupid too?"
    },
    {
        "character": "Stan",
        "line": "I don't know, I... But I don't know if my future is with this company either."
    },
    {
        "character": "Cartman",
        "line": "Well then, I wish you both well in your new venture. Good-bye. [Kyle and Stan walk out the door. Butters begins to follow them, but stops in his tracks.]"
    },
    {
        "character": "Butters",
        "line": "Hang on, is this the company where I don't get raped? Yeah, he-here, right? Okay, I'm uh stayin' here."
    },
    {
        "character": "",
        "line": "NFL Headquarters"
    },
    {
        "character": "Dan Snyder",
        "line": "Is the league just going to sit by and while my team and my players are compared to ISIS. You have to do something, Commissioner Goodell! What are you going to do about this?!"
    },
    {
        "character": "Goodell",
        "line": "[sound clips come out of his mouth, indicating he's a robot] I will get it right, and do whatever is necessary to accomplish that."
    },
    {
        "character": "Dan Snyder",
        "line": "What?!"
    },
    {
        "character": "Goodell",
        "line": "We will continue to identify and add expertise to our team."
    },
    {
        "character": "Dan Snyder",
        "line": "That's the most ridiculous nothing answer I've ever heard! What are you gonna do now?!"
    },
    {
        "character": "Goodell",
        "line": "Everyone will participate in educating sessions starting in the next month."
    },
    {
        "character": "Dan Snyder",
        "line": "Ugh! This thing is broken!"
    },
    {
        "character": "Goodell",
        "line": "We can add... and we will do more, do more, do more [winds down and continues in a high pitch]"
    },
    {
        "character": "Dan Snyder",
        "line": "Get all the NFL owners on Skype! This thing is broken again!"
    },
    {
        "character": "",
        "line": "Skype session"
    },
    {
        "character": "Dan Snyder",
        "line": "And so I call upon the help of all owners. You cannot let my people be belittled like this!"
    },
    {
        "character": "Jim Irsay",
        "line": "Dan, you don't wanna be dealin' with this stuff. Let the Goodell-bot do it."
    },
    {
        "character": "Dan Snyder",
        "line": "The stupid thing isn't working!"
    },
    {
        "character": "Goodell",
        "line": "[starts up again] I will get it right."
    },
    {
        "character": "Steve Bischiotti",
        "line": "Man, that thing hasn't worked right since we bought it."
    },
    {
        "character": "Dan Snyder",
        "line": "Look, my team is starting to lose hope. You have to use your influence to make these people change their name."
    },
    {
        "character": "Paul Allen",
        "line": "Did you tell them we're about honor and integrity?"
    },
    {
        "character": "Alex Spanos",
        "line": "If the Goodell bot is broken, we must stay out of it more than even usual!"
    },
    {
        "character": "Dan Snyder",
        "line": "And so I'm alone? What if they ridicule the 49ers team next? Or make fun of Jerry Jones because his eyes are too far apart?"
    },
    {
        "character": "Jerry Jones",
        "line": "My eyes aren't too far apart!"
    },
    {
        "character": "Paul Allen",
        "line": "If we get them to change their logo, will it make you happy?"
    },
    {
        "character": "Dan Snyder",
        "line": "Uh I guess we can live with that."
    },
    {
        "character": "Jim Irsay",
        "line": "Then it is decided! We will make them change their logo. Begin mas behind-the-scenes under-the-table enforcement of our wishes NOW"
    },
    {
        "character": "Owners",
        "line": "Go! [all screens go blank]"
    },
    {
        "character": "Dan Snyder",
        "line": "Thank God!"
    },
    {
        "character": "",
        "line": "A Washington Redskins announcement. Lots of cheering and applause. Cartman steps on stage before a giant Redskins logo"
    },
    {
        "character": "Cartman",
        "line": "Fuck youuuu, fuck youuuu. Fuck you up there! Fuck you! \"Fuck you.\" Those words mean a great deal to us. They help us express just how we as a company... see things differently. There are a lot of startup companies on Kickstarter, but after today I think you'll agree that Washington Redskins is the most exciting. As you know, the Redskins have been on the forefront of Kickstarter as a company that is always finding new and exciting ways to tell people to go fuck themselves. And now, our company is thrilled to show you all the latest innovations we've come up with. [An image of the office appears, with the new changes] To begin with, we have moved the couch from the left side of the office to the right side. But we didn't stop there. We also added a new rug that goes better with our office drapes. And probably most exciting of all, we have actually updated the company from the inside out. We received a lot of pressure from certain communities to change our Redskins logo. As a company we want to be firm, but we also want to be flexible. And so we thought, if we have to change our logo, it should be more in step with today's times, but still define us as the leading Kickstarter company. What we came up with is the new company logo that I think you'll all agree is very exciting. [a pair of tits and male genitalia are added to the original logo, to much cheer and applause] Now when people hear the name \"Redskins\", they will immediately think \"titties\" and \"balls\". It's just a bold new way that we can say \"We don't fucking care.\" Go Redskins! [cheering and applause]"
    },
    {
        "character": "",
        "line": "Kyle's room. He and Stan are discussing their new company - it's \"Furry Balls Plopped Menacingly on the Table, INC.\" resurrected"
    },
    {
        "character": "Kyle",
        "line": "It's so awesome, dude. Our company already has a hundred backers. And we still have 14 days to go!"
    },
    {
        "character": "Stan",
        "line": "Yeah..."
    },
    {
        "character": "Kyle",
        "line": "You okay, bro?"
    },
    {
        "character": "Stan",
        "line": "I just... never saw myself owning a company called \"Furry Balls Plopped Menacingly on the Table, INC.\""
    },
    {
        "character": "Kyle",
        "line": "Give it time, it'll grow on you."
    },
    {
        "character": "Stan",
        "line": "Why don't we just call it \"Untitled Startup Company\"?"
    },
    {
        "character": "Kyle",
        "line": "Because that sounds like we don't have anything, We've been through this already, Stan!"
    },
    {
        "character": "Stan",
        "line": "Yeah, I know that. But a good company should never have seven words in its title."
    },
    {
        "character": "Kyle",
        "line": "Well whattaya mean?"
    },
    {
        "character": "Stan",
        "line": "I just feel that somewhere out there, there's a perfect startup company name. And I need to be free to go find it."
    },
    {
        "character": "Kyle",
        "line": "Oh. Well, I certainly don't want you to feel that \"Furry Balls Plopped Menacingly on the Table\" is holding you back. [Stan slowly walks to the door, then turns around]"
    },
    {
        "character": "Stan",
        "line": "Good luck with your company, dude."
    },
    {
        "character": "Kyle",
        "line": "Yeah. Good luck with yours. [Stan leaves and closes the door]"
    },
    {
        "character": "",
        "line": "Kickstarter Headquarters, night."
    },
    {
        "character": "Employee",
        "line": "It's just... incredible, Harry. Everyone is using Kickstarter for everything!"
    },
    {
        "character": "Harry",
        "line": "And for every project funded, we get 5%."
    },
    {
        "character": "Employee",
        "line": "It's like, we don't even have to do anything and we just make money."
    },
    {
        "character": "Harry",
        "line": "Sitting on our asses, here we come."
    },
    {
        "character": "",
        "line": "Kickstarter, moments later. Tribal music comes up. Dan Snyder rises from the bushes"
    },
    {
        "character": "Dan Snyder",
        "line": "Caw-CAW, Caw-CAW. [his football team rises from the bushes and gather behind him] HooHOO, hoohooHOO. [other players appear and they all move in. A player sneaks past a Kickstarter employee]"
    },
    {
        "character": "Employee 2",
        "line": "[lowers his cup] Huh? [goes back to sipping coffee. Two more players sneak past him, and #88 tackles him moments later. Number 28 tackles another employee. Pretty soon all the employees are targeted. Two players make it to the servers and head-butt them, causing damage to them. Number 48 kicks the head off one of the employees. An uninjured female waits for an elevator. The doors open, she goes in, and number 28 spooks her. She screams. Later, Kickstarter is in flames]"
    },
    {
        "character": "",
        "line": "South Park, morning"
    },
    {
        "character": "Cartman",
        "line": "Goooood morning, guys!"
    },
    {
        "character": "Butters",
        "line": "Happy Deadline Day!"
    },
    {
        "character": "Cartman",
        "line": "We made it, guys. We cab finally stop doing stuff and see just how much our company made in 4, 3, 2, 1 that's the deadline!"
    },
    {
        "character": "Butters",
        "line": "Oh boy, this is like Christmas morning!"
    },
    {
        "character": "Cartman",
        "line": "[tries to visit his page, but it's not coming up] What the hell? Can't find the server? [tries again] Kickstarter.com! [not found] Kickstarter. Where is Kickstarter?! Get it up on the phone, Butters. Come on, I wanna know how much our company is worth!"
    },
    {
        "character": "Butters",
        "line": "It's not coming up on my phone either. I... Holy Mother Mary!"
    },
    {
        "character": "Kenny",
        "line": "(What?!)"
    },
    {
        "character": "Butters",
        "line": "Somebody raided Kickstarter and they burned the building to the ground!"
    },
    {
        "character": "Cartman",
        "line": "What?!"
    },
    {
        "character": "Butters",
        "line": "Somebody killed Kickstarter!"
    },
    {
        "character": "Cartman",
        "line": "Who the hell would burn Kickstarter to the ground?! [gasps] Oh my God! That weird little Jewy guy! Kyle!"
    },
    {
        "character": "",
        "line": "Kyle's room. He's having trouble accessing the site too."
    },
    {
        "character": "Kyle",
        "line": "What the hell is wrong? \"Can't find the server\" Kickstarter. [Cartman barges in with Butters and Kenny in tow]"
    },
    {
        "character": "Cartman",
        "line": "You son of a bitch!"
    },
    {
        "character": "Kyle",
        "line": "What?!"
    },
    {
        "character": "Cartman",
        "line": "You broke Kickstarter!"
    },
    {
        "character": "Kyle",
        "line": "No, I just can't get it to load."
    },
    {
        "character": "Cartman",
        "line": "Nobody can! It's gone! You just couldn't take it that our company was more successful than yours would ever be!"
    },
    {
        "character": "Kyle",
        "line": "My company was on Kickstarter too! Why would I get rid of it?!"
    },
    {
        "character": "Cartman",
        "line": "Well, somebody did!"
    },
    {
        "character": "Stan",
        "line": "It doesn't matter, you guys. There's something a lot more important here. [walks up to the boys] Do you guys remember when we first decided to start a company together? We all had a common goal. And we weren't gonna let anything stop us from getting to the bro down. But somewhere between starting up and selling out we... we lost our way. We can't do this on our own. We need each other."
    },
    {
        "character": "Kyle",
        "line": "He's right. We should do a merger."
    },
    {
        "character": "Cartman",
        "line": "[shocked] A merger?! It's too late for that, you guys! Kickstarter is gone! We don't have a company! We don't have anything! [begins walking out the door]"
    },
    {
        "character": "Kyle",
        "line": "Yes we do! We have a sweet name. [Cartman turns around] I was wrong, Cartman. \"Washington Redskins\" is the perfect name. I think maybe I was jealous that I didn't come up with it."
    },
    {
        "character": "Cartman",
        "line": "[steps forward] It is really sweet."
    },
    {
        "character": "Stan",
        "line": "And we always said that all we needed was a sweet name and the rest would figure itself out,"
    },
    {
        "character": "Butters",
        "line": "Yeah, we can do it, fellas! It'll be like old times!"
    },
    {
        "character": "Kyle",
        "line": "Whattaya say, Cartman?"
    },
    {
        "character": "",
        "line": "Third Redskins announcement. Cartman comes out on stage again to cheers and applause"
    },
    {
        "character": "Cartman",
        "line": "Fuck you! Fuck you, everyone. Yes, fuck you all, thanks! [the cheering and applause die down] How do you stay relevant in a volatile marketplace? As you know, our goal at Washington Redskins is to not do anything, and make money not doing it."
    },
    {
        "character": "Kyle",
        "line": "[joins Cartman onstage] When Kickstarter went down, many saw their startup projects die, but here at Washington Redskins, we saw opportunity. People still need a way to raise money for their stupid startup projects, and with the Redskins you can now go fund yourself. [The modified Redskin logo fades to a single line saying \"GO FUND YOURSELF\"] And the idea is simple. You, the people, go out and raise all your own money, and give the Washington Redskins 5%."
    },
    {
        "character": "Cartman",
        "line": "You will literally be giving us money for doing absolutely nothing. It is the biggest \"fuck you\" we have ever come up with. But we didn't stop there, because a new company direction also means, of course, a new and improved logo. [The neo logo comes up - it's two of the old logo, with titties and balls and penises, one taking the other from behind. This receives cheers and applause]"
    },
    {
        "character": "Cartman and Kyle",
        "line": "Go Redskins!"
    },
    {
        "character": "",
        "line": "Arlington Stadium. A helicopter shot of the stadium"
    },
    {
        "character": "Announcer",
        "line": "A beautiful night in Arlington, Texas as the Dallas Cowboys get set to take on the Washington Redskins. That is, of course, Washington Redskins the football team, not Washington Redskins, the audacious crowd-funding company."
    },
    {
        "character": "Commentator",
        "line": "Yeah, and if you ask me, the Redskins are a scam."
    },
    {
        "character": "Announcer",
        "line": "You're talking about the crowd-funding company- Redskins, right?"
    },
    {
        "character": "Commentator",
        "line": "That's right. An-and now you've got terrorist groups like ISIS using the Redskins to raise their money. I-I don't like what the Redskins are doing."
    },
    {
        "character": "Announcer",
        "line": "Those Redskins"
    },
    {
        "character": "Commentator",
        "line": "Yeah, whatever."
    },
    {
        "character": "",
        "line": "The Visitors locker room. The Redskins sit there looking morose, even their owner Dan Snyder. Somber Native American music play"
    },
    {
        "character": "#35",
        "line": "It's over. Our name has been reduced to a stereotype and a joke."
    },
    {
        "character": "#59",
        "line": "Yeah, let's just go home."
    },
    {
        "character": "Dan Snyder",
        "line": "No. No, we cannot give up! We have been through too much together. We have fought Eagle, and Bear! The Eagles only beat us by three points."
    },
    {
        "character": "#92",
        "line": "Yeah, but I just feel pretty stupid wearing this now."
    },
    {
        "character": "#72",
        "line": "Yeah."
    },
    {
        "character": "#35",
        "line": "Come on, guys."
    },
    {
        "character": "#8",
        "line": "Where will we go? What will we do? [and with that his players desert him]"
    },
    {
        "character": "Dan Snyder",
        "line": "Don't let them break you! Don't let them win! [as kickoff approaches, a Native American drumbeat starts up]"
    },
    {
        "character": "Announcer",
        "line": "And the Cowboys are still set to kick off, but there doesn't seem to be anyone to kick off to."
    },
    {
        "character": "Commentator",
        "line": "Yeah, and Jerry Jones must be happy this means a forfeit, another win for the Cowboys. [with his bright chameleon eyes and a woman popping up from between his legs, he must indeed be happy. Mellow Native American music joins the drumbeat]"
    },
    {
        "character": "Announcer",
        "line": "Wait a minute, it appears a lone Redskin is making his way out of the locker room. [Dan Snyder comes out, not in uniform, but willing to face down the Cowboys. The referee blows the whistle and the game starts.] The Cowboys kick it off. [Snyder catches it, but the Cowboys quickly pile up on him, then get off]"
    },
    {
        "character": "Dan Snyder",
        "line": "[dusts himself off] Hut! Hut Hut Hut! [the Cowboys pile up on him again, then get off. He dusts himself off] Hut hut hut. Hut Hut Hut Hut! [the Cowboys pile up on him again, then get off. He dusts himself off. He's quite beat up now] Hut. Hut hut hut. Hut Hut! [the Cowboys pile up on him again, then get off. The crowd finally reacts]"
    },
    {
        "character": "Crowd",
        "line": "Oh!"
    },
    {
        "character": "Fan wearing #3",
        "line": "Just stay down! For the love of God!"
    },
    {
        "character": "Dan Snyder",
        "line": "[barely able to move] Hut hut. Hut! [the Cowboys pile up on him again, then get off. He dusts himself off]"
    },
    {
        "character": "Fan wearing #74",
        "line": "Stop! Make it stop!"
    },
    {
        "character": "Fan wearing #82",
        "line": "Just stay down!"
    },
    {
        "character": "Another fan",
        "line": "Please!"
    },
    {
        "character": "Fan wearing a blue star",
        "line": "Just make him stay down!"
    },
    {
        "character": "Other fans",
        "line": "Go Redskins! Go Redskins!"
    },
    {
        "character": "",
        "line": "Washington Redskins, now a crowd-funding company. Stan is at the armchair sipping Coke, Cartman is kicking back on the couch, Butters is at the desk working a paddleball, Kyle reads from a book, and Kenny is on a tablet"
    },
    {
        "character": "Stan",
        "line": "Boy, this is the life, huh guys?"
    },
    {
        "character": "Butters",
        "line": "We finally did it!"
    },
    {
        "character": "Cartman",
        "line": "I just might sit here until my ass fuses into the couch. [a brick flies in through a window and shards flow into the room]"
    },
    {
        "character": "Kyle",
        "line": "What the heck is that? [the boys leave the building to investigate]"
    },
    {
        "character": "",
        "line": "Outside headquarters, they face a protest"
    },
    {
        "character": "Cartman",
        "line": "Whoa, whoa! What?"
    },
    {
        "character": "Protestor #1",
        "line": "Change your name!"
    },
    {
        "character": "Protestor #2",
        "line": "It doesn't belong in today's society!"
    },
    {
        "character": "Kyle",
        "line": "Change our name?"
    },
    {
        "character": "Stan",
        "line": "But you all thought our name was sweet."
    },
    {
        "character": "Protestor #3",
        "line": "There's nothing sweet about a people who were decimated. A once proud nation that finally lost hope and left their leader to be massacred by Cowboys in a defiant last stand!"
    },
    {
        "character": "Kyle",
        "line": "When was that?"
    },
    {
        "character": "Protestor #4",
        "line": "Last night."
    },
    {
        "character": "Protestor #5",
        "line": "Until you change your name, we are asking all your subscribers to boycott you."
    },
    {
        "character": "ISIS spokesman",
        "line": "That's right! ISIS will no longer use your insensitive company for its fundraising!"
    },
    {
        "character": "Crowd",
        "line": "Yeah! Alright!"
    },
    {
        "character": "Protestor #1",
        "line": "Good for you, ISIS!"
    },
    {
        "character": "Kyle",
        "line": "Well what the hell do we do?"
    },
    {
        "character": "Cartman",
        "line": "[sighs and his voice drops] I guess we gotta go back to school. [they boys turn left and walk away, their heads hanging down. The protesters keep cheering until they're gone.]"
    }
]