[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Butters' room, day. He's at his computer singing to himself."
    },
    {
        "character": "Butters",
        "line": "Loo looloo loo loo loo loo, Loo looloo loo loo."
    },
    {
        "character": "Cartman",
        "line": "[opens Butters' door and enters] Hey, douchebag, are you doing anything kewl?"
    },
    {
        "character": "Butters",
        "line": "Hey, Eric, I'm just lookin' at a video of bird eggs that I took."
    },
    {
        "character": "Cartman",
        "line": "[heads for Butters' bed] Oh goddamnit, nobody's doing anything kewl! [gets on Butters' bed and lays down on his back.] I'm so bored! Everything is so stupid!"
    },
    {
        "character": "Butters",
        "line": "I don't know, this bird nest is pretty neato."
    },
    {
        "character": "Cartman",
        "line": "No, it isn't."
    },
    {
        "character": "Butters",
        "line": "My dad and I shot it yesterday at the lake."
    },
    {
        "character": "Cartman",
        "line": "That's stupid."
    },
    {
        "character": "Butters",
        "line": "You can see the momma bird fly in."
    },
    {
        "character": "Cartman",
        "line": "I'm dying of boredom."
    },
    {
        "character": "Butters",
        "line": "We took all kinds of video with his drone."
    },
    {
        "character": "Cartman",
        "line": "[sits up, suddenly interested] What did you say?"
    },
    {
        "character": "Butters",
        "line": "[looks over his shoulder] You know, those drone thingies. You can make it fly anywhere, and shoot video, and stuff."
    },
    {
        "character": "Cartman",
        "line": "Your dad has a fucking drone?"
    },
    {
        "character": "",
        "line": "Butters' house, day. Butters and Cartman lift up the garage door and behold the drone"
    },
    {
        "character": "Cartman",
        "line": "Whooaa! [runs up to it for a closer look]"
    },
    {
        "character": "Butters",
        "line": "It can fly like a quarter mile away from whoever's controlling it. And it can take video the entire time right to your phone. Don't touch the propellers."
    },
    {
        "character": "Cartman",
        "line": "[pulls his finger back and smiles at Butters] You wanna take it out for a spin?"
    },
    {
        "character": "Butters",
        "line": "Are you crazy?! This is my dad's drone!"
    },
    {
        "character": "Cartman",
        "line": "[runs up to Butters and stands next to him] Do you have any idea how much fun we can have with this thing? We can spy on everyone!"
    },
    {
        "character": "Butters",
        "line": "My dad said it's not for spying on people."
    },
    {
        "character": "Cartman",
        "line": "Butters, that's all drones are for. If we use it for a couple of minutes tonight, your dad will never know."
    },
    {
        "character": "Butters",
        "line": "Oh, he'll know. You can hear it take off."
    },
    {
        "character": "Cartman",
        "line": "Okay, good idea. [picks up the drone] We'll take it over to my house. Come over after dark. And don't tell anyone!"
    },
    {
        "character": "Butters",
        "line": "[goes to take the drone back] No, Eric. I don't wanna d-"
    },
    {
        "character": "Stephen",
        "line": "[off screen] Butters?"
    },
    {
        "character": "Cartman",
        "line": "Oh, shit, it's your dad! Go, go, go! [leaves the garage with the drone as Butters faces the source of the call, then pulls down the garage door] I'll see you later at my house."
    },
    {
        "character": "Stephen",
        "line": "Butters, are you home??"
    },
    {
        "character": "Butters",
        "line": "Comin', Dad! [leaves the garage through the side door into the house]"
    },
    {
        "character": "",
        "line": "Cartman's house, night. He's been working with the drone, figuring out how to operate it. There's a knock on his door."
    },
    {
        "character": "Cartman",
        "line": "Butters, is that you?"
    },
    {
        "character": "Butters",
        "line": "Yes, it's me."
    },
    {
        "character": "Cartman",
        "line": "[opens the door just a crack and peeks out] Nobody followed you, right? You didn't tell anybody?!"
    },
    {
        "character": "Butters",
        "line": "Of course not!"
    },
    {
        "character": "Cartman",
        "line": "Alright, come in. [opens the door to reveal Kenny] Kenny's here; I told him all about it. [Kenny waves hello]"
    },
    {
        "character": "Butters",
        "line": "What?! You said nobody would know!"
    },
    {
        "character": "Cartman",
        "line": "It's just Kenny. Like we're not gonna tell Kenny we have a fucking drone! Come on, Butters! Alright, come on, guys. I think I have this thing figured out. [outside, the drone sits in the grass in the backyard, 50 feet away from the house. Suddenly it rises to 23 feet, above the boys' heads, then veers to the right] Dude, no way! This thing is so epic! [the drone's camera shows some backyards through a fish-eye lens. A dog barks up at it from below.]"
    },
    {
        "character": "Butters",
        "line": "Be careful! The powerlines!"
    },
    {
        "character": "Cartman",
        "line": "Dude, look! There's everyone's backyards! [in the distance, Kenny's house is shown from the back two blocks away. The drone veers to the right and drops down a bit, headed for a back door] Dude there's Craig's house! That's Craig's house!"
    },
    {
        "character": "Kenny",
        "line": "(Okay, try to get closer!)"
    },
    {
        "character": "Butters",
        "line": "Okay, uh, maybe that's enough. [the drone approaches Craig's window]"
    },
    {
        "character": "Cartman",
        "line": "Aw dude, look, there's Craig! Heheh. [Craig is shown at his computer. The drone moves to the next window and shows Craig's mom undressing.] Craig's mom is taking off her clothes."
    },
    {
        "character": "Kenny",
        "line": "(Are you serious?!)"
    },
    {
        "character": "Butters",
        "line": "[gruffly] Let me see!"
    },
    {
        "character": "Cartman",
        "line": "Check it out guys, she's taking o- Oh my God, we've got full bush!"
    },
    {
        "character": "Kenny",
        "line": "(Stop taping!)"
    },
    {
        "character": "Butters",
        "line": "Jeeeeezz!"
    },
    {
        "character": "Cartman",
        "line": "This thing is recording, right?"
    },
    {
        "character": "Kenny",
        "line": "(Yeah.)"
    },
    {
        "character": "Cartman",
        "line": "Dude! That is Craig's mom's bush right there! Wait, wait what's that? [Craig's mom has heard the drone and called her husband Thomas over. She stands behind him as they both look at the drone outside their window] Oh shit, dude! Bail! Bail! [thrusts the controller at Butters]"
    },
    {
        "character": "Butters",
        "line": "What do I do?!"
    },
    {
        "character": "Cartman",
        "line": "His dad sees you!"
    },
    {
        "character": "Butters",
        "line": "[begins to panic] I don't know what to do!"
    },
    {
        "character": "Cartman",
        "line": "Fly back to the house, stupid!"
    },
    {
        "character": "",
        "line": "The Stotch house, night. Thomas Tucker bangs on the front door and Stephen comes to answer it."
    },
    {
        "character": "Thomas",
        "line": "You've got a problem, Stotch!"
    },
    {
        "character": "Stephen",
        "line": "What are you talkin' about?"
    },
    {
        "character": "Thomas",
        "line": "You know what I'm talkin' about! There was a drone spyin' on my wife, and you're the only person I know with a drone!"
    },
    {
        "character": "Stephen",
        "line": "Hey now hold on. I am a drone hobby enthusiast. I would never use my drone in a way that contradicts the drone hobbyist code of conduct."
    },
    {
        "character": "Thomas",
        "line": "Horseshit! Your drone is out there flyin' around right now!"
    },
    {
        "character": "Stephen",
        "line": "I assure you, my drone is sitting in the garage. I'll show you."
    },
    {
        "character": "",
        "line": "The Stotch house, garage. Stephen leads Thomas to the garage. He opens the side door"
    },
    {
        "character": "Stephen",
        "line": "There, you see? It's right there. [sure enough, the drone and its controller are on the garage floor as expected.]"
    },
    {
        "character": "Thomas",
        "line": "So, thuh so you flew it back here in time."
    },
    {
        "character": "Stephen",
        "line": "I swear I didn't fly it."
    },
    {
        "character": "Thomas",
        "line": "Well, these things don't just fly themselves, do they? They outta be illegal. I'd better not find out it was your drone! [hurries out of the garage. Stephen looks at the drone and wonders... spooky theremin music plays, so he's a little afraid as well]"
    },
    {
        "character": "",
        "line": "Butters' room, night. Stephen opens Butters' door and looks in"
    },
    {
        "character": "Stephen",
        "line": "Butters?"
    },
    {
        "character": "Butters",
        "line": "[already in his PJs and in bed, but clearly panting] Oh, heh-hey, Dad."
    },
    {
        "character": "Stephen",
        "line": "Butters, did you hear the drone making any sounds in the garage?"
    },
    {
        "character": "Butters",
        "line": "[panting throughout] Ah, hold on Dad. I should be sleepin'. Why do you ask?"
    },
    {
        "character": "Stephen",
        "line": "Nothing, son. It's nothing. Get back to sleep, pal. Love you."
    },
    {
        "character": "Butters",
        "line": "I love you too, Dad. [Stephen leaves and closes the door. That was close.]"
    },
    {
        "character": "",
        "line": "South Park, morning. At the bus stop, Cartman and Kenny wait for the school bus"
    },
    {
        "character": "Cartman",
        "line": "Alright, alright, shh Kenny, here come Stan and Kyle. Remember, not a word about this to anyone!"
    },
    {
        "character": "Kenny",
        "line": "(Yeah, I know, dude.)"
    },
    {
        "character": "Cartman",
        "line": "Not a word, Kenny!"
    },
    {
        "character": "Kenny",
        "line": "(Alright!) [Stan and Kyle's voices are heard]"
    },
    {
        "character": "Stan",
        "line": "Yeah, but seriously, it's like there's no real thing to hang on to, you know?"
    },
    {
        "character": "Kyle",
        "line": "Yeah, I don't even know if I'm gonna watch it anymore."
    },
    {
        "character": "Stan",
        "line": "I know. [they take their places next to Cartman]"
    },
    {
        "character": "Cartman",
        "line": "Hey, you guys."
    },
    {
        "character": "Stan",
        "line": "Sup? [the pressure gets to Cartman, but he resists. He finally cracks]"
    },
    {
        "character": "Cartman",
        "line": "You guys wanna see Craig's mom's bush?"
    },
    {
        "character": "Kenny",
        "line": "(Dude! What the fuck!)"
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "Somebody, I guess, was spying on Craig's mom and they got pictures of her bush, and it's like, it's like a yeti. You guys wanna check it out? [whips out his phone]"
    },
    {
        "character": "Kenny",
        "line": "(Dude!)"
    },
    {
        "character": "Kyle",
        "line": "That's horrible. If that's true, I don't wanna see it."
    },
    {
        "character": "Cartman",
        "line": "You don't wanna see Craig's mom's bush."
    },
    {
        "character": "Kyle",
        "line": "Not if somebody took pictures without her knowing."
    },
    {
        "character": "Stan",
        "line": "Let me see."
    },
    {
        "character": "Cartman",
        "line": "[shows Stan] Locked and loaded. Full metal bush, bro."
    },
    {
        "character": "Stan",
        "line": "How'd you get that on your phone?"
    },
    {
        "character": "Cartman",
        "line": "Oh. Um, uh... Kenny? [motions for Kenny to get closer, but Kenny doesn't budge] Oh, it was on the Internet. Yeah, I just downloaded it off the Internet and nobody knows who took it. Huh, Kenny?"
    },
    {
        "character": "Kenny",
        "line": "[grudgingly] (Uh huh.)"
    },
    {
        "character": "Kyle",
        "line": "That's terrible!"
    },
    {
        "character": "Cartman",
        "line": "I know, right? Now everyone's gonna see it."
    },
    {
        "character": "",
        "line": "South Park Elementary, later. Craig is at his locker when Jimmy, Tolkien and Clyde approach him"
    },
    {
        "character": "Jimmy",
        "line": "Hey, Craig, have you checked out the Internet lately? [he and the other two chuckle]"
    },
    {
        "character": "Craig",
        "line": "What are you talking about? [Cartman comes into view at the end of the hall and walks towards the boys room]"
    },
    {
        "character": "Jimmy",
        "line": "Ohhhh nothin'. It's just that... y-you might wanna invest in some hedge clippers. [he and the other two chuckle. Cartman chuckles as well]"
    },
    {
        "character": "Craig",
        "line": "For what?"
    },
    {
        "character": "Jimmy",
        "line": "Ohhhh nothin'. You just might wanna... hire Tarzan to do some... landscaping work for your mom. [he and the other two chuckle. Butters comes out of nowhere and shoves Cartman into the boys room, slamming him into the stall 1 wall]"
    },
    {
        "character": "Butters",
        "line": "What the heck are you doing?!"
    },
    {
        "character": "Cartman",
        "line": "Whoa, Butters, chillax, bro."
    },
    {
        "character": "Butters",
        "line": "When did you put Craig's mom's bush on the Internet?!"
    },
    {
        "character": "Cartman",
        "line": "Butters-"
    },
    {
        "character": "Butters",
        "line": "You promised me we wouldn't get in trouble!"
    },
    {
        "character": "Cartman",
        "line": "Butters. Butters."
    },
    {
        "character": "Butters",
        "line": "Now everyone is gonna know what we were doing!"
    },
    {
        "character": "Cartman",
        "line": "Butters, I had to! [Butters lets him go] Okay, I had to put it on the Internet!"
    },
    {
        "character": "Butters",
        "line": "WHY?!"
    },
    {
        "character": "Cartman",
        "line": "Because Stan saw the video on my phone, alright? If the video is only on my phone, then clearly we did it! If we downloaded it off the Internet, then anyone could have done it!"
    },
    {
        "character": "Butters",
        "line": "I should have never listened to you! Ah I should have known this would get out of hand!"
    },
    {
        "character": "Cartman",
        "line": "Butters, don't start playing the blame game here, okay?! You and Kenny are just as responsible! And the next time you wanna shove me, just remember, I'm covering your ass! [they leave the restroom. Stall 1 opens and Kyle steps out, angry at what he just heard]"
    },
    {
        "character": "",
        "line": "Neighborhood Watch meeting, Roger Donovan's house, evening. "
    },
    {
        "character": "Roger",
        "line": "Hi everyone. For those of you I don't know as well, my name is Roger Donovan, and un, just like you I'm pretty upset about what's going on in our neighborhood."
    },
    {
        "character": "Thomas",
        "line": "How are these drones legal?! My wife didn't deserve to be splayed all over the Internet like that!"
    },
    {
        "character": "Roger",
        "line": "Yes, well luckily nobody's watched the video of course. [a round of denials from the gathered adults] But the fact is that these drones are only getting more popular. I mean, anyone can get a drone off Amazon for 200 bucks, and there's no laws and the whole thing is pretty damned hairy. Oh-ohh, God I'm sorry Laura. [she looks around and gets mad] You know I I meant the situation is pretty hairy, right? Nothin' to do with you p-personally. I mean, how would I even know? I didn't see it. [she crosses her arms] Um..."
    },
    {
        "character": "Randy",
        "line": "[stands up] Look, we're all here because what happened to Laura could happen to any of us. There's nobody regulating these drones and if we don't do something now, we're gonna be up to our navels with bush. [winces. Sharon puts her face in her left hand] Oh um, up to our necks in trouble. Sorry. [sits down and looks at Sharon]"
    },
    {
        "character": "Laura Tucker",
        "line": "You know, it used to be called \"natural\". Completely shaving bald down there used to be the weird thing."
    },
    {
        "character": "Thomas",
        "line": "It's okay honey, the-"
    },
    {
        "character": "Laura",
        "line": "But now, because I \"choose\" not to let society dictate how hairy my vagina should be,"
    },
    {
        "character": "Randy",
        "line": "Eeww."
    },
    {
        "character": "Laura",
        "line": "I'm labelled as some kind of freaking monster!"
    },
    {
        "character": "Roger",
        "line": "And and and that's the point. I mean, we all have things about ourselves that are embarrassing, that that-"
    },
    {
        "character": "Laura",
        "line": "I'm not embarrassed about it! It's natural!"
    },
    {
        "character": "Stuart",
        "line": "It's a lot of natural."
    },
    {
        "character": "Roger",
        "line": "Look, look, why we're here is because it's gonna take all of us, a neighborhood watch, to make sure that our community stays safe."
    },
    {
        "character": "Mr. Garrison",
        "line": "Yeah, but how can we keep that close a watch on the whole neighborhood?"
    },
    {
        "character": "Randy",
        "line": "It's simple."
    },
    {
        "character": "",
        "line": "The neighborhood, day. The first Neighborhood Watch drone, which is black, appears, followed by more drones."
    },
    {
        "character": "Randy",
        "line": "Oh yeah, this is gonna work great. [smiles]"
    },
    {
        "character": "",
        "line": "The bus stop. The four boys are there. A Neighborhood Watch drone flies over it and then flies off."
    },
    {
        "character": "Kyle",
        "line": "Are you happy now?!"
    },
    {
        "character": "Cartman",
        "line": "What? [the drone returns and goes the other way]"
    },
    {
        "character": "Kyle",
        "line": "Is, is this? Do you think this is cool?"
    },
    {
        "character": "Cartman",
        "line": "What does that have to do with me?"
    },
    {
        "character": "Kyle",
        "line": "See, when you start invading people's privacy, eh thinking it's harmless to put up pictures of them they didn't want up - Kenny! - you start a domino effect that eventually screws everything up for everybody!"
    },
    {
        "character": "Cartman",
        "line": "Kenny has no idea what you're talking about, dude."
    },
    {
        "character": "Kyle",
        "line": "I was in the bathroom when you were talking to Butters, Cartman! [another drone floats by in the background] I know what-"
    },
    {
        "character": "Cartman",
        "line": "You were what?!"
    },
    {
        "character": "Kyle",
        "line": "I was in the bathroom-"
    },
    {
        "character": "Cartman",
        "line": "You were spying on me?!"
    },
    {
        "character": "Kyle",
        "line": "No, I was taking a crap, and I heard you guys talking!"
    },
    {
        "character": "Cartman",
        "line": "But you didn't say anything?! That's fucking spying, Kyle!"
    },
    {
        "character": "Kyle",
        "line": "How is that spying?!"
    },
    {
        "character": "Cartman",
        "line": "You were listening, but we didn't know you were there?! How is that not spying?! You'r a dick! You're a spying dick! And now you wanna lecture Kenny about spying?! Fuck you, hypocrite dick spy! [another drone hovers by]"
    },
    {
        "character": "",
        "line": "A strip mall, day. One of the stores there is The Hobby Enthusiast. Stephen and Butters go inside."
    },
    {
        "character": "Clerk",
        "line": "Hello, can I help you?"
    },
    {
        "character": "Stephen",
        "line": "Yes, I'd like to return this drone. [sets it on the counter. The clerk looks through the open box]"
    },
    {
        "character": "Clerk",
        "line": "You wanna return it?"
    },
    {
        "character": "Stephen",
        "line": "Yes, I'm... I'm not into the hobby anymore."
    },
    {
        "character": "Clerk",
        "line": "The hobby of flyin' drones is new and exciting. How can you not be into it? [Butters puts his arms tight against his sides and glances here and there]"
    },
    {
        "character": "Stephen",
        "line": "Look, something's wrong with it. It does things, it... [leans in] flies by itself."
    },
    {
        "character": "Clerk",
        "line": "Uhh, noo, somebody has to control it."
    },
    {
        "character": "Stephen",
        "line": "[stands straight] You don't understand. It was in the garage and the battery was fully charged. Someone said they'd seen it flying around, so I checked. [leans in] The battery was half empty."
    },
    {
        "character": "Clerk",
        "line": "[looks at Butters, then back at Stephen] I'm sorry, but we don't do returns. [Butters relaxes a bit]"
    },
    {
        "character": "Stephen",
        "line": "Please, I just want another hobby to get enthused about."
    },
    {
        "character": "Clerk",
        "line": "Sir, did you try looking at the SD card? All the video gets recorded to that so you could probably determine who flew it. [Butters tenses up again]"
    },
    {
        "character": "Stephen",
        "line": "You think I didn't try that? I pulled out the SD card. It was all erased. Somehow it erased everything."
    },
    {
        "character": "Clerk",
        "line": "Uh, sir, did you consider that your son might have done that?"
    },
    {
        "character": "Stephen",
        "line": "No, it's impossible. He's not allowed to fly it without my supervision. [looks down to his right, then to his left. The clerk fixes his gaze on him]"
    },
    {
        "character": "",
        "line": "A closeup of Thomas putting his pants on. He hears a Neighborhood Watch drone buzz by and looks out his bedroom windows"
    },
    {
        "character": "Thomas",
        "line": "Oh for God's sakes! [goes into the bathroom, where he sees Laura at the sink, having just gotten out of the shower. He also sees another drone outside the window, which has open curtains] Goddamnit get the hell out of here! [the drone hurries away, and he goes to the window and closes the curtains] That DOES IT!"
    },
    {
        "character": "",
        "line": "Park County Police Department, day. The Tuckers are there to file a police report"
    },
    {
        "character": "Thomas",
        "line": "You people have to do something! You're the law, and these things NEED to BE illegal!"
    },
    {
        "character": "Officer 1",
        "line": "But they aren't illegal, Mr. Tucker."
    },
    {
        "character": "Thomas",
        "line": "Our privacy was invaded, and now there are kids at school making music videos with the footage of my wife! Have you seen what they're doing?!"
    },
    {
        "character": "Sgt. Yates",
        "line": "Nono, none of us watched the video, but if we did, we could handle it. We're police officers. We see sickening things like that every day."
    },
    {
        "character": "Officer 1",
        "line": "We understand the humiliation your wife has gone through, Mr. Tucker, but we don't-"
    },
    {
        "character": "Laura",
        "line": "I haven't been \"humiliated\", I've been wronged! We are here to ask for your help, now are you gonna help us or not?!"
    },
    {
        "character": "Officer 1",
        "line": "Well that'd probably be best left to a professional hair removal company."
    },
    {
        "character": "Officer 2",
        "line": "Or perhaps a forest ranger?"
    },
    {
        "character": "Thomas",
        "line": "Help us with the drones spying on us!!"
    },
    {
        "character": "Sgt. Yates",
        "line": "All right, all right. We'll do everything we can."
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Cartman walks by the boys restroom when Butters comes at him again and shoves him into the restroom, again slamming him into the stall 1 wall."
    },
    {
        "character": "Butters",
        "line": "Are you out of your mind?! What are you doing?!"
    },
    {
        "character": "Cartman",
        "line": "Butters."
    },
    {
        "character": "Butters",
        "line": "Why would you turn \"Craig's mom's bush\" into a music video starring us?!"
    },
    {
        "character": "Cartman",
        "line": "Because, Butters-"
    },
    {
        "character": "Butters",
        "line": "Why can't you leave it alone?! Why can't you just stop?!"
    },
    {
        "character": "Cartman",
        "line": "[brushes Butters' hands off his jacket] Because, Butters, Kyle was spying on us, okay- [stops and kneels down to see if there's anyone in the stall, then gets up again] Kyle was spying on us, and he knows that we put the video of Craig's mom on the Internet. He found out everything. That's why I had to make another video."
    },
    {
        "character": "Butters",
        "line": "Why?!"
    },
    {
        "character": "Cartman",
        "line": "Because when Kyle said he heard us say we made the video, we can say we were talking about THIS video. \"Ohh, thank you Eric, that's pretty smart. I really owe you one.\""
    },
    {
        "character": "Butters",
        "line": "That poor lady. Her vagina is everywhere. Poor Craig."
    },
    {
        "character": "Cartman",
        "line": "Butters, we live in a world where privacy is gone. Okay? It's... It' just gone, bud. Your wiener, my balls, they're public domain. You can get on the Internet right now and look at that chick from Hunger Games butthole. We can either all freak out about it, or we can just calm down because honestly, I'm getting a little sick of covering your ass!"
    },
    {
        "character": "",
        "line": "The neighborhood, night. A Neighborhood Watch drone flies around and hones in on the Broflovski house. Gerald is on the couch eating a slice of cake and watching TV - Real Housewives of Atlanta."
    },
    {
        "character": "Randy",
        "line": "Heheh, Gerald is watching Housewives of Atlanta."
    },
    {
        "character": "Sharon",
        "line": "You're supposed to be keeping watch on the neighborhood."
    },
    {
        "character": "Randy",
        "line": "I am. Let's see what Nelson's doing. [the drone leaves the Broflovski house and hovers over to the Neloson house, where Nelson is having sex with his girl. Randy puts his wine glass on the bedstand and concentrates on the video feed. He glances at Sharon a few times to see if she's noticing. She isn't. Soon, a police drone appears, with blue and red flashing lights and a siren. It aims for Randy's drone.] Oh shit! [gets his drone to fly off, but the police drone keeps up] Dude! Neighborhood Watch! I'm Neighborhood Watch! [has the drone turn to face the police drone, which is armed. The police drone fires two rounds into Randy's drone, which falters. Sharon finally looks over] I've been shot! [his drone crashes into a backyard] No! Noooo!"
    },
    {
        "character": "",
        "line": "News 4 breaking news."
    },
    {
        "character": "Anchor",
        "line": "Shock and outrage all over the state tonight after an on-duty police drone chased and shot down an unarmed civilian drone, and worst of all, yes, the civilian drone was black. [a picture of a similar drone pops up behind him]"
    },
    {
        "character": "Jimbo",
        "line": "What gives them the right to shoot down our drones?!"
    },
    {
        "character": "Randy",
        "line": "I wasn't doing anything wrong! This is a complete outrage to drone owners everywhere!"
    },
    {
        "character": "Farmer",
        "line": "It was about yay big. [strokes the back of his head] I mean the hair on it was out to here [spreads his arms out so there's three feet between his hands], and then it had another trail of hair down from her belly button. I mean, the, the drone. Yeah, that's what I saw. That that's all I saw."
    },
    {
        "character": "Anchor",
        "line": "While police claim they were only following standard protocol, the drone owners are banding together and holding a candlelight vigil."
    },
    {
        "character": "",
        "line": "Downtown South Park, night. A group of civilian drones hovers down the street, each drone holding a lit candle. Sirens and lights come up and the drones turn right to see police drones approaching"
    },
    {
        "character": "Police drone",
        "line": "Please disperse. Candles on top of drones are a fire hazard, [the civilian drones look at each other] Return to your garages."
    },
    {
        "character": "Mr. Garrison",
        "line": "[on his bed holding the controller and a glass of wine] What the hell are these police drones doing? We can't protest now?"
    },
    {
        "character": "Steve",
        "line": "[on his bed with Linda, his wife] Just hover, honey. They can't do anything if we're just hovering."
    },
    {
        "character": "",
        "line": "Randy's house, later. Someone is banging on his front door, and he goes to answer it. It's Stephen, with Butters on the sidewalk"
    },
    {
        "character": "Stephen",
        "line": "[looking frazzled] Randy. We need to talk."
    },
    {
        "character": "Randy",
        "line": "Okay."
    },
    {
        "character": "Stephen",
        "line": "Inside. [Randy lets him in and moments later sits on the sofa with Sharon and Butters. Stephen paces the floor before them] I've been going over it and over it in my head. I thought Butters and I were alone, but then I saw you on the news. [walks up to Randy] Another drone hobby enthusiast whose drone was blamed for something the enthusiast didn't recall doing. Randy, this is very important. Is it possible that you did something contrary to the proper code of conduct for drone-flying enthusiasts?"
    },
    {
        "character": "Randy",
        "line": "No. I didn't. [theremin music starts up as Stephen walks back to where he was]"
    },
    {
        "character": "Stephen",
        "line": "I thought it was just my drone, but I think it might be all of them."
    },
    {
        "character": "Randy",
        "line": "What might be?"
    },
    {
        "character": "Stephen",
        "line": "Once you eliminate the impossible, whatever remains, no matter how improbable, must be the truth! Our drone flew! The battery was drained! The SD card was erased! Butters was the only other person who had access to it! Butters can't use the drone without my supervision! So where does that leave us, Randy??"
    },
    {
        "character": "Randy",
        "line": "...Drones are spooky?"
    },
    {
        "character": "Stephen",
        "line": "If they have minds of their own, they're more than spooky! I don't know about you, but I'm starting to feel pretty unenthused about this hobby."
    },
    {
        "character": "",
        "line": "News 4 news break."
    },
    {
        "character": "Anchor",
        "line": "The town of South Park has become a hotbed of tension with civilians lashing out at police. After police used excessive force at a peaceful protest, the town has now broken out into full-scale riots. [sure enough, there are riots all over the place, but no humans are rioting. It's all the drones. One drone crashes into a building, then bounces off it and into a car through the windshield. Another drown crashes through Tele's display window and two others make off with a flatscreen TV] As the people of South Park continue to protest, the South Park police are now ordering a mandatory reverse curfew. The governor has asked for help from the National Guard to bring order to the town."
    },
    {
        "character": "",
        "line": "South Park, day. National Guard drones begin flying into town. In one house, a woman goes to undress. A drone stops by to get a closer look, and a second one joins it, then they both fly off. The woman hears the buzzing and looks out her window."
    },
    {
        "character": "",
        "line": "20/20 preview"
    },
    {
        "character": "Announcer",
        "line": "Tonight on an all-new 20/20. [a Viper probe droid appears onscreen...] A town in crisis over the matter of privacy. [...and gets a red \"NO\" circle stamped on it] Now for the first time we sit down and talk to the mom behind the bush."
    },
    {
        "character": "",
        "line": "The Tucker house. A 20/20 reporter is interviewing Thomas and Laura in low light"
    },
    {
        "character": "Reporter",
        "line": "You've become sort of a poster child for privacy and drone issues."
    },
    {
        "character": "Laura",
        "line": "I don't think anyone wants to live in a world where police drones are monitoring Neighborhood Watch drones. I mean, where does it stop?"
    },
    {
        "character": "Reporter",
        "line": "It just... keeps going on and on. Kind of like your... [Laura gets mad] I mean... it just... goes outside what most people would call... acceptable."
    },
    {
        "character": "Laura",
        "line": "Have you ever seen pictures of naked women before 2005?! It's not that weird!"
    },
    {
        "character": "Thomas",
        "line": "It's okay, honey."
    },
    {
        "character": "Reporter",
        "line": "I didn't see the video. I don't believe in doing that, but uh... I'm just saying that... the situation in in your town is... unwieldy? [the power begins to flicker and on monitors everywhere the image of Stephen appears, with Butters behind him. Stephen now has facial hair and a paranoid look about him]"
    },
    {
        "character": "Stephen",
        "line": "Please do not adjust your televisions!"
    },
    {
        "character": "Reporter",
        "line": "What is that?"
    },
    {
        "character": "Stephen",
        "line": "My name is Stephen Willis Stotch. The drone that took the video of Craig's mom... was my drone. I didn't want to believe it, but they do things without us knowing. At this point, I have completely lost all enthusiasm for the hobby. [a shot of Gerald and Sheila in bed with their glasses of wine and their controllers] All of you with drones, please listen to me. Three days ago my drone recorded a video that something uploaded to the Internet. We all were told to respectfully not watch the video. But on the page, [holds up a printout of the YouTube page] it has over three hundred million views, so if none of us watched it, who did? [a shot of Gerald and Sheila, then Steve and Linda] We have to find a way to get rid of them! Before they get rid of us!"
    },
    {
        "character": "",
        "line": "Cartman's house, day. His doorbell rings and he goes to answer it. It's Butters, and behind him are police drones and National Guard drones"
    },
    {
        "character": "Cartman",
        "line": "Oh hey Butters. Sup?"
    },
    {
        "character": "Butters",
        "line": "Do you remember when I showed you the video of the little bird eggs? Well that's the last time I felt happy."
    },
    {
        "character": "Cartman",
        "line": "Dude, what's the matter?"
    },
    {
        "character": "Butters",
        "line": "I have to tell the truth. I want you and Kenny to come with me and tell Craig's mom we're sorry and that we'll-"
    },
    {
        "character": "Cartman",
        "line": "Okay okay okay. Come inside, there's drones out here. [takes Butters in and closes the door]"
    },
    {
        "character": "Butters",
        "line": "I don't want anymore discussions, Eric! I don't want anymore excuses!"
    },
    {
        "character": "Cartman",
        "line": "Butters."
    },
    {
        "character": "Butters",
        "line": "I just want to end this so we can take our punishment and be done with it!"
    },
    {
        "character": "Cartman",
        "line": "[while Butters speaks] Okay. Okay. Butters, Butters."
    },
    {
        "character": "Butters",
        "line": "I don't want all these drones everywhere! Nobody does!"
    },
    {
        "character": "Cartman",
        "line": "Butters. BUTTERS. All right, all right Butters, fine! I have a way that we can get rid of all the drones."
    },
    {
        "character": "Butters",
        "line": "You do?"
    },
    {
        "character": "Cartman",
        "line": "Yes. Everyone is sick of it, it's just that everyone is waiting for everyone else to stop. We can put an end to it all tonight. We're just gonna need one thing."
    },
    {
        "character": "Butters",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "Your dad's drone."
    },
    {
        "character": "Butters",
        "line": "NO! There is NO WAY I'm gonna-"
    },
    {
        "character": "Cartman",
        "line": "Butters. Butters Butters! Jennifer Lawrence's butthole didn't take picture of itself! It started with her! Right? Just like this started with you spying on birds! Now I'm willing to bail you out of all this, but I swear it's the last time! Okay?!"
    },
    {
        "character": "Butters",
        "line": "...Okay."
    },
    {
        "character": "",
        "line": "Butters' house, night. Stephen is at the sofa preparing a sizeable bomb. He's soldering the ends of a cable together, then takes a sip of spirits, then picks up a grenade launcher and pops a grenade in place. He stands up"
    },
    {
        "character": "Stephen",
        "line": "Time to end this hobby once and for all! [he moves stealthily to his garage, opens the door, and jumps in ready to blow his drone up, but finds it missing again] No! NOOOO!"
    },
    {
        "character": "",
        "line": "Cartman's house. Kenny is back with Butters and Cartman as Cartman gets ready to execute his next big idea."
    },
    {
        "character": "Cartman",
        "line": "[with the controller] Alright, we've got power. Prepare for takeoff."
    },
    {
        "character": "Butters",
        "line": "If this doesn't work, we're dead."
    },
    {
        "character": "Cartman",
        "line": "It'll work, Butters. If there's one thing we've learned, it's that drones can't resist Craig's mom. [he gets the drone going. It rises, pulling behind it a blow-up doll made to resemble Laura, with a large bushy wig over the crotch. The drone and doll hover away from Cartman's house.]"
    },
    {
        "character": "",
        "line": "Park County Police Station, night. The police drones, some with shields, hover over the civilian drones. A news drone flies by. Both sides jockey for positions, but then notice the National Guard drones arriving. One of the civilian drones then notices the sex doll floating by. The doll floats up to the police drones and National Guard drones and they take notice too. The doll floats away and all the drones, civilian, police, and National Guard, follow. The doll floats through the town gathering more and more drones. It goes over the bridge and across Stark's Pond, luring all the drones away. Where they ended up is anybody's guess."
    },
    {
        "character": "",
        "line": "A convention room, night, several days later. Stephen Stotch is at the podium with the rest of the town seated at tables. Everyone is applauding the Tuckers, but Laura isn't pleased."
    },
    {
        "character": "Stephen",
        "line": "We're here tonight to pay tribute to a woman who overcame humiliation, who rose above the monsters invading her privacy and said \"No more!\" Just when it seemed that we were about to live in a world controlled by drones, she did something miraculous. And someday, our children's children will still be telling stories about how Craig' mom flew through the town and led all the drones away. [more applause, and Laura buries her face in her right hand. A minstrel with lute comes out to sing Laura's praises]"
    },
    {
        "character": "Minstrel",
        "line": "Have you heard the tale of Craig's mom's bush\nAnd the night that it saved us from drones?\nNobody knew the power it had.\nThey just thought it was shaggy and gross.\nCraig's mom live a life of shame and despair\nEveryone feared her great giant bush!\n\n\n"
    },
    {
        "character": "Laura",
        "line": "They didn't!"
    },
    {
        "character": "Minstrel",
        "line": "But then when drones were filling the sky,\nShe unfurled her bush and she used it to fly.\nCraig's mom's bush, Craig's mom's bush.\nGargantuan thicket of madness.\nBigger than earth and denser than gold.\nTruly a magical bush to behold.\n\n\n"
    },
    {
        "character": "",
        "line": "Butters' and Cartman's table. Butters is a bit distraught. The minstrel continues with the lute and some whistling"
    },
    {
        "character": "Cartman",
        "line": "Well, you see, Butters, everything worked out. [Butters doesn't respond] \"Oh, thank you, Eric. I screwed up everything, but now everyone's happy. Thanks for covering my ass.\""
    },
    {
        "character": "Butters",
        "line": "Craig's mom doesn't seem very happy."
    },
    {
        "character": "Cartman",
        "line": "[taken aback, then sighs] Alright, I have a way that we can make Craig's mom happy."
    },
    {
        "character": "Butters",
        "line": "No! No, no! I'm sorry. Thank you, Eric! I screwed up everything, but now everyone's happy! Thanks for covering my ass!"
    },
    {
        "character": "Cartman",
        "line": "You're welcome. [the minstrel begins to sing again]"
    },
    {
        "character": "Minstrel",
        "line": "And she flew and she flew away into the sun\nAnd then she died.\nCraig's mom's bush, Craig's mom's bush.\nTruly a magical bush to behold.\n\n\n"
    }
]