[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Butters walks down the hallway wearing a fake Oculus headset. He stumbles along as if he's actually in virtual reality. He checks out the other kids, the floor, the surroundings..."
    },
    {
        "character": "Butters",
        "line": "WHOOAA! It's all so real! Uh this is amazing! It's like I'm there! [Craig turns to watch] I see all our friends at school. Oh wow! If I hold up my hands, I can see them too. Whooaa... [He and Stan bump into each other and Butters begins to run his hands over him] Wow, you were right. I can actually feel it."
    },
    {
        "character": "Stan",
        "line": "[holding Butters off] Butters, what the hell are you doing?"
    },
    {
        "character": "Butters",
        "line": "I feel Stan! He looks totally real!"
    },
    {
        "character": "Cartman",
        "line": "[hidden around the corner, in front of the camera] That's awesome, Butters. [snickers away from the walkie-talkie] Keep making your way down the hallway. Your vital signs are looking good. What do you see now? [snickers away from the walkie-talkie]"
    },
    {
        "character": "Butters",
        "line": "More of the school. [Clyde talks to Bebe, who then leaves]"
    },
    {
        "character": "Clyde",
        "line": "What are you doing, Butters?"
    },
    {
        "character": "Butters",
        "line": "The school and all the kids. [Clyde walks away] I still can't hear any sound except for your voice."
    },
    {
        "character": "Cartman",
        "line": "Yeah, they haven't worked out the audio yet, but I- [mutes the walkie-talkie and whispers] He's so fucking stupid. [un-mutes it] But I'm sure they will soon."
    },
    {
        "character": "Butters",
        "line": "[beginning to wobble] Ah, okay uh, I think I'm done, Eric. Ah I'm feeling kind of dizzy and uh- [about to take off the fake headset]"
    },
    {
        "character": "Cartman",
        "line": "[watching him from around the corner] Butters, no! Are you crazy?!"
    },
    {
        "character": "Butters",
        "line": "What what what?"
    },
    {
        "character": "Cartman",
        "line": "What did I tell you about removing the headset when you're not back in the access hub??"
    },
    {
        "character": "Butters",
        "line": "[turns so that he's facing away from the camera] Oh yeah, that it would split my neurons and scramble my brains! I forgot!"
    },
    {
        "character": "Cartman",
        "line": "You forgot your neurons would be torn apart?! Did you also forget that if you die in virtual reality you die in real life, Butters?!"
    },
    {
        "character": "Butters",
        "line": "I'm sorry!"
    },
    {
        "character": "Cartman",
        "line": "You need to find your way back to my room. Can you do that??"
    },
    {
        "character": "Butters",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "You only have eight minutes before the battery protocol dies, Butters. You have to hurry!"
    },
    {
        "character": "Butters",
        "line": "[begins to run] Oh Jesus! [Cartman looks on from around the corner]"
    },
    {
        "character": "",
        "line": "From school to home. Butters comes out the front doors and runs to the sidewalk. He looks both ways and runs off to his left. Next, Cartman's house is shown the Cartman's room. Butters makes it inside, where Cartman has put up fluorescent posters and accents"
    },
    {
        "character": "Butters",
        "line": "Okay, I'm back in your room!"
    },
    {
        "character": "Cartman",
        "line": "Alright Butters, sit down at the computer. [Butters does this] Now drop the suppornity window! We're just gonna make it!"
    },
    {
        "character": "Butters",
        "line": "[drops a shield over the glasses] Suppornity window dropped. [Cartman enters his room, locks the door and turns on the lights, then walks over to Butters and removes the fake headset. Butters wipes his eyes]"
    },
    {
        "character": "Cartman",
        "line": "Welcome back, dude."
    },
    {
        "character": "Butters",
        "line": "Wow! That was cool!"
    },
    {
        "character": "Cartman",
        "line": "How do you feel? Do you feel okay?"
    },
    {
        "character": "Butters",
        "line": "I touched Wendy's boob. [smiles]"
    },
    {
        "character": "",
        "line": "The cafeteria, lunchtime. Cartman is at table with Kyle, Tolkien, Kenny, Stan, and Jimmy. Cartman is laughing his ass off, but soon gets back to his story"
    },
    {
        "character": "Cartman",
        "line": "And then, and then he, he took off the shop goggles, and he was all like, \"Whoa, I'm back.\" [pounds his left fist on the table] Damn it if it's not the awesomest thing ever!"
    },
    {
        "character": "Stan",
        "line": "Sound pretty typical to me."
    },
    {
        "character": "Cartman",
        "line": "Come on, guys! This is the cure de gars of Butters' torture!"
    },
    {
        "character": "Kyle",
        "line": "Coup de grah, Cartman"
    },
    {
        "character": "Cartman",
        "line": "Thank you, Kyle."
    },
    {
        "character": "Stan",
        "line": "Poor Butters. Can't you just leave him alone?"
    },
    {
        "character": "Cartman",
        "line": "Dude, Butters is an asshole, and he deserves to be taken down once in a while, okay?!"
    },
    {
        "character": "Butters",
        "line": "Hey Eric! What'd ya say to the principal for missing first period? [in a knowing voice] Not that we were doing anything interesting. Right Eric? [chuckles]"
    },
    {
        "character": "Cartman",
        "line": "Yeah, I just told her I was running late and that it won't happen again."
    },
    {
        "character": "Butters",
        "line": "You know what I said? She asked me why I wasn't in school and I said \"Well, technically I was in school.\" Tee hee. Sorry guys, but Eric and I know a little something you don't. Not that it's anything that cool. Right Eric?"
    },
    {
        "character": "Cartman",
        "line": "Right Butters. [softly over his left shoulder] These guys are so dumb, huh?"
    },
    {
        "character": "Butters",
        "line": "Yeah. [runs off with his food tray]"
    },
    {
        "character": "Cartman",
        "line": "See? He's an asshole. Fuck him."
    },
    {
        "character": "",
        "line": "Cartman's room, night. Butters is at the computer while Cartman holds the fake headset in hand"
    },
    {
        "character": "Cartman",
        "line": "Each time you go into the virtual world it becomes more and more dangerous. Are you absolutely sure you want to do this, Butters?"
    },
    {
        "character": "Butters",
        "line": "Well, not a hundred percent..."
    },
    {
        "character": "Cartman",
        "line": "Even 10% is good enough. Here you go. [hands him the headset and Butters puts it on.]"
    },
    {
        "character": "Butters",
        "line": "Okay, subject is ready."
    },
    {
        "character": "Cartman",
        "line": "[picks up the walkie-talkie] Okay, Butters, I'm booting up the core competency now. [presses a few keys on the keyboard] Edifice framework is online. Vital signs appear to be normal. Interim status?"
    },
    {
        "character": "Butters",
        "line": "Interim status is go."
    },
    {
        "character": "Cartman",
        "line": "[turns off the room light so the fluorescent lights stand out] Digital malcontent now at parameter alpha. Prepare for full graphic interfaces on my mark: 5, 4, 3, 2, 1, [raises the shield]Mark. [quickly hides in the closet as Butters gets accustomed to the headset again]"
    },
    {
        "character": "Butters",
        "line": "It worked! I'm back in. All systems normal."
    },
    {
        "character": "Cartman",
        "line": "All right, Butters. Behind you you should see the door. Go through it and head outside."
    },
    {
        "character": "Butters",
        "line": "Going now! [bumps into the door frame, then goes downstairs. A second or two later Cartman comes out of the closet, turns on the light, goes to his computer and sits on his chair]"
    },
    {
        "character": "Cartman",
        "line": "Everything looks good, Butters. You're doing great. Let's get to work."
    },
    {
        "character": "Butters",
        "line": "Okay."
    },
    {
        "character": "",
        "line": "Stan's room, night. Stan is reading a book when he heats something outside. He sets the book aside and looks out his window. He sees Butters shoveling snow off people's driveways"
    },
    {
        "character": "Butters",
        "line": "How much more of this am I supposed to clear up?"
    },
    {
        "character": "Cartman",
        "line": "You're doing great. Almost done with this level Butters. Just make sure you clear the driveway and uh walkway of all the virtual snow."
    },
    {
        "character": "Butters",
        "line": "Okay. It's so realistic. [a shot of Stan watching from across the street.] The snow looks kind of fake though. [Stan leaves the window] Alright, I think that's all of it."
    },
    {
        "character": "Cartman",
        "line": "Okay, nice, Butters. Uhhm, now go to the front door and ring the doorbell. This is the part where you collect the money."
    },
    {
        "character": "Butters",
        "line": "[rings the doorbell. A middle-aged woman answers the door with a dollar bill in her hand] There's an old fat lady here! She's holding out money for me!"
    },
    {
        "character": "Cartman",
        "line": "Just take the money, Butters! [Butters reaches for the bill and takes it.]"
    },
    {
        "character": "Butters",
        "line": "Okay, I got it!"
    },
    {
        "character": "Cartman",
        "line": "You got the money? [Butters walks down the walkway as the lady closes the front door] Okay great, Butters. Now get back to the access point."
    },
    {
        "character": "Butters",
        "line": "Already? Oh no!"
    },
    {
        "character": "Cartman",
        "line": "Yeah, Butters, the discrepancy bars are oscillating. You need to uh, come back. [eats some more chips] Are you heading back Butters? [no reply.] Butters? [Butters goes home] Alright, Butters, you should be heading back to the access point now. You're going off grid."
    },
    {
        "character": "Butters",
        "line": "I'm sorry, Eric, but there's just one thing I gotta do real quick. [goes inside, leaving the front door open]"
    },
    {
        "character": "Stephen",
        "line": "There you are, mister! Just what do you think you're doing?!"
    },
    {
        "character": "Butters",
        "line": "Hello, Dad! It's me, Butters!"
    },
    {
        "character": "Stephen",
        "line": "I know that! What do you-?"
    },
    {
        "character": "Butters",
        "line": "This is for all the times I got grounded! [makes a fist and fires it at Stephen's groin. Stephen doubles over in pain]"
    },
    {
        "character": "Stephen",
        "line": "Ohhh! Oooooo! Ohhh!"
    },
    {
        "character": "Butters",
        "line": "HA! I can almost feel his balls on my fist! [at the other end of the call, Cartman is shocked] Haha! How do you like that, Dad?!"
    },
    {
        "character": "Linda",
        "line": "Butters, why?? Oh my God!"
    },
    {
        "character": "Butters",
        "line": "Huh, that was incredible!"
    },
    {
        "character": "Cartman",
        "line": "[getting worried] Uh, Butters, uhh, get back to the access point now."
    },
    {
        "character": "Butters",
        "line": "I feel amazing! [giggles] I'm back outside now. I'm a baaaaad man! You hear me?! [starts throwing rocks] Eh take that, you stupid cars! [a hit car screeches to a halt]"
    },
    {
        "character": "Driver",
        "line": "[steps out of the car] What the hell are you doing, kid?!"
    },
    {
        "character": "Cartman",
        "line": "Butters, it's, uhh, time to stop. Get back to my place."
    },
    {
        "character": "Butters",
        "line": "[knocks the driver out of the car] Who's the man now?! I'm gonna take his car! This is like Grand Theft Auto!"
    },
    {
        "character": "Driver",
        "line": "Hey! [Butters peels away]"
    },
    {
        "character": "Butters",
        "line": "Whoa! I'm in the car now."
    },
    {
        "character": "Cartman",
        "line": "Oh shit! [runs outside] Butters! Butters, where are you now?"
    },
    {
        "character": "Butters",
        "line": "Hahaha, I'm in the bad part of town! I just hit a lamp post! Ah, ah-I'm back on my feet. Oh, oh that's cool. There's a prostitute out here."
    },
    {
        "character": "Cartman",
        "line": "Okay Butters, let's call it good, okay?"
    },
    {
        "character": "Butters",
        "line": "I'm gonna beat her up and take her money!"
    },
    {
        "character": "Cartman",
        "line": "Wait, hang on Butters!"
    },
    {
        "character": "Butters",
        "line": "Take that, you dumb hooker!"
    },
    {
        "character": "Hooker",
        "line": "What you doin' motherfucker?!"
    },
    {
        "character": "Butters",
        "line": "I'm taking your money! Ow. Oh she stabbed me. Uh the hooker stabbed me."
    },
    {
        "character": "Cartman",
        "line": "Butters get back to my room! The veracrosses are destablilzing!"
    },
    {
        "character": "Butters",
        "line": "I can't [wheeze] I can't breathe too good. Eric, I can't see. Are you still there? Oh... I think I overdid it. I have to take this thing off. What the hell? What the hell is that?! AAAH!"
    },
    {
        "character": "Cartman",
        "line": "Butters?? Butters?? [turns the walkie-talkie off]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, now bigger, with two new wings and four floors. Moon shadows appear on the facade. Butters is in a room with a doctor and a nurse"
    },
    {
        "character": "Dr. Carroll",
        "line": "You're very lucky, young man. You've got a couple of hairline fractures, but the knife missed your spleen by half an inch."
    },
    {
        "character": "Butters",
        "line": "I... I d-didn't think a knife could really hurt me. Ah I thought I was just in a virtual reality."
    },
    {
        "character": "Dr. Carroll",
        "line": "No, you actually got stabbed by a hooker. We've called your parents and they're on their way. Your dad wanted me to let you know that you're grounded more than you can possibly imagine."
    },
    {
        "character": "Butters",
        "line": "Aw nuts!"
    },
    {
        "character": "Dr. Carroll",
        "line": "Try and relax, and when your parents get here we'll sort this all out. [the doctor and nurse leave. The nurse turns off the light]"
    },
    {
        "character": "Butters",
        "line": "I wonder how long I'm grounded for?"
    },
    {
        "character": "Cartman",
        "line": "Butters. [Butters looks to his right. Dramatic camera pan from Butters to Cartman, who stands on the window sill like Morpheus]"
    },
    {
        "character": "Butters",
        "line": "Ahhh!"
    },
    {
        "character": "Cartman",
        "line": "Are you okay?"
    },
    {
        "character": "Butters",
        "line": "Eric! Uh what are you doing here?"
    },
    {
        "character": "Cartman",
        "line": "I'm not here, Butters."
    },
    {
        "character": "Butters",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "This is going to be hard to understand, Butters, [climbs down to the floor] but, you've become trapped in a simulation. None of this... [spreads his arms out] is real."
    },
    {
        "character": "Butters",
        "line": "[looks around skeptically] Nuh uh!"
    },
    {
        "character": "Cartman",
        "line": "Yeahuh huh. I told you never to take the headset off outside the access point, didn't I?! We're actually both in my house right now. You're wearing the headset and I'm talking to you as a computer program. That's why I can... manipulate reality. [pulls off the missing thumb trick.]"
    },
    {
        "character": "Butters",
        "line": "WHAT?? [Cartman puts on a couple of thumb lights and clicks them on and off in alternate order.]"
    },
    {
        "character": "Cartman",
        "line": "You see, in this world, things aren't... what they seam. [pulls out a wand from his sleeve and produces a bouquet of flowers from it]"
    },
    {
        "character": "Butters",
        "line": "[now on edge] Aghah. Okay, stop! Stooop!"
    },
    {
        "character": "Cartman",
        "line": "Listen to me carefully, Butters. The Oculus Compromise has been streamlined. You can't trust anyone in this reality. Say nothing to no one about the Oculus Rift. If you think they know, they will kill you."
    },
    {
        "character": "Butters",
        "line": "Ah how do you know that?!"
    },
    {
        "character": "Cartman",
        "line": "[pressing a buzzer] How would I know that the nurse is about to walk through that door? [hides under the bed]"
    },
    {
        "character": "Nurse",
        "line": "Everything okay in here?"
    },
    {
        "character": "Butters",
        "line": "Aaaaah! Yes! Y-yes everything's fine!"
    },
    {
        "character": "Nurse",
        "line": "O-kay. [turns around and walks out. Cartman comes out from the window side of the bed]"
    },
    {
        "character": "Cartman",
        "line": "Butters."
    },
    {
        "character": "Butters",
        "line": "NO!"
    },
    {
        "character": "Cartman",
        "line": "I'm gonna get you back to reality, Butters. But you have to give me time! I've gotta go. The Orion parameters are embellishing. Just stay quiet! [performs another trick in which he gets a coin inside a glass bottle... and succeeds]"
    },
    {
        "character": "Butters",
        "line": "[thoroughly scared, shuts his eyes] AAAAAAHAHAH! [he opens them moments later and Cartman is gone.]"
    },
    {
        "character": "",
        "line": "The bus stop, next day. The four boys await the bus. Kyle is angry at Cartman"
    },
    {
        "character": "Kyle",
        "line": "Well? Are you happy, Cartman? Butters is completely traumatized!"
    },
    {
        "character": "Cartman",
        "line": "I'm happy that I totally got away with it. [gets a call] What's a 911 area code? Hello?"
    },
    {
        "character": "Steve",
        "line": "Hello, Eric. My name is Steve from Oculus Customer Service. There seems to be an error with our virtual headsets, and on behalf of the company, I would like to apologize and try to help."
    },
    {
        "character": "Cartman",
        "line": "With what?"
    },
    {
        "character": "Steve",
        "line": "This is going to be very jarring for you, but, there has been a malfunction with the headset you ordered from us. Right now, you're actually in your room at your computer wearing an Oculus headset, but, you're in a coma-like trance, my friend."
    },
    {
        "character": "Cartman",
        "line": "[slowly] Fuck you!"
    },
    {
        "character": "Steve",
        "line": "I understand your shock, my friend, but you have simply been in the virtual world so long you have forgotten."
    },
    {
        "character": "Kyle",
        "line": "You should probably listen to him, dude."
    },
    {
        "character": "Cartman",
        "line": "Uh huh. 'Cause I thought I was messing with Butters, but I'm actually the one trapped in virtual reality."
    },
    {
        "character": "Steve",
        "line": "The people you are talking to are just computer programs, my friend."
    },
    {
        "character": "Cartman",
        "line": "Guys, tell him you're not computer programs."
    },
    {
        "character": "Kyle",
        "line": "[glances at Stan and Kenny] Maybe we are."
    },
    {
        "character": "Cartman",
        "line": "[sighs and squeezes his eyes shut for a moment] Kyle, just- don't be a dick right now."
    },
    {
        "character": "Steve",
        "line": "I know this is very hard for you, but we don't have a lot of time."
    },
    {
        "character": "Cartman",
        "line": "Do you really think I'm that stupid?! That I believe all of this all along has been me living out some kind of virtual reality fantasy? Fuck you! [Well...]"
    },
    {
        "character": "",
        "line": "Cartman's room, day. Liane has prepared a glazed burger for Cartman and takes it to his room. She knocks on his door."
    },
    {
        "character": "Liane",
        "line": "Eric? Poopsiekins? [hearing no reply, she opens his door and goes in] Eric? [Steve was right. Cartman is at his computer wearing the Oculus headset, in a coma-like trance] Honey, maybe that's enough computer time. It's been about nineteen hours now. [Cartman's left foot twitches] I know you said not to disturb you with your new toy, but Mommy thought maybe you needed to eat? [this time Cartman moves his whole body] All right, I'll just leave it here, hon. [sets the burger next to the computer] I'm turning in for the night. Mommy loves you.[exits and closes the door]"
    },
    {
        "character": "",
        "line": "Butters' house, next day."
    },
    {
        "character": "Stephen",
        "line": "What kind of person did we raise you to be?! You think this world is just there for your amusement?! You are not to leave this room, and you are not allowed to use the phone or the computer!"
    },
    {
        "character": "Butters",
        "line": "Please! You can't do that! I have to find a way out of this!"
    },
    {
        "character": "Stephen",
        "line": "Oh no, mister. You are GROUNDED! [Butters recoils and Stephen slams the door shut. Butters turns around and goes to sit on the floor beside his bed. The door opens and Cartman enters]"
    },
    {
        "character": "Cartman",
        "line": "Are you fucking with me?!"
    },
    {
        "character": "Butters",
        "line": "...What? What do you mean?"
    },
    {
        "character": "Cartman",
        "line": "Butters, I'm seriously! Are you fucking with me?!"
    },
    {
        "character": "Butters",
        "line": "I don't know what you mean."
    },
    {
        "character": "Cartman",
        "line": "Because if you are, it's not cool!"
    },
    {
        "character": "Butters",
        "line": "Eric, you said you were going to get me out of this virtual world!"
    },
    {
        "character": "Cartman",
        "line": "Butters, I talked to Oculus Customer Service, and they said I'm the one who's wearing a headset and has forgotten he's in virtual reality!"
    },
    {
        "character": "Butters",
        "line": "Oh really? Oh, that's a relief."
    },
    {
        "character": "Cartman",
        "line": "Oh it's a relief, huh?! Well guess what, Butters! If I'm the one trapped in virtual reality, that means you're nothing but a computer program!"
    },
    {
        "character": "Butters",
        "line": "Oh gosh!"
    },
    {
        "character": "Cartman",
        "line": "That's right!"
    },
    {
        "character": "Butters",
        "line": "OH GOSH!"
    },
    {
        "character": "Cartman",
        "line": "THAT'S RIGHT! And you'd better stop messin' around, Butters, so I can help you out of this! Because you know how I said if you die in virtual reality you die in real life?"
    },
    {
        "character": "Butters",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "Well if you get grounded in virtual reality, you get grounded in real life too... FOREVER! [Butters is alarmed]"
    },
    {
        "character": "",
        "line": "The neighborhood park, day. Stan and Kyle are playing tether-ball near the restrooms. Kyle's phone rings"
    },
    {
        "character": "Kyle",
        "line": "[answers] Hello?"
    },
    {
        "character": "Butters",
        "line": "Kyle, it's Butters. I've been grounded!"
    },
    {
        "character": "Kyle",
        "line": "Again?"
    },
    {
        "character": "Butters",
        "line": "No no, you don't understand. This time I've been grounded for no good reason! I didn't do anything, Kyle!"
    },
    {
        "character": "Kyle",
        "line": "Uh huh."
    },
    {
        "character": "Butters",
        "line": "I think there's somethin' supernatural goin' on. I asked my dad why I was being grounded, and he said that for asking him, that I was more grounded! It doesn't make sense!"
    },
    {
        "character": "Kyle",
        "line": "Butters, Butters, I'm, I'm kind of super busy right now."
    },
    {
        "character": "Butters",
        "line": "PLEASE! Just go to Cartman's house. I think the answer might be within the-"
    },
    {
        "character": "Stephen",
        "line": "Butters?! Who is that?!"
    },
    {
        "character": "Butters",
        "line": "Ahhh! Wuhhhh! Ahhh- [Kyle looks concerned and hangs up]"
    },
    {
        "character": "Kenny",
        "line": "[runs up to Stan and Kyle, panicked] (You guys! You guys, oh shit, come check this out!) "
    },
    {
        "character": "",
        "line": "Cartman's room. Kenny leads Stan and Kyle inside over to Cartman, who is still passed out wearing the Oculus headset"
    },
    {
        "character": "Kenny",
        "line": "(You see? Look at all this dried up food. He must have been here for days!)"
    },
    {
        "character": "Kyle",
        "line": "You found Cartman like this and you think he's somehow trapped in virtual reality?"
    },
    {
        "character": "Kenny",
        "line": "(Yeah!)"
    },
    {
        "character": "Kyle",
        "line": "[slowly] Fuck you!"
    },
    {
        "character": "Kenny",
        "line": "[taken aback] (What??)"
    },
    {
        "character": "Kyle",
        "line": "Get up, Cartman!"
    },
    {
        "character": "Kenny",
        "line": "[angry] (This isn't a prank, Kyle!)"
    },
    {
        "character": "Kyle",
        "line": "Okay, then let's take him to the hospital. You hear that, fatso?! [shakes Cartman's chair] You're goin' to the hospital!"
    },
    {
        "character": "Stan",
        "line": "Kyle, maybe this is for real."
    },
    {
        "character": "Kyle",
        "line": "[looks back at Stan, then turns around to face him] Fuck you if you're in on this."
    },
    {
        "character": "Stan",
        "line": "In on what? [thinks a moment...] Ohh, [slowly] Fuck you!"
    },
    {
        "character": "",
        "line": "The customer service center in India"
    },
    {
        "character": "Steve",
        "line": "Yes, no, sorry, but because you bought two business-class tickets I can NOT refund the fares. [listens to the response] That's right, there is nothing we can do. All right. Have I answered all your customer concerns in a timely, polite manner? Thank you for calling Korean Airlines Customer Service. [clicks to the next caller] El Pollo Loco Customer Service, this is Steve."
    },
    {
        "character": "Kyle",
        "line": "Oh. Ah, we're trying to reach Oculus Customer Service."
    },
    {
        "character": "Steve",
        "line": "Oh, yes, ah, yes my friend. [clicks again] Oculus Customer Service, this is Steve."
    },
    {
        "character": "Kyle",
        "line": "Yeah, our friend has been missing for a few days, so we went and checked on him, and he's in a coma wearing your headset."
    },
    {
        "character": "Steve",
        "line": "Ohh yehhs, yes. What is your name please?"
    },
    {
        "character": "Kyle",
        "line": "Kyle."
    },
    {
        "character": "Steve",
        "line": "Kyle. I need to advise you that this call may be recorded to help with better customer service in the future. Is that agreeable to you?"
    },
    {
        "character": "Kyle",
        "line": "I don't care!"
    },
    {
        "character": "Steve",
        "line": "He doesn't care! I can continue! All right, listen very carefully my friend. The headsets we sold you are having some minor problems."
    },
    {
        "character": "Kyle",
        "line": "You mean he's actually stuck in virtual reality?!"
    },
    {
        "character": "Steve",
        "line": "Yes. And that is why we are trying to locate all the headsets and do a recall. Do you understand? It is a Total Recall."
    },
    {
        "character": "Kyle",
        "line": "[rolls his eyes, then slowly] Fuck you!"
    },
    {
        "character": "Stan",
        "line": "\"Fuck you\" what?"
    },
    {
        "character": "Kyle",
        "line": "He said they're doing a Total Recall."
    },
    {
        "character": "Stan",
        "line": "Oh fuck you!"
    },
    {
        "character": "Steve",
        "line": "All right, did I take care of all your customer needs in a timely and satisfactory fashion today?"
    },
    {
        "character": "Kyle",
        "line": "You haven't done anything yet!"
    },
    {
        "character": "Steve",
        "line": "But the customer service - was that reliable? And did I accurately and politely respond to your concerns?"
    },
    {
        "character": "Kyle",
        "line": "We need help! Our friend is in a coma!"
    },
    {
        "character": "Steve",
        "line": "Uhhh let's see, ah, it looks like... one of you is going to have to put on the Oculus headset and go into the virtual world and convince your friend to get to an access point. Could you try that, my friend? [Kyle looks at his phone, then at the user's manual]"
    },
    {
        "character": "",
        "line": "South Park, morning. A signal interrupts the scenery twice, but is quickly gone"
    },
    {
        "character": "",
        "line": "Cartman's house, living room. Cartman is pacing the living room trying to calm himself"
    },
    {
        "character": "Cartman",
        "line": "It's okay. Everything is cool. Don't let anyone mess with your head, and it's all going to be fine. You're cool, Eric. You're cool. [the doorbell rings and he answers. It's Kyle.]"
    },
    {
        "character": "Kyle",
        "line": "Hey, Cartman, I need to talk to you."
    },
    {
        "character": "Cartman",
        "line": "I know. Let's go to the backyard. [turns and walks to the backyard. Kyle is quite surprised by Cartman's reaction. Moments later they takes seats at the picnic table out back. A butterfly floats by]"
    },
    {
        "character": "Kyle",
        "line": "Cartman, I'm going to tell you something, and I need you to believe me, even if it seems impossible."
    },
    {
        "character": "Cartman",
        "line": "Okay Kyle."
    },
    {
        "character": "Kyle",
        "line": "Alright, here it goes. Cartman, you aren't really here."
    },
    {
        "character": "Cartman",
        "line": "Mmm. And why do you know that, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "Because I saw you. Okay? In your room, passed out, with a VR headset on. Customer Service said that one of us needed to put on the headset and come get you, and that's why I'm here."
    },
    {
        "character": "Cartman",
        "line": "[laces his fingers together, with his index fingers making a steeple in front of his lips] Mmmhmm."
    },
    {
        "character": "Kyle",
        "line": "I know it's hard to believe, but you have to trust me."
    },
    {
        "character": "Cartman",
        "line": "And why did the guys send you, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "Www-what do you mean?"
    },
    {
        "character": "Cartman",
        "line": "Kyle, I want you to brace yourself. This is going to be extremely hard to believe, but you are the one that has been in a coma with a VR headset on."
    },
    {
        "character": "Kyle",
        "line": "Fuck you!"
    },
    {
        "character": "Cartman",
        "line": "I know it's hard to grasp, Kyle, but I was the one sent by customer service to try and convince you that none of what you've seen is real. You bought the Oculus Rift headset, Kyle."
    },
    {
        "character": "Kyle",
        "line": "Don't... do that!"
    },
    {
        "character": "Cartman",
        "line": "Calm down."
    },
    {
        "character": "Kyle",
        "line": "NO! I put your headset on, and came here to-"
    },
    {
        "character": "Cartman",
        "line": "In virtual reality, yes you did."
    },
    {
        "character": "Kyle",
        "line": "No. Then I came into this virtual space."
    },
    {
        "character": "Cartman",
        "line": "You've been in a virtual space all along, Kyle! Think about it: we're arch-rivals! Why would the guys send you in to convince me of anything?!"
    },
    {
        "character": "Kyle",
        "line": "Fuck you! Why would they send you in to convince me of anything?!"
    },
    {
        "character": "Cartman",
        "line": "[defeated] Fuck!"
    },
    {
        "character": "",
        "line": "Best Buy, day. A Best Buy rep answers a phone"
    },
    {
        "character": "Best Buy rep",
        "line": "Thanks for callin' Best Buy. How can I direct your call?"
    },
    {
        "character": "Kyle",
        "line": "Yes. My name is Kyle Broflovski. Can you tell me if I purchased an Oculus Rift headset there?"
    },
    {
        "character": "Cartman",
        "line": "Or if I did?"
    },
    {
        "character": "Kyle",
        "line": "Or if you sold one to an \"Eric Cartman\"?"
    },
    {
        "character": "Best Buy rep",
        "line": "Sir, I'm gonna have to connect you to Customer Service. Hang on a sec. [transfers the call and hangs up. The call now reaches ... Steve!]"
    },
    {
        "character": "Steve",
        "line": "Best Buy Customer Service, this is Steve."
    },
    {
        "character": "Kyle",
        "line": "[stunned at the familiar voice] Dude... What?"
    },
    {
        "character": "Cartman",
        "line": "What? [takes the phone from Kyle] Hello?"
    },
    {
        "character": "Steve",
        "line": "Yes, hello. This call may be recorded to ensure good customer service in the future."
    },
    {
        "character": "Cartman",
        "line": "Dude. NOW this is getting weird!"
    },
    {
        "character": "",
        "line": "The Stotch house, night. Stephen and Linda sit down for dinner"
    },
    {
        "character": "Stephen",
        "line": "[loudly] Well, this looks like a lovely meal. Too bad Butters won't be enjoying it. You hear that, mister?! No dinner for you! While you're grounded you can just GO TO BED HUNGRY! Linda, do you remember why Butters is grounded? What, what did he do?"
    },
    {
        "character": "Linda",
        "line": "Oh. I don't know, Stephen, I let you handle all the groundings."
    },
    {
        "character": "Stephen",
        "line": "It's strange. I don't recall him really doing anything particularly bad, and yet... and yet he is grounded. [hears something upstairs] And no bouncing the racquetball either!"
    },
    {
        "character": "",
        "line": "Cartman's room. Stan and Kenny are the only two in the room, and Kenny's wearing the Oculus Rift. Stan is talking to Customer Service"
    },
    {
        "character": "Stan",
        "line": "No, listen, I called Customer Service because I need help! [the door opens and Cartman and Kyle walk in]"
    },
    {
        "character": "Kyle",
        "line": "Wait. Stan? [walks up to Stan] Hold on, is this my virtual reality, or Cartman's virtual reality?"
    },
    {
        "character": "Stan",
        "line": "It's neither. I know this might be hard for you to grasp right now, but this is all actually real."
    },
    {
        "character": "Kyle",
        "line": "Nono, after we found Cartman, I put the headset on and then-"
    },
    {
        "character": "Stan",
        "line": "No dude, dude. We've all been here the entire time."
    },
    {
        "character": "Kyle",
        "line": "Holy shit. Then this is all real. We've all been here from the beginning. Taking turns on the Oculus Rift headset."
    },
    {
        "character": "Cartman",
        "line": "[still lost] No, you guys. This is virtual reality."
    },
    {
        "character": "Stan",
        "line": "How do you know?"
    },
    {
        "character": "Cartman",
        "line": "Because... I'm a computer program."
    },
    {
        "character": "Kyle",
        "line": "God damn it Cartman!"
    },
    {
        "character": "Cartman",
        "line": "I'm telling you guys, I swear, you have to believe me, I am a computer program. I'm not real."
    },
    {
        "character": "Kyle",
        "line": "He's lying."
    },
    {
        "character": "Cartman",
        "line": "I'm not lying. Go ahead and ask Customer Service."
    },
    {
        "character": "Stan",
        "line": "What was the name of the first person who called you for customer service?"
    },
    {
        "character": "Steve",
        "line": "Ohhh yes yes yes! That I can answer! His name was... But-ters!"
    },
    {
        "character": "Stan",
        "line": "Butters called Customer Service first?"
    },
    {
        "character": "Steve",
        "line": "Have I answered all your questions in a satisfying and courteous manner?"
    },
    {
        "character": "Stan",
        "line": "Come on, we're going to Butters' house! [they leave Kenny behind]"
    },
    {
        "character": "Steve",
        "line": "Hello? My friend? My friend, I believe we are having some technical issues with our phone line. Please hang on, I'm going to call Customer Service."
    },
    {
        "character": "",
        "line": "Steve talks to himself"
    },
    {
        "character": "Steve",
        "line": "Hello, Customer Service, this is Steve."
    },
    {
        "character": "Steve",
        "line": "Hello, this is Steve with Customer Service."
    },
    {
        "character": "Steve",
        "line": "Uhhh, nononono my friend. I am Steve with Customer Service."
    },
    {
        "character": "Steve",
        "line": "Listen, my friend. This is gong to be very hard to comprehend, but none of what you are seeing is real."
    },
    {
        "character": "Steve",
        "line": "...Ohhh, nohhh, nonononononono."
    },
    {
        "character": "Steve",
        "line": "My friend, my friend, a customer who is in virtual reality called Customer Service, and it has created a customer feedback loop. Okay? Here in India we call it a customer feedback vindaloop."
    },
    {
        "character": "Steve",
        "line": "[slowly, wagging his left index finger] Ohhh, fuck you!"
    },
    {
        "character": "Steve",
        "line": "Nononononono, do not fuck me, because I am you and then we will just be fucking ourselves. Now, have I provided answers to your questions in a courteous and prompt fashion?"
    },
    {
        "character": "Steve",
        "line": "What do you mean have you answered all my questions?! NO! You have not answered ANY questions at ALL!"
    },
    {
        "character": "Steve",
        "line": "Nonononono no, listen, listen: if I didn't answer your questions, then we have given bad customer service!"
    },
    {
        "character": "Steve",
        "line": "But you didn't answer any of my questions!"
    },
    {
        "character": "Steve",
        "line": "Well what is more important, my friend? The result, or good customer service?"
    },
    {
        "character": "",
        "line": "Butters' room, day. He sits on the floor by his bed playing a child's xylophone. The curtains are drawn, but leave a small gap through which the sun shines in"
    },
    {
        "character": "Butters",
        "line": "[singing a spiritual] I'm troubled, I'm troubled in mind. If Jesus don't help me I surely will die. [his door opens and Stan, Kyle, and Cartman come in]"
    },
    {
        "character": "Stan",
        "line": "Butters."
    },
    {
        "character": "Butters",
        "line": "[startled] Huh. But... [stands up] you guys can't be here."
    },
    {
        "character": "Kyle",
        "line": "Why not?"
    },
    {
        "character": "Butters",
        "line": "Because I'm grounded. That means no visitors."
    },
    {
        "character": "Kyle",
        "line": "Butters! When did you call Oculus Rift Customer Service?!"
    },
    {
        "character": "Butters",
        "line": "When we were playing with the Oculus headset. Wuh don't you guys remember? [goes to the bedroom door] We were all messin' around with it. I played with it first, and, and went a little nuts. Uh I forgot I was in virtual reality and I got grounded, and now I'm grounded in real life."
    },
    {
        "character": "Stan",
        "line": "So now we are in the real world."
    },
    {
        "character": "Butters",
        "line": "YES."
    },
    {
        "character": "Cartman",
        "line": "You guys! [the boys look at him] I have accepted the reality that I am just a computer program. The fact is that one of us right now is in a room wearing a VR helmet seeing all this, and it's not me!"
    },
    {
        "character": "Stephen",
        "line": "[appears behind him] Butters!"
    },
    {
        "character": "Butters",
        "line": "[really startled] AAaaghagh!"
    },
    {
        "character": "Stephen",
        "line": "What are your friends doing here?!"
    },
    {
        "character": "Butters",
        "line": "Huh I'm sorry Dad!"
    },
    {
        "character": "Steve",
        "line": "Hello, hello my friend, are you still there?"
    },
    {
        "character": "Stan",
        "line": "Yes, we're here."
    },
    {
        "character": "Steve",
        "line": "Listen carefully, my friend. You are stuck in a paradox. It turns out there are three things you cannot do in virtual reality. You cannot die, you cannot get grounded, and you cannot call Customer Service. This is why you are having problems."
    },
    {
        "character": "Stephen",
        "line": "You just don't get it, do you?! What is wrong with you?!"
    },
    {
        "character": "Stan",
        "line": "[as Stephen chews Butters out, puts some distance between them and himself] Well then how much of what just happened was in virtual reality?"
    },
    {
        "character": "Steve",
        "line": "That does not matter! There is only one thing that matters!"
    },
    {
        "character": "Stan",
        "line": "What?! [Stephen unbuckles his belt, Butters holds a hand up]"
    },
    {
        "character": "Steve",
        "line": "Have I answered your questions satisfactorily and offered GOOD CUSTOMER SERVICE?!"
    },
    {
        "character": "Stan",
        "line": "That doesn't make sense! [Stephen takes his belt off. Butters closes his eyes, knowing what's coming]"
    },
    {
        "character": "Steve",
        "line": "That's the paradox! Please my friend, please! I am not real! You are not real! Have I answered your questions and provided good customer service?! This call may be recorded! [the boys look at Stephen and Butters as Stephen prepares his belt for a whipping]"
    },
    {
        "character": "Stephen",
        "line": "Well, you're getting it now!"
    },
    {
        "character": "Stan",
        "line": "Yes! Yes, you have answered all my questions and I am pleased with the customer service I have been provided!! [Stephen disappears, then Butters, then Kyle, then Cartman] You guys? Are you there?"
    },
    {
        "character": "Kyle",
        "line": "[from a walkie-talkie] We're right here dude. Do you remember now?"
    },
    {
        "character": "Stan",
        "line": "Yeah I remember. I'm heading back to the access point. [leaves Butters' room. Stephen and Linda never really left the dining room table/ Stephen senses a change in mood]"
    },
    {
        "character": "Stephen",
        "line": "Oh my gosh! Linda!"
    },
    {
        "character": "Linda",
        "line": "What is it, Stephen?"
    },
    {
        "character": "Stephen",
        "line": "It's Butters. He's not grounded anymore."
    },
    {
        "character": "Linda",
        "line": "He's not?"
    },
    {
        "character": "Stephen",
        "line": "No. I've I've got to tell him! [leaves his chair and runs up to Butters' room] Butter? Butters! [Butters is on his bed, with the curtains open, asleep]"
    },
    {
        "character": "Butters",
        "line": "[wakes up] Ahhh, huh?"
    },
    {
        "character": "Stephen",
        "line": "You can go outside and play, son."
    },
    {
        "character": "Butters",
        "line": "You... you, you mean ih... [sits up] I'm not grounded?"
    },
    {
        "character": "Stephen",
        "line": "No. I don't know why or how, but... it's over."
    },
    {
        "character": "Butters",
        "line": "They did it! [hops off his bed] They figured it out! [heads out the door] Whoopie!"
    },
    {
        "character": "",
        "line": "Cartman's house, later. Stan walks up to the house"
    },
    {
        "character": "Stan",
        "line": "Alright, I'm nearing Checkpoint Alpha. You guys still there?"
    },
    {
        "character": "Kyle",
        "line": "We're here, dude. Just a little further and we can finally end this."
    },
    {
        "character": "Stan",
        "line": "[goes upstairs and enters Cartman's room] Okay, I'm back in Cartman's room."
    },
    {
        "character": "Cartman",
        "line": "Alright, Stan, just sit down at the computer. [Stan does this]"
    },
    {
        "character": "Kyle",
        "line": "Alright, dude, take off the headset. [Stan reaches up and removes the headset. At this point the animation switches to live-action. Stan finishes taking off the headset as Cartman, Kyle, and Kenny watch]"
    },
    {
        "character": "Kyle",
        "line": "Sssoo aside from all the bull crap, what do ya think of the Oculus?"
    },
    {
        "character": "Stan",
        "line": "[thoughtfully looking at the headset] It's pretty cool, but the graphics suck."
    },
    {
        "character": "",
        "line": "Credits start rolling but after few credits roll there is shot back at Stan's room"
    },
    {
        "character": "Butters",
        "line": "[hops in like a bunny] Fellas, I'm not grounded anymore."
    }
]