[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Kyle's house, day. Kyle runs home excitedly with something in his hand. He opens the front door and goes in. Gerald spots him"
    },
    {
        "character": "Gerald",
        "line": "There you are, Kyle. I was gonna see if you and your brother wanted to go down to the bowling alley."
    },
    {
        "character": "Kyle",
        "line": "Nono Dad, please. I just got Call Of Duty: Advanced Warfare. Me and Ike are going to play it together."
    },
    {
        "character": "Gerald",
        "line": "It's your day off. You boys really wanna spend it inside in front of the TV?"
    },
    {
        "character": "Kyle",
        "line": "Please Dad, I've been looking forward to this all week. Aaand it's me and Ike's bonding time. Really. This is good for our relationship."
    },
    {
        "character": "Gerald",
        "line": "All right. [Kyle smiles, Gerald heads back to the kitchen] I swear I'll never understand you kids these days."
    },
    {
        "character": "Kyle",
        "line": "Yes! [runs upstairs smiling.]"
    },
    {
        "character": "",
        "line": "Ike's room. Ike is at his computer eating Cheetos. Kyle knocks, then goes into the room"
    },
    {
        "character": "Kyle",
        "line": "Heeey Ike! Look what I got. [Ike looks over his shoulder] The new Call Of Duty! Do you wanna go downstairs and play?"
    },
    {
        "character": "PewDiePie",
        "line": "[on the monitor] Aww, look at all the bright colors."
    },
    {
        "character": "Ike",
        "line": "...Meh. [goes back to watching the monitor and eating his Cheetos]"
    },
    {
        "character": "Kyle",
        "line": "Meh? Ike, we have a whole day to play XBox! Mom and Dad are leaving!"
    },
    {
        "character": "Ike",
        "line": "Maybe later, 'kay?"
    },
    {
        "character": "Kyle",
        "line": "[walks up to Ike] Well what are you watching?"
    },
    {
        "character": "PewDiePie",
        "line": "How's it goin' bros? My name's PewDiePie. I'm playing Call Of Duty: Advanced Warfare. Here we go. [breaks through a door and is met with gunfire] Agh! People are shooting at me, bros!"
    },
    {
        "character": "Kyle",
        "line": "You're watching someone play Call Of Duty and talk about it?"
    },
    {
        "character": "Ike",
        "line": "[claps] PewDiePie!"
    },
    {
        "character": "PewDiePie",
        "line": "There's lots of bullet! And I've gotta run! RUN FOR THE BUNKER! RUUUUN!"
    },
    {
        "character": "Kyle",
        "line": "Ike, we could go play the game downstairs. Isn't that better than watching some guy on YouTube playing it?"
    },
    {
        "character": "PewDiePie",
        "line": "Alright, I hope that's enough."
    },
    {
        "character": "Ike",
        "line": "Meh."
    },
    {
        "character": "PewDiePie",
        "line": "Uh, like I said, um... Look at this. Look at this. Ooohhh, gigrrig! [fires away at will]"
    },
    {
        "character": "",
        "line": "South Park Elementary Cafeteria, lunchtime"
    },
    {
        "character": "Kyle",
        "line": "Dude, I'm telling you. It's crazy. All my little brother wants to do is sit on YouTube watching this PewDiePie play video games. I swear, I don't understand kids these days."
    },
    {
        "character": "Butters",
        "line": "What's a PewDiePie do?"
    },
    {
        "character": "Kyle",
        "line": "Google him. He's this guy from Sweden who has over 30 million YouTube subscribers. We didn't even know, but he's a bigger celebrity to kids than anyone. It just seems so lame."
    },
    {
        "character": "Cartman",
        "line": "He plays video games and makes millions of dollars, and it's lame how?"
    },
    {
        "character": "Kyle",
        "line": "Because- because that's not even entertainment! I mean, it's just, just, rehashing shit, isn't it?? It's like everything these kids are into these days, you know, it's just... rehashed shit!"
    },
    {
        "character": "",
        "line": "Commercial for an upcoming concert"
    },
    {
        "character": "Announcer",
        "line": "This Saturday, at the Pepsi Center, it's Women of Rock! Miley Cyrus, Iggy Azalea, Nicki Minaj, and Lorde! [Randy] All on one stage, on one night! With a special appearance by Michael Jackson's Hologram!"
    },
    {
        "character": "MJ Hologram",
        "line": "Hee hee!"
    },
    {
        "character": "Announcer",
        "line": "Ticket proceeds help fight the gluten crisis in West Africa! It's a night of pure, pure estrogen! Tickets on sale now! [TeleChargeIt and TicketMastering info go up]"
    },
    {
        "character": "",
        "line": "Randy's garage, night. Randy runs inside to call someone in private"
    },
    {
        "character": "Randy",
        "line": "Yeah, it's me. I told you I can't play the concert!"
    },
    {
        "character": "Record producer",
        "line": "Come on, this is a great lineup."
    },
    {
        "character": "Randy",
        "line": "Look, I do a lot of post-production enhancements to make my music sound the way it does, okay? I feel like if I play live I'm... really gonna disappoint people. I'm sorry, but the answer is no."
    },
    {
        "character": "Record producer",
        "line": "I don't think you're really in a position to turn down this kind of gig."
    },
    {
        "character": "Randy",
        "line": "What is that supposed to mean?"
    },
    {
        "character": "Record producer",
        "line": "I understand your son gave all your savings to Canada."
    },
    {
        "character": "Randy",
        "line": "Yes, Freemium gaming."
    },
    {
        "character": "Record producer",
        "line": "I'm sorry. Freemium gaming destroys lives. I lost my father to Candy Crush. [Randy sighs] You need this, Lorde. And the girls out there need you. You've got till tomorrow to think it over. [hangs up. Randy ends the call]"
    },
    {
        "character": "Randy",
        "line": "I love Candy Crush."
    },
    {
        "character": "",
        "line": "The bus stop, day. The boys are there waiting for the bus"
    },
    {
        "character": "Kyle",
        "line": "All I wanted was to play one level of Call of Duty and you know what Ike told me? He said the living room was for old people."
    },
    {
        "character": "Stan",
        "line": "I don't get it. The whole fun of Call of Duty is that you get to do the shooting."
    },
    {
        "character": "Kyle",
        "line": "I know! But that doesn't matter any more! These kids don't wanna play the game, they just wanna watch people on YouTube play it. And you know why? Commentary."
    },
    {
        "character": "Kenny",
        "line": "(Commentary?)"
    },
    {
        "character": "Kyle",
        "line": "Yeah. You used to sit in the living room with family and friends to hear their commentary on things. Now you can get it with a little guy in a window on the screen. Someone who just comments on stuff. I mean, really? Who would even WANT to do that?! [Cartman eyes his phone with Stan and Kenny look at Kyle]"
    },
    {
        "character": "",
        "line": "Cartman's room, later. He's set up a YouTube channel and is now broadcasting on it"
    },
    {
        "character": "Cartman",
        "line": "Hey bros, what's going on? This is CartmaaanBrah! Be sure to subscribe to my channel if you haven't already, 'cause subscribing makes you feel good! Uhh, so today I'm gonna comment on Call Of Duty. More specifically, I'm going to comment on my friends commenting on Call Of Duty, so let's start. [a recording of the earlier conversation plays]"
    },
    {
        "character": "Kyle",
        "line": "All I wanted was to play one level of Call of Duty and you know what Ike told me? He said the living room was for old people."
    },
    {
        "character": "Cartman",
        "line": "That's Kyle the Jew again, talking about Call Of Duty to Stan."
    },
    {
        "character": "Stan",
        "line": "I don't get it. The whole fun of Call of Duty is that you get to do the shooting."
    },
    {
        "character": "Cartman",
        "line": "[reaches for some chips and eat them, chuckles, then] Stan is such a douchebag. He just agrees with Kyle no matter what."
    },
    {
        "character": "Kyle",
        "line": "I know! But that doesn't matter any more! These kids don't wanna play the game, they just wanna watch people on YouTube play it."
    },
    {
        "character": "Kenny",
        "line": "(Commentary?)"
    },
    {
        "character": "Cartman",
        "line": "There's Kenny commenting on Call of Duty. Kenny! Kenny! SPEAK UP!! SPEAK THROUGH THE HOOD KENNY!"
    },
    {
        "character": "Kyle",
        "line": "Yeah. You used to sit in the living room with family and friends to hear their commentary on things. Now you can get it with a l-"
    },
    {
        "character": "",
        "line": "The Marsh house, kitchen. Sharon is washing, Randy is drying, Shelly walks in excitedly"
    },
    {
        "character": "Shelly",
        "line": "Mom, Dad, Kelly and Stacy are going to the Women of Rock concert! Can I go with them?! [anxiously waits for an answer]"
    },
    {
        "character": "Sharon",
        "line": "I don't know, Shelly."
    },
    {
        "character": "Shelly",
        "line": "But Mom, Lorde is playing! You can't not let me go or I'll hate you forever! [Randy and Sharon turn around]"
    },
    {
        "character": "Randy",
        "line": "Shelly, there's a good chance Lorde isn't goin' to show up."
    },
    {
        "character": "Shelly",
        "line": "She will too! She has to show up, and if I don't get to see her I'm gonna kill myself!"
    },
    {
        "character": "Randy",
        "line": "And what if you go and Lorde doesn't sound that great in person?"
    },
    {
        "character": "Shelly",
        "line": "That doesn't matter, Dad! We love Lorde because she's real! Gosh, you guys don't understand anything!"
    },
    {
        "character": "Randy",
        "line": "You know, I think Lorde is going to play tomorrow."
    },
    {
        "character": "Shelly",
        "line": "So can I go or not?!"
    },
    {
        "character": "Randy",
        "line": "If she means that much to you."
    },
    {
        "character": "Shelly",
        "line": "Okay, yay, thanks, love you guys. [smiles and walks away]"
    },
    {
        "character": "Sharon",
        "line": "Sooo you're doing it? [smiles]"
    },
    {
        "character": "Randy",
        "line": "How can I let her down? Do you mind finishing up here? I think I should practice a little."
    },
    {
        "character": "Sharon",
        "line": "Of course not. [Randy walks away and out of earshot] Anything to keep you away from cock magic."
    },
    {
        "character": "",
        "line": "Ike's room, later. Ike is still at his computer eating Cheetos"
    },
    {
        "character": "Cartman",
        "line": "Uhh, so today I'm gonna comment on Call Of Duty."
    },
    {
        "character": "Kyle",
        "line": "[goes into the room] Hey Ike, you wanna come watch TV with me?"
    },
    {
        "character": "Cartman",
        "line": "More specifically, I'm going to comment on my friends commenting on Call Of Duty, so let's start."
    },
    {
        "character": "Kyle",
        "line": "Oh no! No, Ike! You are not watching him comment on things!"
    },
    {
        "character": "Kyle",
        "line": "All I wanted was to play one level of Call of Duty and you know what Ike told me? He said the living room was for old people."
    },
    {
        "character": "Cartman",
        "line": "That's Kyle the Jew again, talking about Call Of Duty to Stan."
    },
    {
        "character": "Kyle",
        "line": "[approaches the monitor] What the fuck?!"
    },
    {
        "character": "Stan",
        "line": "I don't get it. The whole fun of Call of Duty is that you get to do the shooting."
    },
    {
        "character": "Cartman",
        "line": "[reaches for some chips and eat them, chuckles, then] Stan is such a douchebag. He just agrees with Kyle no matter what."
    },
    {
        "character": "Kyle",
        "line": "Ike, that is enough! If you're interested in Call of Duty, go play it downstairs in the living room!"
    },
    {
        "character": "Cartman",
        "line": "God these guys are so annoying, aren't they? CartmaaanBrah!"
    },
    {
        "character": "Kyle",
        "line": "But that's all that matter now! It's just all ... and the new celebrity?"
    },
    {
        "character": "Ike",
        "line": "CartmaaanBrah!"
    },
    {
        "character": "",
        "line": "The neighborhood park, basketball court, day. Cartman, Stan, and Kenny are playing a game. Cartman has the ball. Kyle runs up, angry"
    },
    {
        "character": "Kyle",
        "line": "What do you think you're doing?!"
    },
    {
        "character": "Cartman",
        "line": "Shooting for a D in a game of Horsedick."
    },
    {
        "character": "Kyle",
        "line": "You know what I mean! Why is my little brother watching you talking about us talking about him?!"
    },
    {
        "character": "Cartman",
        "line": "I have a YouTube blog where I comment on video games. Big whoop."
    },
    {
        "character": "Kyle",
        "line": "I don't need Ike listening to you comment on anything!"
    },
    {
        "character": "Stan",
        "line": "What are you talking about?"
    },
    {
        "character": "Kyle",
        "line": "This fat fuck thinks he's PewDiePie! Because of him I can't get Ike to come out of his room!"
    },
    {
        "character": "Cartman",
        "line": "Because of me?! I'm pretty sure I'm not the person who invented \"Let's Plays\", Kyle."
    },
    {
        "character": "Kyle",
        "line": "\"Let's Plays\"?"
    },
    {
        "character": "Cartman",
        "line": "That's what they're called, dude. Get with the times. [turns to the basket and takes his shot. Kyle looks away and down]"
    },
    {
        "character": "",
        "line": "The Women of Rock concert at the Pepsi Center, night. Miley Cyrus is performing"
    },
    {
        "character": "Miley Cyrus",
        "line": "There's a party going on and it's all right here, yehhhehehah!\nThrow my hands in the air while I'm twerkin' this chair\nThere's a party going on and it's all right here, yehhhehehah!\nAnd I'm movin' my hands while I'm shakin' my tits.\n\n\n"
    },
    {
        "character": "Stagehand",
        "line": "Alright guys, uh, Miley's about to finish up her set. So next we'll need you, Nicki Minaj, then Iggy Azalea who'll be performing with a hologram of Michael Jackson, and then finally you, Lorde. [walks out of the dressing room backwards] Have a great show, ladies."
    },
    {
        "character": "Randy",
        "line": "Hey uh, listen, I, I thought I could do this, but it's not gonna work."
    },
    {
        "character": "Record producer",
        "line": "You're nervous, it's understandable."
    },
    {
        "character": "Randy",
        "line": "No I'm eh... I know for a fact that I don't sound the same live."
    },
    {
        "character": "Record producer",
        "line": "You think those people out there care what you sound like? You're just another female pop star. Just go out there, pump your hips and rub your clit."
    },
    {
        "character": "Randy",
        "line": "Hey! That's not what my music is about! I'm not reducing myself to that!"
    },
    {
        "character": "Iggy",
        "line": "Oh fuck you, Lorde! You think you're so much better than everyone!"
    },
    {
        "character": "Randy",
        "line": "No, I don't, Iggy. I just think that our younger girl fans need something a little more positive as role models."
    },
    {
        "character": "Iggy",
        "line": "That's easy for you to say because YOU don't have a nice body! Is that why you're so high and mighty, Lorde?! Because you're jealous of this booty?!"
    },
    {
        "character": "Randy",
        "line": "Iggs, I really don't care to go through this again with you."
    },
    {
        "character": "Iggy",
        "line": "'Cause let's face it! You got legs that look like a horse!"
    },
    {
        "character": "Randy",
        "line": "Fuck you! [they start fighting and break through a table full of finger food and drinks]"
    },
    {
        "character": "Record producer",
        "line": "Alright that's enough! [breaks up the scuffle and separates the two artists] Look at yourselves!"
    },
    {
        "character": "Iggy",
        "line": "You're an internet bullshit artist, Lorde!"
    },
    {
        "character": "",
        "line": "Kyle's house, night. The doorbell rings and Kyle answers it. Stan comes in"
    },
    {
        "character": "Stan",
        "line": "Hey, what's up?"
    },
    {
        "character": "Kyle",
        "line": "You're not gonna believe this."
    },
    {
        "character": "Stan",
        "line": "Oh no, what now?"
    },
    {
        "character": "Kyle",
        "line": "I wanted to get Ike out of his room, so I invited all his friends over for a slumber party to play Dragon Age: Inquisition."
    },
    {
        "character": "Stan",
        "line": "Yeah?"
    },
    {
        "character": "Kyle",
        "line": "Come on! [leads Stan upstairs]"
    },
    {
        "character": "",
        "line": "Ike's room. There are five other kids beside Ike in his room, and each one is using a tablet or a laptop, so no one is talking. Ike is watching PewDiePie on his monitor"
    },
    {
        "character": "PewDiePie",
        "line": "[giggling] He's just laying there."
    },
    {
        "character": "Kyle",
        "line": "See? Look at this. Ike has all his friends over and they're just sitting around on their own computers barely talking to each other. Ike is watching PewDiePie play Dragon Age."
    },
    {
        "character": "PewDiePie",
        "line": "I'm going \"Dun dun dadadun dun dadadun.\""
    },
    {
        "character": "Kids",
        "line": "[in unison] PewDiePie!"
    },
    {
        "character": "Kyle",
        "line": "And this kid is watching Cartman commenting on people commenting on Dragon Age."
    },
    {
        "character": "Butters",
        "line": "Well it's a really great game. The characters are so rich."
    },
    {
        "character": "Cartman",
        "line": "Butters is such a butthole, oh my God! CartmaaanBrah!"
    },
    {
        "character": "Kids",
        "line": "CartmanBrah!"
    },
    {
        "character": "Stan",
        "line": "Dude, video games are meant to be played in a living room, not something to watch people comment on!"
    },
    {
        "character": "Conner",
        "line": "Okay Grandpa, we'll be sure to keep that in mind. [the kids laugh]"
    },
    {
        "character": "Stan",
        "line": "Grandpa?"
    },
    {
        "character": "Kyle",
        "line": "This is how they talk to us! [to Conner] You'd better watch your mouth, kid!"
    },
    {
        "character": "Kid 1",
        "line": "Yeah Conner, we're supposed to respect our elders, remember?"
    },
    {
        "character": "Kid 2",
        "line": "It's best to just make old people think they matter."
    },
    {
        "character": "Stan",
        "line": "Oh, is that right?! Do you even know how to multiply?!"
    },
    {
        "character": "Kid 2",
        "line": "No sir. Thank goodness we have you to do that. [Ike laughs at PewDiePie's gameplay]"
    },
    {
        "character": "Stan",
        "line": "We're not being grandpas! Your guys's stuff is just seriously lame! Our generation's stuff is cool!"
    },
    {
        "character": "PewDiePie",
        "line": "Oh my God I killed him!"
    },
    {
        "character": "",
        "line": "Back at the Pepsi Center, Iggy Azalea is performing."
    },
    {
        "character": "Iggy",
        "line": "Missy who who?\nThat's all I do is rip off Missy.\nMissy who?\nMissy who? Missy who? Missy who, who? Missy who, who?\n\nAlright bitches and hos, via hologram and shit, Michael Jackson! [two men from the Syntech Hologram Company get ready]\n"
    },
    {
        "character": "Tech 1",
        "line": "And, cue the hologram! [a bunch of special lights come on and produce the hologram, and the hologram performs Michael's signature moves. The crowd goes wild as Michael's music plays. The hologram moonwalks like Michael did]"
    },
    {
        "character": "MJ Hologram",
        "line": "Hee hee. [as the crowd roars, Iggy starts twerking to the hologram]"
    },
    {
        "character": "Randy",
        "line": "They shouldn't rehash dead people. It's so wrong."
    },
    {
        "character": "Nicki",
        "line": "Oh Lorde, you're such a purist."
    },
    {
        "character": "Randy",
        "line": "Can't help it, Nick. Can't help feeling like... we're losing something."
    },
    {
        "character": "",
        "line": "Wendy: The Wendy Williams Show, now on air. Wendy comes out in a blue dress and black jacket"
    },
    {
        "character": "Wendy",
        "line": "Hi everybody. I love you!"
    },
    {
        "character": "Audience",
        "line": "Thanks for loving me. I love you too."
    },
    {
        "character": "Wendy",
        "line": "So I guess there's this new trend with young people where the celebrities they look up to most are YouTube commentators. Just ordinary people who sit in front of a mic and blab their opinions about everything while their mindless loyal followers cheer them on. Isn't that crazy?? [the audience cheers in agreement] Well let's meet one of these stars of the internet. Please welcome CartmanBrah! [Instead of Cartman himself appearing on the couch, Cartman's commenter window pops up - he's doing this via satellite]"
    },
    {
        "character": "Cartman",
        "line": "CartmaaanBrah!"
    },
    {
        "character": "Wendy",
        "line": "So can you explain to our audience members over the age of five what it is that you DO?"
    },
    {
        "character": "Cartman",
        "line": "Well, Wendy, I started by talking about people talking about video games, but now I'm branching out into talking about people talking about music and the arts as well."
    },
    {
        "character": "Wendy",
        "line": "And why do you think young people-?"
    },
    {
        "character": "Cartman",
        "line": "CartmaaanBrah!"
    },
    {
        "character": "Wendy",
        "line": "...Why do you think young people are responding to this? [Cartman mocks the question by asking it back in nonsense syllables] I'm asking you a question! [Cartman continues with the nonsense replies]"
    },
    {
        "character": "Cartman",
        "line": "CartmaaanBrah! CartmanBrah! Be sure to subscribe to my channel, brahs."
    },
    {
        "character": "",
        "line": "Back at the Pepsi Center, the MC is about to introduce Lorde. The crowd cheers loudly"
    },
    {
        "character": "MC",
        "line": "And now, give it up for the girl from New Zealand, LORDE!"
    },
    {
        "character": "Randy",
        "line": "Thank you! Thanks a lot! This is for all the royals out there! [begins playing an acoustic guitar. Shelly is in the audience with Kelly and Stacy] Lorde Looorde. I'm Lorde, ya ya ya-a-a. Sittin' on the toilet thinkin' 'bout how I'm not as rich as other people, ya ya ya. [the cheering dies down] Yaa ya ya ya, I'll never be, I'll never by royalty. Ya ya ya. But that'd be nice 'cause that'd be a nice fantaasy. [the mood of the audience begins to change] Women's bathrooms smell so nice, ya ya ya. Ya ya ya. [the audience begins to boo] And we'll never be- Lorde Lorde Lor- Lorde flushing- Lordy Lordy Lorde. Lor-uh, okay, uh. [turns right and the mic falls to the ground] Oh God. Sorry. [bends over to pick up the mic...] Uh hold on.[...but drops the guitar instead. The boos intensify] Hang on, uh. [to bail Lorde out of this mess, the technicians bring Michael's hologram back to the stage]"
    },
    {
        "character": "MJ Hologram",
        "line": "Hee hee. [the hologram runs through the audience] I'm free! I'm free!"
    },
    {
        "character": "Randy",
        "line": "[dusts himself off] Sorry folks, just one second here."
    },
    {
        "character": "",
        "line": "The Pepsi Center entrance. Michael's hologram runs through the metal detector and begins to dance. Security guards are hot on his tail"
    },
    {
        "character": "MJ Hologram",
        "line": "Hee hee. Dah dadit dat ja!"
    },
    {
        "character": "Guard 1",
        "line": "Stop him. [another guard tries to grab the hologram, but realizes it can't be done. The hologram leaves the Center. The guards run out after it, and a guard guard gets on his walkie-talkie]"
    },
    {
        "character": "Guard 1",
        "line": "Michael Jackson's hologram is on the loose!"
    },
    {
        "character": "MJ Hologram",
        "line": "[leaving the parking area] Hee hee!"
    },
    {
        "character": "",
        "line": "The Pepsi Center stage. Lorde is still on stage getting booed."
    },
    {
        "character": "Randy",
        "line": "Ah ya ya. Okay, uh. Ah ya ya ya ya-a-a-a. [the boos don't stop, and Randy's vision becomes prismatic] Okay, uh, uh... [steps aside and begins to simulate rubbing his \"clit\"] Oooo![hops onto the car on stage and continues the simulation] Oh yeah! Oh my clit! Oh yeah! Oooo yeah, flick that bean, yeah! [the boos are replaced by disgust. Shelly and friends are disappointed]"
    },
    {
        "character": "Fan",
        "line": "Ogh! Lorde, ewww!"
    },
    {
        "character": "Randy",
        "line": "Oh, I'm so horny, yeah! Ooo, fuck, my clit's so big! Oooo! [fans begin to walk out of the concert]"
    },
    {
        "character": "",
        "line": "The Marsh house, dining room. Sharon, Randy, and Stan are having dinner"
    },
    {
        "character": "Randy",
        "line": "Could you um, pass the potatoes, Stan? [Stan reaches to his left and passes the potatoes to Randy] Great, thanks. [serves himself some potatoes] Well, nobody's talking. Does anyone have anything to talk about?"
    },
    {
        "character": "Stan",
        "line": "Why'd you have to rub your clit on stage, Dad?"
    },
    {
        "character": "Randy",
        "line": "I was told to!"
    },
    {
        "character": "Sharon",
        "line": "You were told to walk out in front of a hundred thousand people including little girls who look up to you, and start rubbing your clit."
    },
    {
        "character": "Randy",
        "line": "Okay, hold on! A, I don't have a clit, so technically, I wasn't rubbing anything! And B, I didn't want to even perform tonight, but Stanley gave all our money to Canada through a freemium game, so if anyone rubbed their clit, it was him! [Stan hisses and leaves the table. Sharon just leaves. Some time later, Randy drops in on Shelly in her room and sees her crying on her bed, face down. He then notices that the Lorde poster on the wall is in tatters and ripped in half. Randy leaves and closes the door softly]"
    },
    {
        "character": "",
        "line": "Kyle's house, day. Kyle walks around a darkened living room, rubbing his left hand along the coffee table, then along the TV, and he finds them dusty"
    },
    {
        "character": "Kyle",
        "line": "It's dying. The living room is... dying."
    },
    {
        "character": "",
        "line": "Randy's garage, night. Randy enters to talk to the record producer on the phone in private"
    },
    {
        "character": "Randy",
        "line": "Yeah, it's me. I need to fix this. How can I undo the clit-rubbing?"
    },
    {
        "character": "Record producer",
        "line": "What are you talking about? It's great! You're the most commented-on artist in the world right now! You're blowing up twitter and you're trending on CartmanBrah. #clitnubbin"
    },
    {
        "character": "Randy",
        "line": "Look, this isn't what I want! My music is supposed to be-"
    },
    {
        "character": "Record producer",
        "line": "It's not about the music, Lorde! It never was. It's about comments! And sister, you've got 'em!"
    },
    {
        "character": "Randy",
        "line": "This ends now. I'm gonna tell people the truth."
    },
    {
        "character": "",
        "line": "The Rockies, day. A South Park City Transit bus is going to town, and Michael's hologram is in it. Everyone is on their iPhones or iPads"
    },
    {
        "character": "Passenger",
        "line": "Will you look at that? Everyone on their cell phones, nobody sayin' a word to each other. Call me a grandpa, but I still like commenting face to face with folks. You know what I mean, buddy?"
    },
    {
        "character": "MJ Hologram",
        "line": "Yes."
    },
    {
        "character": "Passenger",
        "line": "You're headin' up to the mountains too, huh? Gonna do some skiin'?"
    },
    {
        "character": "MJ Hologram",
        "line": "No, I just need to... take care of some im-, important business."
    },
    {
        "character": "Passenger",
        "line": "Oh, what kind of business? Oh are you a fisherman?"
    },
    {
        "character": "MJ Hologram",
        "line": "Yes. I mean, yes, that's all. I'm, I'm just gonna fish and hunt."
    },
    {
        "character": "Passenger",
        "line": "Oh, you're a hunter? What do you prey upon?"
    },
    {
        "character": "MJ Hologram",
        "line": "[stands up] Nobody! That's ignorant!"
    },
    {
        "character": "Passenger",
        "line": "Well, you must have a favorite kind of prey?"
    },
    {
        "character": "MJ Hologram",
        "line": "Allegedly! Allegedly! That's ignorant!"
    },
    {
        "character": "Passenger",
        "line": "You know, excuse me for saying so, but you seem kind of... transparent."
    },
    {
        "character": "MJ Hologram",
        "line": "...That's ignorant. I'm just cold."
    },
    {
        "character": "Passenger",
        "line": "I'm saying it must make it easier to sneak up on your prey."
    },
    {
        "character": "MJ Hologram",
        "line": "Allegedly! I'm weary of this conversation! Can we please stop talking, please?! Ignorant!"
    },
    {
        "character": "Passenger",
        "line": "[looks him over] Well, whatever it is you're after, I hope you get it."
    },
    {
        "character": "MJ Hologram",
        "line": "Oh I will. Trust me, I will. [The bus enters South Park.]"
    },
    {
        "character": "",
        "line": "The Syntech Hologram Company, day. The record producer is with the tech working on the hologram problem"
    },
    {
        "character": "Tech 2",
        "line": "Ah, we've lost any ability to track the hologram's location. Ih...it looks like it reprogrammed its guidance systems."
    },
    {
        "character": "Record producer",
        "line": "We paid a lot of money for that hologram. You'd better find a way to get it back!"
    },
    {
        "character": "Tech 3",
        "line": "Project Alpha?"
    },
    {
        "character": "Tech 4",
        "line": "Yes. That might be our only option."
    },
    {
        "character": "Record producer",
        "line": "What is Project Alpha?"
    },
    {
        "character": "Tech 4",
        "line": "The first hologram we ever created to appear on stage. It was a prototype. But perhaps the best thing to stop a hologram-"
    },
    {
        "character": "Tech 3",
        "line": "Is another hologram. Bring up Project Alpha!"
    },
    {
        "character": "Tech 2",
        "line": "Sir, are you sure that we wanna-?"
    },
    {
        "character": "Tech 3",
        "line": "Bring it up! [Tech 2 gets to work. Everyone turns around and watches as the hologram is assembled]"
    },
    {
        "character": "Record producer",
        "line": "What is that?"
    },
    {
        "character": "Tech 3",
        "line": "Tupac."
    },
    {
        "character": "Tech 4",
        "line": "[approaches the hologram] Tupac? [the hologram is activated] Yo. The hologram of Michael Jackson is on the loose. We need you to \"take care of the situation.\" [the hologram takes out a Glock hologram and cocks it, then he walks forward, then turns left and walks out]"
    },
    {
        "character": "Tech 3",
        "line": "Godspeed, Tupac."
    },
    {
        "character": "",
        "line": "The Syntech Hologram Company, outside. Tupac crosses the street and a car almost runs him down. The couple inside is in shock"
    },
    {
        "character": "Man",
        "line": "Oh my gosh, honey look it's Tupac! I told you them homies didn't cap his ass! [Tupac opens the driver's door, pulls the driver out and throws him to the ground, then gets into the driver's seat and takes off with the car and driver's wife. The driver gets up and pulls out his phone] Oh, this is going on Instagram! [takes the picture]"
    },
    {
        "character": "",
        "line": "The bus stop, day. Cartman's commenter window is there in his place"
    },
    {
        "character": "Cartman",
        "line": "Hey hey, how's it going, bros? This is CartmanBrah. CartmaaanBrah. And uhh, we are, it looks like we are at the bus stop now. [the other three boys walk into view] Yep, there's Kyle, Stan and Kenny looking stupid as ever."
    },
    {
        "character": "Kyle",
        "line": "I don't know what the hell to do. The whole world's gone crazy."
    },
    {
        "character": "Stan",
        "line": "Tell me about it."
    },
    {
        "character": "Cartman",
        "line": "Uh oh, it looks like Kyle is taking issue with something again. Kyle's got a pro-blem. CartmanBrah!"
    },
    {
        "character": "Kyle",
        "line": "You know, you used to sit in the living room with your friends and family, and THEY were the ones commenting on whatever was on TV."
    },
    {
        "character": "Cartman",
        "line": "[exasperated] Oh God."
    },
    {
        "character": "Kyle",
        "line": "[notices the commenter window above the bus stop sign] Do you mind?!"
    },
    {
        "character": "Cartman",
        "line": "Oh, looks like Kyle is commenting on my commenter window, bras! Be sure to comment on that. #kyleisgettingfrustrated"
    },
    {
        "character": "Kyle",
        "line": "Dude! Nobody wants to hear you commenting on things!"
    },
    {
        "character": "Cartman",
        "line": "Oh really. Ten thousand subscribers and counting, brah!"
    },
    {
        "character": "",
        "line": "Buca de Faggoncini, day. Randy goes inside. The record producer is waiting for him at a table. Randy approaches, but doesn't sit down."
    },
    {
        "character": "Randy",
        "line": "Thanks for seeing me. I've got my speech written. I'm ready to let the world know the truth. [the producer puts down his fork and wipes his lips off with a napkin.]"
    },
    {
        "character": "Record producer",
        "line": "Sit down, Lorde."
    },
    {
        "character": "Randy",
        "line": "I'm not interested in being talked out of ending this. It's the right thing to do."
    },
    {
        "character": "Record producer",
        "line": "[stands up and walks to a nearby bar] Do you know what an artist is now, Lorde? An artist is a conversation piece, nothing more. [pours himself a drink] Like a vase, or a kitschy side table. Just something for people to comment on. [turns around] The old ways are dying. We're not making money off records, we're making money off tweets. And you've taken it to a whole new level."
    },
    {
        "character": "Randy",
        "line": "Well that's not a world Lorde ever wanted to be a part of."
    },
    {
        "character": "Record producer",
        "line": "On the contrary. Lorde is going on the Jimmy Fallon show tonight and exposing her asshole for everyone to freak out about."
    },
    {
        "character": "Randy",
        "line": "I'll do no such thing!"
    },
    {
        "character": "Record producer",
        "line": "Who said anything about you? [whips out a small remote control and presses a button on it. Some lasers turn on and assemble a new hologram. It's Lorde's hologram. It walks up to the producer and stands beside him. Randy is frightened and takes several steps back. Two bodyguards appear behind him, and he notices. The producer closes the blinds]"
    },
    {
        "character": "Randy",
        "line": "You can't just replace artists with holograms. Who will make the content?"
    },
    {
        "character": "Record producer",
        "line": "Today, commentary IS the content. And you, I'm afraid, are just in the way. [the bodyguards quickly escort him out]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Mr. Garrison wipes off the previous night's work from the blackboard."
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay children, let's take our seats. Before we get started, Kyle has asked to say a few words. Go ahead, Kyle."
    },
    {
        "character": "Kyle",
        "line": "[walks up to the front of the class and turns around. He reads from a sheet of paper] What is happening to our living rooms? There is a crisis in America, and-"
    },
    {
        "character": "Cartman",
        "line": "[his commenter window pops up] Looks like we're in the school now. Check out Wendy, she's flat as a pancake."
    },
    {
        "character": "Mr. Garrison",
        "line": "What the hell is that?"
    },
    {
        "character": "Kyle",
        "line": "It's Cartman's stupid online persona!"
    },
    {
        "character": "Cartman",
        "line": "Oh my dick's gettin hard again! It's protrudin' out my paaaaants!"
    },
    {
        "character": "Mr. Garrison",
        "line": "What the hell?"
    },
    {
        "character": "Cartman",
        "line": "This is the way of the future, Mr. Garrison."
    },
    {
        "character": "Butters",
        "line": "It's true!"
    },
    {
        "character": "Cartman",
        "line": "Heh that's right, Butters will back me up on anything. He's such a bitch."
    },
    {
        "character": "Butters",
        "line": "Heheyehah."
    },
    {
        "character": "Kyle",
        "line": "There is a crisis in America! As families grow further and further apart-"
    },
    {
        "character": "Cartman",
        "line": "[mocking] There is a crisis in America. and we have to save our living rooms. Our living rooms are dying."
    },
    {
        "character": "Kyle",
        "line": "Mr. Garrison, will you make him stop!"
    },
    {
        "character": "Mr. Garrison",
        "line": "I don't- I don't even understand what's happening."
    },
    {
        "character": "Kyle",
        "line": "THIS is the reason why our living rooms are dying!"
    },
    {
        "character": "Cartman",
        "line": "[mocking] This is the reason why our living rooms are dying, so we've got to do something."
    },
    {
        "character": "Mr. Mackey",
        "line": "Eric Cartman's commenter window to the principal's office, please? Eric Cartman's commenter window to the principal's office!"
    },
    {
        "character": "Cartman",
        "line": "What the hell did I do?"
    },
    {
        "character": "",
        "line": "Principal Victoria's office, later."
    },
    {
        "character": "Principal Victoria",
        "line": "Eric, I've had a lot of complaints that your online persona is becoming a distraction."
    },
    {
        "character": "Cartman",
        "line": "Well this sucks. Looks like I'm in the principal's office for just commenting on things."
    },
    {
        "character": "Principal Victoria",
        "line": "Eric, I am talking to YOU!"
    },
    {
        "character": "Cartman",
        "line": "Adults so don't get what's cool anymore."
    },
    {
        "character": "",
        "line": "The Marsh house. Randy rushes in through the front door"
    },
    {
        "character": "Randy",
        "line": "Sharon? Sharon!"
    },
    {
        "character": "Sharon",
        "line": "[comes down the stairs in her bath robe] Randy? What's going on?"
    },
    {
        "character": "Randy",
        "line": "They made a hologram of me, Sharon! They don't care about the music! They're REPLACING us!"
    },
    {
        "character": "Sharon",
        "line": "Oh my God! You mean, I just slept with a hologram?"
    },
    {
        "character": "Randy",
        "line": "The hologram's in our bedroom?"
    },
    {
        "character": "Sharon",
        "line": "Yes!"
    },
    {
        "character": "Tupac's Hologram",
        "line": "I've gotta be leavin' now, Sharon. I would leave you my number but I'm just a hologram 'n shit."
    },
    {
        "character": "Randy",
        "line": "You slept with Tupac?! SHARON!"
    },
    {
        "character": "",
        "line": "The record producer's limousine, back seat. Cartman's commenter window is there with the record producer"
    },
    {
        "character": "Record producer",
        "line": "It's a brave new world, starting much sooner than we thought. What we need is someone who truly gets the changing of the guard. We have an army of holograms poised to start the next chapter in American culture. How would you like to be in charge of it all?"
    },
    {
        "character": "Cartman",
        "line": "[in his commenter window] Ohohoh, totally, brah! So sweet. Being in charge of stuff rules! CartmaaanBrah!"
    },
    {
        "character": "Record producer",
        "line": "Glad you feel that way. We have a lot to do together. We're about to take this to a whole new level."
    },
    {
        "character": "Cartman",
        "line": "Ooohh, I love whole new levels! This is gonna be so totally awesome! CartmaaanBrah!"
    }
]