[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Kyle's house, a snowy day. He's preparing for Hanukkah, setting up the menorah with nine candles. He's lit the second candle, for the second day of Hanukkah, then takes a selfie of himself and the menorah"
    },
    {
        "character": "Kyle",
        "line": "It's the holiday season, but the good times... are ending.\nBecause what matters most isn't what's good, it's what's trending.\n\n[leaves the menorah and stops by Ike's room, and looks in]\n\nThis younger generation, with their eyes and ears glued:\nWhat's trending to them is trenders who trend on YouTube.\n\n[Ike is watching \"Dragon Age: Inquisition\" on his computer while eating Flamin' Hot Cheetos]\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[his commenter window pops up on screen] Ahem, how's it going brahs? This is CartmaaanBrah!"
    },
    {
        "character": "Kyle",
        "line": "Comments on commentators, it's all changing so fast.\nPlaying XBox with your brother is... just a thing of the past.\n\n[Kyle looks at the floor, turns back and walks away. he stops by the kitchen, then by his dad's study. Gerald takes a selfie with his pet project: a model of a ship]\n\nNow with Ma on her iPad, and Dad trending or trying,\nAll the family is scattered, and the living room's dying.\n\n[he walks through the living room, then stops and looks around]\n\nBecause it wasn't the outdoors or church or even trips to go ski,\n[he looks at the TV and walks up to it]\n\nWhat brought families together most was a good old TV\n[he walks through the park with his head down]\n\nNow we watch things by ourselves and just tweet what we saw.\n[he sees a little girl on a bench looking at her iPhone]\n\nAnd if you try to complain, you get called a-\n\n\n"
    },
    {
        "character": "Girl",
        "line": "Grandpa!"
    },
    {
        "character": "Kyle",
        "line": "I'm NOT a GRANDPA!"
    },
    {
        "character": "Kyle",
        "line": "[Now at his own desk]\nBut now let me tweet this for you all to comment upon.\n[The following is the tweet]\n\nThe more connected we get, the more alone we become.\nIf you want change like I do, and feel the same gloom,\nThen please follow THIS trend, #savethelivingroom\n\n[finishes the tweet but doesn't submit it yet. He's wearing a tee shirt with #savethelivingroom on it]\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "Whattaya think?"
    },
    {
        "character": "Butters",
        "line": "Hmmm, it's kind of gay."
    },
    {
        "character": "Kyle",
        "line": "Really??"
    },
    {
        "character": "Butters",
        "line": "I mean, havin' it all rhyme 'n stuff, you know?"
    },
    {
        "character": "Kyle",
        "line": "Hm, I wasn't really going for \"gay,\" I was more going for \"wholesome.\""
    },
    {
        "character": "Butters",
        "line": "Well, gay is wholesome."
    },
    {
        "character": "Kyle",
        "line": "But it's gotta be perfect. We're trending well, but we need to attract more followers who want good old family values."
    },
    {
        "character": "Sheila",
        "line": "[knocks, then enters] Kyle, Bill Cosby is here to see you."
    },
    {
        "character": "Kyle",
        "line": "Bill Cosby."
    },
    {
        "character": "Sheila",
        "line": "Yes."
    },
    {
        "character": "Kyle",
        "line": "Is here. To see me."
    },
    {
        "character": "Sheila",
        "line": "Yes. [turns around and leaves]"
    },
    {
        "character": "",
        "line": "The living room, moments later. Kyle and Butters come downstairs and see Bill"
    },
    {
        "character": "Bill Cosby",
        "line": "Oh! There he is comin' down the stairs."
    },
    {
        "character": "Kyle",
        "line": "Hello."
    },
    {
        "character": "Bill Cosby",
        "line": "Hello, son. Your savethelivingroom hash tag is getting a lot of attention and we think it's great."
    },
    {
        "character": "Kyle",
        "line": "We?"
    },
    {
        "character": "Bill Cosby",
        "line": "I'm just a small part of a big epic holiday special, which is gonna air this weekend. [notices how dusty the TV is and wipes some of the dust off with his right hand] It's a shame how families don't gather in their living rooms like they used to, and we think a big holiday special is just the thing America needs now."
    },
    {
        "character": "Kyle",
        "line": "Wow. [smiles] Well that's awesome!"
    },
    {
        "character": "Bill Cosby",
        "line": "Well the producers of the show saw how much your idea was trending and thought we should get your hash-tag on board with ours."
    },
    {
        "character": "Kyle",
        "line": "M-Ah, I'd love to."
    },
    {
        "character": "Bill Cosby",
        "line": "Great! I'll go right now and tell them you're on board. We've gotta do this quickly!"
    },
    {
        "character": "Kyle",
        "line": "Uh okay! No problem! [Bill lets himself out]"
    },
    {
        "character": "Bill Cosby",
        "line": "This holiday special is gonna bring families together again, son!"
    },
    {
        "character": "Kyle",
        "line": "Uh thanks, Mr. Cosby!"
    },
    {
        "character": "Bill Cosby",
        "line": "Happy Holidays! [Kyle closes the door, and Bill's glitch appears as he walks away - this Bill is a hologram]"
    },
    {
        "character": "",
        "line": "Park County Police Station. Detective Harries is grilling Randy and Sharon on their story."
    },
    {
        "character": "Det. Harris",
        "line": "Mr. Marsh, forgive me if I say your story sounds a little farfetched. You're saying that these people who what you killed are entertainment producers?"
    },
    {
        "character": "Randy",
        "line": "Yes, they made a copy of me and they don't want me around anymore. They're about to do something big, and they need famous artists to be controlled for it."
    },
    {
        "character": "Officer 1",
        "line": "[with mustache] Who's the famous artist?"
    },
    {
        "character": "Randy",
        "line": "Me! Oh right, I forgot to tell you that part. I'm actually Lorde."
    },
    {
        "character": "Det. Harris",
        "line": "You're Lorde."
    },
    {
        "character": "Sharon",
        "line": "The nineteen year old pop star. It's true, that's him."
    },
    {
        "character": "Officer 1",
        "line": "You mean the girl who just showed her asshole on Jimmy Fallon?"
    },
    {
        "character": "Randy",
        "line": "No! That was a copy of me!"
    },
    {
        "character": "Officer 2",
        "line": "Right. The thing that I jacked off to was you! Huh! [bemused smile which quickly fades.]"
    },
    {
        "character": "Randy",
        "line": "Look, I don't know what they're up to, but these people have something much darker planned!"
    },
    {
        "character": "Officer 3",
        "line": "[runs into the station] Detective Harris! Sir! We've got a problem!"
    },
    {
        "character": "Det. Harris",
        "line": "[turns around] What is it, Adams?"
    },
    {
        "character": "Adams",
        "line": "[Officer 3] We've arrested a black man who was snooping around the old Jefferson estate!"
    },
    {
        "character": "Det. Harris",
        "line": "Did you choke him?"
    },
    {
        "character": "Adams",
        "line": "Yes!"
    },
    {
        "character": "Det. Harris",
        "line": "Did you shoot him?"
    },
    {
        "character": "Adams",
        "line": "YES!"
    },
    {
        "character": "Det. Harris",
        "line": "So what's the problem?"
    },
    {
        "character": "Adams",
        "line": "He... appears to be just a hologram, sir."
    },
    {
        "character": "MJ's Hologram",
        "line": "[brought in by another officer, somehow handcuffed] Naw, it's ignorant! You don't understand! We have to stop them! Heee hee!"
    },
    {
        "character": "Det. Harris",
        "line": "Oh my God. Are you sure that hologram is black??"
    },
    {
        "character": "",
        "line": "Stan's house, day. The doorbell rings and he answers it. It's Kyle."
    },
    {
        "character": "Kyle",
        "line": "[excitedly] Dude, what are you doing?!"
    },
    {
        "character": "Stan",
        "line": "[texting] Trying to find my dad. He's supposed to take me to the board game store."
    },
    {
        "character": "Kyle",
        "line": "They picked up my hash tag, Stan! I'm trending!"
    },
    {
        "character": "Stan",
        "line": "Who did?"
    },
    {
        "character": "Kyle",
        "line": "These producers making a big holiday special! [goes to the TV and wipes it clean] They had me upload a video for a commercial they're about to air! They said my hash tag was awesome, and they wanted to promote it!"
    },
    {
        "character": "Stan",
        "line": "That's a little strange, isn't it?"
    },
    {
        "character": "Kyle",
        "line": "No, it's great! It's just what this country needs right now!"
    },
    {
        "character": "",
        "line": "The commercial begins"
    },
    {
        "character": "Announcer",
        "line": "From the producers of Women Of Rock Live and The Rockefeller Tree Lighting Ceremony, it's the holiday television event of the season! With appearances by [the guest stars are shown as they're mentioned] Al Pacino [on a sled going down a hill] Iggy Azalea [wearing a black and white outfit, with her ass dressed up as a snowman] J.J. Watt [clutching a reindeer] Miley Cyrus [dressed as an elf, swinging from a huge Christmas ornament and sticking her tongue out] U2 [presenting gifts] Angelina Jolie [dressed as an elf and scratching her crotch] Bill Cosby and Taylor Swift [he offers her a drink, she declines it] A hologram of Elvis Presley [a National Enquire tabloid drops down to reveal him, then a bigfoot appears behind him] Kurt Cobain's hologram [pops up from a chimney and waves hello with his hat] The hologram of Robin Williams [wearing reindeer horns and festive clothes, pops his clown nose off] Tom Hanks, Lorde [he holds up a mistletoe as her hologram turns around] First Lady Michelle Obama [licks a huge candy cane] And Michael Jackson's hologram as Peter Pan."
    },
    {
        "character": "MJ's hologram",
        "line": "[flits through the air] I'm flying! Hee dah dada dat dih"
    },
    {
        "character": "Announcer",
        "line": "And featuring live commentary the entire show by CartmanBrah."
    },
    {
        "character": "Cartman",
        "line": "CartmaaanBrah! Dude, check it out. Lady Gaga is singing Christmas songs. Isn't she a Jew?"
    },
    {
        "character": "Announcer",
        "line": "There's something for every generation to bring families together."
    },
    {
        "character": "Kyle",
        "line": "Please, tune in and help get America's families back in the living room."
    },
    {
        "character": "Cartman",
        "line": "He's such a douchebag."
    },
    {
        "character": "Announcer",
        "line": "It's all live and it's all magical. It's the Washington Redskins Go Fuck Yourself Holiday Special."
    },
    {
        "character": "Cartman",
        "line": "Now we're talkin'! [the commenter window disappears and Stan and Kyle are stunned]"
    },
    {
        "character": "Kyle",
        "line": "That son of a bitch!"
    },
    {
        "character": "Stan",
        "line": "That self-promoting asshole!"
    },
    {
        "character": "Kyle",
        "line": "Why would he do this?!"
    },
    {
        "character": "Stan",
        "line": "Because my dad's an idiot!"
    },
    {
        "character": "Kyle",
        "line": "Not your dad, Cartman! What's your dad got to do with this?!"
    },
    {
        "character": "Stan",
        "line": "Nnnothing, nothing."
    },
    {
        "character": "",
        "line": "The record producer's office, day. CartmanBrah is there with the other executives in the office"
    },
    {
        "character": "Cartman",
        "line": "Ehey hey, how's it going bros? This is CartmaaanBrah! And it looks like we're in the producer's office in Los Angeles now. [eats some chips]"
    },
    {
        "character": "Exec. 1",
        "line": "So far the holiday special is trending fine, but it appears that the Michael Jackson hologram is the most heavily tweeted."
    },
    {
        "character": "Record producer",
        "line": "And we still have no idea where the damned hologram is?"
    },
    {
        "character": "Ron",
        "line": "Not yet, but Tupac is close to hunting him down."
    },
    {
        "character": "Cartman",
        "line": "Look at that guy. He's like 40, but he's got a Justin Bieber haircut."
    },
    {
        "character": "Record producer",
        "line": "We got one shot at this, people! This [pounds his fist on the table] has to be the holiday special to end all holiday specials!"
    },
    {
        "character": "Ron",
        "line": "Sir, I get that you brought this YouTube commentator in because he's popular with the younger kids, but now he's trying to tell us what the show should be called??"
    },
    {
        "character": "Record producer",
        "line": "He's got his finger on the pulse of young America."
    },
    {
        "character": "Exec. 2",
        "line": "Sir, I'm pretty sure that [reads from his phone] \"Washington Redskins Go Fuck Yourself Holiday Special\" is not a good name."
    },
    {
        "character": "Cartman",
        "line": "No, it's not good, it's fuckin' awesome!"
    },
    {
        "character": "Ron",
        "line": "[leans in] If I may be frank, sir, I think you're giving this kid a little too much power!"
    },
    {
        "character": "Cartman",
        "line": "I can hear you, douchebag."
    },
    {
        "character": "Record producer",
        "line": "People, you know what we're trying to do here. [leaves his desk and paces the room] We're trying to finally create entertainment that reaches the younger generation, that unites the young with the old. That means being hip, being now."
    },
    {
        "character": "Cartman",
        "line": "These guys are such blumpkin catchers."
    },
    {
        "character": "Record producer",
        "line": "There, you see that? \"Blumpkin catchers.\" Do any of you even know what that means? This kid is our way to connect with the youth of America, and I'm gonna give him all the power he needs."
    },
    {
        "character": "Cartman",
        "line": "G'dang g'dang! G'dang g'dang g'dank!"
    },
    {
        "character": "",
        "line": "Park County Police Station. Harris goes over skin color with the other cops and some color swatches. Randy, Sharon, and MJ's hologram are at the far end of the office space"
    },
    {
        "character": "Officer 4",
        "line": "What about this, sir? Burnt sienna?"
    },
    {
        "character": "Det. Harris",
        "line": "He's not a Native American, damnit! That's obvious!"
    },
    {
        "character": "Officer 1",
        "line": "I'll, I'll put it in the report he's Mylar brown."
    },
    {
        "character": "Det. Harris",
        "line": "That isn't even close! We have to be able to prove that hologram is a light-skinned black guy!"
    },
    {
        "character": "Randy",
        "line": "Mr. Jackson, it's me, Lorde."
    },
    {
        "character": "MJ's hologram",
        "line": "Who? Lorde? You're not Lorde, that's ignorant."
    },
    {
        "character": "Randy",
        "line": "Please. Do you know what's going on here? What are the producers trying to do?"
    },
    {
        "character": "MJ's hologram",
        "line": "They're gonna make a big holiday special. They've got holograms and YouTube commentators and live tweeting and it's ignorant! It's gonna be the most ignorant holiday special ever!"
    },
    {
        "character": "Randy",
        "line": "A holiday special. Oh my God."
    },
    {
        "character": "MJ's hologram",
        "line": "It's directed at children! We have to stop them!"
    },
    {
        "character": "Officer 4",
        "line": "Huh how about we say he's mixed race?"
    },
    {
        "character": "Det. Harris",
        "line": "As long as Adams only choked the black half, I think it's okay."
    },
    {
        "character": "Randy",
        "line": "[to Sharon] I should have known. Bastards always talked about a day when social media and entertainment would be fused as one! I didn't know they meant a Christmas special! [to MJ's hologram] Can you help me stop them?!"
    },
    {
        "character": "MJ's hologram",
        "line": "Yes. We have to reach the children. It's our only hope."
    },
    {
        "character": "Randy",
        "line": "Then we'll do it together. I love children just as much as you do."
    },
    {
        "character": "MJ's hologram",
        "line": "[stands up] ALLEGEDLY! [the officers look at him] THAT WAS A CIVIL SUIT AND THERE WAS NO EVIDENCE! [sits down] It's ignorant."
    },
    {
        "character": "",
        "line": "Kyle's house. He stops by the kitchen with Stan as Sheila reads her iPad"
    },
    {
        "character": "Kyle",
        "line": "Mom?! Where is Ike?!"
    },
    {
        "character": "Sheila",
        "line": "Oh Kyle! Your hash tag is really trending. I saw the commercial."
    },
    {
        "character": "Kyle",
        "line": "That's not what I was trending! They took my hash tag and they raped it! Where is Ike?!"
    },
    {
        "character": "Sheila",
        "line": "He's upstairs playing with all his friends."
    },
    {
        "character": "",
        "line": "Ike's room. Kyle and Stan rush inside"
    },
    {
        "character": "PewDiePie",
        "line": "Oh my God, that's the ugliest..."
    },
    {
        "character": "Kyle",
        "line": "Ike! You are no longer to watch that stupid little YouTube blogging asshole! Do you understand?! You damn kids following these YouTube commentators is bad enough, but i will not have them invading my living room!"
    },
    {
        "character": "Kid 2",
        "line": "Old people are so funny."
    },
    {
        "character": "Conner",
        "line": "They really just don't get it."
    },
    {
        "character": "Kid 3",
        "line": "And they smell like soap."
    },
    {
        "character": "Stan",
        "line": "We're not old people! You guys are just into lame, vulgar crap, and it needs to be stopped!"
    },
    {
        "character": "Kid 4",
        "line": "Careful Grandpa, you might crap your Depends! [the kids laugh, even Ike]"
    },
    {
        "character": "Kyle",
        "line": "WE'RE NOT BEING GRANDPAS!"
    },
    {
        "character": "Stan",
        "line": "Yeah, you damn kids!"
    },
    {
        "character": "PewDiePie",
        "line": "...that's the lamest..."
    },
    {
        "character": "",
        "line": "Park County Police Station, upstairs. The officers still haven't come to a conclusion about MJ's hologram"
    },
    {
        "character": "Det. Harris",
        "line": "Okay, okay, so we're agreeing the hologram is black. So the question is, if he's black, then how come we couldn't choke him?"
    },
    {
        "character": "",
        "line": "Park County Police Station, front office. A police officer stands behind the front desk. The doors open and in walks Tupac's hologram"
    },
    {
        "character": "Front Desk Officer",
        "line": "Can I help you? [the hologram looks at him and moves away] Eh-excuse me. Can I help you? [the hologram moves deeper into the building. A security camera shows him walking down a hallway. The front desk officer runs into the office] Sir? A black guy walked into the police station!"
    },
    {
        "character": "Det. Harris",
        "line": "Heh, uh huh? [looks at the officer and grins]"
    },
    {
        "character": "Front Desk Officer",
        "line": "Well a, a black guy walked into the police station."
    },
    {
        "character": "Det. Harris",
        "line": "[chuckling, anticipating a joke] Yeah? Wait. Mitchell, listen to this one. [Mitchell appears in the background] Start over: what's the setup?"
    },
    {
        "character": "Front Desk Officer",
        "line": "There's this black guy, walked into the police station."
    },
    {
        "character": "Mitchell",
        "line": "Oh yeah, I think I've heard it, but go ahead."
    },
    {
        "character": "Front Desk Officer",
        "line": "No, really, a black guy walked into the-!"
    },
    {
        "character": "Mitchell",
        "line": "Ohhh ya ya ya? \"We set who free?\""
    },
    {
        "character": "Front Desk Officer",
        "line": "No no, a black guy literally walked into the police station!"
    },
    {
        "character": "Det. Harris",
        "line": "Oh, it's a new one. [Tupac's hologram walks in] Aw, shit! Look out! [the officers quickly draw their weapons]"
    },
    {
        "character": "Officer 4",
        "line": "It's a black guy! Choke him!"
    },
    {
        "character": "Det. Harris",
        "line": "Shoot him!"
    },
    {
        "character": "Officer 4",
        "line": "Shoot him and then choke him! [the front desk officer shoots the hologram, but the bullet just goes through and disrupts the hologram's structural integrity. The officer tries to choke the hologram, but the arms just go through it]"
    },
    {
        "character": "MJ's hologram",
        "line": "He's here to kill us! Run!! Heee heee! [they escape while the officers shoot at Tupac's hologram. They go down the fire escape unnoticed]"
    },
    {
        "character": "",
        "line": "Cartman's house. Kyle and Stan walk up to his room. Kyle tries to open the door, but finds it locked. He then pounds on the door"
    },
    {
        "character": "Kyle",
        "line": "Cartman, open this door right now!"
    },
    {
        "character": "Cartman",
        "line": "[his commenter window pops up] Hahaha, look at kyle, brahs. he's all pissed off. CartmaanBrah!"
    },
    {
        "character": "Kyle",
        "line": "What the hell are you doing?!"
    },
    {
        "character": "Cartman",
        "line": "What's it look like I'm doing? I'm trending, Kyle. I'm trending more than I ecer thought possible."
    },
    {
        "character": "Kyle",
        "line": "Come out here and talk to me face to face! Open this door!"
    },
    {
        "character": "Cartman",
        "line": "How do you even know I'm here in my room?"
    },
    {
        "character": "Kyle",
        "line": "Because you just said, \"here in my room\"!"
    },
    {
        "character": "Cartman",
        "line": "...Very impressive, Kyle. But the holiday special is beginning soon. I'm afraid I can't let there be any distractions. [Kyle tries breaking his way into the room] You will find that my door has been sealed with a 3/4 inch plywood and a polymer-metal alloy secured with drewall screws. [Kyle stops]"
    },
    {
        "character": "Stan",
        "line": "Cartman, please! We have to stop this show! Lorde is going to do something horrible and corrupt little girls everywhere!"
    },
    {
        "character": "Cartman",
        "line": "Why does that matter?"
    },
    {
        "character": "Stan",
        "line": "Because Lorde is my dad, alright?! [walks forward as his anger drains away] Lorde is my dad."
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Kyle",
        "line": "What are you talking about, Stan?"
    },
    {
        "character": "Stan",
        "line": "He does it all with computers and processors... He got discovered on the Internet. He's like the PewDiePie of music. And he played live last week. Rubbed his clit and started trending more than ever. I thought he had learned his lesson... but it's like he doesn't care."
    },
    {
        "character": "Cartman",
        "line": "Sorry guys, I gotta go. The world needs CartmanBrah. [the commenter window disappears]"
    },
    {
        "character": "Kyle",
        "line": "Why didn't you tell me, Stam? I would've helped."
    },
    {
        "character": "Stan",
        "line": "It just all seemed so... stupid."
    },
    {
        "character": "Kyle",
        "line": "I'll call the producers of the show. They'll help you find your dad."
    },
    {
        "character": "",
        "line": "Meanwhile, at the Marsh house. Randy, Sharon, and MJ's hologram enter the house and sit on the sofa"
    },
    {
        "character": "Sharon",
        "line": "See if it started!"
    },
    {
        "character": "Randy",
        "line": "We don't really use this thing anymore. [grabs the remote and turns on the TV] It hasn't started yet! Alright, Sharon, get on your computer upstairs! Mr. Jackson, you can take the one in my son's room! We've got to tell people the truth!"
    },
    {
        "character": "Sharon",
        "line": "[puts her hand on Randy's shoulder] Randy, what about Shelly?"
    },
    {
        "character": "Randy",
        "line": "Oh my God..."
    },
    {
        "character": "MJ's hologram",
        "line": "Shelly? Who's Shelly? That's ignorant."
    },
    {
        "character": "Randy",
        "line": "My daughter... She has no idea that I'm Lorde... I can't let her find out from the Internet. I have to tell her the truth before we all tell the world."
    },
    {
        "character": "Sharon",
        "line": "How are you going to tell her that the singer she's idolized has been you?"
    },
    {
        "character": "Randy",
        "line": "I guess... one step at a time."
    },
    {
        "character": "",
        "line": "Shelly's room, moments later. Randy knocks on her door, then looks in. Shelly is looking at her monitor"
    },
    {
        "character": "Randy",
        "line": "Shelly? Um, I'm Lorde. [she sits up a little] All the music you've really been into has been me. Nobody in the family knew except for your mother. And your brother, and your grandpa. But Michael Jackson's hologram is here and we're going to set the record straight, Okay? Love you. [blows her a kiss and closes the door, then to Michael's hologram]Whew, that was hard."
    },
    {
        "character": "Sharon",
        "line": "RANDY?! [Randy and Michael's hologram head downstairs]"
    },
    {
        "character": "",
        "line": "The living room. The men reach the foot of the stairs"
    },
    {
        "character": "Sharon",
        "line": "It's started."
    },
    {
        "character": "Announcer",
        "line": "And now, Nabisco and Dolly Madison present, The Washington Redskins Go Fuck Yourself Holiday Special! [CartmanBrah appears in a window at upper left of the screen]And now, live via hologram, it's Kurt Cobain. [he appears in a Christmas fireplace setting]\n\n"
    },
    {
        "character": "Cartman",
        "line": "Oh, this should be good."
    },
    {
        "character": "Kurt's hologram",
        "line": "[begins to sing]\nUp on the housetop, reindeer pause out jumps good ole Santa Claus\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "I'm sure this is exactly how Kurt Cobain would want to be remembered."
    },
    {
        "character": "Kurt's hologram",
        "line": "Down through the chimney with lots of toys\nAll for the little ones, girls and boys [reaches to his left for a double-barreled shotgun and waves it around as if marching]\nHo ho ho, who wouldn't go\nYeh-he-he-eah who wouldn't go [loads and cocks the shotgun]\nUp on the housetop clickity click click [aims it at his mouth as if to shoot himself]\nDown through the chimney with good St. Nick? [waves it around again, then stops]\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Hoh, this should get some comments. [Kurt's hologram fires the rifle and a small flag saying \"Merry Christmas\" pops out. He grins]"
    },
    {
        "character": "",
        "line": "The control room. Ron is in charge"
    },
    {
        "character": "Ron",
        "line": "Stand by on camera 4. Boost the live Twitter feed. Aaand cue the hash tag! How are we trending?"
    },
    {
        "character": "Controller 1",
        "line": "Trending at 64% and steady."
    },
    {
        "character": "Ron",
        "line": "[on the phone with the producer] We're trending at 64%, sir."
    },
    {
        "character": "",
        "line": "Buca de Faggoncini. The record producer is having dinner"
    },
    {
        "character": "Record producer",
        "line": "Excellent. I'm just about to deal with our last order of business now."
    },
    {
        "character": "Kyle",
        "line": "[walks into the restaurant and towards the producer with Stan] Thanks for seeing us, sir. My friend is really worried about his dad."
    },
    {
        "character": "Record producer",
        "line": "No no, thank you! [wipes his lips clean] If you hadn't called, I... wouldn't know what I know now. [gets up and walks towards the bar, dialing a number in the process]"
    },
    {
        "character": "Stan",
        "line": "Um, l-look ih if I could just talk to him real quick? I wanna try and stop him from making an ass of himself again."
    },
    {
        "character": "Record producer",
        "line": "It's me. I've got somethin' you might be interested in."
    },
    {
        "character": "Randy",
        "line": "[on the line in the master bedroom] I don't think so, you son of a bitch! [Sharon and Michael's hologram are also there]"
    },
    {
        "character": "Record producer",
        "line": "I've got your son here, Lorde. If you don't cooperate, he dies."
    },
    {
        "character": "Stan",
        "line": "What?? [both he and Kyle are scared]"
    },
    {
        "character": "Randy",
        "line": "Stanley?! YOU LEAVE HIM OUT OF THIS!"
    },
    {
        "character": "",
        "line": "The living room. Randy runs downstairs with Sharon following"
    },
    {
        "character": "Sharon",
        "line": "Randy, where are you going?!"
    },
    {
        "character": "Randy",
        "line": "THEY'VE GOT STAN! JUST STAY HERE WITH MICHAEL JACKSON! [just as he reaches the front door, it opens and Tupac's hologram walks in] SHIT!! [runs to the back door.]"
    },
    {
        "character": "",
        "line": "Out front, at least 14 police cruisers and one tank roll up to the house. Some of them drift into position. Officers jump out of the cars and arm themselves."
    },
    {
        "character": "Det. Harris",
        "line": "[on his bullhorn] All right, listen up! We believe this is where the black people are! They're holograms, so we can't choke them or shoot them, so stand by till we figure out what the hell to do!"
    },
    {
        "character": "Officer 5",
        "line": "[runs up] Sir! You'd better see this! [holds out a phone, which Detective Harris looks at] There's something new trending! #copscantgoaroundchokingblackpeople."
    },
    {
        "character": "Det. Harris",
        "line": "We know we can't, but we're trying to! Jesus, tell them we're working on it!"
    },
    {
        "character": "Officer 6",
        "line": "No, sir, I I think they mean we shouldn't. Like we're racist or something."
    },
    {
        "character": "Det. Harris",
        "line": "What?! We're not racists."
    },
    {
        "character": "Peterson",
        "line": "Sir, we've got confirmation. There's two black guys in the upstairs of the house!"
    },
    {
        "character": "Det. Harris",
        "line": "[turns around anticipating another joke] Uh huh, go ahead."
    },
    {
        "character": "Peterson",
        "line": "Two black guys. One of them is threatening the other one."
    },
    {
        "character": "Det. Harris",
        "line": "Yehah? Hang on! Mitch! [Mitchell appears again] Two black guys in the upstairs of the house. One of them is threatening the other one. [to Peterson] Okay, go ahead."
    },
    {
        "character": "",
        "line": "Back at the holiday special"
    },
    {
        "character": "Announcer",
        "line": "And now, together at last, Iggy Azalea and Elvis. [Elvis' hologram is playing the ukulele]"
    },
    {
        "character": "Cartman",
        "line": "Oh bros, weak!"
    },
    {
        "character": "Elvis' Hologram",
        "line": "Have a jolly holly Christmas\n\n\n"
    },
    {
        "character": "Iggy's Ass",
        "line": "It's the best time of the pfffffffft.\n\n\n"
    },
    {
        "character": "Elvis' Hologram",
        "line": "I don't know if there'll be snow\nbut have a cup of\n\n\n"
    },
    {
        "character": "Iggy's Ass",
        "line": "Pfffffffft\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Oh weak, bros, so weak!"
    },
    {
        "character": "",
        "line": "Back at the control room. Ron has his back to the monitors"
    },
    {
        "character": "Controller 2",
        "line": "It's incredible! I've never seen trending like this!"
    },
    {
        "character": "Ron",
        "line": "[turns around] We're trending well?"
    },
    {
        "character": "Controller 1",
        "line": "We're barely trending at all. But #ihatecartmanbrah is trending off the charts!"
    },
    {
        "character": "Controller 2",
        "line": "He's right. ihatecartmanbrah is trending at 96% and climbing."
    },
    {
        "character": "Ron",
        "line": "That's impossible."
    },
    {
        "character": "",
        "line": "Back at Buca de Faggoncini, the record producer pours himself another drink"
    },
    {
        "character": "Kyle",
        "line": "How can you be willing to kill people for a holiday special? What's wrong with you?"
    },
    {
        "character": "Record producer",
        "line": "It was five years ago that I... became a grandpa. At first it was wonderful. I wanted to show my grandson everything. Teach him all about the entertainment business. One day I aasked him, \"Who's your favorite celebrity?\" You know what he said to me? He said, \"PeewwDiePie.\" I had no idea who [turns around] he was talking about. So I looked it up. And he was this insignificant little game blogger from Sweden who my grandson thought was a god! No matter who else I tried to impress him with, he would just say, \"Meh.\" To me! MEH! [turns back to the bar] What the hell is wrong with these kids today?? With this special, we will assimilate this generation's culture into ours! MAKE THEM APPRECIATE REAL ENTERTAINMENT, DAMNIT! [pounds theh bar with his fist]"
    },
    {
        "character": "Stan",
        "line": "Dude. You're such a grandpa."
    },
    {
        "character": "Record producer",
        "line": "[angrily clears everything off the bar] I AM NOT A GRANDPAAA!"
    },
    {
        "character": "",
        "line": "Back at the holiday special, it's Bill Cosby and Taylor Swift in the second duet"
    },
    {
        "character": "Taylor",
        "line": "Well I guess it's time to leave.\n\n\n"
    },
    {
        "character": "Bill's hologram",
        "line": "Oh but it's snowin' out dere.\n\n\n"
    },
    {
        "character": "Taylor",
        "line": "Yeah but I need to get home.\n\n\n"
    },
    {
        "character": "Bill's hologram",
        "line": "But it's snowin' out dere.\n\n\n"
    },
    {
        "character": "Taylor",
        "line": "I really should go\n\n\n"
    },
    {
        "character": "Bill's hologram",
        "line": "Oh what's the hurry?\n\n\n"
    },
    {
        "character": "Taylor",
        "line": "Say, what's in this drink?'\n\n\n"
    },
    {
        "character": "Bill's hologram",
        "line": "That's just some J-E-L-L-O.\n\n\n"
    },
    {
        "character": "Taylor",
        "line": "The holidays are comin'-\n\n\n"
    },
    {
        "character": "Dad",
        "line": "This is the oddest holiday special I've ever seen."
    },
    {
        "character": "Mom",
        "line": "Maybe we should turn it off."
    },
    {
        "character": "Cartman",
        "line": "[his commenter window appears] Oh wow, where are we now, brahs? [the family looks at him] This looks pretty stupid."
    },
    {
        "character": "Dad",
        "line": "What the heck? [tries to turn the TV off, but it won't turn off]"
    },
    {
        "character": "Cartman",
        "line": "CartmaanBrah!"
    },
    {
        "character": "Dad",
        "line": "[smacks the remote on his left hand a few times] This damn TV! What is that window doing outside the holiday special?! [tries turning the TV off again]"
    },
    {
        "character": "Mom",
        "line": "Call customer service."
    },
    {
        "character": "",
        "line": "Customer service, Steve answering"
    },
    {
        "character": "Steve",
        "line": "Panasonic customer service. How can I help you?"
    },
    {
        "character": "Dad",
        "line": "Yeah, we've got a commenter window in our living room. How do I get rid of that?"
    },
    {
        "character": "Steve",
        "line": "Ohhhh yes yes yes yes. Many people are calling about this. We have NO idea what's going on. Have I answered all your questions in a timely manner?"
    },
    {
        "character": "Cartman",
        "line": "[his commenter window appears] Oho, looks like we've reached customer service, brahs. Now we can truly be everywhere!"
    },
    {
        "character": "",
        "line": "The holiday special control room"
    },
    {
        "character": "Ron",
        "line": "This isn't part of the holiday special! What is he doing?!"
    },
    {
        "character": "Controller 2",
        "line": "He's trending more than we ever thought possible.!"
    },
    {
        "character": "Cartman",
        "line": "[his commenter window appears] Yes, with every passing second I become more powerful."
    },
    {
        "character": "",
        "line": "Stan's house, out front. The cops are laughing their asses off now"
    },
    {
        "character": "Det. Harris",
        "line": "[laughing with them] Okay! Okay, okay okay okay. Go ahead."
    },
    {
        "character": "Peterson",
        "line": "So, then, the first black guy said to the second black guy, \"Don't shoot me. I'm on your side.\""
    },
    {
        "character": "Det. Harris",
        "line": "Okay! Okay. Okay. Hold on. [catches his breath] Okay, go ahead."
    },
    {
        "character": "Peterson",
        "line": "And then the, the the tattooed black guy said, to him, \"I ain't gonna kill you, man. You're the King of Pop. Let's go cap that whitey producer.\""
    },
    {
        "character": "Det. Harris",
        "line": "Oh God! Stop! Stop! Stop!"
    },
    {
        "character": "Cartman",
        "line": "[his commenter window appears] Happy holidays, everyone! [the cops stop laughing and look at the window] Enjoy the rest of your lives with CartmanBrah."
    },
    {
        "character": "",
        "line": "Buca de Faggoncini. Cartman's commenter window is now a fixture"
    },
    {
        "character": "Record producer",
        "line": "Damn it, you're ruining the show!"
    },
    {
        "character": "Cartman",
        "line": "Of course I am. This isn't about you. This is about CartmanBrah, brah."
    },
    {
        "character": "Kyle",
        "line": "I am so confused."
    },
    {
        "character": "Record producer",
        "line": "[to Ron] Shut him down!"
    },
    {
        "character": "Ron",
        "line": "We can't, sir!"
    },
    {
        "character": "Cartman",
        "line": "I am trending so much that soon I will reach... trendscendence. Like Johnny Depp, but cool."
    },
    {
        "character": "Stephen",
        "line": "I'm confused. Why this holiday special and what is it?"
    },
    {
        "character": "Cartman",
        "line": "It's all CartmanBrah now. [a shot of Times Square. Cartman's image replaces everything else on the screens there] I am trending into something more than human. I am becoming... transgender. [a shot of the Times Square crowd, looking at the screens in disbelief] Now they will HAVE to give my my own bathroom!"
    },
    {
        "character": "Record producer",
        "line": "This is not what I hired you for! I CONTROL TALENT, DAMNIT!"
    },
    {
        "character": "MJ's hologram",
        "line": "[bursts through the doors with Tupac's hologram] There he is! That's the ignorant man!"
    },
    {
        "character": "Record producer",
        "line": "This is crazy and everyone is watching everything!"
    },
    {
        "character": "Kyle",
        "line": "[thinking aloud] Everyone is watching everything. [turns right and walks up to a camera] Ike? [switch to Ike's room] Ike, if you can hear me, I'm sorry. I have been a grandpa. [Ike's friends look at the monitor] I didn't understand the things you are into and I and I thought you should like the same stuff that I did. [Michael's hologram walks up to the record producer and shoots him in the head, killing him] I have to accept that you're gonna have your own things. I just didn't want you to watch HIM. I just... I just wanna be a family again."
    },
    {
        "character": "Kid 4",
        "line": "Oh, I feel bad for the little guy."
    },
    {
        "character": "Conner",
        "line": "There's nothing sadder than a old man crying."
    },
    {
        "character": "Kid 3",
        "line": "Maybe we should help"
    },
    {
        "character": "Ike",
        "line": "Yeah!"
    },
    {
        "character": "Kid 2",
        "line": "Okay."
    },
    {
        "character": "Kyle",
        "line": "Help? How can you help?"
    },
    {
        "character": "Kid 2",
        "line": "It's the holiday season. We just need to get everyone to believe again."
    },
    {
        "character": "Conner",
        "line": "Yeah, someone can come change all this. You know who."
    },
    {
        "character": "Kyle",
        "line": "Really? That's what you guys would do?"
    },
    {
        "character": "Conner",
        "line": "Of course! We just need to get everyone to believe in him. He'll always come and help. #webelieveinyou"
    },
    {
        "character": "Kyle",
        "line": "Oh my God, you're right! You're totally right!! EVERYONE! GET A NEW TREND GOING! FAST! #webelieveinyou!"
    },
    {
        "character": "MJ's hologram",
        "line": "We believe in you. Of course!"
    },
    {
        "character": "Kyle",
        "line": "[walks ever closer to the camera] You too! Right now! #webelieveinyou! We've got to make him appear! [the signal is now disrupted]"
    },
    {
        "character": "Cartman",
        "line": "Hey! What's going on? What is that? [amid some special effects of snow and holly popping out of the upper right corner of screens everywhere, PewDiePie's commenter window appears]"
    },
    {
        "character": "PewDiePie",
        "line": "How's it goin' bros? This is [goes fullscreen]PewDiePie!"
    },
    {
        "character": "Cartman",
        "line": "What the hell?!"
    },
    {
        "character": "Kids",
        "line": "PewDiePie!"
    },
    {
        "character": "Kyle",
        "line": "PewDiePie?!"
    },
    {
        "character": "PewDiePie",
        "line": "Thanks for all the shoutouts. I guess there's some little fat kid trying to be me, so let's check it out."
    },
    {
        "character": "Cartman",
        "line": "Ey! Get out of here, PewDiePie! This is MY holiday special!"
    },
    {
        "character": "PewDiePie",
        "line": "[mocking Cartman] God damn it, get out of here!"
    },
    {
        "character": "Cartman",
        "line": "Uh, everyone, tweet now if you wanna get rid of PewDiePie!"
    },
    {
        "character": "PewDiePie",
        "line": "This show is getting kind of boring, bros. What do you say we change it out to something more exciting?"
    },
    {
        "character": "Cartman",
        "line": "Please show your support for CartmanBrah brah right now by uh..."
    },
    {
        "character": "PewDiePie",
        "line": "I know! Let's play Call of Duty! [the game pops up fullscreen and the commenter windows switch places]"
    },
    {
        "character": "Cartman",
        "line": "No! You can't do this!"
    },
    {
        "character": "PewDiePie",
        "line": "Ohhh yeah! This is more like it, bros!"
    },
    {
        "character": "Cartman",
        "line": "God damn it, who the hell do you think you are?! If you don't stop right now-!"
    },
    {
        "character": "PewDiePie",
        "line": "Okay, that little fat kid is getting annoying. Let's get rid of him!"
    },
    {
        "character": "Cartman",
        "line": "NOOOO! [his commenter window disappears, as well as the holiday special]"
    },
    {
        "character": "PewDiePie",
        "line": "Oh yeah! Way better, bros! This is how we do it in Sweden! BOOM head shot! BOOM head shot!"
    },
    {
        "character": "",
        "line": "South Park, next morning. At Stark's Pond, Stan and Kyle sit on a bench and look out over the lake."
    },
    {
        "character": "Kyle",
        "line": "Well, I finally got my family to use the living room for an hour each night."
    },
    {
        "character": "Stan",
        "line": "I'm still really confused, dude. I have no idea what that was about."
    },
    {
        "character": "Kyle",
        "line": "Yeah. I guess that's the point. I don't think we're gonna understand. Maybe this IS all the beginning of a new art form. YouTube celebrities are only getting bigger. And what's great is that these people are inventing themselves, instead of being marketed and shoved down our throats."
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Kyle",
        "line": "No matter what we think, it's not just a passing trend. We need to realize that the new generation of entertainment is here. [notices PewDiePie's commenter window pop up to his right and above] And I, think that's great."
    },
    {
        "character": "Stan",
        "line": "Yeah, I think that's great too."
    },
    {
        "character": "PewDiePie",
        "line": "Alright bros, it look like we'll have to end it there. I wanna thank South Park for being in my show. I hope you bros enjoyed watching, and as always, stay awesome![over the end credits] Oh! That's it bros. Show's over.\n\n"
    }
]