[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Morning in CtPaTown, renamed Shi Tpa Town. A bright sun rises over City Foods. People mill around all over the area. The Stotches walk past Skeeter's Wine Bar while the Tuckers, without Craig, walk towards Whole Foods. In the parking area in front of the store two old friends greet each other"
    },
    {
        "character": "Gerald",
        "line": "Mornin' Randy!"
    },
    {
        "character": "Randy",
        "line": "Mornin' Ger! Just another day in paradise, huh?"
    },
    {
        "character": "Gerald",
        "line": "Yeah. Look at all the new restaurants the Whole Foods has brought in. [turns around and points at the restaurant behind them.] Let's try out that one there. [they walk towards it and reach the entrance. A greeter awaits them]"
    },
    {
        "character": "",
        "line": "(vernacular)"
    },
    {
        "character": "Randy",
        "line": "Hi. Two of us. please?"
    },
    {
        "character": "Greeter",
        "line": "Yeah, sorry guys. we got about a thirty minute wait."
    },
    {
        "character": "Gerald",
        "line": "[switches places with Randy] Oh, uh, scuse me. [whispers into the greeter's ear]"
    },
    {
        "character": "Greeter",
        "line": "Yes, sir, give me a second; I'll have a table right away. [rolls his eyes and walks off]"
    },
    {
        "character": "Randy",
        "line": "Whoa, what'd you say to him?"
    },
    {
        "character": "Gerald",
        "line": "I just... told him who I am."
    },
    {
        "character": "Randy",
        "line": "Who are you?"
    },
    {
        "character": "Gerald",
        "line": "[whips out his phone and shows Randy the Yelp app] I'm a yelp reviewer. I usually keep it on the down-low so they don't kiss my ass too much."
    },
    {
        "character": "Greeter",
        "line": "[returns and gets two menus] Right over here, sir. [takes them to their seats]"
    },
    {
        "character": "Waiter",
        "line": "Alright guys, welcome to (vernacular)"
    },
    {
        "character": "Gerald",
        "line": "Thanks, uh, did they mention to you that I am a Yelper?"
    },
    {
        "character": "Waiter",
        "line": "Yes, we've been alerted. Sir."
    },
    {
        "character": "Gerald",
        "line": "Greeeat. Could you have them turn up the lights a little, please? [the waiter goes away]"
    },
    {
        "character": "Randy",
        "line": "Oh, look at it, Gerald. All the new families moving in. [a new Mexican restaurant - Nueva Familia - is having its grand opening across the street] Our little town is all grown up.[Nueva Familia, across the street. A family-run restaurant. A boy sweeps up in the kitchen as his mother prepares some tacos on the griddle. His father rushes in.]\n\n"
    },
    {
        "character": "Mr. Rodriguez",
        "line": "Where's that other taco plate? We need it now."
    },
    {
        "character": "Mrs. Rodriguez",
        "line": "I'm a little overwhelmed."
    },
    {
        "character": "Mr. Rodriguez",
        "line": "I know. But we've put everything into moving here and starting this business, and we have to be impressive. [walks up to the boy and gets down on one knee] David, you must help your mama however you can. We're not going back to that miserable place!"
    },
    {
        "character": "Mr. Rodriguez",
        "line": "I don't wanna go back either."
    },
    {
        "character": "Mrs. Rodriguez",
        "line": "Okay, done."
    },
    {
        "character": "Mr. Rodriguez",
        "line": "Great! [rises and goes for the plates] We really have to impress this customer. He's a local food critic. [rushes the plates out to the dining area]"
    },
    {
        "character": "Mrs. Rodriguez",
        "line": "Another one?"
    },
    {
        "character": "",
        "line": "The dining area. Cartman is eating away. Before him are three plates. One has two burritos, the second has two tacos and some chips and guacamole, the third has two enchiladas which he hasn't touched yet. Ambient Mexican music plays"
    },
    {
        "character": "Mr. Rodriguez",
        "line": "[rushes to his table with two plates of food] Okay, here you go, amigo! Another taco plate and the taquitos."
    },
    {
        "character": "Cartman",
        "line": "Oh, thank you. And, uh did I mention I am a food critic for Yelp?"
    },
    {
        "character": "Mr. Rodriguez",
        "line": "Yes, you mentioned that several times."
    },
    {
        "character": "Cartman",
        "line": "Okay, I just didn't want you caught off-guard. [whips out his phone] I was thinking of giving this place 5 stars."
    },
    {
        "character": "Mr. Rodriguez",
        "line": "Really?"
    },
    {
        "character": "Cartman",
        "line": "[wiping his mouth clean with his napkin] Yeah, but I'm kind of teetering on 5 stars or 1 star."
    },
    {
        "character": "Mr. Rodriguez",
        "line": "Ohnono. No 1 star, please. What could we do to-?"
    },
    {
        "character": "Cartman",
        "line": "Ah I mean, I could probably be persuaded with some free desserts."
    },
    {
        "character": "Mr. Rodriguez",
        "line": "Let me get that for you."
    },
    {
        "character": "Cartman",
        "line": "Great, and can you turn down the music a bit? [taps his left ear a few times] This pagan shit hurts my ears."
    },
    {
        "character": "Mr. Rodriguez",
        "line": "Of course! [turns around and hurries away. A spritz is heard, and the camera shows David wiping down a table. Cartman notices]"
    },
    {
        "character": "Cartman",
        "line": "Oh hey, hey busboy. Busboy busboy, por favor. [snaps his fingers and whistles] Busboy!"
    },
    {
        "character": "Davíd",
        "line": "My name is David. (Dah-veed)"
    },
    {
        "character": "Cartman",
        "line": "Ehexcuse me?"
    },
    {
        "character": "Davíd",
        "line": "I said my name is David. (Dah-veed)"
    },
    {
        "character": "Cartman",
        "line": "Uhh, it's actually pronounced \"David,\" okay?"
    },
    {
        "character": "Davíd",
        "line": "Well, I'm \"David.\" (Dah-veed)"
    },
    {
        "character": "Cartman",
        "line": "It's \"David,\" dude. Look it up."
    },
    {
        "character": "Mr. Rodriguez",
        "line": "[comes out with a flan and a sundae on a plate] What's going on? Do not argue, son. We need him. [walks to Cartman's table and sets the desserts down] Here you are, a few free desserts. [the front door opens and some bells are heard] Ho, excuse me. More customers! [goes away]"
    },
    {
        "character": "Male food critic",
        "line": "[enters with his wife] Hi, two of us for lunch, please."
    },
    {
        "character": "Mr. Rodriguez",
        "line": "Yes, right away!"
    },
    {
        "character": "Male food critic",
        "line": "Oh, and uh, I just wanted to mention that my wife and I are Yelp reviewers, so uh, your best table, please."
    },
    {
        "character": "Mr. Rodriguez",
        "line": "Oh Jeez, you guys too, huh? Ho-kay, uhm, I'll get you set up right over here, okay? [takes them past Cartman, who casts a critical eye]"
    },
    {
        "character": "Cartman",
        "line": "Mmmhmmm! [The father takes them to a booth near Cartman]"
    },
    {
        "character": "Male food critic",
        "line": "Hm, this place seems, nice."
    },
    {
        "character": "Female food critic",
        "line": "I guess we'll see."
    },
    {
        "character": "Male food critic",
        "line": "D'I guess we'll see, won't we?"
    },
    {
        "character": "Cartman",
        "line": "Oh God, now everyone thinks they're a food critic."
    },
    {
        "character": "",
        "line": "South Park Elementary, hallway, day. Cartman puts his books in his locker and walks away when Butters catches him"
    },
    {
        "character": "Butters",
        "line": "Did you get 'em? Did you get 'em? Did you get 'em? Huh?"
    },
    {
        "character": "Cartman",
        "line": "[wearing a T-shirt that says \"WARNING: YELP critic\" on the front] Here you go. [takes a bag out of his back pocket and hands it to Butters]"
    },
    {
        "character": "Butters",
        "line": "Whoooaaa. [opens the bag and begins eating what's inside.]"
    },
    {
        "character": "Cartman",
        "line": "Crispy risotto bites from Olive Garden."
    },
    {
        "character": "Butters",
        "line": "How do you do it, Eric?"
    },
    {
        "character": "Cartman",
        "line": "I'm a restaurant critic, Butters. I get whatever I want."
    },
    {
        "character": "Butters",
        "line": "Jeeeeezzz. [a second later, Kyle walks by with David]"
    },
    {
        "character": "Kyle",
        "line": "So the cafeteria's back that way, and most of the classrooms are this way, down the-."
    },
    {
        "character": "Cartman",
        "line": "EEWW. [Kyle and David face him] What's the busboy doing here?"
    },
    {
        "character": "Kyle",
        "line": "Davíd is new to our school."
    },
    {
        "character": "Cartman",
        "line": "Oh, cool. Are you gonna clean the tables here too? How do you get to school? [mimics a boy on a bicycle] Do you ride your tiny bicicleta? Huh?"
    },
    {
        "character": "Kyle",
        "line": "Shut up."
    },
    {
        "character": "Cartman",
        "line": "Look amigo, I'm sorry I only gave your parents' restaurant 2 stars, but it could have been worse."
    },
    {
        "character": "Davíd",
        "line": "Why'd you only give them 2 stars?"
    },
    {
        "character": "Cartman",
        "line": "I'm sorry, but the food totally messed my stomach up. The morning after I ate it I went to the bathroom and my poop was all solid. Like no water at all."
    },
    {
        "character": "Kyle",
        "line": "It's not supposed to have water you-!"
    },
    {
        "character": "Cartman",
        "line": "It was like this one solid piece that I had to... push out my asshole. It was like being raped from the inside. Your parents' restaurant just wasn't up to my standards, David."
    },
    {
        "character": "Davíd",
        "line": "David. (Dah-veed)"
    },
    {
        "character": "Cartman",
        "line": "David."
    },
    {
        "character": "Davíd",
        "line": "Dah-víd."
    },
    {
        "character": "Cartman",
        "line": "David."
    },
    {
        "character": "Davíd",
        "line": "Dah-víííd."
    },
    {
        "character": "Cartman",
        "line": "David David David David! I can update this to a 1-star review in two seconds, dude. [David turns around and walks away. Kyle turns around, looks at Cartman, and follows David away. A few second later Cartman relaxes] ...Oohhhh God I love being a restaurant critic."
    },
    {
        "character": "",
        "line": "The Broflovski house, day, Gerald's den. Gerald is typing away at his computer. To help him focus on his work, he plays some opera music and smokes a pipe"
    },
    {
        "character": "Gerald's review",
        "line": "And yet, there was more. For in this crisp time when autumn begins to fade, the chef brings chicken in habanero, and even adds habanero powder to the crust. But the heat is restrained. You experience the fruity, delicious flavor of this without any spicy pain. I don't need any more pain. Hell, does anyone?"
    },
    {
        "character": "Sheila",
        "line": "[appears at the den doorway with Ike] Gerald! We're going to the park. You wanna come along?"
    },
    {
        "character": "Gerald",
        "line": "Sorry honey, this review for Applebee's has turned into a fifty-pager. And then I have a polish on Ruby Tuesday's."
    },
    {
        "character": "Sheila",
        "line": "Why don't you take a break from Yelping, Gerald? You seem a little overwhelmed."
    },
    {
        "character": "Gerald",
        "line": "[leans back on his chair] I am, overwhelmed. Sometimes I don't know what I've gotten myself into. But now everyone relies on my Yelp reviews and I... I don't wanna let anyone down."
    },
    {
        "character": "Sheila",
        "line": "Well there's chicken in the fridge if you get hungry."
    },
    {
        "character": "Gerald",
        "line": "Thanks, but I, I've gotta Yelp a new place in CtPaTown tonight. [leans forward a bit] God I'm so damned tired."
    },
    {
        "character": "Sheila",
        "line": "Okay. Have fun."
    },
    {
        "character": "Gerald",
        "line": "[to himself]Ha, \"fun,\" she says."
    },
    {
        "character": "Gerald's review",
        "line": "In finality, I will say that my experience at Applebee's was sublime and my treatment near that of a gladiator most decorated. But the street parking wasn't that great. Two and a half stars."
    },
    {
        "character": "Gerald",
        "line": "[satisfied with his review Gerald leans back in his chair again commenting to himself] Yes."
    },
    {
        "character": "",
        "line": "The school cafeteria, day. Wendy walks by with a new classmate. Cartman is on his phone while the boys around him go about eating their lunches"
    },
    {
        "character": "Wendy",
        "line": "Come on, Liza, I'll introduce you to the girls."
    },
    {
        "character": "Butters",
        "line": "Well aren't you eatin' lunch, Eric?"
    },
    {
        "character": "Cartman",
        "line": "Uhuh, I'm a food critic, Butters, okay? I can't just eat cafeteria food."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "O-okay, Here you are sir! There's orange-peel chicken, some uh shity beef, and uh shitty egg roll!"
    },
    {
        "character": "Kyle",
        "line": "Are you joking?!"
    },
    {
        "character": "Cartman",
        "line": "Well, you are a little late, like, I dunno, maybe only [emphasis] 1 star late."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Oh no! No 1 star, prease! You Uelpers are kriwing me! Okay, you no pay! You no pay, prease!"
    },
    {
        "character": "Cartman",
        "line": "Sounds good. Now get the fuck out of here."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Yes yes. I get the fuck out. Thank you! [hurries away]"
    },
    {
        "character": "Butters",
        "line": "Wow! Well you're pretty important, Eric."
    },
    {
        "character": "Kyle",
        "line": "He's not important. At. All."
    },
    {
        "character": "Cartman",
        "line": "Yes, no no, you you're right, Kyle. I'm not important. Oh, hey David, I was just wondering, um, how do you get to school? Do you... ride your tiny bicicleta? Eh?"
    },
    {
        "character": "Stan",
        "line": "Stop it."
    },
    {
        "character": "Cartman",
        "line": "What? I just want to hear him say \"Sí, me ride me tiny bicicleta to schooool.\""
    },
    {
        "character": "Davíd",
        "line": "Sí, me ride me teeny bicicleta to school."
    },
    {
        "character": "Cartman",
        "line": "[laughs] That's awesome! [turns around on the bench] I'm gonna go out to recess. Will you bus this for me, David. Thanks. [leaves the table. David leaves his seat]"
    },
    {
        "character": "Kyle",
        "line": "Ah, [facepalm] don't, dude, dude- Don't."
    },
    {
        "character": "",
        "line": "Park County Police Station. Sgt. Yates is at his computer"
    },
    {
        "character": "Barkley",
        "line": "Sir, it's midnight. Go home, get some sleep."
    },
    {
        "character": "Sgt. Yates",
        "line": "There's no time to sleep when the city's counting on me."
    },
    {
        "character": "Barkley",
        "line": "More Yelp reviews, sir?"
    },
    {
        "character": "Sgt. Yates",
        "line": "I had a bad experience at Red Lobster and if the people don't know about it, they could too. Folks deserve to know where to eat, Mitch."
    },
    {
        "character": "Barkley",
        "line": "But does anyone even thank you for it?"
    },
    {
        "character": "Sgt. Yates",
        "line": "I don't need them to. I know they need me, and that's enough."
    },
    {
        "character": "Barkley",
        "line": "[pats him on the left shoulder] God bless you, sir."
    },
    {
        "character": "Sgt. Yates",
        "line": "I know. [Barkley walks away]"
    },
    {
        "character": "",
        "line": "Whistlin' Willy's Pizza Gulch, established in 1986. A table shows the food critic couple who were in Nueva Familia earlier on, now with their son"
    },
    {
        "character": "Whistlin' Willy",
        "line": "Welcome to Whistlin' Willy's. Y'all enjoyin' your pizza?"
    },
    {
        "character": "Male food critic",
        "line": "Look here, my good man, we've been waiting over 15 minutes for you to sing Happy Birthday to our son!"
    },
    {
        "character": "Female food critic",
        "line": "Unfortunately for you, we are both restaurant critics, and so is our son!"
    },
    {
        "character": "Son",
        "line": "[gets an angry face] 1 star!"
    },
    {
        "character": "Diner 1",
        "line": "Excuse me! Emergency! [Whistlin' Willy rushes over to see what's up] Over here! Emergency! I would like a table. Inside the area with all the little plastic balls please, and make it snappy I am a food critic for Yelp."
    },
    {
        "character": "Whistlin' Willy",
        "line": "That does it! I've had enough! All you Yelp reviewers get the hell outta here! I don't care what happens to my business! I ain't kissing your asses no more! [moves the male food critic from the table to the double doors on his chair and throws him against the doors] Go on! Every Yelper get the fuck out of here!"
    },
    {
        "character": "Diner 2",
        "line": "Careful now, Bill, you don't want a one-star review."
    },
    {
        "character": "Whistlin' Willy",
        "line": "You're not a food critic, Dennis! You're a fuckin' mechanic! Now get the fuck out! Go on! All you Yelpin' sons of bitches get the fuck out of here! [Yelpers begin to stream out of the restaurant]"
    },
    {
        "character": "Male food critic",
        "line": "You're gonna regret this, Whistlin' Willy. You can't treat Yelpers this way."
    },
    {
        "character": "Whistlin' Willy",
        "line": "You get the f- Get the fuck out! [kicks the male food critic in the ass for emphasis as the critic goes out the door.]"
    },
    {
        "character": "Male food critic",
        "line": "AH! [Whistlin' Willy slams the door shut. Gerald shows up a few seconds later]"
    },
    {
        "character": "Gerald",
        "line": "Well, good for you."
    },
    {
        "character": "Whistlin' Willy",
        "line": "You too, you sonofabitch!"
    },
    {
        "character": "Gerald",
        "line": "Whoa! Hey! [Whistlin' Willy kicks him out too, and Gerald rubs his butt outside]"
    },
    {
        "character": "",
        "line": "Shi Tpa Town. Tuong Lu Kim is running around excited about something while David's father sweeps up at Nueva Familia."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "It's oba! It's oba! [screams some more and approaches Nueva Familia.] You see papaa?! It's oba! [David's father steps outside and Mr. Kim stops him] Whistrin' Wirry! He stand up to the Yelpas! [David's father scans the front page] We don't have to kiss uh their asses anymore! Look! [David's mother comes out to join his father] Everyone is doing the same! [signs go up saying \"No Yelpers\"] Ha haha. It's ova it's ova! Hey Skeetah, you hear the news?! [He runs off continuing his celebration]"
    },
    {
        "character": "Mr. Rodriguez",
        "line": "[softly] It's a ...miracle. [jubilantly] IT'S A MIRACLE! [he and his wife hug]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Cartman walks down the hallway humming to himself"
    },
    {
        "character": "Cartman",
        "line": "Hm hm hm the fuck? [notices a small puddle on the floor] Aw, dude, somebody spilled shit on the floor! [notices David at his locker] Hey David, somebody spilled something here. Could you clean this up, por favor? David. [whistles] Over here, there's some shit on the floor. [David closes his locker and turns away] Heyheyhey hey! What's goin' on, man?"
    },
    {
        "character": "Kyle",
        "line": "[arriving] You haven't heard? Nobody gives a fuck what Yelp reviewers think anymore."
    },
    {
        "character": "Cartman",
        "line": "What are you talking about? I'm the most influential critic in this town. Okay David, forget the spill, just give me one little \"My name is David. Me ride me biciceta to schoool\""
    },
    {
        "character": "Davíd",
        "line": "My name... is David. (Dah-veed)[walks off]"
    },
    {
        "character": "Kyle",
        "line": "HA! [walks off as well; confidently]"
    },
    {
        "character": "Cartman",
        "line": "[whips out his phone] Okay, I'm uh I'm updating my review. I'm about to do it. [waits for a comeback but doesn't get one] You'd better say \"I ride me bicicleta to school\"! [holds up his phone] One star! ... No s-no stars? [no reply. He sighs and tries again] No stars? ... You can't just treat me like I'm nothing... I still know I'm worth something! Come on, guys! [walks away. No one follows him. Seconds later he's back.] Oh yeah, y-you guys stay in school, that's kewl, you guys stay here. [leaves again]"
    },
    {
        "character": "",
        "line": "Shi Tpa Town, day. Cartman walks alone by City Wok. He notices a sign there - NO YELPERS. He then walks to Nueva Familia and knocks on the door. David is moving chairs around and stops. Cartman mimics someone riding a bike, and David sticks his middle finger up at him, then turns and walks away. Cartman sighs, turns around, and walks away. He walks right into Butters' house, through the living room, and up into Butters' room. Butters is at his desk drawing a purple car. Cartman sighs"
    },
    {
        "character": "Butters",
        "line": "[noticing] Oh, hey Eric."
    },
    {
        "character": "Cartman",
        "line": "[hops onto Butters' bed and lays down] It's all over, Butters. Everything I've worked so hard to achieve. All these hack wannabe food critics have made my profession a joke."
    },
    {
        "character": "Butters",
        "line": "Oh I'm sorry, bud."
    },
    {
        "character": "Cartman",
        "line": "All these people trying to be like me. And they don't even write about poop consistency the next day."
    },
    {
        "character": "Butters",
        "line": "Well Eric, you should be proud that people wanna be like you. Ha ah, I mean, you really started something."
    },
    {
        "character": "Cartman",
        "line": "I guess."
    },
    {
        "character": "Butters",
        "line": "Well if these people look up to you, maybe, maybe you can sort of, set the record straight and show them the way it's supposed to be done."
    },
    {
        "character": "Cartman",
        "line": "[sits up] You're right, Butters. Maybe I can actually use all these people somehow to make... real food critics respected again."
    },
    {
        "character": "",
        "line": "Sgt. Yates' house. Yates serves himself some whisky on the rocks while doing more reviews. His wife Maggie walks up to him."
    },
    {
        "character": "Maggie",
        "line": "Harrison Yates, what's gotten into you?"
    },
    {
        "character": "Yates",
        "line": "That's it, Maggie. I'm hanging it up. If people are gonna be trying all the new restaurants in town they'll... have to do it without my reviews."
    },
    {
        "character": "Maggie",
        "line": "What are ya talkin' about? You said that protectin' people from bad dinin' experiences was what kept you goin'."
    },
    {
        "character": "Yates",
        "line": "The restaurants put up signs sayin' I can't come in. I don't know why they singled me out, but it's like, people don't need me. [opens a letter and reads it] Well I'll be damned."
    },
    {
        "character": "Maggie",
        "line": "What is it?"
    },
    {
        "character": "Yates",
        "line": "Somebody's put a note in the mailbox... asking me to come and talk to them. They do need me. [rises and goes to the coat rack] I need to get goin'."
    },
    {
        "character": "Maggie",
        "line": "You want me to come along?"
    },
    {
        "character": "Yates",
        "line": "No, they're just asking for me. I guess... [opens the front door] maybe I do have a town to protect. [smiles and leaves]"
    },
    {
        "character": "",
        "line": "Cartman's house, Sunday. Cartman is getting refreshments ready for his guests in the living room. Liane walks up to him"
    },
    {
        "character": "Liane",
        "line": "Oh, are you having a party sweetheart?"
    },
    {
        "character": "Cartman",
        "line": "Not a part, Mom. I've invited all the poser food critics over for a meeting."
    },
    {
        "character": "Liane",
        "line": "Oh, how fun!"
    },
    {
        "character": "Cartman",
        "line": "It's not fun, it's serious. These people think they can do what I do, but they need to be, made to understand the reality. When the Yelpers get here I need you to get lost, okay? Okay, that's them, that's them. Go, get lost, Mom! [she goes away as he walks to the front door. He opens the door and sees a sea of reviewers]"
    },
    {
        "character": "Yelpers",
        "line": "Hello, hi. My name is [they all give their names at the same time] and I'm here for the meeting. [Cartman freezes up]"
    },
    {
        "character": "A reviewer",
        "line": "Is this the right place?"
    },
    {
        "character": "Cartman",
        "line": "Fuuuuuuck! [closes the door and keeps it closed with his back] Mom!"
    },
    {
        "character": "Liane",
        "line": "I'm going, honey."
    },
    {
        "character": "Cartman",
        "line": "But Mom, there's like a billion people here."
    },
    {
        "character": "Liane",
        "line": "Oh yes, sweetie, I think quite a few people are Yelp reviewers."
    },
    {
        "character": "Cartman",
        "line": "Oh, this many people have nothing better to do than write reviews on Yelp?!"
    },
    {
        "character": "Liane",
        "line": "I guess so, honey. Do you need more lemonade?"
    },
    {
        "character": "Cartman",
        "line": "Mom, there's a fucking billion people here! [yes, Yelpers all up and down the block, filling the streets all around. Moments later, he appears at his bedroom window on the second floor, and holds court] Uh, thank you all for coming. My name is Eric, and as you know, us Yelpers are being scrutinized-"
    },
    {
        "character": "A Yelper",
        "line": "COULD YOU SPEAK A LITTLE LOUDER?"
    },
    {
        "character": "Cartman",
        "line": "Yes. Us Yelp critics are being scrutinized."
    },
    {
        "character": "Other Yelpers",
        "line": "That's right! Yeah!"
    },
    {
        "character": "Cartman",
        "line": "Now, you see, the problem is that when there's too many reviewers, people no longer know who is the real food critic. [Sgt. Yates puffs up his chest, pretty sure that it's him] It's great that you all want to be critics, but we all know who the real food analyst of the town is."
    },
    {
        "character": "Other Yelpers",
        "line": "That's right. Yeah!"
    },
    {
        "character": "Gerald",
        "line": "[confidently humble] Huh. Oh thanks."
    },
    {
        "character": "Cartman",
        "line": "Okay. So, as long as there is one clear leader, then the rest of you can just follow. And with this many people all following [holds up index finger] one captain, we can fight to get our power back!"
    },
    {
        "character": "A Yelper",
        "line": "Poweerrrrr Back!"
    },
    {
        "character": "Cartman",
        "line": "So now rise up, and [pounds on the window sill] fight for your leader!! Fight together and show the restaurants that our food critic does matter!"
    },
    {
        "character": "Other Yelpers",
        "line": "Yeah! Let's go! [more cheering from the Yelpers]"
    },
    {
        "character": "Sgt. Yates",
        "line": "Alright, follow me!"
    },
    {
        "character": "Gerald",
        "line": "This way, everyone! [the crowd turns left and moves off]"
    },
    {
        "character": "",
        "line": "Whistlin' Willy's Pizza Gulch, day. A mother and son leave, but are still nearby when the crowd of Yelpers arrives and begins destroying the gulch. They then leave quickly. After a barrel is thrown through a window, Willy looks up to see what's going on"
    },
    {
        "character": "",
        "line": "News 4 segment"
    },
    {
        "character": "Anchor Tom",
        "line": "Another local business is closing its doors tonight after being taken down by Yelp reviewers. Whistlin' Willy's, a child favorite in town, was destroyed and its owner stripped and beheaded. The following video is graphic. [a crowd of Yelp reviewers is shown and they are ululating. Two Yelpers bring Whistlin' Willy in front of the camera and hold him there. The crowd continues to ululate]"
    },
    {
        "character": "Whistlin' Willy",
        "line": "No, please! No! Nonono! [the Yelpers pull the mask off his head and show it off to the camera] Awwww. [the ululating continues]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. \"Bad to the Bone\" plays as the school bell rings. Cartman walks down the hallway as a Big Critic on Campus, while in voice over he is singing the words. The other kids either hold their hands up or hold themselves a little tighter as Cartman walks to the tune of \"Bad To The Bone.\" He's met by a group of boys led by Kyle."
    },
    {
        "character": "Kyle",
        "line": "We all... loved... Whistlin' Willy's!"
    },
    {
        "character": "Cartman",
        "line": "[just shrugs] It didn't do well with Yelpers."
    },
    {
        "character": "Tolkien",
        "line": "You assholes destroyed the best place in town because they wouldn't kiss your asses!"
    },
    {
        "character": "Cartman",
        "line": "Oh come on, admit it. The food sucked."
    },
    {
        "character": "Kyle",
        "line": "Nobody went for the fucking food!"
    },
    {
        "character": "Cartman",
        "line": "Look, I'm sorry goys, but Whistlin' Willy failed to recognize the influence someone like me has on their business. Now, I just have one question for you, David. Do you ride... your teeny, tiny, bicicleta... to school?"
    },
    {
        "character": "Davíd",
        "line": "Si. Me ride me teeny bicicleta to school. [turns around and walks away. Kyle flashes an angry look at Cartman, then watches Davíd leave]"
    },
    {
        "character": "Kyle",
        "line": "[gets in Cartman's face] You're done! [turns around and walks away with the remaining boys]"
    },
    {
        "character": "Cartman",
        "line": "Yeah, I'm done! I'm now the leader of thousands of people! They all hang on my every word! [softly] And I'm gonna use my power to finally get what this town really needs."
    },
    {
        "character": "",
        "line": "The Broflovski house, day, Gerald's den. Gerald is typing away at his computer, with music and pipe, as before."
    },
    {
        "character": "Gerald's review",
        "line": "I found the wait staff at Red Lobster to be rude, and barely even acknowledging who I was. Or what I meant to this city."
    },
    {
        "character": "Sheila",
        "line": "[appears at the doorway with Ike] Gerald, I'm taking Ike to clown school. You care to joing us?"
    },
    {
        "character": "Gerald",
        "line": "I can't, honey. I'm now the leader of thousands of people. They all hang on my every word. And I'm going to use my power to finally get what this town really needs. [Sheila and Ike just walk away]"
    },
    {
        "character": "",
        "line": "Shi Tpa Town. The peace and quiet of the morning is disrupted by semiautomatic gunfire. Yelpers run into the area, and a bomb goes off behind Dee's Meats. Another News 4 segment"
    },
    {
        "character": "Reporter",
        "line": "For the fifth day in a row, historic Shi Tpa Town is under siege by Yelp reviewers. The restaurants are still refusing to be intimidated. and the Yelp reviewers are- [quickly ducks as the gunfire hits very close to him] -and the Yelp reviewers are preparing for all-out war. [real war footage is shown] The angry Yelp reviewers are demanding special treatment at all city restaurants. They claim that as local food critics they deserve respect and that all who oppose them will suffer. The online restaurant critics are getting ready to bring businesses to their knees, and some are already closing their doors. [Nueva Familia is shown...]"
    },
    {
        "character": "Reporter",
        "line": "One local restaurant worker actually called out the Yelp critics' leader."
    },
    {
        "character": "David",
        "line": "I guess you win, huh, big shot?! If you really are any kind of important to anybody, then get your bullshit food critic ass to the south of town and face me! Because you aren't a food critic, and you aren't important! [Sgt. Yates looks at the screen in the police station] And unless you're a chicken, I'll see you south of town! [Yates walks into his office and gets his coat]"
    },
    {
        "character": "Barkley",
        "line": "Where are you going, sir?"
    },
    {
        "character": "Sgt. Yates",
        "line": "You heard him. Little Mexican kid called me out. [shows his gun, then places it back in its holster] If he wants to fight me, that's fine."
    },
    {
        "character": "Barkley",
        "line": "You need backup sir?"
    },
    {
        "character": "Sgt. Yates",
        "line": "No, he's just calling me out. [turns and walks out]"
    },
    {
        "character": "Barkley",
        "line": "God bless you sir."
    },
    {
        "character": "Sgt. Yates",
        "line": "I know!"
    },
    {
        "character": "",
        "line": "The south of town, a big meadow or park on the outskirts of town. David marches towards the meeting point. Kyle runs up to catch him"
    },
    {
        "character": "Kyle",
        "line": "David! Dude, wait! [Kyle is next to him now] Dude, you don't wanna do this. You don't know what Cartman's capable of."
    },
    {
        "character": "David",
        "line": "Where I come from, we settle things with our fists!"
    },
    {
        "character": "Kyle",
        "line": "But this isn't Mexico."
    },
    {
        "character": "David",
        "line": "I'm not from Mexico, dude! I'm from Idaho! [Kyle glances away, embarrassed] I'm gonna show this prick how we do things in Boise!"
    },
    {
        "character": "Cartman",
        "line": "Oh, hello David! [Cartman is flanked by hundreds of Helpers]"
    },
    {
        "character": "Kyle",
        "line": "Alright, you've got your army! You've got your followers! If you're such a great leader, then just tell the city what you want, fat-ass!"
    },
    {
        "character": "Gerald",
        "line": "Don't call me fat, son! I'm doing this because they've-"
    },
    {
        "character": "Sgt. Yates",
        "line": "What I want is to be able to lead these fine people with the respect and the dignity-"
    },
    {
        "character": "Yelper 1",
        "line": "I didn't ask to be the leader, I was appointed! You see, I'm extremely important to this town, and I'm not going to be-"
    },
    {
        "character": "Yelper 2",
        "line": "My journey is this town's food- [soon everyone is talking over each other, and David and Kyle just look at each other.]"
    },
    {
        "character": "Yelper 3",
        "line": "You've made these people feel unwanted, and now they look to me for answers."
    },
    {
        "character": "Gerald",
        "line": "Now here I stand, vulnerable, afraid, and yet willing to do what the people of this-"
    },
    {
        "character": "Male food critic",
        "line": "And so we said \"to hell with it!\" And we took the challenge to go from the town's food critics to the town's spiritual leaders! What do we want?"
    },
    {
        "character": "Yelper 4",
        "line": "[another woman] People would say \"Oh, you're just a food blogger. You're just a tiny voice in the crowd. Well now my voice is heard, and I will-\" [her voice melts into the other voices]"
    },
    {
        "character": "Cartman",
        "line": "...wanted special privileges, but these people think I should have them! Right, guys? Maybe I don't deserve special treatment, but how else can I be the elite food critic they want? [more chatter]"
    },
    {
        "character": "Kyle",
        "line": "[after a few moments] Every person here thinks this is about them."
    },
    {
        "character": "David",
        "line": "I think I know what to do."
    },
    {
        "character": "Kyle",
        "line": "Yeah. Me too."
    },
    {
        "character": "",
        "line": "They Mayor's office, day. Mayor McDaniels sits at her desk, with several townsfolk standing behind her. Kyle stands to the right of the desk in a suit. Fanfare plays"
    },
    {
        "character": "Mayor McDaniels",
        "line": "And for all your service to this community, we want to once and for all declare you our most elite food critic. To distinguish you, we present to you... the Golden Badge. [an aide pins the badge on Gerald's coat] Wearing this badge means you will always get the special treatment that you deserve. [Johnson rings a bell and Fr. Maxi hums a short chant]"
    },
    {
        "character": "Gerald",
        "line": "Thank you, Mayor. It's a big responsibility, but I suppose I have to accept. I will do my best to serve this town."
    },
    {
        "character": "Mayor McDaniels",
        "line": "We know you will. [shows him the exit. He turns right and walks out. Another aide closes the exit door]"
    },
    {
        "character": "Kyle",
        "line": "Okay, bring in the next one."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Mr. Davis, you have proven yourself a leader. And for all your service to this community, we want to once and for all declare you our most elite food critic. To distinguish you, we present the Golden Badge. [an aide pins the badge on Mr. Davis's coat]"
    },
    {
        "character": "Mr. Davis",
        "line": "[softly] Wwooww."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Wearing this badge means you will always get the special treatment you deserve. [Johnson rings the bell and Fr. Maxi hums the short chant]"
    },
    {
        "character": "",
        "line": "Nueva Familia, day. The signs that showed the restaurant was shutting down are gone; the Grand Opening sign remains"
    },
    {
        "character": "Davíd",
        "line": "Alright, we got all the restaurants to agree to let the Yelpers in and make them feel special."
    },
    {
        "character": "Mr. Rodriguez",
        "line": "How did you do it, son?"
    },
    {
        "character": "",
        "line": "(vernacular), dinnertime. An elite food critic is about to order."
    },
    {
        "character": "Diner 3",
        "line": "Hi, yes, the steak, please. [points to his golden badge] I'm the uh Yelp elite. [the waiter takes his order to the kitchen and...]"
    },
    {
        "character": "Waiter",
        "line": "Alright, we got a Yelper. Give it that special attention."
    },
    {
        "character": "Chef",
        "line": "Youuu got it! [puts his finger into his nose and pulls out some boogers, and smears them on the steak.]"
    },
    {
        "character": "",
        "line": "Montage. What follows is a series of scenes showing cooks and waiters doing nasty things to Yelpers' dishes, including more boogers on them, masturbating to them, peeing on them, farting on them, etc... Some examples; Mr. Kim masturbating onto a plate of broccoli chicken, then serving it to the food critic couple, and grinning to himself; a Steed chef masturbates onto a plate of thin steaks and gives it to a waiter, who serves it to Sgt. Yates; Gerald finishes a review, then eats crab legs at a fine restaurant. Back at (vernacular), a waiter farts on a salad and gives it to the female food critic. Later, the couple critiques the restaurant's décor to the greeter. Whistlin' Willy serves up three pizzas to three different elite Yelpers. Sgt. Yates is back at the office writing another review."
    },
    {
        "character": "Lead singer",
        "line": "So you're one of Yelpers' special blessed.\nYou demand a restaurant's very best.\nWell they're gonna treat you special, I'm tellin' you, chum.\nNow get yourself ready for some boogers and cum!\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "That's called the Yelper Special!\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "Say, what's that on your pretzel?\n\n\n"
    },
    {
        "character": "",
        "line": "together"
    },
    {
        "character": "Lead singer",
        "line": "Your online critiques are real useful to some.\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Oooo-oooo-oooo-oooo\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "Now have a good time eatin' boogers and cum.\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "Someone farted on your salad.\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "But your décor critiques are valid.\n\n\n"
    },
    {
        "character": "",
        "line": "together"
    },
    {
        "character": "Lead singer",
        "line": "You think you're special, like you're A #1!\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Oooo-oooo-oooo-oooo\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "Well there's a whole lot of special in\n\n\n"
    },
    {
        "character": "All Singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "How 'bout some feces with your flounder?\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "You like that queefy quarter pounder?\n\n\n"
    },
    {
        "character": "",
        "line": "together"
    },
    {
        "character": "Diner 4",
        "line": "What's that spice that feels tangy on my tongue?"
    },
    {
        "character": "Backup singers",
        "line": "Oooo-oooo-oooo-oooo\n\n\n"
    },
    {
        "character": "Waiter 2",
        "line": "Oh that's a yuzu pepper [to himself] along with some boogers and cum"
    },
    {
        "character": "",
        "line": "At the school cafeteria"
    },
    {
        "character": "Davíd",
        "line": "Here you are, sir."
    },
    {
        "character": "Cartman",
        "line": "Why thank you, David. That's good service."
    },
    {
        "character": "Davíd",
        "line": "I will bring you food every day, my friend."
    },
    {
        "character": "Cartman",
        "line": "Mmmm, is that a jalapeño cream sauce?"
    },
    {
        "character": "Davíd",
        "line": "Yes. My father made it just for youuu."
    },
    {
        "character": "Cartman",
        "line": "Hmmm. It's tart, but savory."
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "",
        "line": "Back to random shots"
    },
    {
        "character": "Lead singer",
        "line": "Bein' a food critic's easy!\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "Oh, you feel a little queasy?\n\n\n"
    },
    {
        "character": "",
        "line": "together"
    },
    {
        "character": "Lead singer",
        "line": "Do you need a diagnosis? Well doctor's got one.\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Oooo-oooo-oooo-oooo"
    },
    {
        "character": "Dr. Doctor",
        "line": "Your stomach seems to be filled with boogers and cum."
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "Piss in your potatoes.\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum.\n\n\n"
    },
    {
        "character": "Lead singer",
        "line": "Some guy shit on your tomatoes.\nAlright, fancy food critic, looks like you've won.\nNow please enjoy all the boohoohoogers.\nBoohoohoohoohoohoogers.\nAaannnddd.\nCuuuuuuuuuummmmmmmm!\n\n\n"
    },
    {
        "character": "Backup singers",
        "line": "Boogers and cum!"
    }
]