[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "The Pentagon, President-Elect Garrison is approached by two members of the military."
    },
    {
        "character": "General Revaur",
        "line": "Mr. President? Russians are scrambling bombers to attack Denmark. NATO wants to know how we intend to stop them. Mr. President?...Mr. President you can't just sit there with your \"stank face\"."
    },
    {
        "character": "Mr. Garrison",
        "line": "Iah-uhk-uh-I cain't?"
    },
    {
        "character": "Military Officer",
        "line": "The TrollTrace website is set to go online in less than fifteen minutes, the world is in complete chaos!"
    },
    {
        "character": "NSA Agent",
        "line": "[From a nearby workstation.] Sir, someone is leading a coordinated cyber strike on the TrollTrace website."
    },
    {
        "character": "Mr. Garrison",
        "line": "[Joyously.] A cyber attack, well that's good! Where's it comin' from?"
    },
    {
        "character": "NSA Agent",
        "line": "It could be Russian, we don't know. Whoever this troll is, he's pretty fucking hardcore sir."
    },
    {
        "character": "",
        "line": "Broflovski Residence. Kyle sits in Gerald's office typing away, a can of Sprite nearby. \"Smokin'\" by the rock band \"Boston\" plays loudly."
    },
    {
        "character": "Kyle",
        "line": "Okay, okay, Tolkien? Tolkien are you there?"
    },
    {
        "character": "",
        "line": "Tolkien pops up in a Skype window on the computer."
    },
    {
        "character": "Tolkien",
        "line": "I'm here, what's this about Kyle?"
    },
    {
        "character": "Kyle",
        "line": "I can't tell you dude, I just need yourSmokin'\n\n\nhelp...Please, my life depends\nSmokin'\n\n on it.\n"
    },
    {
        "character": "Tolkien",
        "line": "Okay, okay sure.I feel alright, mamma...\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "Alright, I'm not jokin', yeah\n\n I need you to tell me the worst thing I can say on the United Negro College Fund website to piss off black people.\n"
    },
    {
        "character": "Tolkien",
        "line": "What!?"
    },
    {
        "character": "Kyle",
        "line": "Tolkien, please! There's no time to explain!"
    },
    {
        "character": "Tolkien",
        "line": "Beyonce ain't nothin' but a Taylor Swift ripoff."
    },
    {
        "character": "Kyle",
        "line": "That helps thank you."
    },
    {
        "character": "",
        "line": "Kyle closes Tolkien's window and brings up Craig and Tweek."
    },
    {
        "character": "Kyle",
        "line": "Tweek, Craig, I need you to get on the GLAAD website and respond to all the horrible shit I just said about gay people."
    },
    {
        "character": "Craig",
        "line": "Why'd you say horrible shit about gay people?"
    },
    {
        "character": "Kyle",
        "line": "It's not important, just get on it and respond."
    },
    {
        "character": "",
        "line": "A popup appears, Stan Marsh is ringing Kyle on Skype. Kyle closes, Tweek and Craig, and brings Stan up."
    },
    {
        "character": "Kyle",
        "line": "[To Tweek & Craig.] Hang on. [To Stan.] Stan! Finally. Dude I need everybody online now!"
    },
    {
        "character": "Stan",
        "line": "For what?"
    },
    {
        "character": "Kyle",
        "line": "Dude, there's no time to explain, you gotta go out and get everybody, tell them to get on their computers, go!"
    },
    {
        "character": "Stan",
        "line": "[Pumped up] Okay!"
    },
    {
        "character": "",
        "line": "Kyle closes Stan's window and brings up Jimmy Valmer."
    },
    {
        "character": "Kyle",
        "line": "Jimmy, what's the worst possible thing you could say on a website for handicapped Syrian refugees?"
    },
    {
        "character": "Jimmy",
        "line": "Wuh-Wuh-Waddle back to Syria you desert-tard. [Jimmy smiles gleefully]"
    },
    {
        "character": "",
        "line": "A door is nailed shut by numerous pieces of wood and the door handle is wedged securely with a chair. On the other side, someone is trapped, jostling the handle and shaking the door."
    },
    {
        "character": "Sheila",
        "line": "You boys...better not be on that computaaaaaaah! I'll make you pay for this. You locked your mother in the pantry? I'll lock you in your rooms forevaaah."
    },
    {
        "character": "",
        "line": "TrollTrace Headquarters. Gerald is locked in the conference room. Risk Astley is still blaring over the large television."
    },
    {
        "character": "",
        "line": "Never gonna give, never gonna give, give you up\nNever gonna give, never gonna give, give you up\nWe've known each other,\n\n\nStatic interrupts the song.\n\n\nfor so long\n\n\nStatic interrupts again and Dildo Shwaggins is seen.\n\n"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "Skank"
    },
    {
        "character": "Gerald",
        "line": "Dildo?"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "Skankhunt, can you hear me?"
    },
    {
        "character": "Gerald",
        "line": "Yes! Yes, where are you?"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "The troll locked us in the control room with his Danish workers."
    },
    {
        "character": "Gerald",
        "line": "How long before the website goes online?"
    },
    {
        "character": "Danish Worker",
        "line": "Less than ten mienutes."
    },
    {
        "character": "Gerald",
        "line": "Oh God!"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "Skankhunt! The TrollTrace servers monitor and catalog outrage and hate on the internet, there's a troll out there trying to overload them by generating tons of hate."
    },
    {
        "character": "Dildo Shwaggins",
        "line": "Skank, whoever's doing it is doing it from your account."
    },
    {
        "character": "Gerald",
        "line": "My account?"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "Yeah, he's pissing off a lot of people."
    },
    {
        "character": "",
        "line": "Gerald realizes that Kyle is using his account to help save him."
    },
    {
        "character": "Gerald",
        "line": "[Proudly.] That's my boy!"
    },
    {
        "character": "",
        "line": "Back at SpaceX, Heidi, Elon Musk and some SpaceX employees look at a chamber containing fast flowing energy."
    },
    {
        "character": "Female SpaceX Worker",
        "line": "The core energy is completely stable, and very easy to reduce. It's the most massive energy source of its size we've ever seen."
    },
    {
        "character": "Male #Occupy Mars SpaceX Worker",
        "line": "We've done it Elon, with this type of energy we can easily get mankind to Mars."
    },
    {
        "character": "Elon Musk",
        "line": "This is amazing! And it's all thanks to you little girl, how did you get to be so smart?"
    },
    {
        "character": "Heidi",
        "line": "I just-- have a boyfriend who really supports me."
    },
    {
        "character": "",
        "line": "She looks over to where Cartman is and waves. Cartman half-heartedly waves back."
    },
    {
        "character": "Elon Musk",
        "line": "Well, c'mon, I wanna know everything about you."
    },
    {
        "character": "",
        "line": "She and Elon Musk walk off, Cartman stands next to Butters with a troubled look on his face."
    },
    {
        "character": "Cartman",
        "line": "Conniving, snakes-in-the-grass. All of them."
    },
    {
        "character": "Butters",
        "line": "Yep."
    },
    {
        "character": "Cartman",
        "line": "We have to tell someone the truth, Butters."
    },
    {
        "character": "Butters",
        "line": "Are you sure about what's going to happen on Mars."
    },
    {
        "character": "Cartman",
        "line": "It's all been leading up to this, we've just been too blind to see it before."
    },
    {
        "character": "Male #Occupy Mars SpaceX Worker",
        "line": "Hey, you guys need anything? Water, Soda?"
    },
    {
        "character": "Cartman",
        "line": "Maybe just a moment alone, to talk?"
    },
    {
        "character": "Male #Occupy Mars SpaceX Worker",
        "line": "Sure, about what?"
    },
    {
        "character": "Cartman",
        "line": "The end of our species."
    },
    {
        "character": "",
        "line": "Back in Gerald's office in Kyle's house."
    },
    {
        "character": "Kyle",
        "line": "All right, who else we got now, Kevin are you there, Kenny?"
    },
    {
        "character": "Kevin",
        "line": "Ye-I, I typed in everything you told me to."
    },
    {
        "character": "Kenny",
        "line": "(Me too dude, what's next?)"
    },
    {
        "character": "",
        "line": "Ike pops up in a window."
    },
    {
        "character": "Ike",
        "line": "Kyle, I wanna help tooo."
    },
    {
        "character": "Kyle",
        "line": "No, Ike. So far the only thing you've done is from dad's account, we need you to stay clean. No trolling, Okay!? You can just help me with what I should say."
    },
    {
        "character": "",
        "line": "Dildo Shwaggins pops up in a window."
    },
    {
        "character": "Dildo Shwaggins",
        "line": "Hello? Can you hear me? This is Dildo Shwaggins."
    },
    {
        "character": "Kyle",
        "line": "Who are you?"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "I'm a colleague of your fathers. We see what you're trying to do, and we're gonna help, we trolled with your father, now we will troll with you."
    },
    {
        "character": "Kyle",
        "line": "O-- Okay?"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "Son, you need to know that your father is very proud of you. He was the best at Trevor's Axiom, he believes you can be too."
    },
    {
        "character": "Kyle",
        "line": "What the hell is \"Trevor's Axiom\"?"
    },
    {
        "character": "",
        "line": "An NSA Agent stands next to a dry-erase board with a pointer. On the board reads \"Trevor's Axiom\" under which is a tree of circled letters, breaking off into tiers, representing users."
    },
    {
        "character": "NSA Agent",
        "line": "Trevor's Axiom is a well-known equation in online trolling."
    },
    {
        "character": "",
        "line": "The people the NSA Agent is talking to are shown, seated at the table are President-Elect Garrison, sporting his \"Stank-Face\", some NSA Agents, General Revaur, and his associate."
    },
    {
        "character": "NSA Agent",
        "line": "It's a way in which one person can create a massive reaction on the Internet. Look, person A trolls person B, but it's not about person B, the troll is trying to push buttons to try and get a reaction from hundreds, eventually creating person C, whose overreaction and self righteousness will elicit a reaction from persons D through F, who weren't trolls but can't help rip on person C."
    },
    {
        "character": "NSA Agent",
        "line": "Their reactions lead to outrage persons G through N, and it keeps going, generating massive energy, it's like the fission reaction that leads to a fusion explosion, all bringing out the worst in humanity."
    },
    {
        "character": "Mr. Garrison",
        "line": "Huh, that sorta sounds like how I got elected."
    },
    {
        "character": "NSA Agent",
        "line": "Precisely, Mr. President, and if this kind of overreaction can be amplified through the Pentagon servers..."
    },
    {
        "character": "General Revaur",
        "line": "[Interrupting] It could blow up the Internet before TrollTrace ever does substantial damage."
    },
    {
        "character": "Mr. Garrison",
        "line": "Gentlemen, get me in contact with that troll."
    },
    {
        "character": "",
        "line": "SpaceX: Interior. Cartman and Butters are sitting at a table across from the male #OccupyMars SpaceX worker"
    },
    {
        "character": "Cartman",
        "line": "Listen, there isn't much time. This whole thing has to be stopped. We can't go to Mars."
    },
    {
        "character": "Male #Occupy Mars SpaceX Worker",
        "line": "You keep saying that, but not why."
    },
    {
        "character": "Butters",
        "line": "Because Eric knows the future."
    },
    {
        "character": "Male #Occupy Mars SpaceX Worker",
        "line": "What are you talking about?"
    },
    {
        "character": "Cartman",
        "line": "I've had visions of Mars for the past few months. I'm a visionary. That's why I came, why I brought her."
    },
    {
        "character": "",
        "line": "He hops off the chair and walks to the other side of the room."
    },
    {
        "character": "Cartman",
        "line": "But the visions weren't complete until recently. I know what happens on Mars."
    },
    {
        "character": "",
        "line": "Cartman has a vision, and the red surface of Mars is now shown, as he dictates his vision."
    },
    {
        "character": "Cartman (Voiceover)",
        "line": "At first, you'll be super-happy, bouncing around the red sand."
    },
    {
        "character": "",
        "line": "Cartman is is in a spacesuit, jumping around saying \"Cool\"."
    },
    {
        "character": "Cartman",
        "line": "Everyone will be really nice."
    },
    {
        "character": "",
        "line": "Cartman jumps down from a small hill and notices a futuristic structure with some female astronauts nearby. They both wave to Cartman as he hops past the structure."
    },
    {
        "character": "Female 1",
        "line": "Hi!"
    },
    {
        "character": "Female 2",
        "line": "Hi!"
    },
    {
        "character": "Cartman",
        "line": "Hi!"
    },
    {
        "character": "",
        "line": "Cartman reaches the bottom of the hill as a rover drives past him."
    },
    {
        "character": "Cartman",
        "line": "You'll think the rover cars and roller coasters are really cool."
    },
    {
        "character": "",
        "line": "The rover is now driving towards a futuristic amusement park."
    },
    {
        "character": "Cartman",
        "line": "But then, you'll realize something--The other colonists all seem to be women."
    },
    {
        "character": "",
        "line": "Cartman looks around and notices a parked rover with 4 women smiling and waving to him."
    },
    {
        "character": "Cartman",
        "line": "Hmm, let's see"
    },
    {
        "character": "",
        "line": "Cartman hops in their direction."
    },
    {
        "character": "Cartman",
        "line": "And then you'll start to wonder, \"Where are all the other guys?\""
    },
    {
        "character": "",
        "line": "He quickly hops past a group of girls and young women. An image of Butters' head in a space helmet zooms past Cartman. Butters voice is heard."
    },
    {
        "character": "Butters",
        "line": "[Whispering] Look underground."
    },
    {
        "character": "",
        "line": "Butter's voice echoes as Cartman hops toward an underground mine entrance."
    },
    {
        "character": "Cartman",
        "line": "And soon, you'll realize there's areas you didn't understand the purpose for."
    },
    {
        "character": "",
        "line": "Cartman stops and examines the entrance, then proceeds inside."
    },
    {
        "character": "Cartman",
        "line": "What is this place?"
    },
    {
        "character": "Cartman",
        "line": "And that's when you'll learn the truth..."
    },
    {
        "character": "",
        "line": "A chamber unfolds in front of Cartman, it is filled with exhausted, naked men who have hoses attached to their penises. Each of them are standing in front of a station housing a reservoir of their semen and a laptop computer resides in front of each of them."
    },
    {
        "character": "Cartman",
        "line": "Men have been forced underground, deemed useless by women."
    },
    {
        "character": "",
        "line": "The naked men are struggling to type on their laptops while being drained of their semen."
    },
    {
        "character": "Cartman",
        "line": "They are mined for the only things women still need us for, our semen, and our jokes."
    },
    {
        "character": "",
        "line": "Cartman continues watching, as two women come up from behind, and grab him."
    },
    {
        "character": "Cartman",
        "line": "What?! No, no!"
    },
    {
        "character": "",
        "line": "One of the women removes Cartman's helmet."
    },
    {
        "character": "Cartman",
        "line": "You're just as funny as us! You don't need to do this!"
    },
    {
        "character": "",
        "line": "Soon, Cartman has been stripped of his clothes and is now naked, attached to a station."
    },
    {
        "character": "Cartman",
        "line": "Nooooooo! No, no!"
    },
    {
        "character": "",
        "line": "A woman in a spacesuit is standing behind him, yelling at him."
    },
    {
        "character": "Female 3",
        "line": "Write jokes!"
    },
    {
        "character": "",
        "line": "Cartman starts typing on the laptop, wimpering."
    },
    {
        "character": "Cartman",
        "line": "No! No!"
    },
    {
        "character": "",
        "line": "SpaceX: Interior. Cartman's vision ends."
    },
    {
        "character": "Cartman",
        "line": "And you'll be trapped down there forever, in the cum and joke mines of Mars."
    },
    {
        "character": "Male #Occupy Mars SpaceX Worker",
        "line": "That's, That's ridiculous. Why would women need us to do that? They're just as funny as men."
    },
    {
        "character": "Cartman",
        "line": "If there's even a little part of you that really doesn't believe that, then think about what else has to be going on."
    },
    {
        "character": "",
        "line": "They all look up at two female SpaceX employees that walk by. The girls stop and notice the guys staring at them."
    },
    {
        "character": "Female SpaceX Employee",
        "line": "What?"
    },
    {
        "character": "Male #Occupy Mars SpaceX Worker",
        "line": "What?"
    },
    {
        "character": "",
        "line": "Cartman hops back on chair, whispering."
    },
    {
        "character": "Cartman",
        "line": "You have to help us stop this!"
    },
    {
        "character": "",
        "line": "TrollTrace:Conference Room. Gerald is trying different access codes to open the door, but is consistently rejected"
    },
    {
        "character": "Gerald",
        "line": "[Frustrated.] Ah! God damn it!"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "Skank! You still there?"
    },
    {
        "character": "Gerald",
        "line": "[He walks over to the TV.] Yeah, I'm here."
    },
    {
        "character": "",
        "line": "TrollTrace:Assembly Hall. Dildo Shwaggins is sitting at a computer with the rest of the trolls and TrollTrace staff"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "The servers are starting to heat up, but the Danish say there are breakers that will never let them overload. You got to climb up the building and shut off the breakers."
    },
    {
        "character": "Gerald",
        "line": "[He looks up at the monitor.] I can't go anywhere. I'm locked in the conference room."
    },
    {
        "character": "TrollTrace employee",
        "line": "Oh, the key code to the conference room is 9..."
    },
    {
        "character": "Gerald",
        "line": "[He runs over to the panel and presses 9.] Yeah...?"
    },
    {
        "character": "TrollTrace employee",
        "line": "That's it. 9."
    },
    {
        "character": "Gerald",
        "line": "[Frustrated.] Oh, for fuck's sake! [The panel light turns green, the door opens, and Gerald runs out.]"
    },
    {
        "character": "",
        "line": "Broflovski Residence. Sheila is still trying to break open the kitchen pantry door."
    },
    {
        "character": "Sheila",
        "line": "[She's pounding the door.] Kyle! You better run if I get out of here! You better pray that--[The chair moves and she is begins to pry open the door with her hands.]-ah! "
    },
    {
        "character": "",
        "line": "Sheila eventually break the kitchen pantry door with her bodyweight. She comes out looking disheveled and breathing heavily, before yelling in frustration."
    },
    {
        "character": "",
        "line": "TrollTrace:Locker Room. Gerald runs in and stops at a locker to grab a uniform. He then proceeds up the ladder in the server room"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "[He speaks over P.A. system.] Skank. Skankhunt, are you there yet?"
    },
    {
        "character": "Gerald",
        "line": "Yeah, I'm up with all the servers."
    },
    {
        "character": "",
        "line": "TrollTrace:Assembly Hall. Dildo Shwaggins is sitting at a computer with the rest of the trolls and TrollTrace staff"
    },
    {
        "character": "TrollTrace employee",
        "line": "The first breaker should be there. Tell him to look for a large red lever."
    },
    {
        "character": "Dildo Shwaggins",
        "line": "[He speaks over P.A. system.] Skank, do you see a large red lever?"
    },
    {
        "character": "Gerald",
        "line": "[notices the lever] Yeah, I got it [grabs the lever]"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "[He speaks over P.A. system.] Flip it off"
    },
    {
        "character": "",
        "line": "Gerald pulls the lever down, causing an alarm to go off."
    },
    {
        "character": "Dildo Shwaggins",
        "line": "[He speaks over P.A. system.] That's good. Keep going Skankhunt."
    },
    {
        "character": "",
        "line": "Ike's room. Ike is on the computer with a headset."
    },
    {
        "character": "Ike",
        "line": "You are all dumbass... fuckwads."
    },
    {
        "character": "",
        "line": "An angry Sheila starts to slowly walk up to Ike's door and then into his room"
    },
    {
        "character": "Ike",
        "line": "Lick my asshole, you Mexican... bitch."
    },
    {
        "character": "Sheila",
        "line": "Ike!"
    },
    {
        "character": "Ike",
        "line": "[screams]"
    },
    {
        "character": "Sheila",
        "line": "[Yelling.] You dare lock me in the pantry, so you can play on your computer?!"
    },
    {
        "character": "",
        "line": "Sheila charges at Ike, but he manages to slide and crawl under her nightgown. She then grabs his computer monitor and throws it down onto the floor."
    },
    {
        "character": "Ike",
        "line": "Mommy!"
    },
    {
        "character": "Sheila",
        "line": "[Yelling.] You're gonna pay for what you have done!"
    },
    {
        "character": "Ike",
        "line": "Aah! [He runs out into the hallway.]"
    },
    {
        "character": "",
        "line": "Sheila follows Ike into the hallway and starts screaming"
    },
    {
        "character": "",
        "line": "Gerald's office. Kyle is typing on the computer just as Ike pushes the door open"
    },
    {
        "character": "Ike",
        "line": "Kyle!"
    },
    {
        "character": "Sheila",
        "line": "Ike!"
    },
    {
        "character": "Kyle",
        "line": "[He throws down headset.] Shit!"
    },
    {
        "character": "Ike",
        "line": "Mommy got out!"
    },
    {
        "character": "",
        "line": "Kyle gets off the chair and tries to shield Ike from Sheila"
    },
    {
        "character": "Sheila",
        "line": "[Panting.] You...! You helped turned your brother this way!"
    },
    {
        "character": "Kyle",
        "line": "Mom, there's been a mistake. Ike isn't the school troll. We're trying to help--"
    },
    {
        "character": "Sheila",
        "line": "Shut up! Not another word from either of you! You're both grounded from the computer...forever!"
    },
    {
        "character": "",
        "line": "Sheila charges at the boys, but Kyle and Ike side step her and move towards the window."
    },
    {
        "character": "Kyle",
        "line": "Mom, please, you got to listen to me. Ike is innocent"
    },
    {
        "character": "Sheila",
        "line": "[Yelling.] Do you think I'm stupid?!"
    },
    {
        "character": "Kyle",
        "line": "No, Mom. You just don't know everything. [Kyle straps a vest around his chest.]"
    },
    {
        "character": "Sheila",
        "line": "You both march out of here, right now!"
    },
    {
        "character": "Kyle",
        "line": "I'm sorry, Mom. I'm just trying to protect my family"
    },
    {
        "character": "",
        "line": "Kyle grabs Ike and pulls the ripcord on his vests, launching both of them out the window. Sheila then runs over to the window and looks on in shock."
    },
    {
        "character": "",
        "line": "SpaceX:Exterior. A large group of people are making noise outside the entrance. "
    },
    {
        "character": "",
        "line": "SpaceX:Interior. The Male #Occupy Mars SpaceX Worker is walking alongside Elon Musk. "
    },
    {
        "character": "Male #Occupy Mars SpaceX Worker",
        "line": "Look, Elon, I'm just saying before we go any further, you might want to hear this kid out. [They both stop in front of Cartman and Butters.]"
    },
    {
        "character": "Male #Occupy Mars SpaceX Worker",
        "line": "Go on, tell Elon."
    },
    {
        "character": "Cartman",
        "line": "Elon, I know you've dreamt of mankind getting to Mars, but its not going to be very kind to man. They're going to put us underground."
    },
    {
        "character": "Elon Musk",
        "line": "For what?"
    },
    {
        "character": "Cartman",
        "line": "What's the one thing women don't have? Semen and a sense of humor."
    },
    {
        "character": "Elon Musk",
        "line": "That's two things."
    },
    {
        "character": "Cartman",
        "line": "They're pretty related."
    },
    {
        "character": "Elon Musk",
        "line": "Women don't need us for comedy. They can be just as funny as men. You should meet my girlfriend. She's really smart and really funny."
    },
    {
        "character": "Cartman",
        "line": "Oh, Elon. Oh, Christ, Elon."
    },
    {
        "character": "Butters",
        "line": "I used to think women were funny, too, but Eric talked me out of it."
    },
    {
        "character": "Cartman",
        "line": "It's something they do to our brains. They attract us like flies to the spiderweb. And then they make you think they're really smart, really funny. But they're only really smart, Elon."
    },
    {
        "character": "",
        "line": "Cartman turns around and notices Heidi looking at him through the glass partition."
    },
    {
        "character": "Cartman",
        "line": "They can live without us. We can't live without them."
    },
    {
        "character": "",
        "line": "Heidi waves to Cartman and he waves to her with a smile. She then walks away"
    },
    {
        "character": "Cartman",
        "line": "If even 1/16th of you believes that women might not be as funny as men, Elon--[He turns around and notices that Elon isn't there.] Elon?"
    },
    {
        "character": "",
        "line": "Copy and Print: Exterior. Kyle and Ike are inside, with Kyle trolling on the computer."
    },
    {
        "character": "Kyle",
        "line": "Why don't you kill yourself? Trust me, no one will care."
    },
    {
        "character": "Ike",
        "line": "You fat hooker."
    },
    {
        "character": "Kyle",
        "line": "You fat hooker. Ike, when this is all over, we're gonna need to clean your mouth out."
    },
    {
        "character": "Ike",
        "line": "You clean your fucking mouth out."
    },
    {
        "character": "",
        "line": "Stan pops up on a FaceTime window"
    },
    {
        "character": "Kyle",
        "line": "Stan! You still haven't found Butters yet? Dude, I need his hatred towards women right now!"
    },
    {
        "character": "Stan",
        "line": "Dude, he's not around anywhere. He must be out of town."
    },
    {
        "character": "Kyle",
        "line": "Shit!"
    },
    {
        "character": "",
        "line": "A FaceTime notification from \"The President\" pops up"
    },
    {
        "character": "Kyle",
        "line": "Hold on..."
    },
    {
        "character": "",
        "line": "Mr. Garrison pops up on a FaceTime window."
    },
    {
        "character": "Mr. Garrison",
        "line": "Kyle?!"
    },
    {
        "character": "Kyle",
        "line": "[Surprised.] Oh, hey, Mr. President"
    },
    {
        "character": "Mr. Garrison",
        "line": "Kyle, you're the troll who started all this?!"
    },
    {
        "character": "Kyle",
        "line": "Uh...what do you mean?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Don't worry. Your secret's safe with me. So long as you keep doing what you're doing. The American government is behind you."
    },
    {
        "character": "Kyle",
        "line": "[Surprised.] It is?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Keep up the good work. We're gonna take that big shitstorm of hate you're creating and amplify it. We'll try to create enough energy to blow up the whole fucking internet. [He gives Kyle a military salute] You're doing God's work, son. Keep it up."
    },
    {
        "character": "Kyle",
        "line": "[He gives Mr. Garrison a half-hearted military salute.] Thanks?"
    },
    {
        "character": "",
        "line": "The skies of Denmark. Tjing Tjang Tjing is heard as Lennart Bedrager is flying a helicopter with a grin on his face. As he looks at his phone, his expression changes into shock as he sees video of Gerald shutting down the servers. "
    },
    {
        "character": "Bedrager",
        "line": "Oh, no, you don't."
    },
    {
        "character": "",
        "line": "Bedrager turns the helicopter around and heads back to the TrollTrace building."
    },
    {
        "character": "",
        "line": "South Park: Residential neighborhood. People are panicking and running around on the streets. Sheila walks up to the Tucker residence and knocks on the door."
    },
    {
        "character": "Sheila",
        "line": "Laura, have my boys come to see Craig? They're hiding from me."
    },
    {
        "character": "",
        "line": "Laura is sobbing."
    },
    {
        "character": "Sheila",
        "line": "What? What? What?"
    },
    {
        "character": "Laura",
        "line": "[She wipes her nose with a tissue.] The son of a bitch. He's such a bastard."
    },
    {
        "character": "",
        "line": "Laura walks away from the door into the living room. A confused Sheila follows her into the house"
    },
    {
        "character": "Laura",
        "line": "When you marry someone and you think you know them..."
    },
    {
        "character": "Sheila",
        "line": "I don't know what you're talking about."
    },
    {
        "character": "Laura",
        "line": "TrollTrace. Its up and running. [She points to the laptop sitting on the table.]"
    },
    {
        "character": "Laura",
        "line": "It can tell you anybody's Internet history. [She starts to walk to her couch.]"
    },
    {
        "character": "Laura",
        "line": "I couldn't resist. I looked up my husband. [Sheila approaches the laptop.] The websites he's visited are just...disgusting!"
    },
    {
        "character": "Sheila",
        "line": "May I use this a moment?"
    },
    {
        "character": "Laura",
        "line": "Sure. Type in any name. It'll show you everything they've ever done online. Be careful. You might not like what you see."
    },
    {
        "character": "",
        "line": "Sheila takes a seat and accesses The TrollTrace website. She starts to type in Ike's name and all his personal information. A detailed list of websites with date and time stamps appears in front of her. She starts to scroll down the list and is shocked at what she sees."
    },
    {
        "character": "",
        "line": "SpaceX:Exterior. A large group of people are making noise outside the entrance. "
    },
    {
        "character": "",
        "line": "SpaceX:Interior. Butters is standing around while Cartman is nervously pacing back and forth. "
    },
    {
        "character": "Cartman",
        "line": "What the hell am I going to do, Butters? Semen and a sense of humor. I can't live without Heidi. I know I'll be miserable. But I also can't live on the cum and joke mines of Mars."
    },
    {
        "character": "Butters",
        "line": "Gee, I don't know what to tell you, buddy."
    },
    {
        "character": "Cartman",
        "line": "If I stay on Earth where the internet is, Heidi finds out I know women aren't actually funny. And if I go to Mars, I get milked like a goat."
    },
    {
        "character": "",
        "line": "Butters' phone rings and he becomes mad as he answers it. "
    },
    {
        "character": "Butters",
        "line": "What?!"
    },
    {
        "character": "Kyle",
        "line": "Butters! Where the fuck are you?!"
    },
    {
        "character": "Butters",
        "line": "Oh, I'm at SpaceX. Where are you?"
    },
    {
        "character": "Kyle",
        "line": "SpaceX? Why?!"
    },
    {
        "character": "Butters",
        "line": "Well, we sort of created this ginormic energy source, but now, we're trying to figure out what to do with it."
    },
    {
        "character": "Kyle",
        "line": "[He swivels his chair around.] Like...how ginormic of an energy source?"
    },
    {
        "character": "Butters",
        "line": "Like enough to get humanity to Mars."
    },
    {
        "character": "Cartman",
        "line": "[He is heard over Kyle's phone.] Is that Kyle?"
    },
    {
        "character": "Cartman",
        "line": "[He takes Butters' phone.] Kyle, do you mind? I'm having really big girl problems right now."
    },
    {
        "character": "Kyle",
        "line": "Cartman, I think we might be able to help each other."
    },
    {
        "character": "",
        "line": "TrollTrace:Server Room. Gerald is moving up another ladder in the server room"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "[He speaks over P.A. system.] Skank, there's no more time! Have you found the last breaker?"
    },
    {
        "character": "",
        "line": "Gerald is at the last walkway and is staring at a path leading to a mechanical door."
    },
    {
        "character": "Gerald",
        "line": "I think so. I-I'm up on some kind of bridgeway."
    },
    {
        "character": "TrollTrace employee",
        "line": "That last breaker should be there"
    },
    {
        "character": "Gerald",
        "line": "Heading to it now!"
    },
    {
        "character": "",
        "line": "Gerald begins to sprint across the bridgeway, but stops as he sees the figure of Lennart Bedrager standing at the door."
    },
    {
        "character": "Bedrager",
        "line": "I'm ten steps ahead of you!"
    },
    {
        "character": "",
        "line": "Gerald is in shock, as Lennart Bedrager emerges from the shadows with a gun pointed at him."
    },
    {
        "character": "Bedrager",
        "line": "What's the matter Skankhunt? You just can't stand to be outdone, huh?"
    },
    {
        "character": "",
        "line": "The TrollTrace server room is starting to fall apart"
    },
    {
        "character": "Gerald",
        "line": "Get out of my way. What you're doing is wrong!"
    },
    {
        "character": "Bedrager",
        "line": "What I'm doing is wrong? How is getting millions of people to kill themselves different from getting one person to?"
    },
    {
        "character": "Gerald",
        "line": "It's completely heartless and malicious!"
    },
    {
        "character": "Bedrager",
        "line": "You can honestly stand there, as a troll, and tell me that what I'm doing isn't hilarious?"
    },
    {
        "character": "Gerald",
        "line": "No! Its not! Hacking the world to show that most people act differently online isn't even technically satirical."
    },
    {
        "character": "Bedrager",
        "line": "How is not satirical?"
    },
    {
        "character": "",
        "line": "The TrollTrace server room continues to fall apart, causing explosions and flying debris, as the bridgway starts to shake, knocking both of them back."
    },
    {
        "character": "",
        "line": "Tucker residence: Living room. As Laura looks out the window, Sheila is still in shock at the TrollTrace results she's looking at."
    },
    {
        "character": "Sheila",
        "line": "There's nothing here."
    },
    {
        "character": "",
        "line": "The TrollTrace results for Ike continue to scroll before finally stopping."
    },
    {
        "character": "Sheila",
        "line": "Maybe Kyle was telling the truth. [She gets off of chair and walks towards Laura.]"
    },
    {
        "character": "Sheila",
        "line": "Oh Laura! I think my boys were being honest with me."
    },
    {
        "character": "Laura",
        "line": "About what?"
    },
    {
        "character": "Sheila",
        "line": "I accused Ike of...of...well, I can't really say, but this thing says that he's clean. I got to find my boys, Laura. Thank you so much. [She approaches the front door.]"
    },
    {
        "character": "Laura",
        "line": "Its not our kids we have to be worried about. [Sheila stops and turns to her.]"
    },
    {
        "character": "Laura",
        "line": "My husband was on three \"married-but-dating\" websites! He looked at porn 4,000 times in one month! Aren't you curious about what your husband does? Huh? Sure he doesn't have any girlfriends?"
    },
    {
        "character": "",
        "line": "Sheila thinks about Laura's question while looking at the TrollTrace website on the laptop."
    },
    {
        "character": "Sheila",
        "line": "No, I-I have to respect Gerald's privacy."
    },
    {
        "character": "Laura",
        "line": "Sure, yeah. Respect. Nice of you to give him that. [She walks toward the laptop.]"
    },
    {
        "character": "Laura",
        "line": "Come on, you really think you can resist the urge to type in his name...just for a quick little look?"
    },
    {
        "character": "",
        "line": "The Pentagon: Diplomatic Strategy room. One employee who is on fire runs across the room unnoticed by the staff. Two NSA agents are typing while Mr. Garrison and the Army generals stand near them"
    },
    {
        "character": "NSA Agent",
        "line": "There's nothing more we can do. Nearly everyone is online and we diverted all the power we can."
    },
    {
        "character": "Army General 2",
        "line": " Mr. President, TrollTrace has been online for almost 15 minutes now. Its too late. We need to get you down to the bunker."
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh I got a bunker? Well that's good."
    },
    {
        "character": "Soldier",
        "line": "[He holds the red telephone.] Mr. President, we have an urgent call from Kyle."
    },
    {
        "character": "Mr. Garrison",
        "line": "[He picks up the phone.] Sorry, Kyle. Looks like its not going to work."
    },
    {
        "character": "Kyle",
        "line": "[He types on his computer.] Mr. Garrison, I might have just found a lot more energy. Is there anyway the Pentagon can connect to SpaceX?"
    },
    {
        "character": "Mr. Garrison",
        "line": "SpaceX? What the fuck is that?"
    },
    {
        "character": "Kyle",
        "line": "[He types on his computer.] You know, the company trying to find new forms of energy, create jobs and get mankind to Mars."
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay, that's dumb, but go on."
    },
    {
        "character": "",
        "line": "TrollTrace: Server room. The rooms continues to fall apart while Gerald and Lennart try to keep their balance as the bridegway starts to shake from the explosions."
    },
    {
        "character": "Gerald",
        "line": "Okay, okay, look. What you're doing is just trying to prove that everyone is either a bad person or a snoop, right? So how is that funny?"
    },
    {
        "character": "Bedrager",
        "line": "That's not what I'm doing. I'm showing everyone that all this stuff that they freak out over doesn't even matter."
    },
    {
        "character": "Gerald",
        "line": "No, but see, that's just nihilism."
    },
    {
        "character": "Bedrager",
        "line": "Oh, come on!"
    },
    {
        "character": "Gerald",
        "line": "That is!"
    },
    {
        "character": "Bedrager",
        "line": "So--so wait! If you do some big, outrageous, offensive thing with a positive attitude, you're a satirist, but if you're cynical about it, then you're a nihilist? That's fucking ridiculous!"
    },
    {
        "character": "",
        "line": "Another explosion causes them to try and regain their balance again."
    },
    {
        "character": "Gerald",
        "line": "You're trying to get people to go to war and kill each other."
    },
    {
        "character": "Bedrager",
        "line": "So maybe this is like the new post-funny era of satire."
    },
    {
        "character": "",
        "line": "Another explosion causes them to move back slightly and keep their balance"
    },
    {
        "character": "",
        "line": "SpaceX: Assembly line. An alarm goes off as Cartman speaks over the P.A. system."
    },
    {
        "character": "Cartman",
        "line": "Attention all SpaceX employees. [Elon Musk and his group turn away from the energy source chamber and look up.]"
    },
    {
        "character": "Cartman",
        "line": "Please evacuate the building immediately. [A group of men working on Tesla cars stop and hear the announcement.]"
    },
    {
        "character": "Cartman",
        "line": "We just received a bomb threat from NASA. This is not a drill. [Heidi walks over to Cartman from behind.]"
    },
    {
        "character": "Cartman",
        "line": "The NASA terrorists are super-jelly of us. Please quietly and calmly find the nearest exit and get the fuck out as fast as you can. [He notices Heidi.] Ah! [He puts the microphone away.] Oh, hey, babe. Wh-What's up?"
    },
    {
        "character": "Heidi",
        "line": "There's a bomb threat?"
    },
    {
        "character": "Cartman",
        "line": "Oh yeah, I was just...They told me on the stifernisy thing. It was spinning. Come on, we better get out. [He grabs Heidi and runs with her to the energy source chamber before she stops him.]"
    },
    {
        "character": "Heidi",
        "line": "Babe, is everything okay? You seem...distantly lately."
    },
    {
        "character": "",
        "line": "As Cartman starts talking, Butters and the male #OccupyMars SpaceX employee look on while bringing a large yellow hose to the chamber "
    },
    {
        "character": "Cartman",
        "line": "Distant? Really? Oh my God. I-I'm sorry."
    },
    {
        "character": "Heidi",
        "line": "Did I do something wrong?"
    },
    {
        "character": "Cartman",
        "line": "[He grabs Heidi's hands.] No. No, Heidi. Why would you think that? [He then turns her away, so she doesn't see what's going on with the chamber.]"
    },
    {
        "character": "Heidi",
        "line": "You don't really talk to me the same way you used to. Oh, God, I'm sounding needy, huh?"
    },
    {
        "character": "Cartman",
        "line": "Uh-huh, uh-huh. Yeah, go on."
    },
    {
        "character": "",
        "line": "As Heidi starts talking, Cartman focuses on Butters and the male #OccupyMars SpaceX employee who has attached the hose to one of the chamber's valve and making adjustments. "
    },
    {
        "character": "Heidi",
        "line": "Eric, I just--I hope that you're always honest with me, even if you think it might hurt my feelings."
    },
    {
        "character": "Cartman",
        "line": "Uh-huh. Yeah, cool. Heidi, I'll always do what's best both of us. [He puts his arm around her while looking back at the guys.]"
    },
    {
        "character": "Cartman",
        "line": "Now come on we got to get outside."
    },
    {
        "character": "",
        "line": "Tucker residence. The TrollTrace website is seen as Sheila hesitates about entering Gerald's information. She then begins to slowly type his name in"
    },
    {
        "character": "Sheila",
        "line": "I shouldn't do this."
    },
    {
        "character": "",
        "line": "TrollTrace: Server room. Gerald has his back turned to Lennart Bedrager"
    },
    {
        "character": "Gerald",
        "line": "I can't argue with you anymore. I want to stand here and tell you that you and I are different, but its not true. [He turns around.]"
    },
    {
        "character": "Gerald",
        "line": "All we've been doing is making excuses for being horrible people. [Bedrager looks down, agreeing with Gerald.]"
    },
    {
        "character": "Gerald",
        "line": "I don't know if you tried to teach me a lesson, but you have. [He slowly shuffles forward towards Bedrager.]"
    },
    {
        "character": "Gerald",
        "line": "I have to stand here and look at you, and all I see is a big fat reflection of myself. [He stops a few inches from Bedrager.] With only one minor difference."
    },
    {
        "character": "",
        "line": "Gerald hops forward and kicks Lennart Bedrager between his legs, causing him to drop down in pain. Gerald then grabs him by his jacket and tosses him off the bridgeway."
    },
    {
        "character": "Bedrager",
        "line": "Noooooo!!!"
    },
    {
        "character": "Gerald",
        "line": "Ha! Fuck you! What I do is fucking funny, bitch!"
    },
    {
        "character": "",
        "line": "Gerald then moves towards the final lever and pulls it down, causing an alarm to go off."
    },
    {
        "character": "",
        "line": "Copy and Print. Dildo Shwaggins is FaceTiming with Kyle and Ike"
    },
    {
        "character": "Dildo Shwaggins",
        "line": "That's it. Your dad's got it. Give it everything you got!"
    },
    {
        "character": "Kyle",
        "line": "Mr. President, do it!"
    },
    {
        "character": "Mr. Garrison",
        "line": "Reroute the internet through SpaceX!."
    },
    {
        "character": "Pentagon Employee",
        "line": "Rerouting now!"
    },
    {
        "character": "",
        "line": "SpaceX: Interior. The chamber begins to violently shake and beep, eventually exploding and sending a massive fireball throughout the entire SpaceX factory."
    },
    {
        "character": "",
        "line": "Tucker residence. Sheila has typed in all of Gerald's information and slowly presses the \"Return\" key to start the search. As the results start to compile, the screen starts to flicker and then the screen shuts down. The shutdown then proceeds to Copy and Print, TrollTrace and the Pentagon, leaving everyone with a black screen that reads \"Internet Reset Global Cache Cleared F:\\>\""
    },
    {
        "character": "Sheila",
        "line": "[She stares at the black screen.] What the hell just happened?!"
    },
    {
        "character": "",
        "line": "SpaceX: Exterior. The entire SpaceX building is exploding and everyone is running away. From a hill, Elon Musk and a few SpaceX employees are watching in horror, along with Cartman, Heidi and Butters."
    },
    {
        "character": "Cartman",
        "line": "Well, looks like you're gonna have to kind of start over, huh, Elon?."
    },
    {
        "character": "",
        "line": "Elon is oblivious to Cartman's remark as he continues watching SpaceX explode in front of him."
    },
    {
        "character": "Cartman",
        "line": "Maybe you should just go back to your little cars, huh?"
    },
    {
        "character": "Heidi",
        "line": "Wow, babe. Looks like all our dreams are kind of on hold for a while, huh?"
    },
    {
        "character": "Cartman",
        "line": "Yeah, well some people's dreams are other people's nightmares."
    },
    {
        "character": "Heidi",
        "line": "Well, what do you mean?"
    },
    {
        "character": "Cartman",
        "line": "It was a joke."
    },
    {
        "character": "",
        "line": "South Park: Residential area. The Stotch residence is shown, with Stephen and Linda Stotch opening the door and looking up to the sky. Kyle starts narrating."
    },
    {
        "character": "Kyle (voiceover)",
        "line": "And so, life goes on."
    },
    {
        "character": "",
        "line": "South Park: The Tweak residence. Tweak and his parents step outside their house."
    },
    {
        "character": "Kyle (voiceover)",
        "line": "The end of civilization didn't happen."
    },
    {
        "character": "",
        "line": "South Park: Residential area. A large group of residents, including Thomas and Linda Tucker and Richard Alder, are stepping outside, looking around, talking to each other, shaking hands and giving each other hugs."
    },
    {
        "character": "Kyle (voiceover)",
        "line": "A massive electrical pulse completely erased the internet."
    },
    {
        "character": "",
        "line": "South Park: Residential area. Broflovski residence. A taxi pulls up to the curb with Gerald inside."
    },
    {
        "character": "Kyle (voiceover)",
        "line": "We've been given a second chance."
    },
    {
        "character": "",
        "line": "Gerald exits the taxi and makes his way to the front door. He open the door and steps inside into the living room"
    },
    {
        "character": "Kyle (voiceover)",
        "line": "A mulligan."
    },
    {
        "character": "",
        "line": "Ike and Kyle look on as Sheila quickly runs over and gives him a hug."
    },
    {
        "character": "Kyle (voiceover)",
        "line": "Anything we might be ashamed of, gone forever."
    },
    {
        "character": "",
        "line": "Ike and Kyle angrily stare at Gerald. He smiles at them and gives them a thumbs-up. Kyle's expression then changes into annoyance."
    },
    {
        "character": "",
        "line": "South Park: Bus Stop. A large bus pulls up to its next stop."
    },
    {
        "character": "Kyle (voiceover)",
        "line": "Maybe now boys and girls can learn to respect each other again."
    },
    {
        "character": "",
        "line": "The bus comes to a stop and opens its door. Two adults, followed by Heidi and Cartman step off the bus. Heidi smiles at Cartman but Cartman looks at her with mistrust."
    },
    {
        "character": "",
        "line": "South Park: The Turner residence. Cartman and Heidi are walking together, holding hands, while Mr. and Mrs. Turner look on from their front door"
    },
    {
        "character": "Kyle (voiceover)",
        "line": "Realize how careful our online lives have to be."
    },
    {
        "character": "",
        "line": "Cartman and Heidi stop in front of her house. Heidi, with a smile on her face, kisses a bitter-looking Cartman on his cheek, before walking up to her parents and going inside their residence. He then wipes her kiss off of his cheek with his hand."
    },
    {
        "character": "",
        "line": "The White House: Front lawn."
    },
    {
        "character": "Kyle (voiceover)",
        "line": "Because we've all seen what happens when the Twitters, Facebook and trolls decide our reality."
    },
    {
        "character": "",
        "line": "The White House: Oval Office. A large group of Memberberries stand at attention while Mr. Garrison walks over to his desk and takes his seat as the President."
    },
    {
        "character": "",
        "line": "Marsh Residence: Living room. Randy, Stan, Shelly, Sharron and Marvin Marsh, along with Sparky, are watching television together"
    },
    {
        "character": "Kyle (voiceover)",
        "line": "Now that we've been given this second chance, it is up to all of us to see what we do with it."
    },
    {
        "character": "News Anchor",
        "line": "And the first new e-mail since the internet was erased was successfully went out at 6 a.m. today. The honor went to a Mr. Dave Beckett of Boca Raton, Florida."
    },
    {
        "character": "",
        "line": "Beckett Residence: Front Porch. Dave Beckett is smoking a pipe and sitting on a rocking chair with a sleeping dog near his feet"
    },
    {
        "character": "News Reporter",
        "line": "Mr. Beckett, you had the honor of being the first person to socialize on the new internet. Could you tell us what you did?"
    },
    {
        "character": "Dave Beckett",
        "line": "Well, I sent an e-mail with a photo to my old friend, Thomas Winger, up in Connecticut."
    },
    {
        "character": "News Reporter",
        "line": "And what you did say to Mr. Winger?"
    },
    {
        "character": "Dave Beckett",
        "line": "[He pauses.] I showed him my dick, called him a fag."
    }
]