[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "The school auditorium, day. The students are gathered there to listen to some performances. PC Principal is on stage next to a piano and another mic."
    },
    {
        "character": "PC Principal",
        "line": "[taps the mic six times] All right everyone, listen up. Today we're gonna have a performance by one of our students who has written a song. The song is about his feelings towards the current political climate with North Korea. Put your hands together for Tweek. [the kids applaud, PC Principal exits stage left, and Tweek approaches the piano from stage right with some sheet music. He sets up the music and gets ready to play. He plays some angry, jarring notes on the piano as he screams]"
    },
    {
        "character": "Tweek",
        "line": "We're all gonna die! They have nuclear missiles! Wuh! Waaaa! Why are you just sitting there, doing nothing?! [stops playing and faces the audience] We have to get out of here! North Korea wants to kill us all and our President keeps making it worse! [walks to the front of the stage] Why are you just sitting there?! [returns to the piano and resumes playing] Why are you all acting like nothing's wrooong?! North Korea is going to bomb us! We are all dead! [Stan and Kyle glance at each other] We have to do something! Do something! Do something! [screams, leaves the piano, and exits stage right]"
    },
    {
        "character": "PC Principal",
        "line": "[returns to the stage] All right. Next up we have Hannah Williams with her rendition of \"Wheels On The Bus.\" [she enters from stage right looking back at Tweek. PC Principal hands her the mic]"
    },
    {
        "character": "Hannah Williams",
        "line": "[emotional] The wheels on the bus go round and round..."
    },
    {
        "character": "",
        "line": "The school cafeteria, lunchtime. At table are seated Jimmy, Tolkien, Kenny, Cartman, Stan, Craig, Kyle, and Butters."
    },
    {
        "character": "Cartman",
        "line": "Dude, Craig, you've gotta get Tweek to get a hold of himself. He's freaking everybody out at school."
    },
    {
        "character": "Craig",
        "line": "What am I supposed to do?"
    },
    {
        "character": "Stan",
        "line": "He's your boyfriend, dude."
    },
    {
        "character": "Craig",
        "line": "He's not gonna listen to me. He never does when he's emotional."
    },
    {
        "character": "Cartman",
        "line": "[lunching on chicken nuggets and fries] Craig, let me tall you about relationships, okay? [eats a fry] If you don't have some fuckin' balls, you're not gonna get anywhere. Doesn't matter if they're gay balls or straight balls. If you don't take control of your side of the relationship, you get walked all over-!"
    },
    {
        "character": "Heidi",
        "line": "[approaching] Hey babe, how are you doin'?"
    },
    {
        "character": "Cartman",
        "line": "[suddenly disinterested] Oh hey baby, what's going on? [Stan, Craig, Kyle, and Butters take turns glancing at each other]"
    },
    {
        "character": "Heidi",
        "line": "We still on for recess?"
    },
    {
        "character": "Cartman",
        "line": "Yep, I'll be there"
    },
    {
        "character": "Heidi",
        "line": "'K babe, love you. [walks away. Craig is stunned at what just happened]"
    },
    {
        "character": "Butters",
        "line": "I thought you said you broke up with Heidi."
    },
    {
        "character": "Cartman",
        "line": "I decided to give her one more chance."
    },
    {
        "character": "Tolkien",
        "line": "But you said she was mentally abusive."
    },
    {
        "character": "Cartman",
        "line": "She is mentally abusive."
    },
    {
        "character": "Butters",
        "line": "So then why did you take her back?"
    },
    {
        "character": "Cartman",
        "line": "Because she said she was gonna kill herself, all right guys? There. I broke up with her and she called me being all like \"I can't live without you, I'm scared of what I'm gonna do to myself? Oh God.\" The bitch is crazy. What am I supposed to do?"
    },
    {
        "character": "",
        "line": "The school hallway, later. Tweek is at his locker putting books away, but he's in panic mode. He slams the locker door and scares himself."
    },
    {
        "character": "Tweek",
        "line": "AAAH!"
    },
    {
        "character": "Craig",
        "line": "[approaches] Tweek."
    },
    {
        "character": "Tweek",
        "line": "[startled, turns to face him] AAAH!"
    },
    {
        "character": "Craig",
        "line": "Dude, come on, you've gotta settle down."
    },
    {
        "character": "Tweek",
        "line": "I can't settle down! We're all gonna die!"
    },
    {
        "character": "Craig",
        "line": "[calmly] We're not all gonna die, you're overreacting. Everything's fine, okay?"
    },
    {
        "character": "Tweek",
        "line": "[hears a tweet and pulls out his phone. Now frantic] Oh God! The President tweeted that North Korea doesn't have the guts to attack us! Why would he say that?! He's making everything worse!"
    },
    {
        "character": "Craig",
        "line": "Tweek-"
    },
    {
        "character": "Tweek",
        "line": "But North Koreans are gonna think we all agree with the President!"
    },
    {
        "character": "Craig",
        "line": "Okay, so how about you write your Congressman a letter?"
    },
    {
        "character": "Tweek",
        "line": "...That won't help anything! North Korea wants us dead!"
    },
    {
        "character": "Craig",
        "line": "Okay, so write a letter to the North Koreans."
    },
    {
        "character": "Tweek",
        "line": "I can't write in Korean and they all think we're war-hungry anyway!"
    },
    {
        "character": "Craig",
        "line": "Okay, well why don't you just send something nice to the North Koreans?"
    },
    {
        "character": "Tweek",
        "line": "Errrrg!"
    },
    {
        "character": "Craig",
        "line": "It will make you feel better, babe."
    },
    {
        "character": "Tweek",
        "line": "Send something, like what?"
    },
    {
        "character": "Craig",
        "line": "I don't know, like... make some croissants or something?"
    },
    {
        "character": "Tweek",
        "line": "I don't know how to make croissants!"
    },
    {
        "character": "Craig",
        "line": "Well, what do you know how to make?"
    },
    {
        "character": "Tweek",
        "line": "Uunnggc, [slowly] cupcakes?"
    },
    {
        "character": "Craig",
        "line": "All right, go home and make some cupcakes, honey."
    },
    {
        "character": "Tweek",
        "line": "Okay. [turns and heads out. Craig watches him leave]"
    },
    {
        "character": "",
        "line": "At the same time, somewhere else in the hallways, Stan is putting his books away in his locker when Heidi approaches him."
    },
    {
        "character": "Heidi",
        "line": "Hey Stan?"
    },
    {
        "character": "Stan",
        "line": "[looks back at her] Yeah?"
    },
    {
        "character": "Heidi",
        "line": "Can I talk to you about Eric?"
    },
    {
        "character": "Stan",
        "line": "Cartman? Okay."
    },
    {
        "character": "Heidi",
        "line": "I just wanna make sure he's all right."
    },
    {
        "character": "Stan",
        "line": "What do you mean?"
    },
    {
        "character": "Heidi",
        "line": "I don't even know if I should be saying this, but, Eric said he was thinking about killing himself."
    },
    {
        "character": "Stan",
        "line": "[stunned] What??"
    },
    {
        "character": "Heidi",
        "line": "We broke up, and he called saying he was about to do it. I'm still really scared for him."
    },
    {
        "character": "Stan",
        "line": "Wait. Cartman said he was going to kill himself?"
    },
    {
        "character": "Heidi",
        "line": "I'll send you the voice mail if you promise to keep it private."
    },
    {
        "character": "Stan",
        "line": "Totally."
    },
    {
        "character": "",
        "line": "The boys' restroom, later. Stan, Kyle, Kenny, Tolkien, Jimmy, and Butters are in a circle laughing at something from Stan's phone."
    },
    {
        "character": "Stan",
        "line": "Shhh. [plays the voice message Heidi sent him]"
    },
    {
        "character": "Cartman",
        "line": "\"You have to take me back! You have to! I'm gonna kill myself, Heidi!\" [the boys laugh a bit] \"I'm gonna kill myself and then you'll be sorry! You'll wish you could have me back, but I'll be deeaad.\" [the boys laugh again. Cartman is nearby with his back to them and his arms crossed over his chest, upset that his threats are being heard by the guys.] \"Please, Heidi, please!\" [the boys laugh again.]"
    },
    {
        "character": "Cartman",
        "line": "Okay, okay! Really cool listening to people's private voice mails!"
    },
    {
        "character": "Kyle",
        "line": "[wipes away a tear from his laughter] You sound like a dying pig."
    },
    {
        "character": "Cartman",
        "line": "[faces the boys] That's great! I'm glad you guys think suicide is so funny! [the boys roar with laughter]"
    },
    {
        "character": "",
        "line": "Pyongyang, North Korea, day. Korean music plays as a woman sings and various sights are shown. Last one is of Kim Jong-un looking at something through binoculars. A soldier brings him a heaping platter of cupcakes with frosting and sprinkles. Kim Jong-un turns around and looks over the cupcakes."
    },
    {
        "character": "",
        "line": "PC Principal's office, day. Someone knocks on the door. PC Principal is looking over some paperwork."
    },
    {
        "character": "PC Principal",
        "line": "Entree. [Cartman enters and takes a seat, crossing his arms again and looking to his left] Yes, Eric, how can I help you?"
    },
    {
        "character": "Cartman",
        "line": "I don't think kids at this school take [looks at PC Principal] suicide seriously enough, and we need to raise awareness!"
    },
    {
        "character": "PC Principal",
        "line": "Well, unfortunately, this week is Distracted Driving Awareness Week at school, so you might have a hard time."
    },
    {
        "character": "Cartman",
        "line": "Distracted Driving? Who gives a shit about that?"
    },
    {
        "character": "PC Principal",
        "line": "A lot of people. There's more deaths now because of people on their phones while driving than ever before."
    },
    {
        "character": "Cartman",
        "line": "PC Principal, someone's life is at stake! If I have to compete with distracted driving, then that's what I'll do."
    },
    {
        "character": "",
        "line": "Tweek's house, kitchen, day. Tweek is preparing more cupcakes, but he's made a mess of things and he's reading various news reports on his phone, grunting apprehensively with each headline. From CNN: \"North Korea is 100% Nuclear Ready,\" \"North Korea Able To Reach Your Town?\" and \"North Korea Delighted By Cupcakes.\""
    },
    {
        "character": "Tweek",
        "line": "Huh? Oh. [taps on the screen and a video pops up]"
    },
    {
        "character": "Anchor 1",
        "line": "A young homosexual boy known only as Tweek has touched the hearts of many by sending cupcakes to the North Korean government. [a shot of Tweek trembling] The little rascal apparently made a dent with the North Korean dictator, who is said to have loved the cupcakes so much that he started to make his own. [A shot of Kim Jong-un watching the cupcake dough stream out of a machine]"
    },
    {
        "character": "Tweek",
        "line": "Oh, ahhh. [smiles. A tweet notification is heard] Huh? [BREAKING NEWS] U.S. President responds to cupcakes. [taps on the notification and another video pops up]"
    },
    {
        "character": "Anchor 2",
        "line": "The human interest cupcake story has apparently been heard by the President. Just moments ago, the President tweeted \"I know that kid Tweek. He's fucking with you, North Korea. Get a clue. I'll bet he took a dump in the batter.\""
    },
    {
        "character": "Tweek",
        "line": "D\"AAAAH! WHAT?? WHY WOULD HE SAY THAT?!"
    },
    {
        "character": "Craig",
        "line": "[walks into the kitchen just in time] Tweek, calm down."
    },
    {
        "character": "Tweek",
        "line": "The President! He tweeted about me! Why would he do that?! Did you see that?!"
    },
    {
        "character": "Craig",
        "line": "Yes, I did see that, so I went and got you something to make things better."
    },
    {
        "character": "Tweek",
        "line": "Wwwhat?"
    },
    {
        "character": "Craig",
        "line": "[whips something out of his jacket pocket and shows him] It's a fidget spinner. It's supposed to help with anxiety. [spins it on his finger] See?"
    },
    {
        "character": "Tweek",
        "line": "...A fidget spinner?? Did you read what the President tweeted?? [another video pops up]"
    },
    {
        "character": "Anchor 3",
        "line": "The President of the United States just tweeted again, this time saying \"I hope ALL children of America will stand with Tweek in saying 'GO AHEAD AND BOMB US, KIM JONG DONG, WE FUCKING DARE YOU!'\""
    },
    {
        "character": "Tweek",
        "line": "[freaking out] AAAAAAAAAAAAAAAH!"
    },
    {
        "character": "",
        "line": "South Park Elementary, morning. Kids are walking into school. A girl plays a recorder softly in the background while three other kids hand out fliers. A banner behind them has this on it: \"STOP DISTRACTED DRIVING!!!\""
    },
    {
        "character": "Gary Borkovec",
        "line": "Hey guys. Take a minute to read about distracted driving? [a passing boy takes a flier]"
    },
    {
        "character": "Lola",
        "line": "Talk to all the grownups you know about staying off their mobile devices when they get behind the wheel."
    },
    {
        "character": "Gary",
        "line": "Hey guys. Got a second to help stop distracted driving? [another boy takes a flier] Thanks."
    },
    {
        "character": "Lola",
        "line": "Hey guys- [music begins to play over the intercom]"
    },
    {
        "character": "Cartman",
        "line": "[over the intercom] Hey guys, let's take a minute and talk about suicide prevention. There's probably someone right now at this school thinkin' about killing himself, and it's not funny! [kids in the hallway stop to listen] You'd better take him serious, or he might actually do it. [all of a sudden jumps into view dressed in blue jeans and a hoodie and starts singing]\nI've been feelin' sad, I've been bein' sad,\nCan't talk to my mom, don't even have a dad.\nI can't go on. What is livin' for?\nMy heart screams \"I DON'T WANNA LIVE NO MORE!\"\n[joined by a chorus of kids that are prerecorded on a boombox]\nEric, we don't want you to die, Eric. Give life a try.\nEric, we don't want you to die, Eric. Oh God no, Eric.\nI don't wanna live no more, no more, no more, no more.\n[walks up to a boy and uses him as a ventriloquist puppet]\nBut Eric, we don't want you to die.\nYou're so kewl, we'd be sad at school.\n[walks away and goes back to his normal voice]\nYeah, but you guys, you don't understand.\nWith my girlfriend, it's like I'm livin' in quicksand\nConflicting thoughts, I need a battered wife shelter.\nMy girlfriend is messed up, but all I wanna do is help her.\nI'm suffocatin', I'm drowning in sorrow.\nGonna kill myself, probably around 2:30 tomorrow.\n[with chorus]\nBut Eric, we don't want you to die, Eric. Give life a try.\n[solo] Everybody!\n[chorus a Capella] Eric, we don't want you to die, Eric. Oh God no, Eric.\nBut it's so hard!\nEric, we don't want you to die\n\n\nOnly you guys can make a difference. I don't care if you're black, white, gay, straight, or trans, I am going to kill myself unless you all start taking it seriously!\n\n\nEric, please don't die\n\n\n[no one says a word. Cartman walks up to the Distracted Driving group] Distracted driving my asshole. [drops the mic and walks away with a mischievous smile]\n\n"
    },
    {
        "character": "",
        "line": "Tweek's house, day. In the dining room, Tweek spins his fidget spinner on his right index finger, but it's not calming him down."
    },
    {
        "character": "Richard",
        "line": "Hey Tweek."
    },
    {
        "character": "Tweek",
        "line": "AAH! [drops the spinner]"
    },
    {
        "character": "Richard",
        "line": "How's it going with the fidget spinner?"
    },
    {
        "character": "Tweek",
        "line": "Greeaat. [picks up the spinner and spins it again, only to see it fly off his hand a second later.]"
    },
    {
        "character": "Richard",
        "line": "You seem a lot less anxious. Things are finally turning around for my little homosexual son. [a loud rocket sound is heard overhead.]"
    },
    {
        "character": "Tweek",
        "line": "What is that??"
    },
    {
        "character": "Richard",
        "line": "I'm not sure."
    },
    {
        "character": "Tweek",
        "line": "[runs outside to look around.] D'aaah! [finally locates the origin of the sound and looks up to see a North Korean missile flying over the town] D'aaah! [runs back into the house and turns on the TV]"
    },
    {
        "character": "Anchor 4",
        "line": "No agreement has been reached between the parties involved. [Breaking News logo pops up] Breaking news now out of Colorado where the North Koreans appeared to have fired a missile over Tweek's house. [a small picture of him appears on the right side of the screen]"
    },
    {
        "character": "Tweek",
        "line": "D'aahaahaah!"
    },
    {
        "character": "Anchor 4",
        "line": "Tweek, of course, the young boy who got the attention of Kim Jong-un last week. The news media in North Korea is calling the missile test a victory for its people. [what follows is actual footage of a Korean woman giving a speech]"
    },
    {
        "character": "Translator",
        "line": "Today, the great country of North Korea has proven its determination and fortitude by successfully firing a missile over Tweek's house. Perhaps now Tweek will come fight- [trails off]"
    },
    {
        "character": "Tweek",
        "line": "Oh my God! Oh my God! Why is this happening to me?! They have to know that this isn't my fault!"
    },
    {
        "character": "Anchor 4",
        "line": "In response to the North Korean test, the President of the United States has just tweeted this statement: \"You really think Tweek is scared? Tweek will single handedly go to North Korea and fuck ALL you slanty-eyed bitches doggy style.\""
    },
    {
        "character": "Tweek",
        "line": "Whaaat?! Why would he say that?!"
    },
    {
        "character": "Anchor 4",
        "line": "The President also tweeted, \"...if you even think Tweek is worried about a bunch of dipshit, poor-ass, third world rice pickers...think again!\""
    },
    {
        "character": "Tweek",
        "line": "Oh my God! What is he doing?!"
    },
    {
        "character": "Richard",
        "line": "[rushes up to him with the fidget spinner and a cup of coffee] Tweek, Tweek, calm down. [puts his coffee on the sofa and tries to give the spinner to Tweek]"
    },
    {
        "character": "Tweek",
        "line": "Why won't he just stop? Why?!"
    },
    {
        "character": "Richard",
        "line": "Tweek, Tweek. [takes the remote control from Tweek's hand and lets it fall to the floor] Here, here's your fidget spinner."
    },
    {
        "character": "Tweek",
        "line": "Why does he keep making it worse?!"
    },
    {
        "character": "Richard",
        "line": "Fidget spinner, Tweek! Come on, son! [Tweek lets out a couple of grunts, and Richard responds with a soothing voice] Focus on the fidget spinner."
    },
    {
        "character": "",
        "line": "South Park, morning. A lone car goes down a street. Both driver and passenger are looking at their phones."
    },
    {
        "character": "Driver 1",
        "line": "Aww, Jeez, looks like North Korea launched another missile."
    },
    {
        "character": "Wife",
        "line": "Oh, really? Like another test? Where are you looking?"
    },
    {
        "character": "Driver 1",
        "line": "I'm on Drudge. You see what the President tweeted about it?"
    },
    {
        "character": "Wife",
        "line": "No, what'd he say?"
    },
    {
        "character": "Driver 1",
        "line": "President tweeted, \"North Korea is the butt hole of Asia and-\""
    },
    {
        "character": "Wife",
        "line": "[sees Gary crossing the street] Innocent child!!"
    },
    {
        "character": "Driver 1",
        "line": "Baaaah! [Gary looks right as the car speeds towards him holds up his arms. The car slams into him.]"
    },
    {
        "character": "Gary",
        "line": "Uh! [he is launched into the air as blood falls to the ground. The windshield shatters while the airbags deploy, shielding the couple from injury. Gary soars through the air and lands down the street in the road, dead, losing his left shoe and sock in the process. The driver steps out of the car, then his wife steps out, and they look in shock at the dead boy]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. All the kids are carrying candles of remembrance and soon clear the hallway. Cartman walks down the hallway. A girl is crying, and Meagan Ridley comforts her."
    },
    {
        "character": "Meagan",
        "line": "I know. I know, it's so sad."
    },
    {
        "character": "Cartman",
        "line": "[passes by them and continues down the hallway. A few seconds later...] Well, how nice. That's a little more like it. [Sees Stan, Kyle, and Kenny as they walk towards him and approaches them.] Well guys, what happened? Change of heart?"
    },
    {
        "character": "Stan",
        "line": "Yeah, you didn't hear? Gary Borkovec got ran over by a distracted driver."
    },
    {
        "character": "Cartman",
        "line": "What? Gary Borkovec? Is he dead?"
    },
    {
        "character": "Kyle",
        "line": "Yeah dude, he's dead."
    },
    {
        "character": "Cartman",
        "line": "Oh, that son of a bitch! [turns around and walks off] I'm gonna talk to the principal! [turns back around to address Kenny] Put down that candle, Kenny! [turns around and walks off again] Like you ever gave a shit about Gary Borkovec!"
    },
    {
        "character": "",
        "line": "Principal's office. PC Principal is curling his left arm when Cartman knocks on the door."
    },
    {
        "character": "PC Principal",
        "line": "Entree vous."
    },
    {
        "character": "Cartman",
        "line": "[walks in] PC Principal, I'm trying to raise suicide awareness, but everyone's preoccupied with this \"don't be on your phone when driving\" crap!"
    },
    {
        "character": "PC Principal",
        "line": "Gary Borkovec was a good student. He didn't deserve to be taken away by someone not paying attention to the road."
    },
    {
        "character": "Cartman",
        "line": "Yes, but Gary Borkovec is already dead! There's nothing we can do for him! Students need to focus on people thinking about dying!"
    },
    {
        "character": "PC Principal",
        "line": "I don't know what more you want from me, bro."
    },
    {
        "character": "Cartman",
        "line": "I can't just get people to care with a stupid rap song! I need a full orchestra! Woodwinds, strings! I need black people in white robes, white people in black robes, and a thousand doves to release into the air!"
    },
    {
        "character": "PC Principal",
        "line": "I can give you two student volunteers and one pigeon."
    },
    {
        "character": "Cartman",
        "line": "[pauses, then] Do you have any idea how serious this is?! As someone who deals with suicidal thoughts, I cannot believe the lack of concern at this school! Maybe I should just take the awareness of my suicide out to the public on the streets!"
    },
    {
        "character": "PC Principal",
        "line": "Maybe you should."
    },
    {
        "character": "Cartman",
        "line": "Maybe I will!"
    },
    {
        "character": "PC Principal",
        "line": "Maybe you should."
    },
    {
        "character": "Cartman",
        "line": "Maybe I will!!"
    },
    {
        "character": "",
        "line": "Craig's bedroom, night. He's fast asleep when Tweek enters and turns on the ceiling light. Tweek walks up to the bed and stands there for a second."
    },
    {
        "character": "Tweek",
        "line": "WAAAAH!"
    },
    {
        "character": "Craig",
        "line": "[started] Ugh. Wuh. [rubs his eyes and sees who woke him] Hey Tweek."
    },
    {
        "character": "Tweek",
        "line": "[holds out his phone] Look at what the President tweeted now!"
    },
    {
        "character": "Craig",
        "line": "What time is it, dude?"
    },
    {
        "character": "Tweek",
        "line": "Just read it! [hands the phone to Craig]"
    },
    {
        "character": "Craig",
        "line": "\"North Korea doesn't have the balls to attack Tweek. They have little tiny rice balls.\""
    },
    {
        "character": "Tweek",
        "line": "They're gonna get me, Craig! Look at what's on CNN! [turns on Craig's TV and changes the channel from a kids' cartoon to CNN]"
    },
    {
        "character": "Anchor 4",
        "line": "And the President's tweets have certainly caught the attention of North Korea, who have been spending the past several days viewing possible targets for a nuclear strike, if war were to break out. [Kim Jong-un looks over pictures of Tweek and his house]"
    },
    {
        "character": "Tweek",
        "line": "Waaaah! What am I gonna do?!"
    },
    {
        "character": "Craig",
        "line": "You've gotta calm down."
    },
    {
        "character": "Tweek",
        "line": "How am I supposed to calm down?! North Korea is gonna get me! They're gonna get me!"
    },
    {
        "character": "Craig",
        "line": "[at the same time] Tweek. Tweek. Tweek! [calms down, but is still shaking]' Let's think this through logically. North Korea isn't going to attack anyone, okay? They're not going to start a war they can't win. Okay?"
    },
    {
        "character": "Tweek",
        "line": "But Craig, I-"
    },
    {
        "character": "Craig",
        "line": "Tweek! You have to stop thinking about it. Tell you what. We're gonna go somewhere fun and make you feel better."
    },
    {
        "character": "",
        "line": "The supermarket, day. Cartman and Heidi are passing out fliers to shoppers as they exit the store."
    },
    {
        "character": "Cartman",
        "line": "[rings a small bell] Give a minute of your time for suicide awareness? Suicide is serious. Help tell people like Kyle it's not a joke."
    },
    {
        "character": "Shopper",
        "line": "Hey, good for you guys, trying to help. [takes a flier from Eric]"
    },
    {
        "character": "Cartman",
        "line": "Yeah, make sure everyone you know gets involved or else I'm gonna do it."
    },
    {
        "character": "Heidi",
        "line": "We're getting a lot of attention, Eric. Our Web site's already full of kids saying they feel the same way as you, and want to get help."
    },
    {
        "character": "Cartman",
        "line": "They want to get help? For what?"
    },
    {
        "character": "Heidi",
        "line": "For... wanting to take their own lives."
    },
    {
        "character": "Cartman",
        "line": "No, this is about me killing myself."
    },
    {
        "character": "Heidi",
        "line": "But babe, there's a lot of kids who feel the same way you do."
    },
    {
        "character": "Cartman",
        "line": "They're full of shit, Heidi. They're just trying to get attention. What, are you actually talking online to these ass wipes?!"
    },
    {
        "character": "Heidi",
        "line": "I thought this was about raising awareness and helping people."
    },
    {
        "character": "Cartman",
        "line": "So you're just gonna e-mail with every guy who has a dick and a death wish?! Are we just your type?!"
    },
    {
        "character": "Heidi",
        "line": "Eric, come on."
    },
    {
        "character": "Cartman",
        "line": "No, look, Heidi. I'm sorry, but you're the one who started all this by telling everybody that I was suicidal! Okay?! Now I'm under a lot of pressure to do it! So the only option I have is to make sure that suicide prevention becomes this entire town's number one priority! [A shopper walks out of the store behind him with a toddler in the shopping cart]"
    },
    {
        "character": "Driver 2",
        "line": "[a woman] Oh God, did you see what the President said about Asians now?"
    },
    {
        "character": "Husband",
        "line": "Look out! [the car runs over the shopping cart, killing the toddler in the process]"
    },
    {
        "character": "Cartman",
        "line": "Oh, are you freaking serious?!"
    },
    {
        "character": "",
        "line": "An amusement park, day. Tweek and Craig walk through the park holding hands."
    },
    {
        "character": "Craig",
        "line": "Okay, babe, what do you want to ride first?"
    },
    {
        "character": "Tweek",
        "line": "Ugh! What are we doing here, Craig?!"
    },
    {
        "character": "Craig",
        "line": "We're gonna get your mind off politics and have some fun. Now, what's your favorite ride?"
    },
    {
        "character": "Tweek",
        "line": "[grunts a few times] The Ferris wheel!!"
    },
    {
        "character": "",
        "line": "The Ferris wheel, later. Tweek grunts some more, while Craig is smiling."
    },
    {
        "character": "Craig",
        "line": "Isn't this lovely, Tweek? Just look at that view!"
    },
    {
        "character": "Tweek",
        "line": "[decides to look at his phone] Oh God! Another tweet from the President!"
    },
    {
        "character": "Craig",
        "line": "Oh, come on."
    },
    {
        "character": "Tweek",
        "line": "\"Why would the U.S. be scared of North Korea? Tweek is so not scared he's at an amusement park in Denver right now.\" [gasps] JESUS CHRIST, WE'VE GOTTA GET OUT OF HERE!!"
    },
    {
        "character": "Craig",
        "line": "Tweek! Tweek, use your brain! North Korea isn't going to attack an amusement park. You're safer here than anywhere."
    },
    {
        "character": "",
        "line": "At an autopia ride, kids and their parents drive along slowly."
    },
    {
        "character": "Father",
        "line": "Oh, Jeez, the President just called Kim Jong-un a fat midget. [the car he's in jumps off the track] Oh, and now North Korea is saying that they're gonna-"
    },
    {
        "character": "Son",
        "line": "Dad, look out! [the car plows through the bushes lining the autopia roadway]"
    },
    {
        "character": "Father",
        "line": "Oh, shit! [a girl turns around and sees the car coming, but can't evade it. The car mows her down and kills her, then speeds towards a woman and a baby carriage. It demolishes the baby carriage with the baby in it. The bumper car ride is shown]"
    },
    {
        "character": "Attendant",
        "line": "All right everyone, please wait for your bumper cars to come to a complete stop. We hope you enjoyed Crazy Cars- [one car has a mother and daughter in it, and the mother is browsing on her phone]"
    },
    {
        "character": "Daughter",
        "line": "Mommy, look out! [the mother screams as they run over a boy who's on his way out. Four other kids are still in the ride, and the car runs over them too. Panic ensues and spreads throughout the park]"
    },
    {
        "character": "Tweek",
        "line": "[noticing] Oh my God, what is that? What is that?!"
    },
    {
        "character": "Craig",
        "line": "It's probably nothing. Everything's fine."
    },
    {
        "character": "Tweek",
        "line": "Will you please stop saying that?! I can't take it!"
    },
    {
        "character": "Craig",
        "line": "I'm trying to make you feel better."
    },
    {
        "character": "Tweek",
        "line": "Well, maybe I don't wanna feel better right now!"
    },
    {
        "character": "Craig",
        "line": "Okay, but think about that. That actually doesn't make any sense."
    },
    {
        "character": "Tweek",
        "line": "Why do you have to be so logical?! I don't need you to problem-solve all the time, I need you to... Augh, I don't know!"
    },
    {
        "character": "Craig",
        "line": "Tweek, honey, all week you've been freaking out, and I've been the one forced to deal with it!"
    },
    {
        "character": "Tweek",
        "line": "You haven't been dealing with it, you've been trying to make it go away because my emotions are freaking you out! [behind him, a girl screams as the runaway bumper car mows her down. The mother in the car is still screaming]"
    },
    {
        "character": "Craig",
        "line": "Tweek, North Korea isn't bombing anyone. [Tweek turns away and tugs at his hair] They would lose the support of China, and that would mean-"
    },
    {
        "character": "Tweek",
        "line": "There you go again! Stop preaching facts to me! It's not what I need!"
    },
    {
        "character": "Craig",
        "line": "Well, I'm sorry that I'm actually in control of my goddamn emotions, you baby! [stops himself for a few seconds] Oh, see? Now you made me lose control of my emotions. [turns left and walks away] God dammit! [Tweek watches him leave, then grunts louder and louder until it's a full scream]"
    },
    {
        "character": "",
        "line": "South Park Elementary, cafeteria, lunchtime. The eight boys are back at their usual table."
    },
    {
        "character": "Butters",
        "line": "Hey Craig, how come Tweek's not at school?"
    },
    {
        "character": "Craig",
        "line": "[a bit depressed] How should I know?"
    },
    {
        "character": "Jimmy",
        "line": "Uh oh, trouble in paradise?"
    },
    {
        "character": "Craig",
        "line": "Look guys, Tweek doesn't want help, okay? He just wants to overreact."
    },
    {
        "character": "Henry Kline",
        "line": "[taps a mic a few times, and all the students in the cafeteria look at him] Hey guys, can we have your attention? Tomorrow night we'll be having a memorial service for all the students we've lost to distracted driving. We hope you can all bring your families."
    },
    {
        "character": "Cartman",
        "line": "[with his own mic] Cool, yeah. Hey guys, and there's also gonna be a suicide awareness pot luck at 7:30 tomorrow night in the school gymnasium. We're gonna have lots of games and face-painting, and uh, what are you guys gonna have?"
    },
    {
        "character": "Henry",
        "line": "...Uhw-we're gonna have some guest speakers and also provide grievance counselors for those who need it."
    },
    {
        "character": "Cartman",
        "line": "Yeah, grievance counseling, that sounds super fun. Listen guys, there's a very real chance I might actually do it right in front of everyone tomorrow, so you don't want to miss it. Suicide prevention pot luck, everybody."
    },
    {
        "character": "Heidi",
        "line": "[approaches Cartman and takes the mic from Henry] Eric, you need to stop. What they're doing is important."
    },
    {
        "character": "Cartman",
        "line": "They're doing a memorial service with speeches and crying. What's that gonna solve?"
    },
    {
        "character": "Heidi",
        "line": "It's not about problem-solving, Eric. It's about people getting together and feeling what they need to feel. [Craig's jaw drops, as he realizes this is what Tweek was trying to tell him] People need help sorting out their emotions sometimes. And the best thing isn't always quick answers, but just being there, supporting each other and... talking through those feelings."
    },
    {
        "character": "Cartman",
        "line": "You are so up and down. I don't know what you want from me, Heidi!"
    },
    {
        "character": "Heidi",
        "line": "[Craig runs off, inspired by Heidi's words] Come on, there has to be a way we can all work together here."
    },
    {
        "character": "Cartman",
        "line": "So now you're on their side! Oh my God, I'm seriously gonna do it right now! [runs off]"
    },
    {
        "character": "Heidi",
        "line": "Eric! [runs after him]"
    },
    {
        "character": "",
        "line": "Tweek's bedroom, late afternoon. He's in bed spinning four spinners, two in each hand."
    },
    {
        "character": "Craig",
        "line": "[runs into the bedroom] Tweek, what's going on??"
    },
    {
        "character": "Tweek",
        "line": "What? What do you mean, what's going on?! The same shit that's been going on!"
    },
    {
        "character": "Craig",
        "line": "Nothing's gotten any better? Oh my God, how does that make you feel?"
    },
    {
        "character": "Tweek",
        "line": "I feel scared! I feel alone!"
    },
    {
        "character": "Craig",
        "line": "Well that must be horrible to feel that way. It must be hard for you to even think!"
    },
    {
        "character": "Tweek",
        "line": "It is! [gets off the bed and walks up to Craig] It's terrible!"
    },
    {
        "character": "Craig",
        "line": "I bet it's terrible! What else are you feeling?"
    },
    {
        "character": "Tweek",
        "line": "Like, like I have no control over my life. Like I'm just a pawn in a big game."
    },
    {
        "character": "Craig",
        "line": "Oh, that's a terrifying thought. You must feel trapped."
    },
    {
        "character": "Tweek",
        "line": "Yeah, like trapped, but like, completely unable to even move."
    },
    {
        "character": "Craig",
        "line": "Jesus, it's like there's no solution to any of this! What are you gonna do?? What can you do?"
    },
    {
        "character": "Tweek",
        "line": "I don't know, it's... it's like... maybe, maybe I have to find a way to feel a little in charge of me again."
    },
    {
        "character": "Craig",
        "line": "That sounds so insurmountable though. How would you even start?"
    },
    {
        "character": "Tweek",
        "line": "I don't know, but I I've gotta do something about this. There's gotta be a way I can... [stops shaking and comes to a realization. He turns to see Craig and smiles. Craig smiles back] Thank you, Craig. [turns around and thinks] I've got it. People aren't focused on the right thing. I know what I should do."
    },
    {
        "character": "",
        "line": "The school auditorium, evening. The kid's parents are now present."
    },
    {
        "character": "PC Principal",
        "line": "All right everyone, listen up. Tonight, one of our students has put together a song about a very important issue. It's a song about how there are certain times to not be on your phone. I hope you all listen carefully. [applause as Tweek sits at the piano and begins to play wonderfully. Craig appears on stage and begins to sing]"
    },
    {
        "character": "Craig",
        "line": "People are dying. The fault is our own.\nYou can do lots of damage when you're on your phone.\nWe all have to agree to change it somehow.\nLet's all make a pledge to end it right now.\n\n\n"
    },
    {
        "character": "Fourth grade choir",
        "line": "Put it down. Don't be on your phone while being President.\nPut it down. You might do something dumb and cause an accident.\n\n\n"
    },
    {
        "character": "Townsfolk",
        "line": "[scattered around town] Let's all agree, here today, that if we're leader of the U.S.A.\n\n\n"
    },
    {
        "character": "The parents",
        "line": "We'll put it down\n\n\n"
    },
    {
        "character": "The Governor",
        "line": "If at any point today you're being a President, put down your mobile device."
    },
    {
        "character": "Fourth grade choir",
        "line": "Put it down.\n\n\n"
    },
    {
        "character": "Townsman",
        "line": "If I'm on the phone, I will not get behind the... desk of an oval office."
    },
    {
        "character": "Fourth grade choir",
        "line": "Put it down.\n\n\n"
    },
    {
        "character": "McDonald's worker",
        "line": "I'll take the pledge!"
    },
    {
        "character": "Doctor",
        "line": "I'll take the pledge."
    },
    {
        "character": "Hillary Clinton",
        "line": "And I'll take the pledge."
    },
    {
        "character": "Fourth grade choir",
        "line": "No one cares.\n\n\n"
    },
    {
        "character": "Diner",
        "line": "What's that? I was just elected President? Well then, goodbye!"
    },
    {
        "character": "Fourth grade choir",
        "line": "Put it down if you're President today.\n\n\n"
    },
    {
        "character": "The parents",
        "line": "If you find yourself being President today.\n\n\n"
    },
    {
        "character": "Fourth grade choir",
        "line": "Ah ah ah, ah a-aaah.\n\n\n"
    },
    {
        "character": "Nancy",
        "line": "Hey, Brian, look! I was just elected President."
    },
    {
        "character": "Brian",
        "line": "That's great, Nancy. Now put down your phone."
    },
    {
        "character": "Nancy",
        "line": "Right."
    },
    {
        "character": "Fourth grade choir",
        "line": "Ah ah ah, ah a-aaah, aaah. Put it down.\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[interrupts with his own rap. He's in a graffiti-ridden alley]\nGive a standing ovation for suicide in our nation\nOr I will rip my own guts out without one hesitation [simulates that act. Next, he's in his living room]\nDedication, that's what it's taken to awaken people to care [next, he stands next to Heidi outside a house]\nAnd yet my future's so hazy, my girlfriend's makin' me crazy\nBut still I'm workin' so hard. You know, just tryin' to hold on, [next, he's in a casket]\n'Cause I know that you don't miss me so much if I was gone. [next, he's on stage with the other kids]\nAnd all the voices start solo, but every day I hear them grow.\nSayiin' \"Eric, don't do it! Don't do it! Noooo (noooo, noooo)\"\n\n\n"
    },
    {
        "character": "",
        "line": "A memorial segment pops up showing Gary Borkovec, then Kelly Morris, both killed by Presidents on their phones (distracted drivers). A montage of kids then appears, each of who were killed by Presidents on their phones. Included among them are Gary, Kelly,... and Kenny."
    },
    {
        "character": "Choir and parents",
        "line": "[A sign language interpreter appears in a small window at upper right of the screen to sign for the deaf. Craig and Tweek are holding hands]\nPut it down. Don't be on your phone while being president.\nPut it down. You might do something dumb and cause an accident.\nWe all agree, here today, that if we're leader of the U.S.A.\nWe'll put it down [the parents and the interpreter fade out. Craig and Tweek look at each other, smiling]\n\n\n"
    },
    {
        "character": "Fourth grade choir",
        "line": "Put it down. [the choir fades out, leaving only Craig and Tweek]\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[emerges from the choir and runs up to Craig and Tweek] I'm not gonna do it, you guys! It worked! I'm not gonna do it!"
    }
]