[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "Announcer",
        "line": "The following program is brought to you in spooky vision. Be warned: all scenes will be accompanied by pictures of Barbra Streisand."
    },
    {
        "character": "",
        "line": "A scream is heard and the Halloween/Pinkeye opening sequence is shown."
    },
    {
        "character": "",
        "line": "Outer Space. A alien ship descends, and then turns towards Earth, headed for the western U.S. As it enters the atmosphere it begins to burn. It slows down and hovers over a road, then lands gently. A door opens like a camera lens, and an alien drops down. As soon as he moves, a tire crushes him. Judging by the size of the tire, the alien was 18 to 24 inches tall. The tire is that of the South Park Elementary school bus, which stops to let the boys off. Then it pulls away."
    },
    {
        "character": "Stan",
        "line": "I wonder why Cartman wasn't in school today."
    },
    {
        "character": "Kyle",
        "line": "He probably just ditched to avoid that spelling test."
    },
    {
        "character": "Cartman",
        "line": "Hey guys. How's it going?"
    },
    {
        "character": "",
        "line": "Cartman now has a full goatee. Kyle and Stan laugh."
    },
    {
        "character": "Kyle",
        "line": "Uh, nice costume, dude. Who are you supposed to be? Luke Perry?"
    },
    {
        "character": "Stan",
        "line": "Cartman, how come you weren't in school today?"
    },
    {
        "character": "Kyle",
        "line": "Did you eat too many pork rinds last night?"
    },
    {
        "character": "",
        "line": "Kyle and Stan laugh again."
    },
    {
        "character": "Cartman",
        "line": "You guys, you're so funny. No matter how I'm feeling, I can always count on you guys to lighten me up."
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "I had to stay home because my mother wasn't feeling well. She has the flu, and I wanted to take care of the house so she could stay in bed"
    },
    {
        "character": "",
        "line": "Stan and Kyle stand there shocked."
    },
    {
        "character": "Cartman",
        "line": "I just wanted to catch you guys to see if we were assigned any homework tonight."
    },
    {
        "character": "Kyle",
        "line": "What the hell are you talking about, Cartman?!"
    },
    {
        "character": "Stan",
        "line": "Stop screwing around, dude. We're all gonna go meet at the store later to buy pumpkins to carve."
    },
    {
        "character": "Cartman",
        "line": "[Excited.] Oooh, then we can enter the carving contest! I'll run home and get money from Mother. Do you guys need some, too?"
    },
    {
        "character": "",
        "line": "Cartman and the boys look at each other."
    },
    {
        "character": "Stan",
        "line": "Dude, this is creepy."
    },
    {
        "character": "",
        "line": "Stan's house. Stan walks in to find Sharon and someone new."
    },
    {
        "character": "Sharon",
        "line": "Stanley? Look who's here. Aunt Flo."
    },
    {
        "character": "",
        "line": "An elderly woman with glasses who has two gifts wrapped up next to her."
    },
    {
        "character": "Aunt Flo",
        "line": "Hello, Stanley. Remember me?"
    },
    {
        "character": "Stanley",
        "line": "[Flatly.] Hi, Aunt Flo."
    },
    {
        "character": "",
        "line": "Stan hesitates to enter, Aunt Flo begins to tremble."
    },
    {
        "character": "Sharon",
        "line": "Now, Stanley! Aunt Flo only visits once a month. Be nice."
    },
    {
        "character": "Aunt Flo",
        "line": "Hey, Stanley. I brought you and Shelly presents."
    },
    {
        "character": "Stan",
        "line": "Wow, really?! Hey, I love Aunt Flo!"
    },
    {
        "character": "",
        "line": "He rushes in, Shelly turning up as well."
    },
    {
        "character": "Aunt Flo",
        "line": "Okay, Shelly. This one's for you."
    },
    {
        "character": "",
        "line": "Shelly opens up the larger box and it expands out into."
    },
    {
        "character": "Aunt Flo",
        "line": "It's a television/CD player/surround sound home theater."
    },
    {
        "character": "Stan",
        "line": "Wow!"
    },
    {
        "character": "Sharon",
        "line": "What do you say, Shelly?"
    },
    {
        "character": "Shelly",
        "line": "Thank you, Aunt Flo."
    },
    {
        "character": "Sharon",
        "line": "Okay, Stanley. Your turn."
    },
    {
        "character": "",
        "line": "Stan opens up his box and reaches in."
    },
    {
        "character": "Aunt Flo",
        "line": "Your very own fish."
    },
    {
        "character": "Sharon",
        "line": "What do you say, Stanley?"
    },
    {
        "character": "Stan",
        "line": "I don't know."
    },
    {
        "character": "",
        "line": "Stan and the fish look at each other. Stan shows some fear."
    },
    {
        "character": "Aunt Flo",
        "line": "[Softly.] I think he likes you. [Normal.] Come on Shelly. Let's hook up your home theater."
    },
    {
        "character": "Shelly",
        "line": "Okay."
    },
    {
        "character": "",
        "line": "Shelly follows her aunt out."
    },
    {
        "character": "Sharon",
        "line": "How do you like your fish, Stanley?"
    },
    {
        "character": "Stan",
        "line": "I don't like it. It's spooky."
    },
    {
        "character": "Sharon",
        "line": "Oh, now, what's spooky about a cute, little goldfish? Go put him in your room."
    },
    {
        "character": "Stan",
        "line": "Do I have to?"
    },
    {
        "character": "Sharon",
        "line": "Yes, you do!"
    },
    {
        "character": "Stan",
        "line": "Damn it!"
    },
    {
        "character": "",
        "line": "Stan walks off with the goldfish."
    },
    {
        "character": "Sharon",
        "line": "Language!"
    },
    {
        "character": "",
        "line": "A different Barbra picture zooms out from the center of the screen. Next: the bus stop. Kyle is already there."
    },
    {
        "character": "Kyle",
        "line": "Where have you been, dude?"
    },
    {
        "character": "Stan",
        "line": "Dude, my mom's having her monthly visitor."
    },
    {
        "character": "Kyle",
        "line": "Aunt Flo?"
    },
    {
        "character": "Stan",
        "line": "Yeah. Every time she shows up my mom turns into a total bitch."
    },
    {
        "character": "Kyle",
        "line": "Where is Cartman? He said he was gonna bring money for us to buy a pumpkin."
    },
    {
        "character": "Stan",
        "line": "Yeah, I wonder why he's being so nice."
    },
    {
        "character": "Kyle",
        "line": "Here he comes."
    },
    {
        "character": "Stan",
        "line": "Hey, Cartman! Did you bring us money from your mom?"
    },
    {
        "character": "Cartman",
        "line": "[clean-shaven] Heh! Yeah, right! You guys could kiss my black ass!"
    },
    {
        "character": "Kyle",
        "line": "You said you could get us money, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Man, you guys are hella stupid! If I had money, I wouldn't give it to you assholes!"
    },
    {
        "character": "Kyle",
        "line": "Well, at least he's back to normal."
    },
    {
        "character": "Stan",
        "line": "Yeah, but we can't get a pumpkin, so we can't enter the carving contest!"
    },
    {
        "character": "Kyle",
        "line": "It's okay. Kenny said he'd get one."
    },
    {
        "character": "Cartman",
        "line": "Oh, how's Kenny gonna get one?! He's hella poor!"
    },
    {
        "character": "Stan",
        "line": "Why do you keep saying \"hella\", fatass?!"
    },
    {
        "character": "Cartman",
        "line": "'Cause I'm hella cool, that's why."
    },
    {
        "character": "Kyle",
        "line": "That's not cool!"
    },
    {
        "character": "Cartman",
        "line": "You guys are just hella jealous."
    },
    {
        "character": "",
        "line": "Night time, storm. Stan's house. Randy is about to turn off the light in Stan's room."
    },
    {
        "character": "Randy",
        "line": "Good night, Stanley. We'll uh see you in the morning."
    },
    {
        "character": "Stan",
        "line": "Can you leave the light on, Dad?"
    },
    {
        "character": "Randy",
        "line": "Well, it has to be off, or your Aunt Flo will complain about wasting electricity."
    },
    {
        "character": "Stan",
        "line": "I wish Aunt Flo didn't have to visit now."
    },
    {
        "character": "Randy",
        "line": "Yeah, me too. But she only visits your mom for five days or so. I'll be out sleeping on the couch. [turns the light off and closes the door]."
    },
    {
        "character": "",
        "line": "'In the darkness, Stan pulls the covers close and looks at the fish. They stare at each other, and the fish blows a bubble. Stan turns away, then looks back. The fish just looks at him. Stan then turns towards the window and begins to fall asleep, until lightning startles him upright. He looks at the tank. The fish is gone!'"
    },
    {
        "character": "Stan",
        "line": "Where did it go? [he lifts the covers and looks under the bed, then sits back. The fish swims back into view.] Huhhh. [he gets out, picks up his shirt, and throws it over the tank. He goes back to bed and looks at the tank again.]"
    },
    {
        "character": "",
        "line": "'[Kenny's house. Rain is dripping in all over the ceiling as pails collect the water. Kenny, Kevin and Mom share a blanket on the sofa while Stuart sits in the armchair.]'"
    },
    {
        "character": "Kenny",
        "line": "(Give me that-!) [pulls the blanket off Kevin]"
    },
    {
        "character": "Carol",
        "line": "Kenny [paf]"
    },
    {
        "character": "Kenny",
        "line": "(Ow, mom!)"
    },
    {
        "character": "Carol",
        "line": "You share that blanket with your brother! [knock knock knock]"
    },
    {
        "character": "Stuart",
        "line": "Who the hell could that be? [the front door opens and the family looks to see who it is]."
    },
    {
        "character": "Cartman",
        "line": "[with mustache and beard, and dressed in raingear] Hi there, folks! This is a heck of a storm out now! Thought maybe you could use some provisions. [a box of SUPPLIES is next to him. The parents look at each other] There's some candles and food in there. It ain't much, but it should get you through the night. Take care, folks. I've got other houses to get to. [walks off]."
    },
    {
        "character": "Stuart",
        "line": "[suspicious] Kenny, wasn't that your fat, racist, foul-mouthed friend, Eric Cartman?"
    },
    {
        "character": "Kenny",
        "line": "(Uh huh.)"
    },
    {
        "character": "",
        "line": "'Stan's house. He gets up once again to look at the tank, but the shirt is not on it anymore.'"
    },
    {
        "character": "Stan",
        "line": "Hey. Where did the shirt go? [hops off and approaches the fish] I covered you with a shirt! Where did it go?! [the fish blinks, then looks down and to the right. Stan's eyes follow, and he sees the shirt.] AAAaAaAaAa [runs back to his bed and pulls the covers up, then drops them a bit. He looks at the fish] I'm not gonna look. [shuts his eyes, then opens them again. The fish tank, and the dresser it's on, are closer to the bed] It's not closer. I'm just seeing things. [shuts his eyes again, then opens them. The tank and dresser are at the foot of his bed] GAAAH! [shuts his eyes tight, and opens them one more time. The fish tank is now on the bed, between his feet] AAAAAAAH!! [he jumps off, runs to his door, and rushes into the hallway] MOM! Mom! [comes back to the room with her in tow]"
    },
    {
        "character": "Sharon",
        "line": "Stanley, settle down!"
    },
    {
        "character": "Stan",
        "line": "Look. He's gonna kill me, Mom!"
    },
    {
        "character": "Aunt Flo",
        "line": "[at the door] Is there a problem? [walks to Sharon]"
    },
    {
        "character": "Sharon",
        "line": "Uh, no problem, Aunt Flo."
    },
    {
        "character": "Aunt Flo",
        "line": "Do you not like your goldfish?"
    },
    {
        "character": "Stan",
        "line": "No!"
    },
    {
        "character": "Aunt Flo",
        "line": "I'm sorry. I'm a bad aunt. [buries her face in her hand and begins to sob.]"
    },
    {
        "character": "Sharon",
        "line": "There, there, Aunt Flo. Stanley loves his goldfish. [he merely looks up at them]"
    },
    {
        "character": "",
        "line": "'1:25 a.m. Stan is under the covers looking at the spooky fish. After a long while, the fish turns around and starts writing something on the tank wall with his tail. Stan gets out of bed for a closer look. The fish finishes writing and turns to blow on the wall. A gray area appears and the word \"KILL\" appears within it.'"
    },
    {
        "character": "Stan",
        "line": "AAAAAAAAH! [runs back to bed]"
    },
    {
        "character": "Sharon",
        "line": "[enters his room and turns on the lights] Stanley, what are you doing?!"
    },
    {
        "character": "Stan",
        "line": "[pointing] The fish! [nothing is left of the writing on the tank wall] But-"
    },
    {
        "character": "Sharon",
        "line": "Stanley, I'm in no mood for this! Not when your Aunt Flo is in town! Oh, look, you woke your sister up. [Shelly stands in front of Sharon, then approaches Stan and slaps him, then leaves the room] Go to sleep, Stanley! [turns off the light and closes the door behind her.]"
    },
    {
        "character": "",
        "line": "'Stan gets back into bed and pulls the covers up. Another flash of lighting gets Stan to sit up again. He looks at the tank again, then gets out of bed for a closer look, failing to notice the growing pool of blood next to him. The fish again looks down and to the right, and Stan's eyes follow.'"
    },
    {
        "character": "Stan",
        "line": "[gasps. A man lies dead between the tank and the bed] WAAAAAAAH! Mooomm!"
    },
    {
        "character": "Sharon",
        "line": "All right, Stanley. I have had enough o- [freezes when she sees the body, then, quivering] Oh, Stanley, what have you done, baby? What have you done?? [rushes to comfort him]"
    },
    {
        "character": "Stan",
        "line": "Mom, I was just sleeping. And the next thing I knew-"
    },
    {
        "character": "Sharon",
        "line": "[covers his mouth with her arm, then quietly] Sshhh. It's okay, honey. It's okay. I've got such a good boy, Mommy's little angel. [kisses him and gets up] Now, don't worry, Stanley. Mommy's going to hide the body. [starts to drag it away] Nobody's going to take my baby away. I've got such a handsome boy, such a good boy. [she drags the body out of the room and out into the storm. Stan just looks at her]"
    },
    {
        "character": "Stan",
        "line": "[turns to the fish] You're not gonna get away with this! [the fish writes again, blows, and the message is: \"Yes I Will.\"]"
    },
    {
        "character": "",
        "line": "'[Stan walks over to the window and sees his mom digging a grave next to the body. She then places the body in the grave and covers it up. She returns with the shovel to the kitchen and closes the door behind her.]'"
    },
    {
        "character": "Aunt Flo",
        "line": "[her silhouette appears] Sharon!"
    },
    {
        "character": "Sharon",
        "line": "D'uh! Aunt Flo, what are you doing up?!"
    },
    {
        "character": "Aunt Flo",
        "line": "Look at you, with your little shovel. Just like when you were twelve."
    },
    {
        "character": "Stan",
        "line": "[sees Sharon pass by] Mom, what are you doing?"
    },
    {
        "character": "Sharon",
        "line": "Sshh. It's going to be okay, Stanley."
    },
    {
        "character": "Stan",
        "line": "Mom, do you think I killed that guy? It was the fish! He says I'm next!"
    },
    {
        "character": "",
        "line": "The fish blinks and blows a bubble."
    },
    {
        "character": "Sharon",
        "line": "[enters the room] Now get some sleep, baby. Mommy's taken care of everything."
    },
    {
        "character": "Stan",
        "line": "But MOM!"
    },
    {
        "character": "Sharon",
        "line": "[Cradles Stan] Sshh.\nHush little baby, don't say a word.\nMomma's gonna buy you a mockin' bird.\nIf that mockin' bird don't sing, Momma's gonna bury it in the backyard\n\n\n"
    },
    {
        "character": "",
        "line": "'[8 a.m., next day. A rooster crows and Stan's clock farts. Stan wakes up and looks at the tank. The fish is still there. Stan hops off the bed and walks to the tank, but is stopped by another body.]'"
    },
    {
        "character": "Stan",
        "line": "MMOOMM!"
    },
    {
        "character": "Sharon",
        "line": "[frantic] What is it, honey? [gasp!] My baby's killed again!"
    },
    {
        "character": "Stan",
        "line": "[points at the body, then holds up his hands] No, mom!"
    },
    {
        "character": "Sharon",
        "line": "[holds him tight] What are we gonna do, baby? What are we gonna do?? [the fish looks on. Sharon drags the body out] I've got such a handsome boy, such a good boy."
    },
    {
        "character": "",
        "line": "Stan then stands at the window. As he looks out, a reflection of Sharon burying the body is seen on the window pane."
    },
    {
        "character": "",
        "line": "'[Almost 8 p.m., Kyle's house. Kyle and Cartman are at table when Kenny comes in]'"
    },
    {
        "character": "Kyle",
        "line": "It's about time, Kenny! Did you bring the pumpkin?"
    },
    {
        "character": "Kenny",
        "line": "(Uh huh!)"
    },
    {
        "character": "Cartman",
        "line": "Well, where is it? [Kenny brings out a squash and sets it on the table] What the hell is that?!"
    },
    {
        "character": "Kenny",
        "line": "(It's the only thing I could afford.)"
    },
    {
        "character": "Cartman",
        "line": "It's all you could afford?! Whoever heard of a squash-o-lantern, Kenny?! That's hella stupid!"
    },
    {
        "character": "Kyle",
        "line": "Stop saying \"hella,\" Cartman! [to Kenny] How are we gonna win the contest with a squash? [as Kyle says this Stan enters the room] Whoa, Stan. You don't look so good."
    },
    {
        "character": "Stan",
        "line": "[squeezes into Kyle's chair so both fit. Cartman walks to Kenny's chair] I haven't been sleeping so well."
    },
    {
        "character": "Cartman",
        "line": "[cuts the top off the squash and taps at the bottom to clear it out. Sigh] God, I hate you, Kenny. [works on the squash some more] I have to get another knife; this one's hella dull! [goes into the kitchen for another one]"
    },
    {
        "character": "Kyle",
        "line": "God, will you shut up?!"
    },
    {
        "character": "Stan",
        "line": "Kyle, you know how some people are, like, murderers and stuff?"
    },
    {
        "character": "Kyle",
        "line": "Yeah."
    },
    {
        "character": "Stan",
        "line": "Do you think animals can be murderers, too?"
    },
    {
        "character": "Kyle",
        "line": "I don't know. [the bearded Cartman comes in with a huge knife] Oh, great. He's got that stupid beard on again."
    },
    {
        "character": "Cartman",
        "line": "[gives Kenny a hand] No, Kenny. You should cut with the blade facing away from you. You're gonna hurt yourself. Seriously, dude. Isn't this fun, you guys? Carving pumpkins for Halloween?\n\nYou guys are my best friends\nThrough thick and thin, we've always been together\nWe're four of a kind, havin' fun all day\nPallin' around and laughin' away\nJust best friends, best friends are we.\n\n I love you guys. [throughout the song, Kyle and Stan look on with awe]\n"
    },
    {
        "character": "",
        "line": "Next day. Stan, Kyle, and Kenny are at the bus stop. A picture of Barbra in curls is now on all four corners."
    },
    {
        "character": "Kyle",
        "line": "You seem tired, Stan."
    },
    {
        "character": "Stan",
        "line": "I haven't been sleeping well."
    },
    {
        "character": "Kyle",
        "line": "Why?"
    },
    {
        "character": "Stan",
        "line": "My pet goldfish killed another random person last night."
    },
    {
        "character": "Kyle",
        "line": "Hoh, that sucks, dude."
    },
    {
        "character": "Cartman",
        "line": "Hey, dudes. Man, it's hella cold out here."
    },
    {
        "character": "Kyle",
        "line": "Cartman?"
    },
    {
        "character": "Cartman",
        "line": "Who'd you expect? Maury Povich? Golly, you're hella lame!"
    },
    {
        "character": "Stan",
        "line": "What are you doing?!"
    },
    {
        "character": "Cartman",
        "line": "What do you mean, what am I doing?! I'm just standing here. Jesus, mellow out, you guys."
    },
    {
        "character": "Kyle",
        "line": "You can't be standing there, Cartman."
    },
    {
        "character": "Cartman",
        "line": "Why the hell not?!"
    },
    {
        "character": "Kyle",
        "line": "Because you're standing over there!"
    },
    {
        "character": "",
        "line": "Kenny looks at the bearded Cartman."
    },
    {
        "character": "Cartman",
        "line": "[seeing his parallel for the first time] Aaah! Son of a bitch!"
    },
    {
        "character": "Evil Cartman",
        "line": "[Cartman walks to him] Wow, you don't see this every day."
    },
    {
        "character": "Cartman",
        "line": "I can't believe what I'm seeing."
    },
    {
        "character": "Evil Cartman",
        "line": "It's like I'm looking in a mirror."
    },
    {
        "character": "Cartman",
        "line": "Dude, this is hella weird."
    },
    {
        "character": "",
        "line": "Sunrise, Stan's house. Officer Barbrady approaches the front door, humming. [He rings the bell]'"
    },
    {
        "character": "Sharon",
        "line": "[answering] Oh. Uh-Officer Barbrady, Woo, wh-what a surprise. What can I do for you?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Well, there's been a report of a few missing people."
    },
    {
        "character": "Sharon",
        "line": "Is that so?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Yeah. No biggie, but I was wondering if you had seen any of them. [show her some pictures of the missing men]"
    },
    {
        "character": "Sharon",
        "line": "I'd never seen any of those men, Officer Barbrady."
    },
    {
        "character": "Officer Barbrady",
        "line": "No, I didn't think so. Mind if I look around the back yard, though?"
    },
    {
        "character": "Sharon",
        "line": "[somewhat alarmed] Why would you wanna do that?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Well, I'm checking everyone's back yards. Missing people usually turn up hiding in someone's bushes. May I? [Sharon moves aside and Barbrady enters. They head for the back yard, where five fresh graves await around the clubhouse, and Sparky is pulling a leg out of one of them. Sparky pulls it free and walks away with it] Well, this all looks in- [clunk] oh? Tennis anyone? [falls to the floor unconscious. Sharon had hit him with a pan]"
    },
    {
        "character": "",
        "line": "The fourth image of Barbra zooms out and back with a scream, and Sharon is now in the basement."
    },
    {
        "character": "Sharon",
        "line": "Nobody's going to take my baby away from me! Nobody!"
    },
    {
        "character": "Officer Barbrady",
        "line": "[missing his pants and shoes, his wrists are tied to posts] Okay, Mrs. Marsh, I'm afraid I'm going to have to ask you a few questions."
    },
    {
        "character": "",
        "line": "South Park Elementary, lunch time. The boys are in the kitchen for their food."
    },
    {
        "character": "Chef",
        "line": "[excited] Hello there, children! [he is dressed as an African chieftain, complete with reebock skull]"
    },
    {
        "character": "The Boys",
        "line": "Hey, Chef."
    },
    {
        "character": "Chef",
        "line": "All ready for our Halloween lunch? Today I've got spooooooky spaghetti, with freeeeeaky French fries."
    },
    {
        "character": "Kyle",
        "line": "Uh, Chef?"
    },
    {
        "character": "Chef",
        "line": "Or haaauuunted hash browns."
    },
    {
        "character": "Kyle",
        "line": "Chef."
    },
    {
        "character": "Chef",
        "line": "And a creeeeeepy cookie, and moooooonstrous milk!"
    },
    {
        "character": "Kyle",
        "line": "Chef."
    },
    {
        "character": "Chef",
        "line": "And a teeeeerrifying napkin!"
    },
    {
        "character": "Kyle",
        "line": "Chef!"
    },
    {
        "character": "Chef",
        "line": "What?!"
    },
    {
        "character": "Kyle",
        "line": "We have problems!"
    },
    {
        "character": "Chef",
        "line": "Well, what's the first problem?"
    },
    {
        "character": "Stan",
        "line": "Chef, I have a goldfish that keeps killing people."
    },
    {
        "character": "Chef",
        "line": "Oh. Well, uh, don't worry, Stan. I'm sure it'll work out. Now, what's the other problem? [Kyle points to Cartman, but now there are two of him. They blink together.] Oh, nohoho. [rubs his eyes] Oh, DEAR GOD, NO!"
    },
    {
        "character": "",
        "line": "Cafeteria dining area. The five boys and Chef are sitting at a table."
    },
    {
        "character": "Cartman",
        "line": "...and them I saw them all at the bus stop, and this son of a bitch is standing there!"
    },
    {
        "character": "Evil Cartman",
        "line": "I'm sorry I caused so much trouble. This is all very strange to me, too."
    },
    {
        "character": "Chef",
        "line": "Exactly what do you remember?"
    },
    {
        "character": "Evil Cartman",
        "line": "Well, I was just standing around, and Stan and Kyle were being really mean, as usual, and Kenny had just bought a new car."
    },
    {
        "character": "Chef",
        "line": "Of course! That's it!"
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Chef",
        "line": "Don't you see, children? This Cartman is from an evil, parallel universe where everything exists as its opposite!"
    },
    {
        "character": "Cartman",
        "line": "He's my evil twin? But he doesn't even look that much like me; he's all fat and stuff. He's hella lying."
    },
    {
        "character": "Kyle",
        "line": "Will you stop saying that word?!"
    },
    {
        "character": "Stan",
        "line": "Of course! My pet goldfish must be from the evil, opposite universe, too!"
    },
    {
        "character": "Chef",
        "line": "Children, somewhere in South Park, something has created a door to the evil, parallel universe!"
    },
    {
        "character": "Evil Cartman",
        "line": "This is amazing! I can't believe how nice you are, Chef."
    },
    {
        "character": "Chef",
        "line": "How do you mean?"
    },
    {
        "character": "Evil Cartman",
        "line": "In my world, you're a skinny, white insurance salesman."
    },
    {
        "character": "",
        "line": "Chef's jaw drops."
    },
    {
        "character": "",
        "line": "Stan's house, daytime. The boys enter the living room and Stan places his fish on a small desk next to the sofa. Aunt Flo greets them."
    },
    {
        "character": "Aunt Flo",
        "line": "[shaking] Ooh, hello, boys. I'm Stan's Aunt Flo."
    },
    {
        "character": "Kyle",
        "line": "Whoa! What's wrong with your head?! Why are you shaking like that?"
    },
    {
        "character": "Stan",
        "line": "[taps Kyle, then softly] Dude, that's not cool. She's got Parkinson's disease."
    },
    {
        "character": "Cartman",
        "line": "Ey, sweet! [hops on her lap] Sweeeeeet! Check it out, guys; you don't even have to put a quarter in her."
    },
    {
        "character": "Stan",
        "line": "Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Dude, this is hella cool."
    },
    {
        "character": "Stan",
        "line": "Aunt Flo, where did you get this goldfish?"
    },
    {
        "character": "Aunt Flo",
        "line": "Nn-oh. [Cartman hops off and rejoins the boys] I got it from the pet store, Stanley."
    },
    {
        "character": "Stan",
        "line": "Do you remember what pet store?"
    },
    {
        "character": "Aunt Flo",
        "line": "Let's see. I believe it was called \"The Indian Burial Ground Pet Store,\" just outside of town."
    },
    {
        "character": "Stan",
        "line": "Where?"
    },
    {
        "character": "Aunt Flo",
        "line": "I know I have the address written down somewhere. [Stan turns and takes Kyle aside] Let me look."
    },
    {
        "character": "Stan",
        "line": "That's it, dude. We've gotta take the spooky fish back to that pet store."
    },
    {
        "character": "Cartman",
        "line": "Who's \"we\"? You got a turd in your pocket? I'm goin' home. I'm hella hungry!"
    },
    {
        "character": "Evil Cartman",
        "line": "I'll help you, Stan."
    },
    {
        "character": "Cartman",
        "line": "Shut your god-damned mouth, fatass!"
    },
    {
        "character": "Kyle",
        "line": "Dude. Are you sure that fish is a murderer? It seemed like a normal fish to me."
    },
    {
        "character": "Stan",
        "line": "Just help me take it back. Come on! [walks to Aunt Flo, who's now dead on the floor] Did you find the address, Aunt Flo- Aunt Flo!"
    },
    {
        "character": "Sharon",
        "line": "[rushing in] Oh, Stanley, no! Not Aunt Flo! [holds her hands to her face]"
    },
    {
        "character": "Stan",
        "line": "It was the fish! [points to it]"
    },
    {
        "character": "Sharon",
        "line": "[dragging Aunt Flo, mutters] Oh, what a good baby. What a good son I have. [the fish swims around]"
    },
    {
        "character": "Stan",
        "line": "Now we'll never know where that pet store is!"
    },
    {
        "character": "Kyle",
        "line": "There can't be that many pet stores in South Park, dude. [the fish jumps out and somehow pulls Kenny into the tank head first.]"
    },
    {
        "character": "Stan",
        "line": "Aunt Flo isn't from South Park. The pet store could be anywhere between here and Denver. [Kenny starts to gargle as the fish gives him the blender treatment. The water turns blood red as Kenny spins in the tank]"
    },
    {
        "character": "Kyle",
        "line": "Well, we'd better get working. Cartman, you go home and call all the pet stores in the phone book."
    },
    {
        "character": "Evil Cartman",
        "line": "Can do!"
    },
    {
        "character": "Cartman",
        "line": "Screw you! [the fish spits Kenny's corpse out of the tank and jumps back in. Kenny's left eye is gone and the water is clear]"
    },
    {
        "character": "Sharon",
        "line": "[returning] It's all taken care of, Stanley- G'oh! [sees Kenny's corpse and reacts frantically. Rats rush in to munch on it] I've got such a good boy, such a handsome boy! [drags Kenny away. The fish looks on]"
    },
    {
        "character": "Stan",
        "line": "[to Kyle] Come on, we're running out of time. [both walk by Randy trying to open a door]"
    },
    {
        "character": "Randy",
        "line": "[turns around] Hey, why is the basement door locked? [turns back and keeps trying]"
    },
    {
        "character": "",
        "line": "The Marsh basement. Officer Barbrady is still tied up."
    },
    {
        "character": "Officer Barbrady",
        "line": "\n-crack corn and I don't care\nJimmy crack corn and I don't care\nMy master's gone away\nJimmy crack corn and I don't care\n\n\n"
    },
    {
        "character": "",
        "line": "Cartman's house. Both Cartmans are seated on the sofa. Evil Cartman has the phone book, Cartman has a pot pie."
    },
    {
        "character": "Evil Cartman",
        "line": "I don't see any pet stores called \"Indian Burial Ground.\""
    },
    {
        "character": "Cartman",
        "line": "Shut up, dude! I'm trying to watch TV!"
    },
    {
        "character": "Announcer",
        "line": "And now, back to the Terrance and Phillip Halloween Special."
    },
    {
        "character": "Terrance",
        "line": "[both are dressed as ghosts] (Fart)"
    },
    {
        "character": "Phillip",
        "line": "[long pause] That fart was absolutely ghoulish, Terrance. [both pull out little daggers and stab each other as they laugh. Small spurts of blood ensue.]"
    },
    {
        "character": "Cartman",
        "line": "Uh-ho-ho, man, that's hella funny! [slaps his thigh]"
    },
    {
        "character": "Evil Cartman",
        "line": "[looks up] What's so funny about that?"
    },
    {
        "character": "Kitty",
        "line": "Meow."
    },
    {
        "character": "Cartman",
        "line": "No, Kitty, this is my pot pie!"
    },
    {
        "character": "Mr. Kitty",
        "line": "Meow."
    },
    {
        "character": "Cartman",
        "line": "No, Kitty, this is my pot pie, Kitty!"
    },
    {
        "character": "Evil Cartman",
        "line": "[picks up Kitty] Who's my kitty? Who's my little kitty? My fluffy little cat. Yeah, that's good, yeah, that's my nice little kitty, yeah. [Kitty is purring loudly, happily now. Cartman is not amused.]"
    },
    {
        "character": "Cartman",
        "line": "NO KITTY, BAD KITTY!!! [Evil Cartman is startled as Kitty jumps away.] Hahaha, you-hoo suck, dude."
    },
    {
        "character": "",
        "line": "Night time, the Marsh house. Stan and Kyle are on the sofa. Sharon enters with another woman."
    },
    {
        "character": "Sharon",
        "line": "Stanley. Kenny's mother is here. She's wondering if you've seen Kenny."
    },
    {
        "character": "Carol",
        "line": "[approaches him] You saw him, didn't you? [Sharon mouths and waves \"no\" to Stan] You saw my boy. [sits down on the sofa between the boys]"
    },
    {
        "character": "Stan",
        "line": "Yeah, my goldfish-."
    },
    {
        "character": "Sharon",
        "line": "Yeah. Stan just got a new goldfish and he wanted to show it to Kenny but, Kenny never came over."
    },
    {
        "character": "Carol",
        "line": "[cradling Stan, distraught] My Kenny used to laugh and play. He was eight years old, just like you, my Kenny was."
    },
    {
        "character": "Stan",
        "line": "I know."
    },
    {
        "character": "Carol",
        "line": "You've gotta tell me what happened to him! [holds Stan up and throttles him] You have to know something!"
    },
    {
        "character": "Sharon",
        "line": "[intervening] Mrs. McCormick, I'm going to have to ask you to leave! You've been drinking!"
    },
    {
        "character": "Carol",
        "line": "That's right, I'm a little drunk. [Sharon escorts her to the door] You'd be drunk, too, if you'd lost your boy. [Evil Cartman enters as the women reach the door] My Kenny used to sing and dance, eh."
    },
    {
        "character": "Evil Cartman",
        "line": "[at the sofa] You guys, I found the pet store!"
    },
    {
        "character": "Stan",
        "line": "Come on, let's go! [takes the fish with him and stops before Sharon] Mom, I know you think I did all this, but I'm gonna prove to you it was this fucking fish!"
    },
    {
        "character": "Sharon",
        "line": "I believe you, sweetheart. [Stan goes outside, and she addresses Kyle and Evil Cartman] Run from him, boys. Run and don't stop!"
    },
    {
        "character": "",
        "line": "A stormy night, at the pet store. The remains of a covered wagon are next to it. The three boys enter."
    },
    {
        "character": "Clerk",
        "line": "Can I help you boys?"
    },
    {
        "character": "Stan",
        "line": "I wanna return a fish."
    },
    {
        "character": "Clerk",
        "line": "[pounds the counter with both fists] Damn it!"
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Clerk",
        "line": "That's the ninth return I've had this week! What's wrong with it? [holds his palms out] Ap! Let me guess. It killed a bunch of people, right?"
    },
    {
        "character": "Stan",
        "line": "Yeah, dude."
    },
    {
        "character": "Clerk",
        "line": "Damn it! [pounds with the right fist] Just like all the other returns! [the camera pulls back to show them. They all groan and have red, evil eyes. One bird blinks, and its eyes glow]"
    },
    {
        "character": "Kyle",
        "line": "Dude, why is your store called \"The Indian Burial Ground Pet Store?\""
    },
    {
        "character": "Clerk",
        "line": "Well, there was an Indian burial ground here before I bought it."
    },
    {
        "character": "Stan",
        "line": "So you just- built your store on top of an Indian burial ground?"
    },
    {
        "character": "Clerk",
        "line": "Oh, hell no! First I dug up all the bodies, pissed on 'em, then buried them again upside down."
    },
    {
        "character": "Stan",
        "line": "Why?"
    },
    {
        "character": "Clerk",
        "line": "Why? I don't know. I was drunk."
    },
    {
        "character": "Stan",
        "line": "We think that when you did that, you opened up a doorway to an evil, parallel universe."
    },
    {
        "character": "Clerk",
        "line": "Well, that certainly would explain a lot."
    },
    {
        "character": "Kyle",
        "line": "Like what?"
    },
    {
        "character": "Clerk",
        "line": "Well, like this. [opens a door marked, \"Employees Only.\" A bright, flashing portal appears] I've been wondering what the hell this was."
    },
    {
        "character": "",
        "line": "Stan's house. Randy finally opened the door to the basement and brings down some items."
    },
    {
        "character": "Officer Barbrady",
        "line": "Hello, Mr. Marsh. Top of the evening to you. [Randy turns to see Officer Barbrady, then rushes up the stairs] Okay, bye, then."
    },
    {
        "character": "",
        "line": "The kitchen. Sharon is preparing cookie dough. Randy enters."
    },
    {
        "character": "Randy",
        "line": "Sharon?"
    },
    {
        "character": "Sharon",
        "line": "Yes, hon?"
    },
    {
        "character": "Randy",
        "line": "There's a policeman being held captive in our basement."
    },
    {
        "character": "Sharon",
        "line": "[rolling the dough] Yes, hon. I had to restrain him so he wouldn't find the bodies in the back yard and take our baby away. [begins cutting out cookies in star shapes.]"
    },
    {
        "character": "Randy",
        "line": "[ponders] Why'd you take his pants off? [long pause. Sharon makes more cookies] Sh-sharon, why'd you take his- pants off?"
    },
    {
        "character": "Sharon",
        "line": "[sobs. Randy comes over] Oh, Randy, I just don't know what to do anymore."
    },
    {
        "character": "Randy",
        "line": "What is it?"
    },
    {
        "character": "Sharon",
        "line": "I just ughhhh, I can't believe that Aunt Flo is gone, that she won't be visiting me ever again."
    },
    {
        "character": "Randy",
        "line": "Oh. Uh, well, don't- think of it as an end, think of it as a new beginning. Now, could you fill me in on the dead bodies and captive policeman stuff real quick?"
    },
    {
        "character": "",
        "line": "Back at the pet store."
    },
    {
        "character": "Stan",
        "line": "Look, pal. This is very simple. All I want to do is return this fish."
    },
    {
        "character": "Clerk",
        "line": "I can't give you your money back."
    },
    {
        "character": "Stan",
        "line": "I don't care, dude! I just want this fish away from me!"
    },
    {
        "character": "Clerk",
        "line": "No! I won't take it back!"
    },
    {
        "character": "Evil Cartman",
        "line": "Listen, friend. You can't sell people pets like this. You have to have a sign that says, \"Warning: these fish are from an evil, parallel universe.\" Now, it's not our fault you disrespected the bodies of this land's native people, but by golly [pounds his right hand with his left fist], you're gonna take this fish back."
    },
    {
        "character": "Clerk",
        "line": "All right, you win."
    },
    {
        "character": "Stan",
        "line": "Wow! Thanks, evil Cartman! [the clerk takes the fish from Stan]"
    },
    {
        "character": "Evil Cartman",
        "line": "[turns to face the clerk again] And sir, can I make a suggestion? [the clerk looks at him] Move your store, and let these great people of the Wampanoag rest in peace."
    },
    {
        "character": "Kyle",
        "line": "You kick ass, evil Cartman!"
    },
    {
        "character": "Stan",
        "line": "Yeah!"
    },
    {
        "character": "Kyle",
        "line": "You know what I like best about you? You don't say, \"hella,\" like our Cartman does. I swear, if he says that one more time, I'm gonna kill him! [the boys exit the store, and the skies are clear]"
    },
    {
        "character": "Evil Cartman",
        "line": "No, Kyle. Murder is never an answer. [the clerk puts the fish up on a shelf and the employee door opens, the doorway glowing brightly]"
    },
    {
        "character": "Clerk",
        "line": "[recoils] What the-? [two figures appear: Evil Stan and Evil Kyle]"
    },
    {
        "character": "Evil Stan",
        "line": "He was here! Cartman was just here!"
    },
    {
        "character": "Clerk",
        "line": "Who are you?"
    },
    {
        "character": "Evil Kyle",
        "line": "We're looking for Cartman. The trail ended here. Where is he?"
    },
    {
        "character": "Clerk",
        "line": "I don't know who you mean?"
    },
    {
        "character": "Evil Kyle",
        "line": "[pulls out a big bat] Maybe this will jog your memory! [starts releasing the evil returns by bashing in the cages]"
    },
    {
        "character": "Clerk",
        "line": "No! Stop! You don't know what you're doing! Those pets are evil!"
    },
    {
        "character": "",
        "line": "Several identical images of Barbra flash through space, one of them towards the camera, and the boys are walking down Main Street."
    },
    {
        "character": "Stan",
        "line": "I'm sure glad that's over with. Now I can sleep at night."
    },
    {
        "character": "Evil Cartman",
        "line": "Hey, you guys. We still have time to enter the pumpkin-carving contest."
    },
    {
        "character": "Kyle",
        "line": "Hey, yeah! I almost forgot."
    },
    {
        "character": "Evil Cartman",
        "line": "Come on! I bet that together we can make the best pumpkin ever!"
    },
    {
        "character": "Stan",
        "line": "You know, evil Cartman? I like you a lot better than our Cartman."
    },
    {
        "character": "Kyle",
        "line": "Yeah, you're cool. And you don't say \"hella.\""
    },
    {
        "character": "Evil Cartman",
        "line": "Yuh, thanks, you guys. I certainly like you a lot more than in my evil, parallel universe. [the boys turn to see a man attacked by two dogs, a cat, two ducks, and a vulture]"
    },
    {
        "character": "",
        "line": "The boys resume walking]."
    },
    {
        "character": "Kyle",
        "line": "Dude, where are we going to find a pumpkin to carve?"
    },
    {
        "character": "Evil Cartman",
        "line": "Let's use Kenny's squash."
    },
    {
        "character": "Stan",
        "line": "Yeah. You know, I never thought it was such a bad, little squash. It just needs some tender, loving care."
    },
    {
        "character": "",
        "line": "Cartman's house. Cartman is watching TV in the dark. Onscreen, Phillip is in a cemetery standing next to a tombstone that might be Terrance's, and has three roses in his hand."
    },
    {
        "character": "Terrance",
        "line": "[as a ghost, walks up to Phillip] Boo!"
    },
    {
        "character": "Phillip",
        "line": "[jumps up] Aaaaagh!"
    },
    {
        "character": "Cartman",
        "line": "Aw, man, this movie is hella scary. [click. The front door flies open and Evil Stan and Evil Kyle burst in]"
    },
    {
        "character": "Evil Stan",
        "line": "Aha! There you are, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "P'h. Nice costume, you guys. You spent about a buck fifty on those?"
    },
    {
        "character": "Evil Kyle",
        "line": "We're here to take you back, Goody Two-Shoes!"
    },
    {
        "character": "Cartman",
        "line": "Oh? I've got a better idea. Why don't you two go fuck yourselves?"
    },
    {
        "character": "Evil Stan",
        "line": "[he and Evil Kyle look at each other, then] Hey! What's wrong with you, Cartman?"
    },
    {
        "character": "Cartman",
        "line": "What's wrong with me? Let's see. Uum. [checks them off] I hate you guys. You're hella stupid."
    },
    {
        "character": "Evil Kyle",
        "line": "[he and Evil Stan go over to grab him] Come on, Mr. Wholesome! We're taking you back to our universe!"
    },
    {
        "character": "Cartman",
        "line": "Don't touch me! [punches Evil Stan, who releases him]"
    },
    {
        "character": "Evil Stan",
        "line": "What the hell's goin' on?! Cartman never hits us!"
    },
    {
        "character": "Evil Kyle",
        "line": "Hall right! Just stand there, Cartman! This gingerification gun will send you back to our universe!"
    },
    {
        "character": "Cartman",
        "line": "Oh, right! You guys are from the evil, parallel universe?!"
    },
    {
        "character": "Evil Stan",
        "line": "Yes!"
    },
    {
        "character": "Cartman",
        "line": "Oh, it's about freakin' time you showed up! You don't want me, you want that impostor Cartman! Come on, I'll show you. [leads them out the door]"
    },
    {
        "character": "",
        "line": "At the Pumpkin Carving Contest. Mayor McDaniels is dressed as a Puritan woman. Johnson holds a ball on a platter. They are on stage, which is adorned with two spiderwebs and a bat in each one."
    },
    {
        "character": "Mayor McDaniels",
        "line": "And the winner is: Squash-O-Lantern, by Stan Marsh, Kyle Broflovski, and the evil Eric Cartman from the parallel universe! \"The Winning Entry! Squash in cobweb, amid a tiny graveyard and flanked by four tiny bats\""
    },
    {
        "character": "Stan",
        "line": "[the crowd cheers] We won, dude!"
    },
    {
        "character": "Evil Cartman",
        "line": "Hooray!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "You boys win the Halloween Chocolate Ball!"
    },
    {
        "character": "Evil Cartman",
        "line": "Oh, no! [spots Cartman, Evil Stan and Evil Kyle] Stan and Kyle have come to take my back to my world, and I don't wanna go back!"
    },
    {
        "character": "Stan",
        "line": "Don't worry, Evil Cartman. You're staying with us! [the two groups face each other]"
    },
    {
        "character": "Cartman",
        "line": "[to Evil Kyle] Now, zap his hella ass back to your- hella universe!"
    },
    {
        "character": "Kyle",
        "line": "Stop saying \"hella,\" Cartman!"
    },
    {
        "character": "Evil Stan",
        "line": "[to Evil Cartman] Thought you could get away from us, huh, Cartman?!"
    },
    {
        "character": "Evil Cartman",
        "line": "[pleading] Please!"
    },
    {
        "character": "Kyle",
        "line": "Leave him alone, butthole!"
    },
    {
        "character": "Evil Kyle",
        "line": "Shut your trap, kid!"
    },
    {
        "character": "Stan",
        "line": "Why don't you guys take our Cartman back? He's more like you anyway."
    },
    {
        "character": "Cartman",
        "line": "Ey, you backstabbin' sellout!"
    },
    {
        "character": "Evil Stan",
        "line": "It's time, Cartman! Prepare for gingerification! [sets the gun]"
    },
    {
        "character": "Evil Cartman",
        "line": "Well, good-bye, you guys. It's been fun. [Stan and Kyle look down. The evil pets return to South Park and start attacking the townsfolk. They scream as they are being attacked.]"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Oh, what now?!"
    },
    {
        "character": "Kyle",
        "line": "It's the evil pets [the attack continues, and a vulture knocks the gingerification gun out of Evil Stan's hands.]"
    },
    {
        "character": "Evil Stan",
        "line": "The gingerification gun!"
    },
    {
        "character": "Stan",
        "line": "[picks it up] Get to the stage! [Stan, Kyle, and Evil Cartman rush up. Stan's spooky fish attacks a man and kills him]"
    },
    {
        "character": "Sharon",
        "line": "[seeing what just happened] Oh, dear. It really was Stan's fish that killed those people!"
    },
    {
        "character": "Evil Stan",
        "line": "[all six boys are on stage] Give me that gun, kid!"
    },
    {
        "character": "Stan",
        "line": "Up yours, evil twin! [zaps him back to the evil, parallel universe.]"
    },
    {
        "character": "Evil Stan",
        "line": "[shrinks as Evil Kyle watches] Noooooo! [vanishes]"
    },
    {
        "character": "Evil Kyle",
        "line": "[zapped, he shrinks too] Noooooo! [vanishes]"
    },
    {
        "character": "Cartman",
        "line": "All right, now you can try to send this Bozo through and the whole mess'll be over with!"
    },
    {
        "character": "Stan",
        "line": "Sorry Cartman. We like Evil Cartman better. See ya. [takes aim]"
    },
    {
        "character": "Cartman",
        "line": "What?!"
    },
    {
        "character": "Kyle",
        "line": "We can't deal with you saying \"hella\" anymore, Cartman! You're going to the other universe! [Cartman takes on Evil Cartman, and both wrestle. Cartman rips off Evil Cartman's mustache and beard, and kicks him. Both of them then stand up, indistinguishable. Stan pulls the gingerification gun back]"
    },
    {
        "character": "Kyle",
        "line": "Which one is the good Cartman?"
    },
    {
        "character": "Both Cartmans",
        "line": "I am!"
    },
    {
        "character": "Stan",
        "line": "Stop wasting time, Cartman! We have to send one of you back to the evil universe!"
    },
    {
        "character": "Kyle",
        "line": "Yeah! Now, which one of you is the Cartman we can't stand?!"
    },
    {
        "character": "Both Cartmans",
        "line": "[pointing to the other one] He is!"
    },
    {
        "character": "Cartman on Left",
        "line": "Time is running out. You'll have to destroy us both."
    },
    {
        "character": "Cartman on Right",
        "line": "What?!"
    },
    {
        "character": "Cartman on Left",
        "line": "It's the only way you can be sure. We have to both go, for the good of the world."
    },
    {
        "character": "Cartman on Right",
        "line": "[Stan zaps him] Noooo! Screw you guys! [disappears]"
    },
    {
        "character": "Cartman on Left",
        "line": "How did you guys know?"
    },
    {
        "character": "Stan",
        "line": "Our Cartman would never say anything like that."
    },
    {
        "character": "Cartman",
        "line": "Haaa hahaha! You guys are hella stupid! I knew you would fall for that!"
    },
    {
        "character": "Kyle",
        "line": "Oh no, dude!"
    },
    {
        "character": "Stan",
        "line": "You tricked us, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "That's right, I did!\nYou guys are hella stupid\nYou guys are hella lame\nYou guys are hella dumb\nHella hella hella!\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "Damn it!"
    },
    {
        "character": "",
        "line": "On the street, Randy walks with Officer Barbrady. The evil pets are still attacking the townsfolk."
    },
    {
        "character": "Randy",
        "line": "I'm sorry my wife held you captive, officer. She's been upset 'cause her Aunt Flo isn't gonna visit her anymore."
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh, I understand. I remember when my wife stopped getting her monthly visitor."
    },
    {
        "character": "Randy",
        "line": "Uuuh, do you want your pants back?"
    },
    {
        "character": "Officer Barbrady",
        "line": "No. Just leave me with my dignity. [turns around and walks into the crowd] Okay, people, move along. Nothing to see here."
    },
    {
        "character": "",
        "line": "'[End of \"Spooky Fish.\" Cartman sings \"Best Friends\"]'"
    }
]