[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day. The school is in an uproar. The students are tearing up their notebooks and littering the hallways with their papers. Clyde starts setting papers on fire."
    },
    {
        "character": "Cartman",
        "line": "[runs through the hallway] This is an outrage! This is a violation of our human rights! [stops in front of Stan and Kyle]"
    },
    {
        "character": "Stan",
        "line": "What the hell is going on?"
    },
    {
        "character": "Cartman",
        "line": "You didn't hear the announcement? They just cancelled Columbus Day! We have to come to school on Monday!"
    },
    {
        "character": "Kyle",
        "line": "They what??"
    },
    {
        "character": "Butters",
        "line": "[runs up between Stan, Kyle, and Cartman] They can't do this! We made plans! [runs off]"
    },
    {
        "character": "Cartman",
        "line": "Some asshole went and convinced the school board that Columbus Day is racist and should be eliminated!"
    },
    {
        "character": "Butters",
        "line": "[returns] You can't take away a day off! We're just innocent children!"
    },
    {
        "character": "Stan",
        "line": "Dude, what asshole would take away a holiday?"
    },
    {
        "character": "",
        "line": "The school gym, later. An official sits behind a desks."
    },
    {
        "character": "Peter Galtman",
        "line": "My name is Peter Galtman. I am the head of the school calendar committee. [the people he's addressing are the parents and faculty of South Park Elementary] I've decided that school will not celebrate Columbus Day this year. I realize this is a hot-button issue for many families, but one parent in particular has really swayed my opinion with his passion. Mr. Randy Marsh. Mr. Marsh pointed out to me the hypocrisy of glorifying a genocidal murderer, and Mr. Marsh is right now also working on having the Columbus statue taken down in Canyon City."
    },
    {
        "character": "",
        "line": "Canyon City, day. In the town square, a magnificent statue of Columbus stands with a globe in its left hand and a telescope in its right hand."
    },
    {
        "character": "Randy",
        "line": "[runs up to the statue] Come on, everybody! Let's take this fuckin' thing down! [kicks it and punches it] Yeah, yehah! [punches it some more, with no effect] Take it down! Columbus was a mass murderer! [people gather to watch as Randy climbs up to the statue's head] Tear it down! Tear it down! Yeah! [grunts as he tries to take it apart] Hey, it's not working. [tugs at the head and grunts] We almost got it, guys! Come on, throw the rope, Stan! [a rope flies up towards him, with noose ready to go. He catches it and wraps it around the head] Good, that's good! Hit the gas, Nelson! [Peter Nelson pulls away with the rope tied to his car] We got it, everybody! To hell with you, Columbus! You guh-whoa! Whoa! [the statue topples to the right and falls apart. Randy falls with it, but isn't hurt]"
    },
    {
        "character": "",
        "line": "The Marsh house, evening. Stan sits on the couch watching TV when he gets a call from Kyle."
    },
    {
        "character": "Stan",
        "line": "Hey dude."
    },
    {
        "character": "Kyle",
        "line": "Dude! Did you know it's your dad did who's getting the school to cancel Columbus Day?"
    },
    {
        "character": "Stan",
        "line": "Yeah. Dude, I don't know what's going on. He's really serious about this."
    },
    {
        "character": "Kyle",
        "line": "Well, you've gotta do something. If you get him to back down, maybe the school will reconsider."
    },
    {
        "character": "Stan",
        "line": "I can't get him to back down."
    },
    {
        "character": "Kyle",
        "line": "Stan, I have to deal with my mom doing shit like this all the time, but she's never tried to take away a holiday. I'm your best friend, but I can't have your back when the guys find out about this."
    },
    {
        "character": "Stan",
        "line": "I'll try, okay. [glances up for a moment] Ok-I, I gotta go. [Randy walks up with his laptop and phone and sits next to Stan]"
    },
    {
        "character": "Randy",
        "line": "Okay, Stan, you got your phone? I need to call everyone on this list. They all live in the same city."
    },
    {
        "character": "Stan",
        "line": "Dad, listen: you need to ease off a little here."
    },
    {
        "character": "Randy",
        "line": "Stan, it's not right that people celebrate a man who wiped out millions of people for his own glory! [puts his phone up to his right ear] Let's go! [places his first call] Hello? Is this uh [checks his laptop screen] Howard Peterson? You live in Columbus, Ohio, is that correct? Yeah? You racist piece of shit. You heard me. You're an intolerant pig. Oh, you're not? You just choose to live in a city named for ethnic cleansing. No, fuck you! Rename your city, asshole! Hello? [evidently, the recipient hung up] Okay, next one, come on. Get calling, Stan!"
    },
    {
        "character": "Stan",
        "line": "Dad, come on. We all get your point, but don't you think you're overdoing it?"
    },
    {
        "character": "Randy",
        "line": "You have to overdo it in today's society Stan. You can't be nuanced and subtle anymore or else critics go \"Wow, what was the point of that?\" [places the next calls] Hi, Francis Melman? Hey, how are you, you fuckin' racist?"
    },
    {
        "character": "",
        "line": "An even more impressive statue of Columbus, lit up at night."
    },
    {
        "character": "Field Reporter",
        "line": "[the camera zooms out to include him] Christopher Columbus. Explorer, pioneer. Is he someone who should be appreciated, or was he just a douche? For years, Columbus Circle has been a landmark and photogenic intersection in New York City. So it came as a surprise when someone defecated on the statue earlier today. I'm joined now by the man who did the actual defecating, Mr. Randy Marsh of South Park, Colorado. [walks up to Randy, who's wearing an \"I poop on New York\" T-shirt, \"poop on\" replaced by a small picture of him pooping on \"New York\"]"
    },
    {
        "character": "Randy",
        "line": "Good evening."
    },
    {
        "character": "Field Reporter",
        "line": "Mr. Marsh, you took a dump on a beloved statue that's been an icon here in the city for years. What was your reasoning?"
    },
    {
        "character": "Randy",
        "line": "Well, I just have a problem with the racist people of this city. Yeehaw, [gets into a hick, redneck accent] I'm from New York! I drive around a big circle n' celebrates a guy who murdered Native Americans! Shoowee!"
    },
    {
        "character": "Field Reporter",
        "line": "So you're doing this because of indigenous peoples and their feelings."
    },
    {
        "character": "Randy",
        "line": "I don't care if people get indigenous, I'll crap all over their statues! I'm the one who's indigenous that this landmark even exists!"
    },
    {
        "character": "Field Reporter",
        "line": "Aah, aaah, bah, back to you, Tom."
    },
    {
        "character": "",
        "line": "South Park Elementary, lunch time. As kids sit down for lunch, a girl walks by with a tear streaming down her face. She sniffles. At the boys' table are seated Tolkien, Jimmy, Kyle, Clyde, Cartman, Kenny, and Butters."
    },
    {
        "character": "Butters",
        "line": "It ain't right. They make you work like a dog and then they just tear away your one day off in October like you're a piece of trash!"
    },
    {
        "character": "Stan",
        "line": "[shows up at table with his lunch] Hey guys. [takes a seat between Tolkien and Jimmy]"
    },
    {
        "character": "Cartman",
        "line": "Boo! Boo! Nobody likes you, Stan!"
    },
    {
        "character": "Stan",
        "line": "Look, I tried talking to him, alright? He's just really against all the things Columbus did."
    },
    {
        "character": "Jimmy",
        "line": "Does anyone know what Columbus actually did?"
    },
    {
        "character": "Cartman",
        "line": "Yeah. In fourteen hundred ninety-two, Columbus got us a day off skewl. That's what matters."
    },
    {
        "character": "Kyle",
        "line": "No! No, wait guys. Maybe that's it. When I'm dealing with my mom, sometimes it works to be on her side for a minute. Maybe we should find out all the things people find offensive about Columbus and-"
    },
    {
        "character": "Cartman",
        "line": "And totally act like we care. I like it, Kyle."
    },
    {
        "character": "Kyle",
        "line": "I'll just look up Columbus, offensive, inflammatory-"
    },
    {
        "character": "Cartman",
        "line": "Yeah, this is sweet. It's like that movie where the dude pretended to be on the monsters' side? You know, with the guy and the chick that had the wife beater on, but her boobs were sweaty so you could see them? [Kyle checks the search results]"
    },
    {
        "character": "Butters",
        "line": "I love that movie."
    },
    {
        "character": "Cartman",
        "line": "Yeah, this is a lot like that. What'd you find, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "Nnnothing."
    },
    {
        "character": "Butters",
        "line": "Dang it! There's nothing?"
    },
    {
        "character": "Kyle",
        "line": "Stan, can I talk to you for a minute? [leaves the table, and Stan follows]"
    },
    {
        "character": "Cartman",
        "line": "[now out of the loop] What? What? What the hell was that?"
    },
    {
        "character": "",
        "line": "The Marsh house, Randy's study. Randy is typing up something on his computer. Stan and Kyle walk in."
    },
    {
        "character": "Stan",
        "line": "Hey Dad?"
    },
    {
        "character": "Randy",
        "line": "Not now, Stan. I'm working on a proposal to change British Columbia to just British."
    },
    {
        "character": "Stan",
        "line": "But Dad, Kyle found a picture on Instagram. [shows Randy the pictures] It pretty much looks like you dressed as Columbus at a Halloween party. [Randy notices the picture, now shown close up]"
    },
    {
        "character": "Randy",
        "line": "Where did you get that?"
    },
    {
        "character": "Stan",
        "line": "If you hate Columbus so much, why did you dress like him?"
    },
    {
        "character": "Randy",
        "line": "Look, that was a long time ago, okay? It's just a dumb Halloween costume."
    },
    {
        "character": "Stan",
        "line": "Yeah but, [goes through the pictures he pulled off Instagram] here's you dressed as Columbus at a formal dinner, and here's you dressed as Columbus at a football game, and you as Columbus on St. Patrick's Day..."
    },
    {
        "character": "Randy",
        "line": "Look, I was younger! We were all... younger. It was another time. You have to understand, it was 2013. Everyone was stoked on Columbus back then."
    },
    {
        "character": "Stan",
        "line": "Yeah, but Dad, you seem to be really stoked on Columbus."
    },
    {
        "character": "Randy",
        "line": "If you guys found those pictures online, it's only a matter of time before everyone else does. People won't care about what I do now. They'll just see me as a thoughtless, indigenous son of a bitch."
    },
    {
        "character": "",
        "line": "The Marsh house, living room, some time later. Sharon walks up to him."
    },
    {
        "character": "Sharon",
        "line": "Randy, do you mind cleaning out the garage like I asked?"
    },
    {
        "character": "Randy",
        "line": "[moping] What's the point, Sharon? Soon they're gonna be coming after me."
    },
    {
        "character": "Sharon",
        "line": "Ach. [turns around and walks away]"
    },
    {
        "character": "Announcer",
        "line": "[a series of faces appear on tv, and Randy is interested] Hey, you! That's right, you! Wouldn't you like to know the story of you? What makes you you? DNAandMe is a genetic service that can help you find out exactly who your ancestors were. You might be surprised."
    },
    {
        "character": "Cyclist",
        "line": "[at Santa Monica Beach, stops] I thought I was just a standard white guy, but DNAandMe showed that I'm actually 4.2% Cherokee Indian."
    },
    {
        "character": "Woman 1",
        "line": "[doing curls] Turns out I'm not totally white. I'm also part Northern Asian and even some Kurdish. I'm a victim of oppression. [smiles]"
    },
    {
        "character": "Steve",
        "line": "[seated at his desk] I used to get in trouble for always using the N word. But with DNAandMe I found out that I'm 2.1% black."
    },
    {
        "character": "Office Worker",
        "line": "[walks by] 'Morning, Steve?"
    },
    {
        "character": "Steve",
        "line": "Sup, n*gga? [smiles]"
    },
    {
        "character": "Announcer",
        "line": "The test is easy. [a woman is shown swabbing her mouth for a DNA sample and putting it into a cuvette, then sealing that cuvette] Simply swab the inside of your mouth and send it into our lab."
    },
    {
        "character": "Driver",
        "line": "[behind the wheel] People made fun of me for being French. DNAandMe showed I was 8% Navajo. Nobody's makin' fun of me now, or my people, who are victims."
    },
    {
        "character": "Female Jogger",
        "line": "I'm 13% victim."
    },
    {
        "character": "Painter",
        "line": "I'm 21% victim."
    },
    {
        "character": "Announcer",
        "line": "Order now and find out if your friends should be more sympathetic towards you. DNAandMe. Are you in?"
    },
    {
        "character": "Randy",
        "line": "Hell fucking yes I'm in."
    },
    {
        "character": "",
        "line": "The Marsh house, day. There's a mellow party going on, with soft jazz musics. With everyone enjoying the ambiance, Randy comes down from the second floor, looks around, then goes back upstairs."
    },
    {
        "character": "",
        "line": "Randy's study. He goes inside the darkened room and closes the door."
    },
    {
        "character": "Randy",
        "line": "Alright, everyone's here. Let's do this. [in the room with him is a Native American (Bill), whom he walks up to. He opens a desk drawer and pulls out some money] Here you go, just like I said. A hundred dollars cash. No questions asked. Are we good? [Bill just looks him over] Good. No talking. Perfect. Okay, let's get this over with. [pulls Bill's face towards his own and gives him a long, passionate French kiss. Bill gets more and more surprised the longer the kiss continues. Randy suddenly stops the kiss] Thank you. Do not talk of this to anyone. [Bill just turns to watch him leave]"
    },
    {
        "character": "",
        "line": "The living room, moments later. Randy greets his guests."
    },
    {
        "character": "Randy",
        "line": "All right, everybody. Hey, thanks for comin'. If uh-I can have your attention, please? I think we're ready to get started."
    },
    {
        "character": "DNA test administrator",
        "line": "[holding a DNAandMe kit] Ahah, Mr. Marsh, you know, none of this was really necessary. For DNAandMe testing you can just swab the inside of your mouth yourself and send it in the mail."
    },
    {
        "character": "Randy",
        "line": "Yeah, I know, but I just, I was really excited, wanted everyone to witness my test."
    },
    {
        "character": "DNA test administrator",
        "line": "Well, to each their own I suppose. [opens the kit and pulls out a swab] All right, open wide. [Randy opens up and hums as the DNAandMe doctor moves the swab around the inside of his cheek. A shot of the Tuckers and Nelson eating hors d'oeuvres. The doctor takes the swab and puts it back in the kit] Okay, I'll get this back to the lab and get the results to you as quickly as possible."
    },
    {
        "character": "Randy",
        "line": "Okay, great. I'm very interested to see [begins speaking more slowly] what those results have to say."
    },
    {
        "character": "",
        "line": "A house, day. A woman sits in a rocking chair knitting a scarf. A cordless phone rings."
    },
    {
        "character": "Peter Galtman",
        "line": "[answers the phone] Galtman residence."
    },
    {
        "character": "Masked voice",
        "line": "Listen to me carefully. The man who convinced you to cancel Columbus Day is a fraud."
    },
    {
        "character": "Mr. Galtman",
        "line": "Who is this?"
    },
    {
        "character": "Masked voice",
        "line": "You will go online and search Instagram for images of Randy Marsh."
    },
    {
        "character": "Mr. Galtman",
        "line": "I most certainly will not!"
    },
    {
        "character": "Masked voice",
        "line": "Randy Marsh is a hypocrite and a fake. You will be taken down with him when he is exposed! [a shot of the boys' restroom at school. Kenny is the one who's masking his voice as Stan, Kyle, and Cartman look on]"
    },
    {
        "character": "Kyle",
        "line": "What's he saying?"
    },
    {
        "character": "Kenny",
        "line": "(Shhh! Don't interrupt!) [masked voice again] We know where you live and we know how to make you suffer!"
    },
    {
        "character": "Mr. Galtman",
        "line": "Now you listen here, Mr. Man! The Galtmans don't believe in social media or the Internet! It's all fake news!"
    },
    {
        "character": "Mrs. Galtman",
        "line": "Fake news."
    },
    {
        "character": "Kenny",
        "line": "[masked voice] Then speak with Marsh yourself! The truth is out there! [hangs up] (Well, I don't know if that worked.)"
    },
    {
        "character": "Mr. Galtman",
        "line": "Hm. [suspicion aroused] Sounds like maybe the Galtmans need to check out Randy Marsh."
    },
    {
        "character": "",
        "line": "The Marsh house,. Shelly's bedroom. She's drawing a pony on her bed when Randy bursts into the room."
    },
    {
        "character": "Randy",
        "line": "Shelly! We've got an emergency! We're getting rid of all the Columbus stuff in this house! Any Columbus costumes? Columbus pictures? They all gotta go!"
    },
    {
        "character": "Shelly",
        "line": "I don't give a shit about Columbus."
    },
    {
        "character": "",
        "line": "The kitchen. Sharon is washing dishes when Randy enters."
    },
    {
        "character": "Randy",
        "line": "Sharon! Peter Galtman called! He sounds suspicious! We've gotta get rid of all our Columbus shot glasses and coffee cups! Where are they?!"
    },
    {
        "character": "Sharon",
        "line": "YOUR Columbus shot glasses and coffee cups are in that cupboard."
    },
    {
        "character": "Randy",
        "line": "Shot, shot glasses, coffee cups, towels, plates. What about the Columbus figurine salt and pepper shakers?"
    },
    {
        "character": "Sharon",
        "line": "I don't know where YOU put them, Randy."
    },
    {
        "character": "Randy",
        "line": "[walks from the cupboard to the sink] Sharon, do you know what they'll do to us when they find out how we were so stoked on Columbus??"
    },
    {
        "character": "Sharon",
        "line": "YOU were stoked on Columbus, Randy. Not me."
    },
    {
        "character": "Randy",
        "line": "Oho, really?! Did you forget our wedding?! That's you, right there! [shows her the wedding picture. She's in a traditional wedding dress while Randy is dressed as Columbus] Standing there with a big smile on your face! You didn't say anything about it being insensitive then, did you?!"
    },
    {
        "character": "Sharon",
        "line": "I actually was a little upset that you dressed up as Columbus for our wedding, but I decided-"
    },
    {
        "character": "Randy",
        "line": "[moves from her right side to her left] Oh, NOW! You say that NOW 'cause everyone's freakin' out, but you were right there going along with it! [turns around and walks away, but turns around again] They're gonna be coming after you too, Sharon! So you can just wipe that indigenous look off your face! [the doorbell rings and Sharon's eyebrows rise up. Randy perks up] Oh! That could be my DNA results! Here, take this stuff out back! [drops it all next to Sharon and runs to the front door, only to find Bill at the door with a bouquet of flowers in his hand. Randy looks him over, and Bill gives him the bouquet] Oh... nooo, nonononono."
    },
    {
        "character": "Bill",
        "line": "I've never felt so alive until now."
    },
    {
        "character": "Randy",
        "line": "Thank you. Lo-lovely flowers. Thank, thank you. [shuts the door on the bouquet, which is crushed and falls apart]"
    },
    {
        "character": "",
        "line": "The Galtman house, day. Mrs. Galtman has made a lot of progress with the scarf. The phone rings."
    },
    {
        "character": "Mr. Galtman",
        "line": "[answers the phone] Galtman residence."
    },
    {
        "character": "Kenny",
        "line": "[masked voice] Listen carefully if you want to live. You will make this Monday a school holiday."
    },
    {
        "character": "Mr. Galtman",
        "line": "I spoke with Mr. Marsh and he denied any wrongdoing."
    },
    {
        "character": "Kenny",
        "line": "[talking from the boys' bathroom at school] Of course he did! That's what liars do!"
    },
    {
        "character": "Stan",
        "line": "I don't think you're being intimidating enough."
    },
    {
        "character": "Cartman",
        "line": "Yeah, get meaner, Kenny."
    },
    {
        "character": "Kenny",
        "line": "Meaner like now, dude?"
    },
    {
        "character": "Stan",
        "line": "I don't know, like, like uh, maybe say-"
    },
    {
        "character": "Cartman",
        "line": "Just talk about cutting off his dick or something."
    },
    {
        "character": "Kenny",
        "line": "[to Galtman] We're gonna cut off your dick!"
    },
    {
        "character": "Kyle",
        "line": "No dude, that's too far."
    },
    {
        "character": "Cartman",
        "line": "Okay, okay, just say we're gonna cut off part of his dick."
    },
    {
        "character": "Stan",
        "line": "Just give me the phone! Hello!"
    },
    {
        "character": "Mr. Galtman",
        "line": "What?"
    },
    {
        "character": "Stan",
        "line": "Randy Marsh is about to pay for what he's done! [shown on the phone] Protect him and you will pay too! Time is running out! [hangs up] Jesus!"
    },
    {
        "character": "",
        "line": "The Marsh house, master bedroom. Sharon is in bed reading a book when Randy enters."
    },
    {
        "character": "Randy",
        "line": "Sharon, have you seen my Columbus staff and orb?"
    },
    {
        "character": "Sharon",
        "line": "I have not. [Randy goes to the closet and start rifling through it]"
    },
    {
        "character": "Randy",
        "line": "Sharon, Galtman called again. Somebody's out there trying to get me in trouble!"
    },
    {
        "character": "Sharon",
        "line": "Randy, why don't you just admit to people that maybe you were somewhat overly excited about Columbus in the past?"
    },
    {
        "character": "Randy",
        "line": "Everyone was excited about Columbus! For some reason people are just pointing fingers at me! Just because he's suddenly not cool now doesn't mean I'm gonna be the effin' scapegoat! [leaves the room and closes the door]"
    },
    {
        "character": "",
        "line": "The front door. Randy is about to leave."
    },
    {
        "character": "Randy",
        "line": "I've gotta burn this stuff! [opens the door and sees Bill waiting for him with a drum and stick] Oh Goddamnit!"
    },
    {
        "character": "Bill",
        "line": "I wrote you a song to express my feelings for you."
    },
    {
        "character": "Randy",
        "line": "Will you get out of here?!"
    },
    {
        "character": "Bill",
        "line": "[bangs on the drum and chants, then] And then he kissed me."
    },
    {
        "character": "Randy",
        "line": "[hushed] I didn't kiss you 'cause I liked you!"
    },
    {
        "character": "Bill",
        "line": "[ignores him, bangs on the drum and chants, then] And then he kissed me."
    },
    {
        "character": "Randy",
        "line": "Okay, okay"
    },
    {
        "character": "Bill",
        "line": "[bangs on the drum and chants, then] And the sun began to shine."
    },
    {
        "character": "Randy",
        "line": "That's it! Get off my property! [turns him around and shoves him towards the sidewalk]"
    },
    {
        "character": "Bill",
        "line": "Randy, I cannot quit you."
    },
    {
        "character": "Randy",
        "line": "Get off my land, you piece of shit! [kicks him to the curb]"
    },
    {
        "character": "Bill",
        "line": "Uuugh! [they both look around. Randy sees a jogger across the street with his phone]"
    },
    {
        "character": "Randy",
        "line": "Don't post that. [a few seconds pass] Do not. Post that. [the jogger takes off. Randy drops the staff and orb, and gives chase] Shit!"
    },
    {
        "character": "",
        "line": "The school playground, recess. The boys now sit around a merry-go-round. Clyde stands next to them. All of them have sad faces. Cartman walks up to them."
    },
    {
        "character": "Cartman",
        "line": "Guys, what are you going?"
    },
    {
        "character": "Butters",
        "line": "It's over, Eric. We have to come to school on Monday. Just face it."
    },
    {
        "character": "Cartman",
        "line": "I'm not facing anything. We still have time. There has to be a way-"
    },
    {
        "character": "Kyle",
        "line": "Dude, there's nothing we can do, all right?"
    },
    {
        "character": "Cartman",
        "line": "Oh okay. I see. Is that what Columbus did? Just give up? On his dream? No! Columbus believed that kids should have a day off skewl! And even when his own country wouldn't support his cause, Columbus said \"Fine! I'll go find a new land, where kids can have that day off!\""
    },
    {
        "character": "Jimmy",
        "line": "Eric, just l-let it go."
    },
    {
        "character": "Cartman",
        "line": "And when Columbus sailed to distant places only to find people already there who said \"No! Stay off our land! We want our kids to have to go to skewl!\", he said \"No! It's just one day in October! They need a break!\"\nYou guys can all give up, but I'm not.\nBecause in 1492, Columbus got us all a day off skewl.\nWith just three ships he sailed over so we could have some me time in October.\nAnd yes, millions were slaughtered and throats were cut\nBut if we don't get that day off of school, then... for what?\n\n\n"
    },
    {
        "character": "Kyle",
        "line": "Come on, guys. [stands up on the merry-go-round] There's something else we can try."
    },
    {
        "character": "",
        "line": "The Marsh bathroom, day. Sharon is on the toilet urinating, while reading stuff on her phones. Randy opens the door."
    },
    {
        "character": "Randy",
        "line": "[excited] Sharon, good news!"
    },
    {
        "character": "Sharon",
        "line": "What??"
    },
    {
        "character": "Randy",
        "line": "The people from the DNA test called. They're on their way over. You wanna come down?"
    },
    {
        "character": "Sharon",
        "line": "I'm doing something."
    },
    {
        "character": "Randy",
        "line": "You sure? These results could be really interesting. [Sharon stays quiet, so he heads downstairs]"
    },
    {
        "character": "",
        "line": "The living room. Randy sees Bill."
    },
    {
        "character": "Randy",
        "line": "Oh Goddammit, what the hell do you want?"
    },
    {
        "character": "Bill",
        "line": "I want you to stop running from yourself. We could be so happy. [the doorbell rings]"
    },
    {
        "character": "Randy",
        "line": "Crap, it's them! [to the front door] Just a second, be right there. Thanks! [turns around and shoves Bill towards the back door] Get over here! I don't have any feelings for you. Do you understand?!"
    },
    {
        "character": "Bill",
        "line": "But Randy, what about the-"
    },
    {
        "character": "Randy",
        "line": "[shoves him out the back door] NO! No buts! There is nothing here! I'm not in love with you! Got it?!"
    },
    {
        "character": "Bill",
        "line": "Yes. Yes, I understand."
    },
    {
        "character": "Randy",
        "line": "Good! Now leave! [goes to the front door, and lets the DNAandMe folks in] Hi, sorry. You guys have my results?"
    },
    {
        "character": "DNA test administrator",
        "line": "Well, Mr. Marsh, we came because there was an irregularity with your test."
    },
    {
        "character": "Randy",
        "line": "Well what? You found something there you didn't expect to find? What is it?"
    },
    {
        "character": "DNA test administrator",
        "line": "Well it's just a little too odd. We need to do the test again."
    },
    {
        "character": "Randy",
        "line": "Do it again? That's not fair."
    },
    {
        "character": "DNA test administrator",
        "line": "Mr. Marsh, please. If we could have one more sample. We want to be absolutely sure of what we found."
    },
    {
        "character": "Randy",
        "line": "Agh-uh oh, okay, no problem. [begins to back up] Give me, give me one sec. I'll be right back. [turns and runs to the back door, opens it, and runs out] Wait! [looks to his left] Wait! [runs up to the Native American and kisses him in the mouth again, and just as before, stops and leaves, this time to go back inside and to the living room] Okay! Okay, all set. Let's do this. Aaaaa-"
    },
    {
        "character": "DNA test administrator",
        "line": "Mr. Marsh, we were hoping to do a more precise test. It's better for harder cases like this, but... it is an anal swab this time. [prepares the kit]"
    },
    {
        "character": "Randy",
        "line": "An anal swab? Give me tuh, three minutes. [backs up and runs out the back door again, looking for the Native American.] Hey, where'd you go? [the doctor walks up behind him and puts his right hand on Randy's shoulder]"
    },
    {
        "character": "DNA test administrator",
        "line": "Mr. Marsh, we're in a bit of a hurry, if you don't mind. [pulls him back inside]"
    },
    {
        "character": "Randy",
        "line": "Oh, aw shit. [the assistant closes the door]"
    },
    {
        "character": "",
        "line": "South Park, day. The Marsh house. Cartman opens the front door and enters."
    },
    {
        "character": "Cartman",
        "line": "[wearing a horse head mask] All right, it's clear. Bring him in. [Stan, wearing a pig head mask, and Kyle, wearing a rabbit head mask, pull Mr. Galtman inside]"
    },
    {
        "character": "Kenny",
        "line": "[wearing a pigeon head mask, using his Mysterion voice] Move your ass, Galtman!"
    },
    {
        "character": "Mr. Galtman",
        "line": "This is a violation of my rights."
    },
    {
        "character": "Stan",
        "line": "Just shut up, and watch what someone posted on their Instagram!"
    },
    {
        "character": "Mr. Galtman",
        "line": "I most certainly will not! If you want me to look at the Internet, I will die first. It's fake news!"
    },
    {
        "character": "Kyle",
        "line": "[as Stan puts a tape into the VCR] That's why we had it transferred to VHS."
    },
    {
        "character": "Mr. Galtman",
        "line": "Oh, VHS is fine."
    },
    {
        "character": "Kenny",
        "line": "Take off his blindfold. [Kyle does so. Stan presses play, and the scene of Randy kicking the Native American to the curb is shown]"
    },
    {
        "character": "Mr. Galtman",
        "line": "Hmmm..."
    },
    {
        "character": "",
        "line": "DNAandMe headquarters, night. Randy sneaks around the hallways of the place. He reaches the specimen room, faces the door, and pulls out a lock pick. He inserts the pick in the door lock to try to open it. The doctor and two lab workers walk up behind him."
    },
    {
        "character": "DNA test administrator",
        "line": "Oh, Mr. Marsh."
    },
    {
        "character": "Randy",
        "line": "Whoa, ha-hay. [turns around] How are you? [smiles nervously]"
    },
    {
        "character": "DNA test administrator",
        "line": "Good. Wha-what are you up to?"
    },
    {
        "character": "Randy",
        "line": "Chillin', chillin'."
    },
    {
        "character": "DNA test administrator",
        "line": "Well, uhhh, we did get your DNA results back this morning. Would you like to go over them?"
    },
    {
        "character": "Randy",
        "line": "Oh, you did? Oh, great. Sure, why not? Uh, I'm here. Huh let's uh, let's do that."
    },
    {
        "character": "",
        "line": "The lab room, moments later"
    },
    {
        "character": "DNA test administrator",
        "line": "N'all right Mr. Marsh, here's your DNAandMe portfolio. [starts the presentation] This shows that we actually found a mix of a few things in you regional ancestry."
    },
    {
        "character": "Randy",
        "line": "[jumps up and stands] Really? Like Native American? Like a, like a little bit?"
    },
    {
        "character": "DNA test administrator",
        "line": "Nno, we didn't find any trace of any Native American DNA in your test."
    },
    {
        "character": "Randy",
        "line": "Nnnuts! [sits down]"
    },
    {
        "character": "DNA test administrator",
        "line": "But as you can see here [click], we found that you are about 43% Northern European, 37% Mediterranean, and 18% Southwest Asian. In fact, your genetic profile most closely matches [clicks] your standard Caucasian British person."
    },
    {
        "character": "Randy",
        "line": "[sighing] Awww."
    },
    {
        "character": "DNA test administrator",
        "line": "And, you might be interested to know that you're actually 2.8% Neanderthal, which is fairly high."
    },
    {
        "character": "Randy",
        "line": "Neander-thal? What the hell is that about?"
    },
    {
        "character": "DNA test administrator",
        "line": "Well, the Neanderthals were actually a species that was wiped out by Homo sapiens."
    },
    {
        "character": "Randy",
        "line": "Wiped out? All of my people?"
    },
    {
        "character": "DNA test administrator",
        "line": "Yes, but you see, because of some cross-breeding, some people like you still possess Neanderthal DNA. Isn't that interesting?"
    },
    {
        "character": "Randy",
        "line": "Cross-breeding? You mean rape. You're telling me that my ancestors were raped, and then eradicated by you? You maniacs! [kicks the chair out of the way] The earth wasn't big enough for Neanderthals, so your ancestors just got rid of them, huh?! Well TO HELL WITH ALL OF YOU!! [knocks over a tool cart and leaves]"
    },
    {
        "character": "",
        "line": "The Marsh house, night. Randy pulls into his driveway and walks towards the house in a sad state. He goes inside, closes the door, and is surprised at what he sees. Mr. Galtman stands with the four boys near the dining room."
    },
    {
        "character": "Mr. Galtman",
        "line": "Well well, Mr. Marsh. I'd like to have a word, please."
    },
    {
        "character": "Randy",
        "line": "[walks up to him and punches him out with one blow] You find this funny, Galtman!"
    },
    {
        "character": "Mr. Galtman",
        "line": "What'd I do?"
    },
    {
        "character": "Randy",
        "line": "Nobody had the guts to tell me what happened to my people, huh? Get the hell out of here! [opens the front door and Bill is back]"
    },
    {
        "character": "Bill",
        "line": "I brought my parents over so you could meet them."
    },
    {
        "character": "Randy",
        "line": "Waww God!"
    },
    {
        "character": "Bill",
        "line": "Don't worry. My parents are very okay and cool with us."
    },
    {
        "character": "Stan",
        "line": "Who the hell is that?"
    },
    {
        "character": "Randy",
        "line": "Yeah, sure! Everyone gang up on the Neanderthal! Isn't it funny!"
    },
    {
        "character": "Bill",
        "line": "Randy, you must face who you are. Stop pretending, Randy. For once, just allow yourself to feel."
    },
    {
        "character": "Randy",
        "line": "[moves away from the others] You're right. [Galtman stands up and they all look at Randy again] You're right. It's only now, when everyone is being so indigenous to me, that I realized... how indigenous I've been acting all along. I thought being a victim would solve all my problems. But being a victim has a down side too. [walks up to Galtman] Mr. Galtman, I haven't been honest. It's time for us all... to be honest."
    },
    {
        "character": "",
        "line": "South Park Elementary, day. A stage, mic, and podium have been prepared at the school entrance, and Randy is at the podium. Before him are the faculty, parents and students of the school."
    },
    {
        "character": "Randy",
        "line": "What is a holiday? It's a day off work, yes. A day off school. But holidays are also meant to be a time to reflect. Today, I'm happy to announce that the school calendar committee is reinstating the day off. [the kids cheer] But instead of glorifying anyone, Let us make it a holiday about the negative feelings that we all sometimes feel. Say what we're really thinking so we can move on. And so, the second Monday in October will still be a holiday, but instead of Columbus Day, it will be for ripping on each other and tearing each other down. And we will call it Indigenous Peoples Day. For perhaps if we all do it at the same time, we won't be so indigenous the rest of the year. And since this is the second Monday of October, let's all embrace the new meaning of the holiday starting right now."
    },
    {
        "character": "Dave",
        "line": "Do you even know what indigenous means, you freakin' idiot?!"
    },
    {
        "character": "Randy",
        "line": "That's the spirit, Dave. Come on, everybody, let's just all be totally indigenous. Come on!"
    },
    {
        "character": "Kurt",
        "line": "Who the hell let this guy talk to the school council?"
    },
    {
        "character": "Randy",
        "line": "Good one Kurt. Your wife's a whore. Come on, everyone! Indigenous People's Day! Let's go for it!"
    },
    {
        "character": "Woman 2",
        "line": "Shut up and get off the podium! [people begin to leave]"
    },
    {
        "character": "Randy",
        "line": "Okay, I will in a second, fatso. All right, who else? Come on! Get it out of your system! Happy Indigenous People's Day, everyone. Suck my asshole!"
    }
]