[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park, a rainy night. A girl screams"
    },
    {
        "character": "Crystal",
        "line": "Mommy! Momm-mmy! [her bedroom door opens and her parents walk in. Her dad flicks on the lights] He's gonna get me!"
    },
    {
        "character": "Bob White",
        "line": "Honey, honey, who's gonna get you?"
    },
    {
        "character": "Crystal",
        "line": "The President! I saw him! He's gonna get me!"
    },
    {
        "character": "Bob White",
        "line": "Crystal, the President isn't going to get you."
    },
    {
        "character": "Crystal",
        "line": "But I saw him!"
    },
    {
        "character": "Bob White",
        "line": "[to his wife] See what I told you? It's that liberal school she's going to, filling her head with all kinds of garbage! Sweetie, the President is doing the best job he can. Your liberal school is just trying to convince you he's dangerous."
    },
    {
        "character": "Crystal",
        "line": "But Daddy, he's getting-"
    },
    {
        "character": "Bob White",
        "line": "Uh uh, no buts! The President is in the White House, not here trying to get you. Okay?"
    },
    {
        "character": "Crystal",
        "line": "Oh-kaaay?"
    },
    {
        "character": "Bob White",
        "line": "All right. [he and Mom walk out the door, and he tells Mom] We're having a talk with that school in the morning! [turns to Crystal] Good night, honey. [turns off the lights, and the couple goes to their room. Thunder and lightning get Crystal out of bed and she goes to her window. She sees a shadow on the walkway outside. When lightning flashes, she sees it's indeed the President.]"
    },
    {
        "character": "Garrison",
        "line": "Hey! How are my approval ratings?! [Crystal runs back to bed]"
    },
    {
        "character": "",
        "line": "Kyle's room, 8:57 p.m. He's moping at the foot of his bed."
    },
    {
        "character": "Reporter",
        "line": "And the latest reports are now saying that over a million Canadians were killed in the nuclear blast. The bomb dropped by the U.S. President took out the entire city of Toronto, and fallout is expected to kill thousands more in the coming days. [A moment of silence follows, and Ike appears at Kyle's door.]"
    },
    {
        "character": "Kyle",
        "line": "Ike... Ike, I'm sorry that I caused a nuclear bomb to be dropped on Canada. I was just- you know, I was just trying to get shows that were toxic taken down. You know, those shows can be really harmful."
    },
    {
        "character": "Ike",
        "line": "Ohhh, stop being a victim! Jesus Christ! [turns left and walks away. Kyle is left with his jaw dropped, then goes back to moping]"
    },
    {
        "character": "",
        "line": "South Park, Elementary, day. It's raining outside. The Principal's office. A father is expressing his concerns"
    },
    {
        "character": "Bob White",
        "line": "What I wanna know is, what gives you the right to preach your political views to my children?! Our daughter woke up with nightmares that the President was going to get her! Just because two liberals happen to be principal and vice principal doesn't mean you can brainwash my kids!"
    },
    {
        "character": "PC Principal",
        "line": "Uh, we sort of have some bigger problems right now, Mr. Uh..."
    },
    {
        "character": "Bob White",
        "line": "It's White. Bob White. You probably never even heard of our family, huh? Well, the Whites have been here since the beginning! Not that it matters, 'cause no one cares about the Whites. Sure, everyone else has problems, but does anyone ask the Whites how they're doing?!"
    },
    {
        "character": "Strong Woman",
        "line": "Mr. White, we assure you that we run this school in a very [glances at PC Principal] professional manner and don't let [glances again] personal emotions get in the way. [glances again. He looks back, and their eyes are locked]"
    },
    {
        "character": "Bob White",
        "line": "Oh, sure you don't! You know how hard I had to fight to even get this meeting with you?! \"Oh, who wants to talk to the administration? Oh, it's just the Whites? Oh, who cares about the Whites? They're fine!\" Well, we've just about had with you, you understand? [a song plays that drowns out Mr. White's rant: Barbara Mandrell - \"(If Loving You Is Wrong) I Don't Want To Be Right\"] And damn it, we won't be ignored!"
    },
    {
        "character": "Mrs.White",
        "line": "[hearing the song somehow] I'm sorry, is anyone else hearing \"(If Loving You Is Wrong) I Don't Want To Be Right\" very very quietly?"
    },
    {
        "character": "Strong Woman",
        "line": " Uh, no. Mr. and Mrs. White, we promise that we will not let anything happen that might bring the integrity of this school into question."
    },
    {
        "character": "Bob White",
        "line": "Guess that's all the Whites can hope for these days."
    },
    {
        "character": "",
        "line": "South Park, night. Someone is riding a bike in the rain. It's Tweek. He notices something off to his left - a red balloon - on which is written \"Make America Great Again.\" The balloon pops, revealing President Garrison"
    },
    {
        "character": "Garrison",
        "line": "Hey!"
    },
    {
        "character": "Tweek",
        "line": "Aaaagh!"
    },
    {
        "character": "Garrison",
        "line": "How are my approval ratings?"
    },
    {
        "character": "Tweek",
        "line": "It's the President! Gaaahhh! [rides away quickly]"
    },
    {
        "character": "Garrison",
        "line": "Wait, come back! What's wrong?"
    },
    {
        "character": "",
        "line": "Sepcial Report, with Bill Keegan"
    },
    {
        "character": "Bill Keegan",
        "line": "Still no word from the President, as his Splatty Tomato approval rating drops to an unprecedented 3%. This puts the President four points below Nut Job 2: Nutty By Nature. Meanwhile, the Canadian Prime Minister, Justin Trudeau called upon Canadians to stand strong."
    },
    {
        "character": "Justin Trudeau",
        "line": "[stands behind a tattered podium with a Canadian flag on it.] Make no mistake, America! If you do not hand over your President, there will be war the likes of which you have never seen! Canadians will rise together! I call on all Canadians here and abroad to stand with their country! The U.S. President must answer for his crime, and only Canada can bring him to justice! [Trudeau himself was bombed, as he is charred and tattered as well. Ike, having seen the broadcast, gets angry and walks off]"
    },
    {
        "character": "",
        "line": "A bus bench, day. Craig and Tweek sit on it, Tweek shivering from his encounter with the President. Tweek grumbles."
    },
    {
        "character": "Craig",
        "line": "[pats him on the shoulder] There there, Tweek. Everything is going to be okay."
    },
    {
        "character": "Tweek",
        "line": "I saw what I saw, Craig! You have to believe me!"
    },
    {
        "character": "Kyle",
        "line": "[Him and Stan walk up with their bikes] What's going on?"
    },
    {
        "character": "Craig",
        "line": "Tweek's having a panic attack."
    },
    {
        "character": "Tweek",
        "line": "It was real! He tried to get me!"
    },
    {
        "character": "Kyle",
        "line": "Who did?"
    },
    {
        "character": "Tweek",
        "line": "The President! [Stan looks away, as if Tweek's statement hit close to home]"
    },
    {
        "character": "Craig",
        "line": "It's just your imagination, Tweek."
    },
    {
        "character": "Stan",
        "line": "It's not his imagination. I saw him too."
    },
    {
        "character": "Kyle",
        "line": "You saw the President?"
    },
    {
        "character": "Stan",
        "line": "Out by the quarry. But I didn't believe it. I said, \"How could this be...\""
    },
    {
        "character": "Heidi",
        "line": "...\"The President?\" [Her and Cartman walk up with their bikes] I saw him too. He had a blue suit and an orange face. He kept asking me \"How are my ap...\""
    },
    {
        "character": "Tolkien",
        "line": "\"...How are my approval ratings?\" [walks up with his bike] I saw him too."
    },
    {
        "character": "Stan",
        "line": "Dude, isn't this all really familiar? I saw something just like this on that show called Stranger..."
    },
    {
        "character": "Randy",
        "line": "[rides up on his bike] ...Stranger Things. Stranger Things is the show. I saw it too."
    },
    {
        "character": "Craig",
        "line": "But wait, isn't Stranger Things just like that movie-?"
    },
    {
        "character": "Cartman",
        "line": "Just like that movie It."
    },
    {
        "character": "Randy",
        "line": "You saw It too?"
    },
    {
        "character": "Cartman",
        "line": "Yeah, I saw It in the theater."
    },
    {
        "character": "Tolkien",
        "line": "I saw Stranger Things AND It."
    },
    {
        "character": "Randy",
        "line": "Jesus. I don't think anyone's imagining anything. I think the President IS here. You kids get inside somewhere. I have to warn the town! [gets on his bike and rides off, only to fall on his face a few seconds later.] Aw!"
    },
    {
        "character": "",
        "line": "Town meeting, night. A crowd has gathered inside, and all the townsfolk are talking"
    },
    {
        "character": "Mayor McDaniels",
        "line": "All right, people. People, please! We need everyone to try and stay calm."
    },
    {
        "character": "Townsman 1",
        "line": "How can we stay calm while the President's out there scaring our children?!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Look, we all want the President out of here. It's just a matter of how we do it. I know you all want to get rid of him."
    },
    {
        "character": "Bob White",
        "line": "That's not true! The Whites still support the President"
    },
    {
        "character": "Randy",
        "line": "Oh, for fuck's sake, White, he's running around eating our pets and terrorizing our kids!"
    },
    {
        "character": "Bob White",
        "line": "You think Hillary would have been any better?!"
    },
    {
        "character": "Townsfolk",
        "line": "Aw! Come on! Sit down, Bob!"
    },
    {
        "character": "Bob White",
        "line": "[Sits down] I'm just sayin', I'm just sayin'"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Listen, everyone. I have a team right now that's trying to locate the President, and I'd like you to hear from Officer Bright, who's leading the search. [the officer adjusts his pants and walks up to the podium]"
    },
    {
        "character": "Officer Bright",
        "line": "Hey folks, we know you're all uh concerned, but I wanna assure you that we're doing everything we can to track the President down and have him safely removed. Since the President was given a Splatty Tomato he's become very desperate and very dangerous. If you see the President, do not approach him. Do not try to reason with him. Most importantly, remember that this is the President, so you cannot shoot him. All right? You can't even talk about shooting him. Don't even... do any coy, satirical takes on shooting him. [the room stays silent] Okay, good. What we're trying to do here is just get the President to go away. We're gonna be handing out padlocks like this one [lifts one up for display] so everyone can lock up their garbage. If we don't feed the President, hopefully he'll just move on. Are there any questions?"
    },
    {
        "character": "Townsman 2",
        "line": "Can we talk about a friend shooting him if it's in sort of a sarcastic way?"
    },
    {
        "character": "Officer Bright",
        "line": "No, no, no. It's just best to avoid that kind of talk altogether. Remember, they can do to you what they did to Kathy Griffin."
    },
    {
        "character": "Randy",
        "line": "Make her not funny for thirty years?"
    },
    {
        "character": "Officer Bright",
        "line": "That's right, so best thing is just lock up your garbage and see if we can get the President to... go away."
    },
    {
        "character": "",
        "line": "South Park, night. An officer is tacking posters of missing Ike onto community boards throughout town. Stan, Cartman, Heidi, Craig, and Tweek watch as the officer finishes his work on one particular board and moves on"
    },
    {
        "character": "Stan",
        "line": "Jesus. Now kids are going missing."
    },
    {
        "character": "Tweek",
        "line": "We're all going to be missing soon! Nyaaarg!"
    },
    {
        "character": "Stan",
        "line": "[notices Kyle across the street walking by] Kyle! [the kids walk up to him]"
    },
    {
        "character": "Kyle",
        "line": "It's my fault. Ike went to go take matters into his own hands. I have to find him."
    },
    {
        "character": "Craig",
        "line": "We'll help you."
    },
    {
        "character": "Stan",
        "line": "We'll all help you."
    },
    {
        "character": "Cartman",
        "line": "Guys this could be very dangerous."
    },
    {
        "character": "Heidi",
        "line": "You're not going. You promised that tonight, we would have a date night."
    },
    {
        "character": "Cartman",
        "line": "Darling this is a little more pressing than date night."
    },
    {
        "character": "Heidi",
        "line": "Oh great. So Kyle's stupid brother goes missing, and I get fucked. How come I'm always the one getting shit on around here?"
    },
    {
        "character": "Kyle",
        "line": "I don't need anyone to go with me."
    },
    {
        "character": "Heidi",
        "line": "Oh what's the matter, Kyle? Don't want me around because you had the hots for me and I shut you down?"
    },
    {
        "character": "Kyle",
        "line": "I would never have the hots for the person you are now."
    },
    {
        "character": "Stan",
        "line": "Come on you guys. Look, we all know what we're supposed to do now We all saw \"It\" and \"Stranger Things\". We need to get our backpacks and go out to the woods and save the town from evil to some kick-ass '80s' music!"
    },
    {
        "character": "",
        "line": "Meanwhile at De Faggoncini Italian, Butters, the Vice Principal  and PC Principal walk trhough the door. Butters wears a message on his shirt saying 'Student of the Day'."
    },
    {
        "character": "Waiter",
        "line": "Hello, joining us for lunch today?"
    },
    {
        "character": "PC Principal",
        "line": "Uh, yes. We are here with our student of the day to reward him lunch with the principal and vice principal."
    },
    {
        "character": "Strong Woman",
        "line": "We have a reservation."
    },
    {
        "character": "Waiter",
        "line": "Okay, last name?"
    },
    {
        "character": "Strong Woman",
        "line": "Woman."
    },
    {
        "character": "Waiter",
        "line": "First name?"
    },
    {
        "character": "Strong Woman",
        "line": "[Takes a deep breath] Strong."
    },
    {
        "character": "Waiter",
        "line": "Oh, yes, Strong Woman, here we are. We have a nice booth set up for you."
    },
    {
        "character": "Strong Woman",
        "line": "We can't keep doing this. People are gonna see through it."
    },
    {
        "character": "PC Principal",
        "line": "Is it my fault that I found the most amazing, perfect, beautiful woman...at work?"
    },
    {
        "character": "Strong Woman",
        "line": "Nobody will understand."
    },
    {
        "character": "PC Principal",
        "line": "Maybe they will. We're co-worker who are in love. You really think that's going to bother people?"
    },
    {
        "character": "Butters",
        "line": "Well, should we order now?"
    },
    {
        "character": "",
        "line": "Bob White comes out of his house with some food. He then starts whistling. He then proceeds to put the food on the floor but is stopped."
    },
    {
        "character": "Randy",
        "line": "What are you doing, Bob?"
    },
    {
        "character": "Bob White",
        "line": "Aah!"
    },
    {
        "character": "Randy",
        "line": "[Randy is joined by Steven, Linda, Sharon and Roger] Have you been putting food out for the president?"
    },
    {
        "character": "Bob White",
        "line": "No, I was just, uh, taking these sandwiches to the trash."
    },
    {
        "character": "Randy",
        "line": "We all agreed not to feed him so he'd go away."
    },
    {
        "character": "Bob White",
        "line": "We didn't all agree! You all agreed! Nobody asked the Whites how they felt! Nobody cares what the Whites have to say!"
    },
    {
        "character": "Randy",
        "line": "Bob, come on. You have to know it's not safe to have him here."
    },
    {
        "character": "Bob White",
        "line": "In 2003, Hillary Clinton admitted to taking funds for her foundation from foreign diplomats!"
    },
    {
        "character": "Randy",
        "line": "What's that got to do with anything, Bob? Come on."
    },
    {
        "character": "Bob White",
        "line": "It's fucking true!"
    },
    {
        "character": "Randy",
        "line": "Bob, if Canada finds out the president is hiding here, they are going to nuke us. He needs to go."
    },
    {
        "character": "Bob White",
        "line": "Hillary wouldn't have been any better."
    },
    {
        "character": "Randy",
        "line": "Give me the finger sandwiches."
    },
    {
        "character": "Bob White",
        "line": "Fine! Go ahead and take the White's sandwiches! They've taken everything else!"
    },
    {
        "character": "",
        "line": "As the boys begin their journey \"The Chicago Bears' The Super Bowl Shuffle\" plays."
    },
    {
        "character": "Stan",
        "line": "Due, this is '80's' music?"
    },
    {
        "character": "Craig",
        "line": "Yeah. It's Pandora. '80s' channel."
    },
    {
        "character": "Stan",
        "line": "Well, just skip to the next song, man. We're trying to get psyched to destroy evil. We need better '80s' music than that."
    },
    {
        "character": "",
        "line": "As the boys continue, \"Gloria\" plays. Heidi stops as the boys go over a bridge."
    },
    {
        "character": "Cartman",
        "line": "Heidi? Honey, what are you doing?"
    },
    {
        "character": "Heidi",
        "line": "This is the place... This is the place where I ended it all, remember? This is where I threw my phone of the bridge and quit Twitter for good. [The camera pans to the left to show Heidi's ghost] I was so different then... so naive and hopeful. [The ghost throws the phone in the river after tweeting her final goodbye]"
    },
    {
        "character": "Cartman",
        "line": "Yes honey, now can we get going, please?"
    },
    {
        "character": "Heidi",
        "line": "I'm sorry! I'm trying to have a moment here! This is where our whole relationship started asshole!"
    },
    {
        "character": "Cartman",
        "line": "Yes, it's very touching, sweetheart. I love you so much. [Quietly] I'm sorry about this, you guys."
    },
    {
        "character": "Heidi",
        "line": "[The ghost turns to face herself] I remember feeling like I had nobody. Skinny bitch."
    },
    {
        "character": "Kyle",
        "line": "We need to keep going guys."
    },
    {
        "character": "",
        "line": "Over at the Mayor's office."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Don't tell me you haven't gotten the President out of here."
    },
    {
        "character": "Officer Bright",
        "line": "We haven't gotten the president out of here. And there's some worse news. A bunch of kids have gone missing."
    },
    {
        "character": "Mayor McDaniels",
        "line": "What?"
    },
    {
        "character": "Officer Bright",
        "line": "I think we have to assume that the President has... eaten them. [Mrs Tweak starts crying]"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Why are you here talking to me instead of trying to find the President?"
    },
    {
        "character": "Officer Bright",
        "line": "Don't worry, we're close. He's out in the woods somewhere. And we've set up a fox trap."
    },
    {
        "character": "Mayor McDaniels",
        "line": "A fox trap?"
    },
    {
        "character": "",
        "line": "The president is watching a mouse, grabs it and eats it. He then sees Fox News with a man sitting waiting."
    },
    {
        "character": "Garrison",
        "line": "Oh, Fox News... They'll listen to me. They'll get my side of the story right!"
    },
    {
        "character": "Bob White",
        "line": "[He whistles the bird call of the bobwhite quail to get Garrison's attention] It's a trap!"
    },
    {
        "character": "Garrison",
        "line": "What?"
    },
    {
        "character": "Bob White",
        "line": "It's a Fox trap, Mr. President!"
    },
    {
        "character": "Garrison",
        "line": "Oh, thank God for the Whites."
    },
    {
        "character": "",
        "line": "The boys venture on as \"Hold On to the Nights\" plays."
    },
    {
        "character": "Kyle",
        "line": "Ike! Ike?"
    },
    {
        "character": "Stan",
        "line": "Dude, come on! This is not kick-ass '80s' music!"
    },
    {
        "character": "Craig",
        "line": "\"Hold On to the Nights\" Richard Marx, 1988."
    },
    {
        "character": "Tweek",
        "line": "Do we really need music?"
    },
    {
        "character": "Stan",
        "line": "Yeah! Craig just has the wrong stuff. Forget your pandora. I'm doing Spotify. '80s' music. 'Kay. There. [\"Pac-Man Fever\" plays]"
    },
    {
        "character": "Craig",
        "line": " Oh, yeah. That's better."
    },
    {
        "character": "Kyle",
        "line": "Can we go please?!"
    },
    {
        "character": "",
        "line": "The boys come up to the log cabin."
    },
    {
        "character": "Kyle",
        "line": "Here it is. [Opens the door] Ike?"
    },
    {
        "character": "Heidi",
        "line": "Wait a minute... Isn't this the place you brought me before? The place you said your friends smashed your phone and computer...? I remember I felt so bad for you. We used to sit in the part and talk for hours. How come we never do that anymore?"
    },
    {
        "character": "Cartman",
        "line": "Oh, fuck. Here we go."
    },
    {
        "character": "Heidi",
        "line": "Here we go what?! You used to be so nice to me."
    },
    {
        "character": "Cartman",
        "line": "You used to be nice to me!"
    },
    {
        "character": "Heidi",
        "line": "I tired! But then you started rolling your eyes every time I tried to talk to you!"
    },
    {
        "character": "Cartman",
        "line": "Ughhhh..."
    },
    {
        "character": "Kyle",
        "line": "He's not here either."
    },
    {
        "character": "Craig",
        "line": "Dude, maybe your brother didn't even go looking for the President."
    },
    {
        "character": "Kyle",
        "line": "You don't understand Canadians. They're fiercely loyal to their country. When Canada is attacked, they all join in the fight."
    },
    {
        "character": "",
        "line": "Ike is seen riding a dog. He uses a pair of binoculars to look around. He then picks some poo up, breaks it in half and sniffs it, he then proceeds to get back on his dog."
    },
    {
        "character": "",
        "line": "Randy and a few other parents are looking around in the woods. He uses a flashlight."
    },
    {
        "character": "Jimbo",
        "line": "Randy! Randy!"
    },
    {
        "character": "Randy",
        "line": "What?"
    },
    {
        "character": "Jimbo",
        "line": "They got him! They found the President!"
    },
    {
        "character": "Officer Bright",
        "line": "We found his hideout. There. Someone's gotta go flush him out. I'll be ready to trap him."
    },
    {
        "character": "Randy",
        "line": "I'll do it."
    },
    {
        "character": "Officer Bright",
        "line": "Hey, hey! Just remember he's been eating animals and living like a monster. Just... prepare yourself for what you're about to see."
    },
    {
        "character": "",
        "line": "Randy approaches the tent and looks inside to see Strong Woman and PC Principal naked."
    },
    {
        "character": "Strong Woman",
        "line": "Oh my God!"
    },
    {
        "character": "Randy",
        "line": "What the... Principal and Vice Principal...?"
    },
    {
        "character": "Strong Woman",
        "line": "I told you we couldn't hide."
    },
    {
        "character": "Randy",
        "line": "But... But you two work togeth... You two work togeth... [Vomits]"
    },
    {
        "character": "Officer Bright",
        "line": "Hey, what the hell's going on?!"
    },
    {
        "character": "Linda Black",
        "line": "Who's together?"
    },
    {
        "character": "Randy",
        "line": "The Principal and the Vice Principal!"
    },
    {
        "character": "Steven",
        "line": "They can't be together! They're co-workers!"
    },
    {
        "character": "",
        "line": "PC Principal and Strong Woman exit the tent. Steven vomits."
    },
    {
        "character": "Offier Bright",
        "line": "Wait, wait. You mean he's actually her superior and they were in there... [Gags, then vomits]"
    },
    {
        "character": "Steven",
        "line": "Who would want to put their penis in a co-worker?! [Gags then vomits. Everyone else starts doing the same]"
    },
    {
        "character": "",
        "line": "The boys proceed on while Queen of Hearts plays."
    },
    {
        "character": "Kyle",
        "line": "Oh, my God! Look! These are Ike's toy binoculars! He was here! Ike!"
    },
    {
        "character": "Heidi",
        "line": "I remember this place too... This is where you brought me on Halloween. Remember?"
    },
    {
        "character": "Cartman",
        "line": "[Sarcastically] Yes, darling, wasn't it romantic"
    },
    {
        "character": "Heidi",
        "line": "No! It wasn't romantic. There was a witch and you had me dress up like Gretel and... [gasps] you were trying to get me killed!"
    },
    {
        "character": "Cartman",
        "line": "Sweetheart, you made me late to the pumpkin patch, remember? I was hurt."
    },
    {
        "character": "Heidi",
        "line": "You were hurt! You Were the victim."
    },
    {
        "character": "Cartman",
        "line": "I'm glad you understand."
    },
    {
        "character": "Heidi",
        "line": "[Heidi's ghost appears] Who turned you into this, Heidi? Shut up! Skinny-ass bitch! You don't know anything!"
    },
    {
        "character": "Cartman",
        "line": "Heidi, I think spooky walk in the woods is making you lost it a little bit."
    },
    {
        "character": "Stan",
        "line": "Guys!"
    },
    {
        "character": "Garrison",
        "line": "I'm seriously dehydrated and starving. I'm pretty sick of this shit, so you better... Aah!"
    },
    {
        "character": "",
        "line": "Mr Garrison gets caught in a trap Ike set up. Meanwhile at the Community Center."
    },
    {
        "character": "Mr. Turner",
        "line": "Have we already done a search of this area? Maybe she went there with her boyfriend!"
    },
    {
        "character": "Mrs. Turner",
        "line": "She would have called by now."
    },
    {
        "character": "Laura",
        "line": "I just talked to the McCormicks. They haven't seen Tweek or Craig since yesterday."
    },
    {
        "character": "",
        "line": "Just then, Jimbo, Steven, Linda, Officer Bright, Roger, Mrs Tweak along with a few other parents walk through the door."
    },
    {
        "character": "Sharon",
        "line": "Randy! Did you find anything?"
    },
    {
        "character": "Randy",
        "line": "[He takes off his hood] Sharon... I... I..."
    },
    {
        "character": "Sharon",
        "line": "What is it? What did you find?"
    },
    {
        "character": "Randy",
        "line": "The... There's... Ugh..."
    },
    {
        "character": "Sharon",
        "line": "Tell me! You have to tell me! [Officer Bright takes off his hat] Oh, God! What did you see?!"
    },
    {
        "character": "Randy",
        "line": "You don't want to know."
    },
    {
        "character": "Sharon",
        "line": "You have to tell me! I can take it! Did you find our son's arm? Did you find him torn apart? What?!"
    },
    {
        "character": "Randy",
        "line": "The Principal and Vice Principal are, like... together. [Sharon vomits right onto Randy's face.] Aw!"
    },
    {
        "character": "",
        "line": "Ike plays a high pitched horn as he arrives back in South Park. Everyone comes out of the Community Center. He has Garrison tied up behind and gagged."
    },
    {
        "character": "Officer Bright",
        "line": "It's the President! [People begin to cheer]"
    },
    {
        "character": "Sheila",
        "line": "Ike! Kyle!"
    },
    {
        "character": "Sharon",
        "line": "Stan, you're okay!"
    },
    {
        "character": "Stan",
        "line": "Yeah, we're okay!"
    },
    {
        "character": "Officer Bright",
        "line": "We got him. We got the son of a bitch. [Bob White walks over and grabs Officer Bright's gun]"
    },
    {
        "character": "Bob White",
        "line": "Get back! Everyone back! Do it now! Get over here, family!"
    },
    {
        "character": "Randy",
        "line": "Bob, for the love of Pete, our country is about to go to war!"
    },
    {
        "character": "Bob White",
        "line": "You wanna know where there's a war?! There's a war on Christmas! Nobody cares about that! 'Cos guess who loves Christmas? The Whites! At least this man's trying to save Christmas!"
    },
    {
        "character": "Garrison",
        "line": "[Muffled] That's true!"
    },
    {
        "character": "Randy",
        "line": "He's not saving Christmas, Bob. He's running around scaring your kids and shitting in the woods."
    },
    {
        "character": "Bob White",
        "line": "[Sighs, sobs]"
    },
    {
        "character": "Randy",
        "line": "Come on, Bob. What's best for your daughter? I mean, really?"
    },
    {
        "character": "Heidi",
        "line": "[Heidi grabs White's gun] You piece of shit! This was all your fault! [She points the gun at Cartman] You controlled me and manipulated me and turned me into this!"
    },
    {
        "character": "Cartman",
        "line": "Baby, put down the gun, sweetheart, okay?"
    },
    {
        "character": "Heidi",
        "line": "I used to be kind. I used to be caring. But then you... you... No. Not you. Me. I did this. I let being a victim become a way of life. If you always make yourself the victim, you can justify being awful. Eric... I'm sorry. I'm breaking up with you."
    },
    {
        "character": "Cartman",
        "line": "Honey, don't be ridiculous."
    },
    {
        "character": "Heidi",
        "line": "I've been ridiculous. I have to learn to stop feeling sorry for myself."
    },
    {
        "character": "Cartman",
        "line": "Heidi, you are not breaking up with me."
    },
    {
        "character": "Heidi",
        "line": "Yes, I am. It's over."
    },
    {
        "character": "Cartman",
        "line": "I'm afraid I can't let you do that, sweetheart! [He grabs the gun and points it at himself] Step back! I'll do it I swear to God!"
    },
    {
        "character": "Heidi",
        "line": "It's not gonna work this time, Eric."
    },
    {
        "character": "Cartman",
        "line": "You break up with me, I will kill myself! The choice is yours, Heidi! Come on everybody! \"Eric, we don't want you to die.\""
    },
    {
        "character": "Heidi",
        "line": "I'm sorry. You can be the victim. I can't."
    },
    {
        "character": "Cartman",
        "line": "Heidi! Heidi, I'm gonna do it! Here we go! Heidi? Are you seriously..."
    },
    {
        "character": "",
        "line": "A scream is heard. Everyone moves to where Garrison was."
    },
    {
        "character": "Officer Bright",
        "line": "He broke free!"
    },
    {
        "character": "Jimbo",
        "line": "The President is on the loose again."
    },
    {
        "character": "Officer Bright",
        "line": "He'll be even more desperate now. It's going to get worse."
    },
    {
        "character": "Stan",
        "line": "We can't destroy him, can we?"
    },
    {
        "character": "Randy",
        "line": "I don't know. I guess... It's up to the Whites."
    }
]