[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Mrs. Nelson hands out papers to the students."
    },
    {
        "character": "Mrs. Nelson",
        "line": "I want you all to take a close look at your math exams, children. Some of you did very well, but many of you did not. [hands Cartman his exam, which has a big red F stamped on it]"
    },
    {
        "character": "Cartman",
        "line": "Oh, man!"
    },
    {
        "character": "Mrs. Nelson",
        "line": "[goes to the board] The addition of fractions is very simple. Let's run through it again. How do we solve this first one? [gun shots are heard outside, followed by faraway screams of children]"
    },
    {
        "character": "Butters",
        "line": "[raises his hand] Add together the three and the three."
    },
    {
        "character": "Mrs. Nelson",
        "line": "[turns to the board] Good, Butters, we add the three's together. [writes 6 in the numerator's place.] And what about the four's? Tolkien?"
    },
    {
        "character": "Tolkien",
        "line": "They're the denominators, so they stay a four."
    },
    {
        "character": "Cartman",
        "line": "Wait, wait, Tolkien got an A? But I cheated off Tolkien!"
    },
    {
        "character": "Mrs. Nelson",
        "line": "Ah, I can't hear you, Eric."
    },
    {
        "character": "Cartman",
        "line": "I said something's wrong! I got an F, but I cheated off Tolkien!"
    },
    {
        "character": "SWAT officer 1",
        "line": "[armed, runs into the classroom] Active shooter! Active shooter! [\"All units, report in\" The officer strikes various poses as he checks out the classroom. More gunshots are heard. Mrs. Nelson moves around to stay visible to the class]"
    },
    {
        "character": "Mrs. Nelson",
        "line": "And now we divide, right?! Craig, how about you?! What are we dividing?!"
    },
    {
        "character": "SWAT officer 1",
        "line": "[moving offscreen] Active shooter! Active shooter!"
    },
    {
        "character": "Craig",
        "line": "Divide four by six? [\"Report now!\"]"
    },
    {
        "character": "Mrs. Nelson",
        "line": "The four by the six?!"
    },
    {
        "character": "SWAT officer 1",
        "line": "Unit 5 in southwest classroom! [more police chatter]"
    },
    {
        "character": "Mrs. Nelson",
        "line": "Or the six by the four?!"
    },
    {
        "character": "Kyle",
        "line": "The six by the four!"
    },
    {
        "character": "SWAT officer 1",
        "line": "Southwest classroom, clear! [\"Copy. Southwest classroom, clear.\"]"
    },
    {
        "character": "Mrs. Nelson",
        "line": "Now we're gonna retake the exam on Friday."
    },
    {
        "character": "Class",
        "line": "AWWW!"
    },
    {
        "character": "SWAT officer 2",
        "line": "Shooter's in the hallway! All units report! [he and officer 1 leave the classroom and make their way towards the shooter.]"
    },
    {
        "character": "Mrs. Nelson",
        "line": "Now I'm giving you an opportunity to do better. I hope you take advantage of it."
    },
    {
        "character": "SWAT officer",
        "line": "[the officers have swarmed the shooter outside] Put down the gun, son. You don't wanna do this."
    },
    {
        "character": "Cartman",
        "line": "You can see where Tolkien erased his answers and wrote down the right ones! He did it to me on purpose! [a final gunshot]"
    },
    {
        "character": "Mrs. Nelson",
        "line": "Eric, that's enough! [\"Shooter is down, shooter is down\"] Now let's move on to the next equation."
    },
    {
        "character": "",
        "line": "The aftermath. Aerial shot of the school. Four officers are on the school roof. Several officers are with the students in the playground on lockdown. A couple of paramedics carry the shooter away on a stretcher towards an ambulance. Several officers talk to the teachers on the school's front lawn. The bell rings and the students are released from lockdown"
    },
    {
        "character": "Cartman",
        "line": "That is such bullshit, you guys! Tolkien knew I was cheating off him, so he deliberately put down the wrong answers! Why would he do that?!"
    },
    {
        "character": "Stan",
        "line": "I flunked that test too. I don't understand fractions - they don't make any sense."
    },
    {
        "character": "Cartman",
        "line": "That's not the point, you guys! Why is Tolkien out to get me? There's something going on here."
    },
    {
        "character": "Bill Keegan",
        "line": "Another school shooting today has left students in shock and disbelief."
    },
    {
        "character": "Kyle",
        "line": "Yeah, Tolkien's probably sick of you cheating off him all the time."
    },
    {
        "character": "Cartman",
        "line": "But why now? That's the question, Kyle. I always cheat off Tolkien. Why did he choose now to hurt me?"
    },
    {
        "character": "Sharon",
        "line": "[a shot of her running towards him. She crosses the police barrier.] Stanley, oh my God! [gets down on her knees and hugs him tight] Baby! Oh, you're okay!"
    },
    {
        "character": "Stan",
        "line": "Uh, hey, Mom."
    },
    {
        "character": "Sharon",
        "line": "It's all right, Stanley. We're gonna go home and talk about this with your dad. And we will get through this as a family! [stands up and pulls him away] Come on, get in the car!"
    },
    {
        "character": "Cartman",
        "line": "Dude, what's up Stan's mom's ass?"
    },
    {
        "character": "",
        "line": "The Marsh house, dinnertime. The family is gathered at the table and Sharon approaches the table with her plate and sits down. She glances over at Randy for a moment, then at Shelley."
    },
    {
        "character": "Sharon",
        "line": "Stanley? Well? Do you wanna tell your father about what happened at school today?"
    },
    {
        "character": "Stan",
        "line": "[glances up at Randy, who is cutting a slice away from his steak.] Um... Oh- Oh, I... flunked my math quiz."
    },
    {
        "character": "Sharon",
        "line": "Noo, the other thing!"
    },
    {
        "character": "Randy",
        "line": "[looks at Sharon] What other thing? [Stan turns his head away. Randy looks at him] What happened at school today?"
    },
    {
        "character": "Stan",
        "line": "[looks at Randy] Oh, the school shooting?"
    },
    {
        "character": "Sharon",
        "line": "Yes, the school shooting!"
    },
    {
        "character": "Stan",
        "line": "Oh, yeah, some kid shot up the school."
    },
    {
        "character": "Randy",
        "line": "Who shot up the schoo- [holds up his knife] was it you?"
    },
    {
        "character": "Stan",
        "line": "No."
    },
    {
        "character": "Randy",
        "line": "Did you get shot?"
    },
    {
        "character": "Stan",
        "line": "No."
    },
    {
        "character": "Randy",
        "line": "Oh... [goes back to cutting his steak] Well, what's this about failing a math quiz?"
    },
    {
        "character": "Sharon",
        "line": "[Stands up in anger and pounds the table. Shelley looks at her, Randy is suddenly afraid] Are you serious?! Did you not hear what your child said?! Kids died at his school!"
    },
    {
        "character": "Randy",
        "line": "I'm sorry, Sharon. I..."
    },
    {
        "character": "Sharon",
        "line": "Why are you all acting like this is normal? What is wrong with you people?! [storms away upstairs]"
    },
    {
        "character": "Stan",
        "line": "What's up Mom's ass?"
    },
    {
        "character": "",
        "line": "The master bedroom, night. Sharon is in there folding clothes and putting it away angrily"
    },
    {
        "character": "Randy",
        "line": "[enters] Hey, Sharon, ya... doin' okay?"
    },
    {
        "character": "Sharon",
        "line": "No, I'm not okay! Children were shot! They were killed at a school where they were supposed to be safe!"
    },
    {
        "character": "Randy",
        "line": "Uh huh, and... what else is goin' on?"
    },
    {
        "character": "Sharon",
        "line": "[turns around angrily] Why does there need to be anything else?! Are you kidding me?!"
    },
    {
        "character": "Randy",
        "line": "[holds his palms up] I'm sorry. I'm sorry, Sharon."
    },
    {
        "character": "Sharon",
        "line": "Why isn't anyone else emotional?!"
    },
    {
        "character": "Randy",
        "line": "...Hun, uh... [pause] When was your last...? I mean, you know how sometimes things can seem like a little bigger deal 'cause you know, your... down there?"
    },
    {
        "character": "Sharon",
        "line": "Don't you dare suggest that I'm only emotional because it's-"
    },
    {
        "character": "Randy",
        "line": "I mean, I'm just, I'm just pointing out that it is around that time."
    },
    {
        "character": "Sharon",
        "line": "GET OUT, RANDY! I'M NOT OVERREACTING!"
    },
    {
        "character": "Randy",
        "line": "Okay. Okay, love you, honey. I'll leave you alone. [backs out of the room and sighs] Welp, another three days of this, probably. [turns around and walks down the hallway to the stairs]"
    },
    {
        "character": "",
        "line": "South Park Elementary, Principal's office. Mr. Mackey stands over PC Principal's left shoulder"
    },
    {
        "character": "PC Principal",
        "line": "I understand that there have been some problems here at the school lately. A lot of students are experiencing anxiety, and Eric Cartman just wanted to be able to voice his concerns. Go ahead, Eric. [Cartman and Tolkien are seated in chairs before him]"
    },
    {
        "character": "Cartman",
        "line": "Tolkien, [sighs] There are some terrible things that I realize you might have heard from the other kids here at school. There are some rumors that have been going around, about me, that... that I thought Black Panther was a terrible movie. There's rumors that I said it was a structural mess. You know, that the rhinos were really stupid. I want to assure you that I never said anything like that. I loved Black Panther. So if, you know, you feel like there's a need to come after me, to get back at me, I just need you to know that people are lying, because I like Black Panther just as much as you did. I am not a racist."
    },
    {
        "character": "Tolkien",
        "line": "I actually never saw Black Panther."
    },
    {
        "character": "Cartman",
        "line": "[affecting a black accent] Say what, girlfriend? Whatchoo talkin' 'bout, Willis? Come on, Raj! You never saw Black Panther??"
    },
    {
        "character": "Tolkien",
        "line": "No, I didn't see it."
    },
    {
        "character": "Cartman",
        "line": "But I thought all of you saw it. [Another day, another round of gunshots.]"
    },
    {
        "character": "Mr. Mackey",
        "line": "I got this one. [leaves the office and goes into the hallway.] All right, everyone, get down! Everybody get the fuck down!"
    },
    {
        "character": "Cartman",
        "line": "Tolkien, let's be honest with each other, okay? Why else would you manipulate my test grades?"
    },
    {
        "character": "PC Principal",
        "line": "How exactly did Tolkien manipulate your grades, Eric? [sirens are heard approaching as gunfire continues]"
    },
    {
        "character": "Cartman",
        "line": "There was a test. I should have got an A on it, but Tolkien did things to make me fail, and it's not fair."
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay, m'kay, who's shootin' up the school?"
    },
    {
        "character": "PC Principal",
        "line": "Is that true, Tolkien? Did you do somethin' to make Eric fail a test?"
    },
    {
        "character": "Tolkien",
        "line": "[emphatic] I didn't make him fail, no!"
    },
    {
        "character": "Cartman",
        "line": "You didn't make me fail the test and you didn't see Black Panther. Right."
    },
    {
        "character": "Mr. Mackey",
        "line": "Everyone down!"
    },
    {
        "character": "An officer",
        "line": "Active shooter, active shooter!"
    },
    {
        "character": "Cartman",
        "line": "I mean, I mean, this is ridiculous."
    },
    {
        "character": "Mr. Mackey",
        "line": "[appears in the doorway directing the officers] Over this way! Into the cafeteria! Right over there, m'kay- No, you shot the wrong one!"
    },
    {
        "character": "",
        "line": "The Marsh living room, night. Sharon has called a group of parents together"
    },
    {
        "character": "Sharon",
        "line": "Thanks for coming, everybody. I'm sure you all heard there was yet another school shooting today. We have to figure out what we're going to do as parents because this whole thing is out of control! [Randy sighs heavily] We have to ask ourselves why this is happening and do something now!"
    },
    {
        "character": "Stephen",
        "line": "Well, you know, Sharon, I think... its a complex issue, you know. It's... it's not really as simple as just... [Randy perks up and begins signing to Stephen furiously. It basically amounts to \"Stop! Stop! It's Sharon! She's menstruating!\"] What I'm saying is that, that with issues like this, sometimes you have to be kind of... [begins to see what Randy is doing: \"she's crazy in the head\"] crazy? [Randy motions \"heavy menstrual flow\"]"
    },
    {
        "character": "Sharon",
        "line": "What are you talking about? [Randy pulls out a red handkerchief and pretends it's a bloody tampon] Do you understand that our children are being murdered?"
    },
    {
        "character": "Stephen",
        "line": "Red?"
    },
    {
        "character": "Sharon",
        "line": "How much closer to home can this all hit? [Randy continues signing: \"She's menstruating heavily and it's driving her crazy.\"] It was at our children's school!"
    },
    {
        "character": "Stephen",
        "line": "[still not getting it] Crazy time. Crazy red time. [Sharon notices Randy's motions, and Randy stops in his tracks]"
    },
    {
        "character": "Randy",
        "line": "I agree with my wife."
    },
    {
        "character": "Laura",
        "line": "Well, there certainly are things that need changing. Just yesterday, I was at the park with my son Craig and... have you seen the state of the playground equipment? Not only does it seem unsafe, but it's become quite an eyesore."
    },
    {
        "character": "Ryan",
        "line": "The whole park could use an upgrade, if you ask me. It's become a campout for the homeless."
    },
    {
        "character": "Sharon",
        "line": "[irate] ARE YOU FUCKING JOKING?! YOU'RE GONNA TAKE ONE SECOND TO COMPARE CHILD MURDER TO PARK UPGRADES?! WHAT IS WRONG WITH EVERYBODY?! YOU'VE ALL GONE CRAZY!! [leaves and goes upstairs. No one says a word]"
    },
    {
        "character": "Randy",
        "line": "...Anybody need a drink?"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Upon entering school, the kids are getting wanded at three security stations as two security cameras look on from the ceiling. Mr. Mackey holds the reins of two drug-sniffing dogs who on occasion bark at a random student walking by. Deeper inside the school, Butters is hall monitor for the day, but he's armed with an AR-15"
    },
    {
        "character": "Cartman",
        "line": "[peeks out from behind a pillar] Butters. [during their conversation, Cartman looks away from time to time, making sure no one else is nearby to hear them]"
    },
    {
        "character": "Butters",
        "line": "Waaah! [startled, he almost loses the rifle, but gets control of it and aims it at Cartman] Ah! Uh-oh! [walks over to him] Hey Eric."
    },
    {
        "character": "Cartman",
        "line": "Butters, I need help. My mom says if I flunk another math test, she's gonna ground me from playing Fortnite."
    },
    {
        "character": "Butters",
        "line": "Oh, Jeez, want me to help you study?"
    },
    {
        "character": "Cartman",
        "line": "No, dumbass, I need to get some dirt on Tolkien so he stops punishing me for what I supposedly said about Black Panther."
    },
    {
        "character": "Butters",
        "line": "Oho, Black Panther? Well that was a great movie! [smiles]"
    },
    {
        "character": "Cartman",
        "line": "No it wasn't. But now listen. [Butters' smile vanishes] There's got to be something Tolkien wouldn't want people to know. Something I can use as leverage."
    },
    {
        "character": "Butters",
        "line": "Well, what do you want me to do? I got hall monitor duty."
    },
    {
        "character": "Cartman",
        "line": "Just ask around. If you find any dirt on Tolkien, give me a call."
    },
    {
        "character": "Butters",
        "line": "Okay, Eric. [turns around and walks away]"
    },
    {
        "character": "Cartman",
        "line": "[thinking to himself.] This world is full of two types of people: [stops by Jason's locker for a moment and looks around] the ones who are honest, and the ones who don't play by the rules. [moves off. Jason looks at him. Next, he's going up some stairs but pauses as another student goes down the stairs, then continues up] Tolkien's got everyone believing he's the one African-American in the entire country who didn't see Black Panther. What else is he lying about? [peeks around a corner and spots Nichole at her locker: she's switching books around. Cartman gets that mischievous look on his face]"
    },
    {
        "character": "",
        "line": "The Marsh kitchen, evening. Randy is seated between Stephen and Gerald, getting tissue after tissue and blowing his nose"
    },
    {
        "character": "Randy",
        "line": "[sniffles] It just gets so hard, you know? [Gerald hands him another tissue] Everything's going fine, and then at a certain time of the month I have to start walking on eggshells."
    },
    {
        "character": "Stephen",
        "line": "It's all right, Randy."
    },
    {
        "character": "Randy",
        "line": "It's just. it's just once I'd like her to acknowledge it, you know? Just once say \"You know, maybe I was overreacting a little bit 'cause of my hormones.\""
    },
    {
        "character": "Sharon",
        "line": "[appearing at a doorway to one side of the kitchen] Randy, they announced on the news there's been another school shooting in Jefferson County!"
    },
    {
        "character": "Randy",
        "line": "[exasperated] Okay, Sharon. Cool."
    },
    {
        "character": "Sharon",
        "line": "What is \"cool\" about that?!"
    },
    {
        "character": "Randy",
        "line": "Nuh-nothing. I love you, sweetheart."
    },
    {
        "character": "Sharon",
        "line": "GOD! [walks off angrily]"
    },
    {
        "character": "Randy",
        "line": "I don't know. I don't know how much more of this I can take. It's like, I turn on the TV and dread they'll say something about a school shooting because it's gonna set my wife off."
    },
    {
        "character": "Stephen",
        "line": "Well, Randy, have you stopped to think that maybe this problem is bigger than Sharon's period?"
    },
    {
        "character": "Randy",
        "line": "[sniffles] What... what do you mean?"
    },
    {
        "character": "Stephen",
        "line": "I mean that maybe what's going on really is a big deal. What if this is actually... menopause?"
    },
    {
        "character": "Randy",
        "line": "Menopause? I don't even know what that is."
    },
    {
        "character": "",
        "line": "Mala Vista Middle School, Jefferson County, day. Like at South Park Elementary, there are officers on the roof and first responders on the ground. There are helicopters in the air and some reporters nearby. Randy appears, but what he's doing there is anybody's guess."
    },
    {
        "character": "Paramedic",
        "line": "[puts a casualty into an ambulance and walks over] Well you see, Mr. Marsh, when the woman's ovaries actually stop producing eggs, it's a significant change. It's this ending of the menstrual cycle in a woman's life that we call menopause."
    },
    {
        "character": "Randy",
        "line": "Uh huh. But... if a woman isn't having periods anymore, then why would she still overreact and be bitchy?"
    },
    {
        "character": "Paramedic",
        "line": "Well actually, menopause is one of the most severely hormonal times a woman ever goes through. It's good you sought the advice of a medical professional, because the changes in your wife's body are gonna be confusing and at times hard to cope with."
    },
    {
        "character": "Randy",
        "line": "Well wait, you're saying this could actually get worse?"
    },
    {
        "character": "Paramedic",
        "line": "I'm afraid so. [notices some movement nearby] Ah, no. Dead ones go in the other truck. [back to Randy] You see Mr. Marsh, menopause is almost like a super period, and it's been known to last... for up to two years."
    },
    {
        "character": "Randy",
        "line": "[trembling] Oh my God!"
    },
    {
        "character": "",
        "line": "South Park Elementary, hallway, day. Nichole is at her locker and opens the door"
    },
    {
        "character": "Cartman",
        "line": "[approaches her] Nichole, can I talk to ya? [leans against the lockers and puts his right foot on one of them]"
    },
    {
        "character": "Nichole",
        "line": "'Bout what?"
    },
    {
        "character": "Cartman",
        "line": "Word on the street is you and Tolkien are back together."
    },
    {
        "character": "Nichole",
        "line": "We're trying, just talking a lot and seeing if we can work things out."
    },
    {
        "character": "Cartman",
        "line": "Why did you break up with him? What did he do to you?"
    },
    {
        "character": "Nichole",
        "line": "That's... really none of your business. [closes the door and walks away]"
    },
    {
        "character": "Cartman",
        "line": "[keeps up] He didn't take you to see Black Panther with him, did he? That must have really stung."
    },
    {
        "character": "Nichole",
        "line": "I don't know what you're talking about."
    },
    {
        "character": "Cartman",
        "line": "Oh no? When you guys talk about how sweet Black Panther was, what's he say?"
    },
    {
        "character": "Nichole",
        "line": "We've never talked about it."
    },
    {
        "character": "Cartman",
        "line": "Right. You two guys just hang out and talk, and Black Panther never comes up. Why are you covering for Tolkien? What's he have on you?"
    },
    {
        "character": "Nichole",
        "line": "[walks away] I gotta get to class."
    },
    {
        "character": "Cartman",
        "line": "[thinking to himself.] $1.3 billion domestic box office, a milestone for African Americans, [on the school roof taking pictures as Tolkien turns to kick back a soccer ball] and I'm supposed to believe that Tolkien and his little sex kitten never even talked about it. [at home he looks over all the pictures he took, with a pencil in his mouth] The all-school test is in less than 72 hours. Unless there's a connection, I'll be grounded from Fortnite for weeks. [looks closely at one of the pictures, which shows Tolkien and his parents shopping]"
    },
    {
        "character": "Cartman",
        "line": "Hello, Mom and Dad."
    },
    {
        "character": "",
        "line": "A doctor's office, day. Sharon is seated at the sofa letting out her frustrations on the good doctor."
    },
    {
        "character": "Sharon",
        "line": "I keep thinking... When will be the time when I get the call? You know? When will I answer the phone and find out my son, my daughter, were... killed? At school?"
    },
    {
        "character": "Doctor",
        "line": "Mmmhmm. Yeah I see."
    },
    {
        "character": "Sharon",
        "line": "I live in constant fear that I won't be there to protect my children when something happens to them."
    },
    {
        "character": "Doctor",
        "line": "Well, Sharon, have you maybe considered that your feelings are partly due to... handkerchief balls?"
    },
    {
        "character": "Sharon",
        "line": "What? [looks at him]"
    },
    {
        "character": "Doctor",
        "line": "Handkerchief balls. Handkerchief out the balls. [Randy signs: \"she used to have periods,\"] Red handkerchief. [\"but now she's old and going through menopause\"] No- no more handkerchief. No more- no more red. Zero. Empty. Old lady."
    },
    {
        "character": "Sharon",
        "line": "What I'm saying is that I'm so overwhelmed that I-"
    },
    {
        "character": "Doctor",
        "line": "Old lady, where's my dick? [Sharon looks at him again] Where's my dick?"
    },
    {
        "character": "Sharon",
        "line": "What the hell are you talking about?! I don't understand! [checks the window and sees Randy] God damnit! [leaves the office and goes outside] Stop acting like there's something wrong with me! Something's wrong with you! All of you! Try having some God-damned compassion! [storms away]"
    },
    {
        "character": "",
        "line": "Tolkien's house, evening. Cartman is visiting them and talking to them about the movie in the kitchen"
    },
    {
        "character": "Cartman",
        "line": "Yeah. yeah yeah, I know. You know, my other favorite part was when Black Panther had those dreams about his dead father. I mean the dad, the tribal leader, speaking to the new king about being a good leader. I've never seen a movie do that before, except for Lion King, of course, but Black Panther was so original."
    },
    {
        "character": "Steve",
        "line": "We enjoyed it, yes."
    },
    {
        "character": "Cartman",
        "line": "So, uh, what was Tolkien's favorite part of Black Panther?"
    },
    {
        "character": "Linda Black",
        "line": "Tolkien?"
    },
    {
        "character": "Cartman",
        "line": "Yeah. You must have all had some deep family talks about it. What does Tolkien say about it on Black Panther Family Discussion Night? [Tolkien comes down some stairs and sees Cartman at table.]"
    },
    {
        "character": "Tolkien",
        "line": "Get out of my house!"
    },
    {
        "character": "Cartman",
        "line": "Tolkien."
    },
    {
        "character": "Tolkien",
        "line": "Come on, get out! [yanks him off the chair and shows him out the back door]"
    },
    {
        "character": "Cartman",
        "line": "Sure thing. You know, we were just talking about how your family did see Black Panther."
    },
    {
        "character": "Steve",
        "line": "Oh, no not the family. Tolkien's mom and I saw it on date night. We're gonna watch it again with Tolkien, though. We don't let him watch it alone because it's PG-13."
    },
    {
        "character": "Cartman",
        "line": "Well, I guess there's nothing more to it, then. Nice talking to you folks. [walks out, but stops moments later] Eh, you know, just one last thing. If you ever found out your son saw a PG-13 movie without you, you'd probably be pretty pissed off."
    },
    {
        "character": "Linda",
        "line": "Well, Tolkien wouldn't do that."
    },
    {
        "character": "Cartman",
        "line": "No. No, he'd have no reason to falsely claim he's the only one who hasn't seen Black Panther. [to Tolkien] I'll see you at school."
    },
    {
        "character": "",
        "line": "The Marsh doorbell, day. Someone is ringing it furiously. Sharon goes to answer it"
    },
    {
        "character": "Harriet Biggle",
        "line": "Sharon, Sharon, you have to come quick!"
    },
    {
        "character": "Sharon",
        "line": "What is it?"
    },
    {
        "character": "Linda Stotch",
        "line": "There's another shooting happening at the school right now!"
    },
    {
        "character": "Harriet",
        "line": "It just started. Maybe we can make it in time!"
    },
    {
        "character": "Sharon",
        "line": "Oh my God! [takes off with the other woomen]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Linda drives up to the school and the three women get out."
    },
    {
        "character": "Sharon",
        "line": "Come on, we have to hurry!"
    },
    {
        "character": "Linda",
        "line": "No, Sharon. You go ahead first."
    },
    {
        "character": "Sharon",
        "line": "Why??"
    },
    {
        "character": "Harriet",
        "line": "You just- ya-you should go. [she runs into the school, which is darkened. The security stations are turned off but decorated with garlands. Candles sit on tables, while rose petals on the lobby floor form a heart. Wreaths are everywhere - looks like Randy rented the school out for this. From the left come one group of parents, from the right another group. Harriet and Linda come up behind her as \"Love Story\" starts up.]"
    },
    {
        "character": "Sharon",
        "line": "What the fuck is going on? [on the second floor, a spotlight shines on Randy as he begins singing. He then goes down a flight of stairs]"
    },
    {
        "character": "Randy",
        "line": "Where do I begin\nTo tell the story of how great a love can be?\n\n Surprise, Sharon\n\nThe sweet love story that is older than the sea...\n\n\n"
    },
    {
        "character": "",
        "line": "The boys bathroom. Cartman is inside waiting for someone to finish using a stall. Tolkien opens the stall door and exits. He goes to wash his hands. Cartman moves and locks the bathroom door"
    },
    {
        "character": "Cartman",
        "line": "Oh hay, man. The big math quiz is about to start. You gonna let me cheat off you?"
    },
    {
        "character": "Tolkien",
        "line": "Nnnope."
    },
    {
        "character": "Cartman",
        "line": "You saw Black Panther without your parents' permission. I typed up all my findings, Tolkien. I made ten copies and put them in envelopes. If I don't pass this math quiz, the envelopes are all set to be sent to ten different news organizations."
    },
    {
        "character": "Tolkien",
        "line": "You did all that instead of actually studying for the test?"
    },
    {
        "character": "Cartman",
        "line": "So, what's it gonna be, Tolkien? You can be mad I didn't like Black Panther, but you can't take it out on me anymore."
    },
    {
        "character": "Tolkien",
        "line": "I didn't see Black Panther."
    },
    {
        "character": "Cartman",
        "line": "Then I guess your parents won't be mad when they read my report."
    },
    {
        "character": "Cartman",
        "line": "In poker they call it a bluff. I know that right now, Tolkien is shitting his pants. All I need to do now is wait for the poop to stink."
    },
    {
        "character": "",
        "line": "South Park Elementary lobby. Randy continues singing."
    },
    {
        "character": "Randy",
        "line": "She fills my heart with very special things.\nWith angel songs, with wild imaginings\nShe f-\n\n\n"
    },
    {
        "character": "",
        "line": "The boys bathroom. Cartman is still trying to break Tolkien"
    },
    {
        "character": "Cartman",
        "line": "Tolkien, we are running out of time. If you don't let me cheat off you, I'm going to tell your parents that you saw Black Panther in the theater without them!"
    },
    {
        "character": "Tolkien",
        "line": "Ii didn't see Black Panther in the theater!"
    },
    {
        "character": "Cartman",
        "line": "Of course you did, Tolkien! That's why me ripping on it pissed you off so much!"
    },
    {
        "character": "Tolkien",
        "line": "I sear on my mother's life, I don't care what you said about Black Panther! Goodbye! [taken aback, Cartman blocks Tolkien's way]"
    },
    {
        "character": "Cartman",
        "line": "But Tolkien, I don't understand! If you didn't see it, and you really don't care that I ripped on Black Panther, then why would you let me cheat- [stops himself and gets another idea...] Oh my God. You don't care what I said because you did see it... and you... didn't like it either. [takes a deep gasp. Tolkien lowers his eyelids] That's what this is all about, isn't it? You hate yourself for seeing through the mirage like I did, and that's why you wouldn't let me cheat off you! Well I didn't write Black Panther, Tolkien! It isn't my fault it sucked! Why go after me?! But now, it's over. Don't worry. They're not gonna know you didn't like Black Panther, so long as... you never make me fail another math test."
    },
    {
        "character": "Tolkien",
        "line": "[checks his phone] Well, we're probably both gonna fail now because fourth period already started. "
    },
    {
        "character": "Cartman",
        "line": "What? No! [turns to unlock the door] We have to take that test, Tolkien! [opens the door and pulls him out]"
    },
    {
        "character": "",
        "line": "Running down the hallway"
    },
    {
        "character": "Cartman",
        "line": "Come on! We can still get to class on time! [a flurry of gunshots] Oh, great! Come on, we can do this! [as they run through the hallways, gunshots ring out and gunsmoke fills the air. They pass a stairwell in which some students are huddled. They round a corner and spot a boy at his locker. They run to him] Billy, give me your lunchbox! [Billy hands it over. The window to the computer lab is shattered by gunfire. Butters stays out of the gunfire, too scared to move. Cartman and Tolkien reach him] Butters!"
    },
    {
        "character": "Butters",
        "line": "Wull it's the entire glee club this time!"
    },
    {
        "character": "Cartman",
        "line": "Butters, I have to get to class! The math quiz is starting!"
    },
    {
        "character": "Butters",
        "line": "Oh crap! The math quiz? It's already fourth period?"
    },
    {
        "character": "Cartman",
        "line": "I can't flunk this math quiz, Butters! Cover me!"
    },
    {
        "character": "Butters",
        "line": "Well okay! [slow motion effect as they run through the school] Waaaagh! Waaaaaagh!"
    },
    {
        "character": "",
        "line": "The school lobby. Randy continues singing, the adults are all smiles, oblivious to the gunfire around them. Cartman and Tolkien run across the lobby without Butters and take the stairway up to the second floor. They run to class."
    },
    {
        "character": "Randy",
        "line": "How long does it last?"
    },
    {
        "character": "",
        "line": "an love be measured by the hours in a day"
    },
    {
        "character": "",
        "line": "The final rush to class. The glee club is still firing away as Cartman and Tolkien reach the classroom. Cartman rolls forward, jumps up, and opens the door. He and Tolkien go in."
    },
    {
        "character": "",
        "line": "The aftermath. The wounded are being taken to hospitals, just as in the beginning of the episode"
    },
    {
        "character": "Officer Stevens",
        "line": "You did everything you could, Mr. Marsh. If your wife can't realize the truth and appreciate you, maybe she never will."
    },
    {
        "character": "Sharon",
        "line": "Realize what?! What have you been telling everybody, RANDY?!"
    },
    {
        "character": "Stephen",
        "line": "Randy was just trying to make you feel loved while you're going through menopause."
    },
    {
        "character": "Sharon",
        "line": "Menopause?! I'm not going through fucking menopause!"
    },
    {
        "character": "Stephen",
        "line": "How do you know?"
    },
    {
        "character": "Sharon",
        "line": "I just got my period this morning!"
    },
    {
        "character": "Randy",
        "line": "You... you got your period?"
    },
    {
        "character": "Sharon",
        "line": "YES!"
    },
    {
        "character": "Randy",
        "line": "You just got your period this morning?"
    },
    {
        "character": "Sharon",
        "line": "YES!"
    },
    {
        "character": "Randy",
        "line": "Soooo the past few days, maybe you have been just a liiittle-"
    },
    {
        "character": "Sharon",
        "line": "NO! NO NOTHING! Don't you guys see what's happened here?! I want you to be angry! Every day we hear about another school shooting! It used to be a big deal! I want it to be a big deal again. I mean Harriet, you came to my house and said there was a school shooting to trick me into going with you!"
    },
    {
        "character": "Harriet",
        "line": "I was just trying to be a part of the big surprise, Sharon."
    },
    {
        "character": "Sharon ",
        "line": "That's what I'm talking about! That's crazy, Harriet! I want you all to be shocked! I want you all to be sad!"
    },
    {
        "character": "Townsman",
        "line": "You want everyone to be sad?"
    },
    {
        "character": "Harriet",
        "line": "Well. Sharon, if you wanted to make me sad, congratulations. [her voice cracks a little] You did a great job. [walks away]"
    },
    {
        "character": "Stephen",
        "line": "Yeah, let's go somewhere without so much negativity. [the people disperse]"
    },
    {
        "character": "Randy",
        "line": "Aw guys, uh she didn't mean it! She just... get, give her a... [sighs, looks at her, turns around and shuffles away]"
    },
    {
        "character": "",
        "line": "The classroom. Mrs. Nelson hands out the quiz"
    },
    {
        "character": "Mrs. Nelson",
        "line": "The quiz is multiple-choice, but be sure to show all your work. You'll have 20 minutes to complete your answers. All right, your time starts... now. [Cartman stares at Tolkien, who notices. Tolkien rolls his eyes and positions his test so Cartman can see his work. Tolkien solves his problems first, then Cartman copies]"
    },
    {
        "character": "Cartman",
        "line": "[thinking] Everybody has dirty laundry. All it takes to find it is getting a little dirty yourself. The only question now is, how many Tolkiens are out there? How many others are afraid to say that Black Panther wasn't all that sweet because of the damage it could do to them?"
    },
    {
        "character": "Cartman",
        "line": "What do you mean?"
    },
    {
        "character": "Cartman",
        "line": "[thinking] I mean, in a school of 200 students, there's already two who are covering up the truth. All Tolkien is doing by letting you cheat off him is keeping the whole thing quiet even longer. [crumples up his test and throws it to the ground, thereby earning another F] There are others out there... and even if it means failing, I'm their only damn hope."
    },
    {
        "character": "",
        "line": "The Marsh house, backyard. Randy is moping on a tree stump. Sharon opens the back door and sees him"
    },
    {
        "character": "Sharon",
        "line": "Randy... [walks up to him] we need to talk."
    },
    {
        "character": "Randy",
        "line": "Sure, honey."
    },
    {
        "character": "Sharon",
        "line": "There's been... too much pain and suffering, and... it has to stop."
    },
    {
        "character": "Randy",
        "line": "I know, sweetheart, I know."
    },
    {
        "character": "Sharon",
        "line": "What I'm trying to say is... I've been very emotional lately, and... maybe... maybe I do overreact sometimes."
    },
    {
        "character": "Randy",
        "line": "[raises his arms up as if he's witnessing a revelation] Aaaaah?"
    },
    {
        "character": "Sharon",
        "line": "Maybe I need to realize that my emotions can be hormonal and not just take things out on you."
    },
    {
        "character": "Randy",
        "line": "Aaah? Aaaaah?"
    },
    {
        "character": "Sharon",
        "line": "Randy, I'm... sorry."
    },
    {
        "character": "Randy",
        "line": "Aaaah. Aaaaaah. [voice shaky] Thank you, Sharon. I don't know what it's like to have periods, but I'll try to be more understanding from now on. [Sharon's cell phone rings, and she pulls it out of her pocket.]"
    },
    {
        "character": "Sharon",
        "line": "Sorry, sorry, one second. [answers it] Hello? Yes. What? Oh my God! Yes. Yes. Yes. Okay. Okay. [hangs up]"
    },
    {
        "character": "Randy",
        "line": "What is it?"
    },
    {
        "character": "Sharon",
        "line": "There's been another school shooting. Stan's been shot."
    },
    {
        "character": "Randy",
        "line": "Shuh-should we get down there?"
    },
    {
        "character": "Sharon",
        "line": "[Sighs] It's not the end of the world. [smiles]"
    },
    {
        "character": "Randy",
        "line": "[sighs in relief] Aaaaah. I love you, Sharon. [they hug as he cries on her shoulder]"
    },
    {
        "character": "",
        "line": "#cancelsouthpark"
    }
]