[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary. The class bell rings and the children are rowdy."
    },
    {
        "character": "Mr. Garrison",
        "line": "[entering] Settle down, children. I have some difficult news. This is going to make you all very sad. [the class is now seated] The school board is considering firing me as your teacher. There's a possibility that I will be let go and never allowed to teach you again. [Stan raises his hand] Yes, Stanley?"
    },
    {
        "character": "Stan",
        "line": "That's okay with us."
    },
    {
        "character": "Kyle",
        "line": "Yeah."
    },
    {
        "character": "Clyde",
        "line": "Yeah, we don't care."
    },
    {
        "character": "Cartman",
        "line": "Yeah, that's fine."
    },
    {
        "character": "Mr. Garrison",
        "line": "No it isn't, it makes you very sad! Now, apparently, the school board thinks that I don't teach you anything about current events, so tomorrow they're going to have you do presentations for the whole board."
    },
    {
        "character": "Class",
        "line": "Aawwww! [heads drop]"
    },
    {
        "character": "Mr. Garrison",
        "line": "[writes on the board] \"Current Events in South Park\". Now, I want you all to read a newspaper, or better yet, watch television, and come up with something current in South Park to do a report on."
    },
    {
        "character": "Class",
        "line": "Aawwww! [heads drop. Cartman is certainly vocal about it.]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Now, this'll be a group project, so I'm going to place you all into groups of five. Let's see, uh. Wendy, Bebe, Clyde, Pip, and Tolkien, you'll be Group 1, and Group 2 will be Stan, Kyle, Eric, Kenny, a-and, and Tweek."
    },
    {
        "character": "Tweek Tweak",
        "line": "[disheveled and really tweaked] AAAghah heheh."
    },
    {
        "character": "Stan",
        "line": "[laments] Oh, not Tweek."
    },
    {
        "character": "Kyle",
        "line": "We don't wanna be in a group with Tweek."
    },
    {
        "character": "Mr. Garrison",
        "line": "There's nothing wrong with Tweek. I bet he'll do a great job in your group."
    },
    {
        "character": "Tweek Tweak",
        "line": "I can't take that kind of pressure. No, Sweet Jesus, ple-hehease!"
    },
    {
        "character": "Stan",
        "line": "Dude, we can't work with this kid."
    },
    {
        "character": "Tweek",
        "line": "Yuh-ugh!"
    },
    {
        "character": "Mr. Garrison",
        "line": "That's what Chad Everett thought when the new female intern joined the cast of Medical Center. He thought, \"Who is this woman with her gazungas and high heels? What does she know about medicine?\" Well, that intern soon saved Chad Everett's brother with a kidney transplant. So, you see? [silence]"
    },
    {
        "character": "Stan",
        "line": "No."
    },
    {
        "character": "Mr. Garrison",
        "line": "Well, let me put it another way. You have to give your oral report to the entire South Park Town Committee tomorrow. And if it doesn't kick ass, and you make me look bad, Mr. Hat is gonna smack you bitches up!"
    },
    {
        "character": "Tweek",
        "line": "Wagh!"
    },
    {
        "character": "",
        "line": "South Park, downtown. Off to the right of Tom's Rhinoplasty is a coffee store: Tweek Bros. A businessman walks in with briefcase."
    },
    {
        "character": "Richard Tweak",
        "line": "Hello there, customer."
    },
    {
        "character": "Customer",
        "line": "Hello. How are you today?"
    },
    {
        "character": "Richard",
        "line": "Great. What can I get for you? Large coffee, small coffee? [motions to the menu]"
    },
    {
        "character": "Customer",
        "line": "I'm actually interested in something else. I'm John Postum from the Harbucks Coffee Corporation..."
    },
    {
        "character": "Richard",
        "line": "Oh, you're that corporate guy who's been calling."
    },
    {
        "character": "Postum",
        "line": "That's right. How come you don't call me back? All we wanna do is buy out your coffee shop here."
    },
    {
        "character": "Richard",
        "line": "Oh, forget it, my store is not for sale."
    },
    {
        "character": "Postum",
        "line": "My company's prepared to make you a veerry generous offer. [lifts the briefcase and opens it. It's empty, but he elaborates] This is a Cramsonite briefcase. All leather, it has four compartments and a keyless lock. Interested?"
    },
    {
        "character": "Richard",
        "line": "Uh, I don't think so. My coffee shop is worth a lot to me."
    },
    {
        "character": "Postum",
        "line": "Well, all right. [closes the briefcase and lifts up two money bag] How about $500,000?"
    },
    {
        "character": "Richard",
        "line": "The answer is still no, Mr. Postum. You see, when my father opened this store 30 years ago, he cared about only one thing: making a great cup of coffee. [moves to his left, towards a backdrop containing lovely rolling hills and a rainbow. A soothing acoustic tune comes up] Sure, we may take a little longer to brew a cup, and we may not call it fancy names, but I guess we just care a little more. [a cart of beans rolls up to him] And that's why Tweek Coffee is still home-brewed from the finest beans we can muster. Yes, Tweek Coffee is a simpler cup, for a simpler America."
    },
    {
        "character": "Postum",
        "line": "Well, that's too bad. We're just gonna have to open our Harbucks right next door to you."
    },
    {
        "character": "Richard",
        "line": "[protesting] But that could put me out of business."
    },
    {
        "character": "Postum",
        "line": "Hey, this is a capitalist country, pal! Get used to it!"
    },
    {
        "character": "",
        "line": "Postum leaves. Officer Barbrady enters."
    },
    {
        "character": "Barbrady",
        "line": "[sees Postum leaving] Hello, Mr. Tweek."
    },
    {
        "character": "Richard",
        "line": "Hi, Officer Barbrady."
    },
    {
        "character": "Barbrady",
        "line": "Who was that?"
    },
    {
        "character": "Richard",
        "line": "Oh, just some dong. What can I get for you."
    },
    {
        "character": "Officer Barbrady",
        "line": "The usual."
    },
    {
        "character": "",
        "line": "Richard pulls out a brown cat from behind the counter and slaps him with it."
    },
    {
        "character": "",
        "line": "Barbrady leaves as he closes the door."
    },
    {
        "character": "Richard",
        "line": "Bye-bye."
    },
    {
        "character": "",
        "line": "South Park Elementary. The class is now in groups of five. Tweek is still wired."
    },
    {
        "character": "Stan",
        "line": "Okay, we have to do this stupid report, so--"
    },
    {
        "character": "Tweek",
        "line": "[twitching and closing his right eye] AAAaaagh. Ugh, ugh, huh, aarrrnnn. Aaarrrhaharn."
    },
    {
        "character": "Stan",
        "line": "Sooo, let's figure out what to do it about."
    },
    {
        "character": "",
        "line": "Shots of Kyle, Kenny, then Cartman."
    },
    {
        "character": "Cartman",
        "line": "How about we do it on that Raymond guy on TV, you know, Everybody Loves Raymond."
    },
    {
        "character": "Kyle",
        "line": "[angry] No, Cartman, we can't do it on Raymond again! It has to be on a current event in South Park. Tweek, do you have any ideas?"
    },
    {
        "character": "",
        "line": "Stan gets alarmed."
    },
    {
        "character": "Tweek",
        "line": "Uuurrnnn, too much pressure!"
    },
    {
        "character": "Stan",
        "line": "Great. A lot of help you are, kid."
    },
    {
        "character": "Tweek",
        "line": "The gnomes!"
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Tweek",
        "line": "[gritting his teeth] We can do our report on the gnomes."
    },
    {
        "character": "Stan",
        "line": "What gnomes?"
    },
    {
        "character": "Tweek",
        "line": "The underpants gnomes. The little guys that, that come into your room late, late at night and steal your underpants."
    },
    {
        "character": "",
        "line": "Shots of Kyle, Stan, then Cartman looking at Tweek."
    },
    {
        "character": "Cartman",
        "line": "Oh, so that's where all my underpants go."
    },
    {
        "character": "Kyle",
        "line": "Dude, that's the dumbest thing I've ever heard."
    },
    {
        "character": "Stan",
        "line": "Yeah, I've never seen any underpants gnomes."
    },
    {
        "character": "Tweek",
        "line": "They come out at 3:30 in the morning. Most people aren't up then, but I am. I can't sleep. Ever."
    },
    {
        "character": "Kyle",
        "line": "Dude, we can't do a presentation on underpants gnomes. Mr. Garrison will fail us because you're making it up."
    },
    {
        "character": "Tweek",
        "line": "No!! Sleep at my house tonight; I'll prove it to you."
    },
    {
        "character": "",
        "line": "The Tweak house that night. Richard Tweak and his wife are in the kitchen. They have three coffeemakers going on at once. Coffee mugs are everywhere."
    },
    {
        "character": "Richard",
        "line": "They want me to sell the store, and it's so much money."
    },
    {
        "character": "Mrs. Tweak",
        "line": "Some things are more important than money. [turns around] The people of South Park count on you to give them that first cup of coffee every day."
    },
    {
        "character": "Richard",
        "line": "I know, but if they open a Harbucks right next door, we might go out of business. They really have my balls in a vice grip."
    },
    {
        "character": "",
        "line": "Tweek and the boys enter."
    },
    {
        "character": "Mrs. Tweak",
        "line": "Oh, hello, son. How was your day?"
    },
    {
        "character": "Tweek",
        "line": "UUuuUunh!"
    },
    {
        "character": "Mrs. Tweek",
        "line": "That's good. Who are your little friends?"
    },
    {
        "character": "Tweek",
        "line": "What do you mean?!"
    },
    {
        "character": "Kyle",
        "line": "We're his oral report buddies."
    },
    {
        "character": "Stan",
        "line": "Yeah, we have to stay up all night to write it."
    },
    {
        "character": "Mrs. Tweak",
        "line": "Well, have some coffee boys. I'll brew up another pot for later."
    },
    {
        "character": "",
        "line": "The boys each take a cup."
    },
    {
        "character": "Kyle",
        "line": "Coffee? I don't think I like coffee."
    },
    {
        "character": "Mrs. Tweak",
        "line": "Hoh, you'll like this coffee. It's fresh."
    },
    {
        "character": "Richard",
        "line": "[waxing prosaic] Country fresh, like the morning after a rainstorm."
    },
    {
        "character": "Stan",
        "line": "'Kay. Maybe it'll help us figure out what to do our report on. We have to present it to the entire South Park town committee tomorrow."
    },
    {
        "character": "Richard",
        "line": "Oh. I've got one for you. How about doing a report on how large corporations take over little family-owned businesses?"
    },
    {
        "character": "Mrs. Tweak",
        "line": "Richard!"
    },
    {
        "character": "Richard",
        "line": "No, I'm- serious, hon. These boys should learn how the corporate machine is ruining America. You see, I own a coffee shop and now a great, big, multi-million dollar company is going to move in and try to take all my business, which means I may have to shut down and sell my son Tweek into slavery."
    },
    {
        "character": "Tweek",
        "line": "Mwaaah! Slavery?"
    },
    {
        "character": "Richard",
        "line": "Yes, slavery."
    },
    {
        "character": "Stan",
        "line": "[to Tweek] Wow, that sucks, dude."
    },
    {
        "character": "Richard",
        "line": "They really have my balls in a salad shooter."
    },
    {
        "character": "Kyle",
        "line": "We're already doing a paper on Tweek's underpants gnomes."
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Mrs. Tweak",
        "line": "Now, Tweek, how many times do we have to tell you? Your underpants are missing because you lose them, not because of underpants gnomes."
    },
    {
        "character": "Tweek",
        "line": "Uunnnnhh!"
    },
    {
        "character": "Kyle",
        "line": "Come on, you guys! We better get to work!"
    },
    {
        "character": "",
        "line": "Tweek and the boys leave the kitchen."
    },
    {
        "character": "Richard",
        "line": "Wuh-okay, but corporate takeovers is a much more fertile subject."
    },
    {
        "character": "Mrs. Tweak",
        "line": "Honestly, Richard. I don't see why you have to preach to some eight-year olds."
    },
    {
        "character": "Richard",
        "line": "Actually, honey, I think those little tykes are just what we need. I've got an idea."
    },
    {
        "character": "",
        "line": "Later that night, in Tweek's room, the boys sip their coffee."
    },
    {
        "character": "Kyle",
        "line": "Man, this stuff is strong."
    },
    {
        "character": "Stan",
        "line": "Kind of bitter."
    },
    {
        "character": "Tweek",
        "line": "[in a corner of the room, scared] What if my parents go out of business? Uh what'll I do?"
    },
    {
        "character": "Kyle",
        "line": "[going to him] Don't worry about it."
    },
    {
        "character": "Tweek",
        "line": "But we'll starve and die like dogs."
    },
    {
        "character": "Cartman",
        "line": "Tweek, Tweek, you can always go on welfare. Look at Kenny's family: they're perfectly happy being poor and on welfare. Right, Kenny?"
    },
    {
        "character": "Kenny",
        "line": "(Fuck you!)"
    },
    {
        "character": "Cartman",
        "line": "Heheh, you suck, Kenny."
    },
    {
        "character": "Kyle",
        "line": "Well, let's just try to finish all this coffee, so we can stay up."
    },
    {
        "character": "",
        "line": "Still later: 10:08p.m.. The boys are hyperactive."
    },
    {
        "character": "Stan",
        "line": "Aooooo!"
    },
    {
        "character": "Kyle",
        "line": "Woohoo!"
    },
    {
        "character": "Kenny",
        "line": "(Let me try! Let me try!)"
    },
    {
        "character": "Stan",
        "line": "Yeess, this stuff rocks!"
    },
    {
        "character": "Kyle",
        "line": "Totally, dudes! I feel awesome!"
    },
    {
        "character": "Stan",
        "line": "[running] Whoopee!"
    },
    {
        "character": "",
        "line": "Kenny jumps high enough to knock down the bedside lamp. The shade goes to the floor. 10:09 p.m."
    },
    {
        "character": "Cartman",
        "line": "[running around the rim of a throw rug like an Olympian] You guys! You guys! Seriously! I'm a sorcerer! Zhyagah, zhyah, zhyagot that."
    },
    {
        "character": "Kyle",
        "line": "Hey, Tweek, you got anymore of this stuff?"
    },
    {
        "character": "Tweek",
        "line": "I just have grounds."
    },
    {
        "character": "Kyle",
        "line": "Killer!! [goes for it and eats it raw]"
    },
    {
        "character": "Cartman",
        "line": "[rushing up] Ey, let me have some grounds. [take some, swallows, and throws up]"
    },
    {
        "character": "Kyle",
        "line": "Gross, Cartman. Whoopee!"
    },
    {
        "character": "",
        "line": "10:15 p.m. gives way to 3:26 a.m., which finds the boys sitting against the bed. Tweek is on it, and Cartman is passed out next to the toys, surrounded by pools of vomit. Kenny looks sleepy."
    },
    {
        "character": "Kyle",
        "line": "Hogh, my stomach hurts."
    },
    {
        "character": "Stan",
        "line": "Yeah, mine too. I wonder why."
    },
    {
        "character": "Kyle",
        "line": "[peeved] Well, it's 3:30; I don't see any god-damned underpants gnomes, Tweek."
    },
    {
        "character": "Tweek",
        "line": "Urgh. Uh maybe, maybe it was all in my head. Maybe I'm going insane! Oh no I'm going insane!"
    },
    {
        "character": "Stan",
        "line": "[cross] Well, this is just great! We haven't gotten anything done, and we're totally screwed!"
    },
    {
        "character": "Richard",
        "line": "[checking] How's the report going, boys?"
    },
    {
        "character": "Stan",
        "line": "Bad!"
    },
    {
        "character": "Richard",
        "line": "Oh, do you need some more coffee?"
    },
    {
        "character": "Boys",
        "line": "Eugh."
    },
    {
        "character": "Cartman",
        "line": "No...more...coffee. Blech. [the vomit falls back on him and on the ground]"
    },
    {
        "character": "Richard",
        "line": "Well, boys, uh. I don't mean to pry, but, if you want it, I wrote your report for you."
    },
    {
        "character": "All",
        "line": "[suddenly bright] You did?!"
    },
    {
        "character": "Richard",
        "line": "Yes, it's all about corporate takeovers. Of course, you don't have to use it."
    },
    {
        "character": "Stan",
        "line": "[goes with Kyle to get it] No, we'll use it."
    },
    {
        "character": "Richard",
        "line": "Alright. [Kyle takes it] And it can be our little secret about who wrote it, right?"
    },
    {
        "character": "",
        "line": "Tweek begins to hear some elfin music: \"Time to go to work,\""
    },
    {
        "character": "Kyle",
        "line": "Sure. [\"work all night\"]"
    },
    {
        "character": "Richard",
        "line": "Now, when you give the report, [Tweek gasps and points] just make sure that you read this part first, okay? [the gnomes open the door and enter:\"Search for underpants, heyWe won't stop until we have underpantsYum tum yummy tum day\"]"
    },
    {
        "character": "Tweek",
        "line": "There they are!"
    },
    {
        "character": "Richard",
        "line": "[A gnome goes for Tweek's bottom drawer, opens it, and takes out some underpants.\"Time to go to work, work all nightSearch for underpants, heyWe won't stop until we have underpantsYum tum yummy tum day\"]And when you come up to do it a second time, really, really clear it up, I mean, um, really, really play the sympathy angle. They'll like that. They'll be calling you, and you'll get a passing grade for it."
    },
    {
        "character": "Tweek",
        "line": "[\"Time to go to work, work all nightSearch for underpants, hey!\"]You guys, look! Look! You're missing it![the gnomes take off with two pairs of underpants:\"We won't stop until we have underpantsYum tum yummy tum day!\"]"
    },
    {
        "character": "Tweek",
        "line": "Arrgghh! They took them again!"
    },
    {
        "character": "Kyle",
        "line": "[to Richard] Thanks, dude."
    },
    {
        "character": "Richard",
        "line": "My pleasure. G'night, boys."
    },
    {
        "character": "Stan",
        "line": "Wow, Tweek, your dad rocks!"
    },
    {
        "character": "Tweek",
        "line": "Why do they torture me like this?! Why can't they leave me alone?!"
    },
    {
        "character": "Kyle",
        "line": "Damnit! What the hell is wrong with you, Tweek?!"
    },
    {
        "character": "Tweek",
        "line": "They took my underpants again! Soon they'll want my blood! Blood! Euuggh!"
    },
    {
        "character": "",
        "line": "South Park Elementary, the next day. The five-member South Park committee listens as Tweek's group speaks."
    },
    {
        "character": "Kyle",
        "line": "[haltingly] \"And as the voluminous corporate automaton bulldozes its way through bantam America..."
    },
    {
        "character": "Cartman",
        "line": "[steps forward] What will become of the endeavoring American family?\""
    },
    {
        "character": "Mr. Garrison",
        "line": "[off to one side, notices the lack of fluency] I don't think they wrote this, Mr. Hat."
    },
    {
        "character": "Stan",
        "line": "Perhaps there is no stopping the corporate machine."
    },
    {
        "character": "Tweek",
        "line": "[throbs] Uurrgh!"
    },
    {
        "character": "Kyle",
        "line": "And that's our report, I guess."
    },
    {
        "character": "Mr. Garrison",
        "line": "Well, boys, it's obvious you didn't even--"
    },
    {
        "character": "Lady Member",
        "line": "Great job!"
    },
    {
        "character": "Mr. Garrison",
        "line": "[falling in] Yes, great job."
    },
    {
        "character": "Lady Member",
        "line": "Boys, you have really opened our eyes. We didn't even know this was happening."
    },
    {
        "character": "Cartman",
        "line": "Neither did we."
    },
    {
        "character": "Lady Member",
        "line": "Well, Mr. Garrison, it looks like we were wrong about you. You really are teaching these kids something."
    },
    {
        "character": "Mr. Garrison",
        "line": "Yeah, well, I don't want to sound like a dickhole, but I told you so."
    },
    {
        "character": "Lady Member",
        "line": "Aw, I am really moved. I say we follow these boys's cause. Let's join them in the fight against corporate takeovers! [the members stand] Lead the way, boys!"
    },
    {
        "character": "Stan",
        "line": "Huh??"
    },
    {
        "character": "Tweek",
        "line": "Uunh, it's too much pressure!"
    },
    {
        "character": "",
        "line": "Harbucks is going up."
    },
    {
        "character": "Postum",
        "line": "[directing] Good! Good! Now, make sure that sign is really bright and flashy now."
    },
    {
        "character": "Mrs. Tweak",
        "line": "My goodness. That's going to be a huge coffee house, honey."
    },
    {
        "character": "Richard",
        "line": "Yes, it is. [places his hand over his groin] They really have my balls in a juice maker. [removes it as the boys stop by] Oh, hello, son, uh. How did your report go?"
    },
    {
        "character": "Tweek",
        "line": "Waagh!"
    },
    {
        "character": "Kyle",
        "line": "I think it went really good. Those people really got into it."
    },
    {
        "character": "Richard",
        "line": "Really?? Well, son, you might have just saved the family business. What do you have to say about that?"
    },
    {
        "character": "Tweek",
        "line": "I need coffee."
    },
    {
        "character": "Richard",
        "line": "I know how you boys feel. [walks to a cup on a stump] Sometimes a hot cup of French Roast Amaretto is just what a man needs to get him through the day. That smooth aroma and mild taste is what make Tweek coffee... [picks up the cup and places his left foot on the stump, right hand on his hip] uh very special. Special, like an Arizona sunrise or a juniper wet with dew. A light rain in the middle of a dusty afternoon or a hug from your dear old aunt-- [a chorus is heard]."
    },
    {
        "character": "Tweek",
        "line": "Dad!"
    },
    {
        "character": "Richard",
        "line": "What?"
    },
    {
        "character": "Tweek",
        "line": "The metaphors, man!"
    },
    {
        "character": "Richard",
        "line": "Oh, sorry. Here you go. [hands him the cup]"
    },
    {
        "character": "Kyle",
        "line": "Hey. Do you ever think maybe you shouldn't give your son coffee?"
    },
    {
        "character": "Mrs. Tweak",
        "line": "Liike, how do you mean?"
    },
    {
        "character": "Kyle",
        "line": "Like look at him. He's always shaking and nervous."
    },
    {
        "character": "Tweek",
        "line": "Agghh!"
    },
    {
        "character": "Mrs. Tweak",
        "line": "[holding a bag of Tweekers BLEND] Oh, that. He has ADD, attention deficit disorder. That's why he's so jittery all the time."
    },
    {
        "character": "",
        "line": "The town commitee arrives."
    },
    {
        "character": "Lady Member",
        "line": "Mr. Tweek, we've only just heard."
    },
    {
        "character": "Richard",
        "line": "Oh, hello committee members. What a surprise."
    },
    {
        "character": "Lady Member",
        "line": "So, this is the corporate bulldozer trying to push you off the map. [Harbucks, with four tables on the roof]"
    },
    {
        "character": "Richard",
        "line": "Yes. How did you hear?"
    },
    {
        "character": "Lady Member 2",
        "line": "These boys did an excellent report for us this morning. They're so upset by this whole thing."
    },
    {
        "character": "Kyle",
        "line": "My butt hurts."
    },
    {
        "character": "Lady Member",
        "line": "Don't worry, Mr. Tweek. This committee is not going to let you be run out of business by these bastards! Do you hear that? You're not gonna get away with this, you whore!"
    },
    {
        "character": "Postum",
        "line": "Excuse me?!"
    },
    {
        "character": "Lady Member 2",
        "line": "Boys, we've talked it over, and we want you to take your case to the mayor!"
    },
    {
        "character": "Stan",
        "line": "Our case?"
    },
    {
        "character": "Tweek",
        "line": "Uuhhh, no way, man! That is way too much pressure!"
    },
    {
        "character": "Richard",
        "line": "[dismissing his son's apprehension] Oh, you'll do fine, son."
    },
    {
        "character": "Lady Member 2",
        "line": "Come on, boys! Let's go!"
    },
    {
        "character": "Cartman",
        "line": "[pissed] Aw, man, this sucks!"
    },
    {
        "character": "",
        "line": "The boys begin to walk with the town committee."
    },
    {
        "character": "Tweek",
        "line": "[fretting] Aaarrrnnn!"
    },
    {
        "character": "",
        "line": "City Hall. Mr. Garrison is present with the boys and the town committee."
    },
    {
        "character": "Lady Member",
        "line": "...And we would have never even known that this was happening if not for these boys' excellent report."
    },
    {
        "character": "Mayor",
        "line": "You're telling me that students from Mr. Garrison's class actually did something that had some kind of relevance to the world?"
    },
    {
        "character": "Lady Member",
        "line": "That's right."
    },
    {
        "character": "",
        "line": "Garrison is shown."
    },
    {
        "character": "Mayor",
        "line": "Mr. Garrison, the guy with the puppet?"
    },
    {
        "character": "Lady Member",
        "line": "Yes!"
    },
    {
        "character": "Mayor",
        "line": "Well, I must say, Garrison, perhaps you're not as stupid and crazy as I always tell people you are."
    },
    {
        "character": "Mr. Garrison",
        "line": "Thank you, Mayor. I don't wanna sound like a dickhole, but I-"
    },
    {
        "character": "Lady Member",
        "line": "Mayor, these boys want that Harbucks coffee shut down right now!"
    },
    {
        "character": "Male Member",
        "line": "Yeah!"
    },
    {
        "character": "Lady Member 2",
        "line": "Yeah!"
    },
    {
        "character": "Mayor",
        "line": "Well, I can't just shut them down, this is a free country."
    },
    {
        "character": "Lady Member",
        "line": "But they're ruining our city!"
    },
    {
        "character": "Mayor",
        "line": "Look, the best I can do is create a proposition. We'll call it Prop. 10. The town can vote on it, and if it passes, we'll see what we can do."
    },
    {
        "character": "Blond Member",
        "line": "Hooray!"
    },
    {
        "character": "The Other Members",
        "line": "Hooray!"
    },
    {
        "character": "Lady Member",
        "line": "[ecstatic] What do you say, boys? We're gonna pass a law!"
    },
    {
        "character": "Stan",
        "line": "Uh... Hooray."
    },
    {
        "character": "Mayor",
        "line": "So I guess you wanna do some campaigning. [Tweek hears the gnomes coming] You can do commercials and things like that, and then we'll have a vote in the middle of town. And obviously, if more than 50% of the people even show up...[\"Time to go to work, work all nightSearch for underpants, hey!We won't stop until we have underpantsYum tum yummy tum dayTime to go to work, work all night\" The gnomes go up to Johnson and pull his underpants out]"
    },
    {
        "character": "Tweek",
        "line": "Wagh!"
    },
    {
        "character": "Mayor",
        "line": "[\"Search for underpants, heyWe won't stop until we have...\" A gnome tosses the underpants to two others, who carry it away over their heads. They all leave]...and care enough to want Harbucks out, then, they're out. So, good luck to you. [the town committee leaves]"
    },
    {
        "character": "Tweek",
        "line": "Didn't you see them!?"
    },
    {
        "character": "Mayor",
        "line": "Alright, what's next."
    },
    {
        "character": "Ted",
        "line": "Next is issue 37D, missing underpants. [hands the issue to her]"
    },
    {
        "character": "Johnson",
        "line": "Is it cold in here?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Uh, boys, can I have a quick this and that with you? Boys, I don't know who wrote that report, but now that you've convinced everybody, you'd better stick with it. 'Cause if these people find out you didn't really write that paper, and I actually do get fired, then Mr. Hat is gonna do horrible things to you. [pretends Mr. Hat is saying something to him] Oh, not that, Mr. Hat! That's really horrible! Anyway, good luck passing your new law, boys."
    },
    {
        "character": "Tweek",
        "line": "Jesus, man, Jesus! What are we gonna do, huh?!"
    },
    {
        "character": "",
        "line": "South Park Town Hall Meeting."
    },
    {
        "character": "Host",
        "line": "Live, it's the South Park Town Hall Meeting on Public Access. Tonight's topic: Prop. 10."
    },
    {
        "character": "",
        "line": "The audience claps."
    },
    {
        "character": "Mediator",
        "line": "Should Harbucks be allowed to open a store in South Park? That's tonight's topic. On my left, five innocent, starry-eyed boys from Middle America. [shot of the boys] On my right, a big, fat, smelly corporate guy from New York."
    },
    {
        "character": "Audience",
        "line": "Boo!"
    },
    {
        "character": "Postum",
        "line": "Hey, I'm not fat or smelly!"
    },
    {
        "character": "Mediator",
        "line": "All right, Mr. Douchebag."
    },
    {
        "character": "Postum",
        "line": "Postum!"
    },
    {
        "character": "Mediator",
        "line": "Oh. Pardon me, Mr. Assface. Anyway, let's hear your side of the argument."
    },
    {
        "character": "Audience",
        "line": "Boo!"
    },
    {
        "character": "Postum",
        "line": "My argument is simple. This country's founded on free enterprise. Harbucks is an organization that-"
    },
    {
        "character": "Audience",
        "line": "Hhssssssss!"
    },
    {
        "character": "Postum",
        "line": "An organization that prides itself on great coffee! We simply want tuh-- Oh, to hell with you!"
    },
    {
        "character": "Mediator",
        "line": "[the hissing stops] Okay, ucka-fay. Now for the other side of the argument we turn to our young, handsome lads. [the boys stay silent] Boys, your thoughts. [Tweek twitches] Come on, boys, don't be shy. What's your principal argument?"
    },
    {
        "character": "",
        "line": "Nothing. A stern Mr. Garrison crosses his arms."
    },
    {
        "character": "Kyle",
        "line": "Uh..."
    },
    {
        "character": "Stan",
        "line": "Uh..."
    },
    {
        "character": "Cartman",
        "line": "This guy sucks ass!"
    },
    {
        "character": "Audience",
        "line": "Yeah! Yeah! Woo!"
    },
    {
        "character": "Mediator",
        "line": "Great argument! You win, boys!"
    },
    {
        "character": "Postum",
        "line": "What?!"
    },
    {
        "character": "Mr. Garrison",
        "line": "[softly, relieved] That was close, Mr. Hat."
    },
    {
        "character": "",
        "line": "The boys' first commercial, beginning with an American flag waving, filling the screen."
    },
    {
        "character": "Voice-over",
        "line": "What is the future of America? Is it the money we make? [a $1 bill] The quests we conquer? [the Moon shot] No, it's children. [head shots of Tweek and the boys] So what do children have to say about Prop. 10?"
    },
    {
        "character": "Kyle",
        "line": "[screen right to screen left] I don't like big corporations."
    },
    {
        "character": "Stan",
        "line": "[rising from the bottom] I like small businesses."
    },
    {
        "character": "Cartman",
        "line": "[screen left to screen right] I believe in the family-owned enterprise."
    },
    {
        "character": "Kenny",
        "line": "[dropping from the top] (In my family, it's a silly enterprise.)"
    },
    {
        "character": "Tweek",
        "line": "[screen right to screen left] Aarrgghh!"
    },
    {
        "character": "Voice-over",
        "line": "It's time to stop large corporations. Prop. 10 is about children. Vote Yes on Prop. 10, or else, you hate children. You don't hate... children... do you? Remember, keep American business small, or else. [the kids' heads combust and only their skulls are left in flames, with charred caps.] Paid for by Citizens for a Fair and Equal way to get Harbucks Coffee kicked out of town forever."
    },
    {
        "character": "",
        "line": "The TV clicks off, and everyone is in the studio."
    },
    {
        "character": "Lady Member",
        "line": "Well, what do you think?"
    },
    {
        "character": "Richard",
        "line": "Wow, it it's great!"
    },
    {
        "character": "Lady Member",
        "line": "[confidently] Yes, it is. We'll put it on the air immediately."
    },
    {
        "character": "Richard",
        "line": "What do you think, hon? [she crosses her arms and moves away him. He follows] Hon? What's the matter?"
    },
    {
        "character": "",
        "line": "Mrs. Tweak turns to him."
    },
    {
        "character": "Mrs. Tweak",
        "line": "I have a big problem with this."
    },
    {
        "character": "Richard",
        "line": "What do you mean?"
    },
    {
        "character": "Mrs. Tweak",
        "line": "We are just using those boys for our benefit. They have no idea what they're saying."
    },
    {
        "character": "Richard",
        "line": "But, kids are great to get people on our side."
    },
    {
        "character": "Mrs. Tweak",
        "line": "You don't just throw a child in a political commercial to sell your beliefs. I won't be a part of this anymore. [walks out the door]"
    },
    {
        "character": "Richard",
        "line": "Honey, all's fair in love and war. [softly] And coffee. Hon? Hu-hon?"
    },
    {
        "character": "",
        "line": "Harbucks' grand opening. Protesters arrive."
    },
    {
        "character": "Lady Protester",
        "line": "Take your corporate coffee and go back to New York City!"
    },
    {
        "character": "Crowd",
        "line": "Yeah!!"
    },
    {
        "character": "Blonde Protester",
        "line": "It's people like you who are ruining Main Street, USA!"
    },
    {
        "character": "",
        "line": "Postum looks out through the window."
    },
    {
        "character": "Crowd",
        "line": "That's right! Yeah!"
    },
    {
        "character": "Lady Protester",
        "line": "How many Native Americans did you slaughter to make that coffee, huh?!"
    },
    {
        "character": "Crowd",
        "line": "[after a pause] Yeah!!"
    },
    {
        "character": "Postum",
        "line": "[inside] Damn, these people aren't buying any coffee! I'll have to try and appeal to the younger crowd."
    },
    {
        "character": "",
        "line": "Later. The crowd now marches in front of Harbucks. To the right, Harbucks' mascot, wearing a fez, holds a tray of coffee cups topped with whipped cream before a boy."
    },
    {
        "character": "Postum",
        "line": "[the man in the camel] Hey, kids. I'm Camel Joe and I love a fresh cup of coffee. It's yum diddly-icious, and it makes you feel super! [a small boy is listening] I have a surprise for you: the new Kiddicino from Harbucks; more sugar and all the other goodies kids like with all the caffeine of a normal double latte."
    },
    {
        "character": "",
        "line": "The kid reaches for one."
    },
    {
        "character": "Kid's Mom",
        "line": "[rushing up] No Billy, no coffee for you. [to Camel Joe] You should be ashamed of yourself, using cartoons to push caffeine on children!"
    },
    {
        "character": "Postum",
        "line": "[rips off the helmet] Why don't you go back to the hole you crawled out from, lady?!"
    },
    {
        "character": "Richard",
        "line": "[intervening] Uh, Mr. Postum, I'm afraid you've got a lot to learn about making coffee."
    },
    {
        "character": "Postum",
        "line": "Oh, and you don't? Your coffee tastes like three-day-old moldy diarrhea!"
    },
    {
        "character": "Richard",
        "line": "Uh, I'm sorry to inform you that this town is having a vote tomorrow, and if the law passes, you're gonna be thrown out of town."
    },
    {
        "character": "Postum",
        "line": "What?!"
    },
    {
        "character": "Richard",
        "line": "At five o'clock, the best coffee wins. Either your coffee, or a fresh, warm cup of... Tweek's coffee. [brings out a bag of Tweekers BLEND, then hugs it] Like an old sweater that keeps getting warmer with age, you can count on Tweek's coffee to start your day. [turns and walks away]"
    },
    {
        "character": "Mayor",
        "line": "[arriving with her aides] Tomorrow, for the Prop. 10 vote, we'll set up ballot booths... here. [between the two coffee shops] All right, men, we'll throw up the stage here. Before the vote we'll get a band everyone likes, like uhhhh, like..."
    },
    {
        "character": "Johnson",
        "line": "Toto."
    },
    {
        "character": "Mayor",
        "line": "Like Toto. And then the Harbucks guy will have five minutes to speak and the boys will have five minutes to speak, and then the town votes."
    },
    {
        "character": "Mr. Garrison",
        "line": "[standing with the boys in front of Tweek Bros.] Uh, boys, you better get your asses to work."
    },
    {
        "character": "Cartman",
        "line": "What now?"
    },
    {
        "character": "Mr. Garrison",
        "line": "They're expecting you to give a big speech on corporate takeovers, and this time it has to last five minutes."
    },
    {
        "character": "Kyle",
        "line": "Oh, God, when is this gonna end?"
    },
    {
        "character": "Stan",
        "line": "Your dad really screwed us, Tweek!"
    },
    {
        "character": "Tweek",
        "line": "Jesus, dude! I'm to blame for all this! I'm to blame for everything!"
    },
    {
        "character": "",
        "line": "Tweek's house that night, Tweek's room. Tweek is on the floor and the others are on his bed."
    },
    {
        "character": "Kyle",
        "line": "So what are we gonna say?"
    },
    {
        "character": "Cartman",
        "line": "Why can't we just read the paper we wrote last time?"
    },
    {
        "character": "Stan",
        "line": "'Cause then they'll know we didn't write it, dummy! We have to be original!"
    },
    {
        "character": "Kyle",
        "line": "Does anybody know anything about corporations? [the gnomes return, and Tweek gasps. The door opens and the gnomes enter, singing their theme:\"Time to go to work, work all nightSearch for underpants, hey\"]"
    },
    {
        "character": "Tweek",
        "line": "[\"We won't stop\"] Waagh!"
    },
    {
        "character": "Cartman",
        "line": "[\"until we have underpants\"] I think my mom is a corporation."
    },
    {
        "character": "Stan",
        "line": "[\"Yum tum yummy tum day!\"] Yeah, that makes sense."
    },
    {
        "character": "Tweek",
        "line": "You guys! Sshhhh! [\"Time to go to work\"]"
    },
    {
        "character": "Kyle",
        "line": "Well, how about we just say, \"corporates should be stopped\"?[\"work all nightSearch for underpants, hey\"]"
    },
    {
        "character": "Stan",
        "line": "How do we stretch that into five minutes?"
    },
    {
        "character": "Tweek",
        "line": "They're taking my underpants![\"We won't stop until we have underpantsYum tum yummy tum day\"]"
    },
    {
        "character": "Kyle",
        "line": "[looking down] Will you stop with the underpants gnomes, Tweek?! We have to work here!  [\"Time to go to work\"]"
    },
    {
        "character": "Tweek",
        "line": "[points at the gnomes] Aaaggghhh! [\"work all nightSearch for underpants, hey\"They open the bottom drawer and go for the underpants]"
    },
    {
        "character": "Stan",
        "line": "What the hell? [\"We won't stop\"]"
    },
    {
        "character": "Cartman",
        "line": "[\"until we have underpants\"] Well, I'll be damned."
    },
    {
        "character": "Tweek",
        "line": "[\"Yum tum yummy tum day!\"] That's my last pair of underpants! [\"Time to go to work, work all nightSearch for underpants, hey...\" The gnomes go for the door, and the boys hop off the bed to follow. One gnome stops and faces the boys]"
    },
    {
        "character": "Kyle",
        "line": "Sshh, don't scare him."
    },
    {
        "character": "Stan",
        "line": "Hey there, little guy."
    },
    {
        "character": "Cartman",
        "line": "Bad! [whacks the gnome with a stick]"
    },
    {
        "character": "Kyle",
        "line": "Cartman!"
    },
    {
        "character": "Cartman",
        "line": "What?!"
    },
    {
        "character": "Kyle",
        "line": "Why do you always have to hit stuff with a stick?!"
    },
    {
        "character": "Cartman",
        "line": "Well, look at him. He's all, you know, uh l-look at him. [whacks him again]"
    },
    {
        "character": "Gnome",
        "line": "Is that all you've got, pussy?"
    },
    {
        "character": "Cartman",
        "line": "What?! [advances]"
    },
    {
        "character": "Stan",
        "line": "Hey, he talks!"
    },
    {
        "character": "Cartman",
        "line": "Yeah, he called me a pussy! I'm not a pussy, you're a pussy!"
    },
    {
        "character": "Gnome",
        "line": "You're a pussy, pussy!"
    },
    {
        "character": "Cartman",
        "line": "Ey!"
    },
    {
        "character": "Stan",
        "line": "Dude, why are you taking Tweek's underpants?"
    },
    {
        "character": "Kyle",
        "line": "Yeah, look what you're doing to this poor kid."
    },
    {
        "character": "Tweek",
        "line": "Waggh."
    },
    {
        "character": "Gnome",
        "line": "Stealing underpants big business."
    },
    {
        "character": "Stan",
        "line": "Business? Wait, do you know anything about business?"
    },
    {
        "character": "Gnome",
        "line": "Sure, that's what gnomes do."
    },
    {
        "character": "Kyle",
        "line": "Show us."
    },
    {
        "character": "Gnome",
        "line": "O-kay. Follow me. [goes for the door]"
    },
    {
        "character": "Cartman",
        "line": "[muttering] Little pussy gnome. Don't call me a pussy, pussy gnome."
    },
    {
        "character": "",
        "line": "The woods. The gnome leads them on to his cave."
    },
    {
        "character": "Gnome",
        "line": "Not much longer now."
    },
    {
        "character": "Cartman",
        "line": "Oh, are you gonna take us to your little pussy house?"
    },
    {
        "character": "Gnome",
        "line": "No, pussy, I'm taking you to my village."
    },
    {
        "character": "Cartman",
        "line": "Oh, your pussy village?"
    },
    {
        "character": "Stan",
        "line": "Cartman, will you just shut up and let him show us?"
    },
    {
        "character": "Gnome",
        "line": "[reaches a tree, knocks on its base and a door opens] Follow me."
    },
    {
        "character": "Cartman",
        "line": "[the boys look at him] I hope we're not wasting our time with this little pecker."
    },
    {
        "character": "",
        "line": "Starbucks, early morn. Workers put on the finishing touches to the coffee store."
    },
    {
        "character": "Postum",
        "line": "Well, it looks like Harbucks will never make it in this town. [turns around] All right, boys, that's it. Pack it up, we're movin' out of town."
    },
    {
        "character": "Worker 1",
        "line": "Aw, but we just finished."
    },
    {
        "character": "Postum",
        "line": "I know, but these folks obviously don't want us here."
    },
    {
        "character": "Worker 2",
        "line": "But what will become of us?"
    },
    {
        "character": "Postum",
        "line": "Oh, quit being so melodramatic, Sanchez. Jesus Christ!"
    },
    {
        "character": "",
        "line": "Underground. The boys are still following the gnome."
    },
    {
        "character": "Stan",
        "line": "Damn, dude, this place is huge!"
    },
    {
        "character": "",
        "line": "Before them is a pile of underpants as tall as a man. Some of them are colored."
    },
    {
        "character": "Kyle",
        "line": "Yeah. It's almost as big as Cartman's ass."
    },
    {
        "character": "Cartman",
        "line": "[exhales] No it isn't, you guys!"
    },
    {
        "character": "Gnome",
        "line": "This is where all our work is done."
    },
    {
        "character": "Cartman",
        "line": "So what are you gonna do with all these underpants that you steal?"
    },
    {
        "character": "Gnome",
        "line": "Collecting underpants is just phase 1. Phase 1: collect underpants."
    },
    {
        "character": "Kyle",
        "line": "Sooo, what's phase 2?"
    },
    {
        "character": "Gnome",
        "line": "[has no response. Looks around, then calls out to the other gnomes on the underpants mound] Hey, what's phase 2?"
    },
    {
        "character": "Gnome 2",
        "line": "Phase 1: we collect underpants."
    },
    {
        "character": "Gnome",
        "line": "Yeah yeah yeah, but, what about phase 2?"
    },
    {
        "character": "Gnome 2",
        "line": "[says nothing, then] Well, phase 3 is profit. Get it?"
    },
    {
        "character": "Stan",
        "line": "I don't get it."
    },
    {
        "character": "Gnome 2",
        "line": "[walks up to a large chart] You see,Phase 1: collect underpants. Phase 2: ... Phase 3: Profit."
    },
    {
        "character": "Cartman",
        "line": "Oh, I get it."
    },
    {
        "character": "Stan",
        "line": "No you don't, fatass!"
    },
    {
        "character": "Kyle",
        "line": "Do you guys know anything about corporations?"
    },
    {
        "character": "Gnome",
        "line": "You bet we do!"
    },
    {
        "character": "Gnome 2",
        "line": "Us gnomes are geniuses at corporations."
    },
    {
        "character": "Gnomes",
        "line": "[three of them move a cart up a track]Time to go to work, work all nightSe--"
    },
    {
        "character": "Center Gnome",
        "line": "[the cart falls off the track and on down] Jesus Christ, look out!"
    },
    {
        "character": "",
        "line": "The cart lands on Kenny."
    },
    {
        "character": "Stan",
        "line": "Oh my God, they killed Kenny."
    },
    {
        "character": "Kyle",
        "line": "You bastards. Listen, we have to give a huge speech tomorrow about corporate takeovers."
    },
    {
        "character": "Gnome",
        "line": "Holy shit! We've killed your friend!"
    },
    {
        "character": "Stan",
        "line": "Yeahyeahyeah. Look. We've gotta know about corporate takeovers tomorrow or we're screwed."
    },
    {
        "character": "Gnome 2",
        "line": "Christ, we squished him like a bug!"
    },
    {
        "character": "Stan",
        "line": "Do you know anything about corporate takeovers?"
    },
    {
        "character": "Gnome",
        "line": "Well, we can explain that to you easily."
    },
    {
        "character": "Gnome 2",
        "line": "Yes, for a price."
    },
    {
        "character": "Kyle",
        "line": "What?"
    },
    {
        "character": "Gnome",
        "line": "You know."
    },
    {
        "character": "Stan",
        "line": "Underpants?"
    },
    {
        "character": "Gnomes",
        "line": "Underpants!"
    },
    {
        "character": "",
        "line": "Harbucks, daytime. Prop. 10 supporters are out in force and Toto is performing."
    },
    {
        "character": "Lady Member",
        "line": "[taking the stage] Toto, ladies and gentlemen!"
    },
    {
        "character": "",
        "line": "The band leaves."
    },
    {
        "character": "Prop. 10 Supporter",
        "line": "Yeah, Toto! Whoo, Toto! Woo!"
    },
    {
        "character": "Lady Member",
        "line": "All right. And now, before we all vote yes on Prop. 10, here to remind us why are the lovable, innocent children."
    },
    {
        "character": "Stan",
        "line": "Uh. Since we are so concerned with the corporate takeovers, we went and asked our friends, the underpants gnomes, and they told us all about big corporations."
    },
    {
        "character": "Supporter",
        "line": "Underpants gnomes?"
    },
    {
        "character": "Kyle",
        "line": "Big corporations are good!"
    },
    {
        "character": "Supporter",
        "line": "What?"
    },
    {
        "character": "Supporter 2",
        "line": "What's this?"
    },
    {
        "character": "Supporter 3",
        "line": "Good? [the Lady Member is cross]"
    },
    {
        "character": "Kyle",
        "line": "Because without big corporations we wouldn't have things like cars and computers and canned soup."
    },
    {
        "character": "Stan",
        "line": "Even Harbucks Coffee started off as a small, little business. But because it made such great coffee, and because they ran their business so well, they managed to grow and grow until it became the corporate powerhouse it is today. And that is why we should all let Harbucks stay!"
    },
    {
        "character": "",
        "line": "The crowd is stunned."
    },
    {
        "character": "Townsman",
        "line": "Ogh."
    },
    {
        "character": "Lady Member",
        "line": "That's not what you said last time."
    },
    {
        "character": "Kyle",
        "line": "Uuuh. Well, the truth is, we didn't write that paper last time."
    },
    {
        "character": "",
        "line": "Gasps from the crowd."
    },
    {
        "character": "Mr. Garrison",
        "line": "You little turds!! You've ruined my life for the last time!!"
    },
    {
        "character": "",
        "line": "Officer Barbrady and another man haul him off. Mrs. Tweek claps for the boys and goes onstage."
    },
    {
        "character": "Mrs. Tweak",
        "line": "These boys are absolutely right. We've been using these poor kids to pull at your heartstrings for our cause, and it's wrong. We're as low and despicable as Rob Reiner. You keep protesting and complaining, but did any of you ever even bother to taste Harbucks coffee? [shot of the town committee. The crowd blinks] Harbucks coffee got to where it is by being the best. Don't you think you should at least try it?"
    },
    {
        "character": "",
        "line": "The crowd parts as Postum exits Harbucks with a tray of his coffee, then closes in to get the coffee. Some people taste it."
    },
    {
        "character": "Townsman",
        "line": "Hey, this is pretty damn good."
    },
    {
        "character": "Townsman 2",
        "line": "Yeah, it doesn't have that bland, raw, sewage taste that Tweek's coffee has."
    },
    {
        "character": "Richard",
        "line": "[comes over for a taste] Hey. Hey, that is good."
    },
    {
        "character": "Postum",
        "line": "It's a French roast."
    },
    {
        "character": "Richard",
        "line": "It's subtle and mild. Mild, like that first splash of sun on an April  morning. This coffee is coffee the way it should be."
    },
    {
        "character": "Postum",
        "line": "Hehey, no hard feelings, Tweek. You know, we still need someone to run this Harbucks coffeehouse. I'm sure it will make a lot of money."
    },
    {
        "character": "Richard",
        "line": "Thank you, Mr. Postum, but I think we'll be happy with the money we make selling our son into slavery."
    },
    {
        "character": "Tweek",
        "line": "Aggghhh!"
    },
    {
        "character": "Richard",
        "line": "Just kidding, son."
    },
    {
        "character": "",
        "line": "Everyone laughs. The gnomes come and remove the pants from a townsman behind Tweek's right shoulder."
    },
    {
        "character": "Cartman",
        "line": "I love you guys. [more laughter]"
    },
    {
        "character": "",
        "line": "'[End of Gnomes. And what do the gnomes sing?Time to go to work, work all nightSearch for underpants, hey!We won't stop until we have underpantsYum tum yummy tum day!]'"
    }
]