[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "Randy",
        "line": "Hey, good morning, everybody. Welcome to Tegridy Breakfast, the show where we talk about everything Tegridy Farms. I'm Randy Marsh."
    },
    {
        "character": "Towelie",
        "line": "Hehehey, folks. I'm Towelie."
    },
    {
        "character": "Randy",
        "line": "Today we're gonna talk about what's been growing on the farm, especially our new Tegridy Thanksgiving Special. [displays the new strain in a mason jar]"
    },
    {
        "character": "Towelie",
        "line": "I'll tell you what. I-I, I smoked that out of a four-foot bong, and it just about destroyed my fro-"
    },
    {
        "character": "Agent",
        "line": "[coming in with another agent and two police officers] Alright, wrap it up! Shut this down! Come on, Marsh, Let's go."
    },
    {
        "character": "Randy",
        "line": "Guh, uh go where?"
    },
    {
        "character": "Agent",
        "line": "Everyone's had enough, Mr. Marsh. I'm gonna need you to come with us. [an officer steps forth to arrest him]"
    },
    {
        "character": "Randy",
        "line": "[stands, to be arrested] What the hell are you do-? [remembers his show] Sorry, everybody. We'll be right back."
    },
    {
        "character": "Officer 1",
        "line": "Let's go!"
    },
    {
        "character": "",
        "line": "Tegridy Farms, day, outside"
    },
    {
        "character": "Randy",
        "line": "What do you think you're-? My show! My Tegridy Farms show!"
    },
    {
        "character": "",
        "line": "City Hall, later. The City Council is in session. The officer brings Randy in, handcuffed"
    },
    {
        "character": "Randy",
        "line": "Hello, Mayor. Mr. and Mrs. Tweek, ... Mackey."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Mr. Marsh, do you remember a few weeks ago when homes in South Park were attacked by a terrorist called Mexican Joker?"
    },
    {
        "character": "Randy",
        "line": "Yah, Mexican Joker. That was terrible."
    },
    {
        "character": "Mayor",
        "line": "Right. Except there was no Mexican Joker. It was you who blew up people's yards because they were home-growing their own marijuana."
    },
    {
        "character": "Randy",
        "line": "[bites his lip, then chuckles] Well, that's ridiculous."
    },
    {
        "character": "Mayor",
        "line": "The Tweeks have come forward with some footage caught on their security camera."
    },
    {
        "character": "Randy",
        "line": "Guys, I have nothing against homegrowers."
    },
    {
        "character": "Mayor",
        "line": "Run the footage, please! [her aide starts up the video. Randy is shown creeping up to a homegrown operation and pissing into it.]"
    },
    {
        "character": "Randy",
        "line": "Hm... [the footage shown him getting deeper into the small garden and pooping in it] Hmmm... [then it shows him burying an explosive and walking away. Two seconds later there's an explosion and the camera footage is interrupted.]"
    },
    {
        "character": "Mayor",
        "line": "People are fed up, Marsh. The past few weeks you've held parades for yourself, needlessly slaughtered a thousand cows, made deals with the Chinese, and nearly poisoned everyone with your Halloween Special. Everyone's had enough of Tegridy Farms."
    },
    {
        "character": "Randy",
        "line": "Enough of Tegridy Farms? South Park is NOTHING without Tegridy Farms!"
    },
    {
        "character": "Mayor",
        "line": "You'll be taken to county jail to await your trial. Get him out of here. [an attending officer comes in to do the job]"
    },
    {
        "character": "Randy",
        "line": "I didn't do anything wrong! [the officer pulls Randy up to his feet and walks him away] You people are just jealous! Jealous that I took over South Park and I'm successful! [the officer takes Randy out of the office]"
    },
    {
        "character": "Mayor",
        "line": "Well. At least now South Park can start getting back to normal."
    },
    {
        "character": "",
        "line": "The neighborhood park, day. Two teams of six players each oppose each other in a game of football. Kenny has the ball and Cartman is set to receive it."
    },
    {
        "character": "Cartman",
        "line": "Titty farts! Titty farts dog wiener. [backs away] Dog wiener, dog wiener! [gets back into position] Pubic mound. Pubic mound. "
    },
    {
        "character": "Kyle",
        "line": "Just hike the stupid ball, Cartman."
    },
    {
        "character": "Cartman",
        "line": "Pubic mound titty farts hike! [receives the ball from Kenny. Kyle counts down 15 seconds before Cartman throws the ball.]"
    },
    {
        "character": "Kyle",
        "line": "Mississippi one Mississippi two Mississippi three Mississippi four Mississippi five Mississippi six Mississippi seven Mississippi eight Mississippi nine Mississippi ten Mississippi eleven Mississippi twelve Mississippi thirteen Mississippi fourteen Mississippi."
    },
    {
        "character": "Jason",
        "line": "[while Kyle counts] Hey, I'm open!"
    },
    {
        "character": "Cartman",
        "line": "[while Kyle counts] You can't catch!"
    },
    {
        "character": "Jason",
        "line": "[while Kyle counts] Dude, I'm wide open! [Cartman releases the ball, and it goes high. Jason goes into the street to catch it, but is struck down by a police car and killed. The officer doesn't stop. The ball comes down next to Jason two seconds later. Most of the boys are aghast]"
    },
    {
        "character": "Cartman",
        "line": "That totally would have been a touchdown."
    },
    {
        "character": "",
        "line": "The Church, day. Funeral music plays. Mrs. White is heard crying. Jason's casket and picture are shown"
    },
    {
        "character": "Fr. Maxi",
        "line": "Little Jason White was a happy child. A playful child. And ultimately it was his playfulness in sports that got him killed in a freak hit-and-run accident. The father would like to now say a few words. [leaves the podium and gives Bob a quick hug as Bob takes the podium.]"
    },
    {
        "character": "Bob",
        "line": "I'm Robert White, Jason's father, and I can tell you that as a White, Jason lived a challenged life. When I look out on this congregation, I can't help but think, \"There's not a whole lot of people here.\" Doesn't seem like a big deal. Nobody's outraged. 'Cause it was our family. Nobody cares when a White gets killed by the police. There should be protests and marches, but NO. The police killed a White! That's not protest-worthy! Everybody's busy trying to lock up Randy Marsh! Now my wife and I have a dead child and we can't even get any weed to make us feel better! Yeah, don't listen to me. I'm just a White. [leaves the podium. His wife is still crying.]"
    },
    {
        "character": "",
        "line": "Tegridy Farms, day. Sharon is at the dinner table addressing her kids"
    },
    {
        "character": "Sharon",
        "line": "Kids, I have something to tell you, but I don't want you to be scared, okay? Daddy is... in police custody until there's a hearing. He could be in jail for a long time."
    },
    {
        "character": "Shelly",
        "line": "Do you promise?"
    },
    {
        "character": "Stan",
        "line": "Like, how long is \"a long time\"? Could it be years?"
    },
    {
        "character": "Sharon",
        "line": "It could be, sweetheart. We don't know."
    },
    {
        "character": "Stan",
        "line": "YES!"
    },
    {
        "character": "Shelly",
        "line": "Is it possible he could get out of it?"
    },
    {
        "character": "Sharon",
        "line": "Of course it's possible, honey"
    },
    {
        "character": "Shelly",
        "line": "Egh! [looks away angrily]"
    },
    {
        "character": "Stan",
        "line": "But if he doesn't get out of it, then what happens to us?"
    },
    {
        "character": "Sharon",
        "line": "We probably have to sell the farm and move, back to town, and, sort of, live our lives without the marijuana business and without daddy. [a smile keeps breaking through as she explains things] Juts... try to stay hopeful, kids."
    },
    {
        "character": "Stan",
        "line": "We will, Mom. You too."
    },
    {
        "character": "Sharon",
        "line": "Okay, you too, Shelly."
    },
    {
        "character": "Shelly",
        "line": "Okay, Mom. You too."
    },
    {
        "character": "",
        "line": "The White House, day. President Garrison is in the Oval Office cracking nuts and eating them. The phone rings and he picks up."
    },
    {
        "character": "Garrison",
        "line": "What? ...Who? ...Oh okay, sure, put him through. This is the President."
    },
    {
        "character": "Randy",
        "line": "Hi, Mr. Ga- Mr. President, Uh, I'm really sorry to bother you. Look, uh... I'm in a bit of trouble."
    },
    {
        "character": "Garrison",
        "line": "Huho, tell me about it."
    },
    {
        "character": "Randy",
        "line": "Yeah, they uh, someone got some supposed evidence on me doing something... \"illegal\" and uh."
    },
    {
        "character": "Garrison",
        "line": "Well, did you tell everyone you didn't do anything wrong?"
    },
    {
        "character": "Randy",
        "line": "Y-yeah, of course."
    },
    {
        "character": "Garrison",
        "line": "Well, did you then go on the attack and swap the accusations to make yourself a victim?"
    },
    {
        "character": "Randy",
        "line": "Did I what?"
    },
    {
        "character": "Garrison",
        "line": "Oh Jeez, DARVO, Randy. Deny, Attack, Reverse Victim and Offender. Alright, let's role-play. You be your accusers and I be you. Okay, go."
    },
    {
        "character": "Randy",
        "line": "Uh, uhm, \"Hey, you! You blew up people's yards who were growing their own marijuana!\""
    },
    {
        "character": "Garrison",
        "line": "\"No I didn't! Are you joking, you psychopath?! Now you're blowin' up my yard!\" Go ahead, try another one."
    },
    {
        "character": "Randy",
        "line": "\"You, you illegally damaged property and made your business-\""
    },
    {
        "character": "Garrison",
        "line": "\"You damage property to make your business more profitable, you lying sack of shit! I'm not gonna be bullied by you!\" See? [looks at footage of himself speaking on several screens] It's really not that hard, just takes a little chin wiggle."
    },
    {
        "character": "Randy",
        "line": "Jeez, you're really good at that. Look, what I really need from you is some personnel. Do you know any good lawyers?"
    },
    {
        "character": "Garrison",
        "line": "Do I know any good lawyers? No, but I do know Rudy Giuliani. [at this point Rudy peaks out from under the desk.]"
    },
    {
        "character": "Giuliani",
        "line": "Hehey hey, fuck you!"
    },
    {
        "character": "Garrison",
        "line": "The fuck you, Rudy. Are you finished cleaning up those pistachio nuts yet?"
    },
    {
        "character": "Giuliani",
        "line": "Yeah, that's all of them, Mr. President."
    },
    {
        "character": "Garrison",
        "line": "Listen, Randy, I'm gonna throw you a bone. You just sit tight and I'll have him take care of this."
    },
    {
        "character": "",
        "line": "Tegridy farms, day. The Broflovskis ring the front door bell"
    },
    {
        "character": "Sharon",
        "line": "Sheila, Gerald, hi."
    },
    {
        "character": "Sheila",
        "line": "Hi, Sharon. We just know you're going through a really hard time right now. We wanted to bring you guys some lasagna."
    },
    {
        "character": "Sharon",
        "line": "Oh that's so sweet, thank you. Other families have brought some stuff too. Come on in. [Gerald and Sheila go in and find something of a party going on. Shelly is dancing on the sofa] Hey guys. We got lasagna. [Stan, Butters, and Cartman show up and run around her]"
    },
    {
        "character": "Shelly",
        "line": "I love lasagnaaa."
    },
    {
        "character": "Sharon",
        "line": "No running in the house, you little turkeys. [the boys run off, and Gerald and Sheila join her]"
    },
    {
        "character": "Sheila",
        "line": "Oh, look at that, Sharon. You took down all the pictures of marijuana."
    },
    {
        "character": "Sharon",
        "line": "Oh, yeah. You know, just too painful. You know, they remind me of Randy. That's why I took Randy's pictures as well, because, you know, they remind me of Randy."
    },
    {
        "character": "Linda Black",
        "line": "Look, I'm sorry if you don't want to talk about it, but have you thought of what you guys might do if Randy gets put away?"
    },
    {
        "character": "Sharon",
        "line": "Yeah, I've kind of made a list of all the things I might do. It's kind of a long list."
    },
    {
        "character": "Bob",
        "line": "Oh, isn't this lovely? [The music scratches to a stop. He, his wife and their daughter are just inside] The whole town, turning out to support the Marsh family in their time of need. [looks of shock great them] Our son was killed by the police."
    },
    {
        "character": "Mrs. White",
        "line": "[sobbing] Why?"
    },
    {
        "character": "Bob",
        "line": "Would have been nice if somebody had brought us some lasagna. You know, if I'm not mistaken, it almost seems like you people are happy that Tegridy Farms is being indicted. It's almost like you're reveling in it. My wife and I were both Tegridy Plus members! We always believed in Randy Marsh. We believed... in Tegridy. And now there's less Whites. Now there's less Whites. [they turn and leave]"
    },
    {
        "character": "Butters",
        "line": "Oh Jeez. We should have never played football that close to the road."
    },
    {
        "character": "Cartman",
        "line": "Yeah, this isn't right."
    },
    {
        "character": "Butters",
        "line": "Wu-where are you going, Eric?"
    },
    {
        "character": "Cartman",
        "line": "I think I might be able to help them. [follows the Whites out]"
    },
    {
        "character": "",
        "line": "Tegridy Farms, outside. The Whites are close to the entrance when Eric calls out to them"
    },
    {
        "character": "Cartman",
        "line": "Mr. and Mrs. White! [The Whites stop and he catches up to them] I'm sorry about what happened. I knew Jason pretty well. He was a shitty receiver, but he would have wanted his parents to... move on. And help a new child."
    },
    {
        "character": "Mrs. White",
        "line": "What? What do you mean?"
    },
    {
        "character": "Cartman",
        "line": "A few weeks ago, I was sent somewhere. It was a place where people like you could find a way to fill that empty hole."
    },
    {
        "character": "",
        "line": "Texas detention center, day. An ICE bus pulls up and unloads its passengers, all parents seeking children to adopt"
    },
    {
        "character": "Jeff",
        "line": "Welcome, everyone. My name is Jeff. We're thrilled you've come to help out and adopt. The parents of the children inside have all been deported, but the kids are legal citizens, since they were born in the United States. [he leads the group inside and down some hallways lined with kennels] Mr. and Mrs. White?"
    },
    {
        "character": "Bob",
        "line": "Yes?"
    },
    {
        "character": "Jeff",
        "line": "We've all heard about your tragic loss. I'd love to help out however I can. Is there something specific you're looking for?"
    },
    {
        "character": "Mrs. White",
        "line": "We... don't really know."
    },
    {
        "character": "Jeff",
        "line": "Well, we've got all kinds here, depending on your preferences. [points out the various kinds of kids he has as they move down the hallway] Here's a little Panamanian. They're very clean. This is a Colombian shorthair. Oh, and this is a good one. This is a Baja shepherd."
    },
    {
        "character": "Baja Shepherd",
        "line": "Quiero a mi papá. Quiero a mi mamá. [\"I want my dad. I want my mom.\"]"
    },
    {
        "character": "Jeff",
        "line": "Bien, gracias. ¿Y tú? [\"Fine, thanks. And you?\"]"
    },
    {
        "character": "Bob",
        "line": "Oh, honey. Look at the Peruvian hairless."
    },
    {
        "character": "Jeff",
        "line": "Yes, they're pretty silly-looking. Great with kids though."
    },
    {
        "character": "Bob",
        "line": "Hey, what's this little guy?"
    },
    {
        "character": "Jeff",
        "line": "Oh, why, this is a purebred Mexican. He's had all his shots; parents were deported two weeks ago. Here, we can let him run around a little bit. [opens the kennel to let the boy out]"
    },
    {
        "character": "Mexican",
        "line": "[steps out] Mi familia. ¿Dónde está? [\"My family. Where is it?\"]"
    },
    {
        "character": "Jeff",
        "line": "Bien, gracias. ¿Y tú? [\"Fine, thanks. And you?\"]"
    },
    {
        "character": "Mrs. White",
        "line": "Oh Bob, he's kind of perfect."
    },
    {
        "character": "Bob",
        "line": "Hello, little fellow. How would you like to be a White? [the boy is dumbfounded]"
    },
    {
        "character": "",
        "line": "County Jail Infirmary at South Park, day. It has 8 beds, six of which are filled. Randy is in the one at far right. A doctor is checking out his ears"
    },
    {
        "character": "Randy",
        "line": "Look, doctor. You have to give me something. I'm really sick."
    },
    {
        "character": "Doctor",
        "line": "What exactly are your symptoms?"
    },
    {
        "character": "Randy",
        "line": "I'm like, starting to question things that I've done. Like, starting to question the person I've become. And I can't sleep at night I, I just lay in my cell wondering if I've been a bad father lately, and a bad husband, and... please, it really hurts. I need some marijuana."
    },
    {
        "character": "Doctor",
        "line": "Sounds like you haven't had access to marijuana for a while, now reality is setting in."
    },
    {
        "character": "Randy",
        "line": "I just need a little medicinal weed and these symptoms will all go away."
    },
    {
        "character": "Doctor",
        "line": "Well maybe they shouldn't go away. Maybe this is your wake-up call that you've been abusing drugs, and need to face all your wrongdoings, try to turn your life around."
    },
    {
        "character": "Randy",
        "line": "You need to turn your life around! Clearly you have the addiction problem and I'm just your whipping boy!"
    },
    {
        "character": "Doctor",
        "line": "That's not going to work, Mr. Marsh. You're not the President of the United States."
    },
    {
        "character": "Randy",
        "line": "Ahh, poop!"
    },
    {
        "character": "",
        "line": "The White house, evening. The Whites and their newly-adopted son are enjoying TV dinners in the living room. The boy studies them"
    },
    {
        "character": "Mrs. White",
        "line": "Well Alejandro, how are you enjoying being a White so far?"
    },
    {
        "character": "Alejandro",
        "line": "Mi familia. ¿Dónde está? [\"My family. Where is it?\"]"
    },
    {
        "character": "Mrs. White",
        "line": "Bien, gracias. ¿Y tú? [\"Fine, thanks. And you?\"]"
    },
    {
        "character": "Bob",
        "line": "Yes, it's good us Whites have each other, Alejandro, because... I need to tell you something. You see, now that you're a White, life isn't gonna be so easy. You're gonna find that a lot of people in this world just don't care about the Whites."
    },
    {
        "character": "Mrs. White",
        "line": "You'll hear about how others in the world are mistreated, but nobody will care when you are."
    },
    {
        "character": "Crystal",
        "line": "Being a White is the hardest thing ever."
    },
    {
        "character": "Bob",
        "line": "That's my little White. [the boy is using a phone all of a sudden. Bob notices something onscreen] Oh, turn it up, honey."
    },
    {
        "character": "Anchor",
        "line": "And the President of the United States today called the allegations against Randy Marsh \"total, buttfucking bullshit,\" and claims the neighbors who came forward with the evidence video are \"tampon-faced, 69ing whistleblowers.\" When asked for clarification, the President's lawyer and treasonous pig Rudy Giuliani, had this to say."
    },
    {
        "character": "Giuliani",
        "line": "Ohhh, this is just a conspiracy. It's conspiracy! And we need everyone out there who, who don't think their voices are heard, to make their voices louder!"
    },
    {
        "character": "Bob",
        "line": "Uh, he's absolutely right. Starting tomorrow, the Whites are gonna start actively trying to stop all this trial nonsense."
    },
    {
        "character": "Mrs. White",
        "line": "Bob, Alejandro's on your phone and it's past phone use time."
    },
    {
        "character": "Bob",
        "line": "Hey! [snatches the phone from him.] Why, he's trying to call Mexico! Alejandro, the Whites do not use mobile devices after 7 pm."
    },
    {
        "character": "Mrs. White",
        "line": "Why would he try to call long distance to Mexico? Does he just assume that the Whites have all the money in the world?"
    },
    {
        "character": "Bob",
        "line": "The Whites don't call long distance! [bops Alejandro on the head with the remote control]"
    },
    {
        "character": "Mrs. White",
        "line": "Jason never tried to use mobile devices after the cutoff time. Jason never tried to call long distance. [begins to cry and leaves the living room]"
    },
    {
        "character": "Bob",
        "line": "Well good job, Alejandro! Now you've upset your mother!"
    },
    {
        "character": "Alejandro",
        "line": "¡Esa no es mi madre! [\"That's not my mother!\"]"
    },
    {
        "character": "Mr. White",
        "line": "Bien, gracias. ¿Y tú? [Alejandro looks at him quizzically]"
    },
    {
        "character": "",
        "line": "County Prison Therapy Room. Two guards keep watch over eight inmates in this room. A Relationship graph is drawn on a whiteboard under the room's sign"
    },
    {
        "character": "Randy",
        "line": "I've had a lot of time to just sit in here and think. I'm starting to realize I have this pattern of behavior where I... always want more. More weed, more drinks, more deals with the Chinese. It's never enough. See, I've always had my flaws, but at the end of the day, I cared about people. You know what the President said? He said just deny everything and make yourself the victim. Yeah, well... maybe he's part of how I got here. Maybe the President has brought down my moral meter. I don't mean to cast blame - I'm to blame - but... ever since he was elected, I've compared my morals to his. And no matter how awful I am, I'm never as bad a the President, so I'm... okay."
    },
    {
        "character": "",
        "line": "The Whites are in front of a market. Alejandro and Crystal carry bells in their hands, Bob has a clipboard, and his wife carries a sign: \"STOP THIS RIDICULOUS PERSECUTION!\""
    },
    {
        "character": "Bob",
        "line": "Help support Tegridy Farms and Randy Marsh! Randy Marsh has done nothing wrong! Stop the ridiculous persecution! [Alejandro is mad, so he doesn't ring his bell]"
    },
    {
        "character": "Mrs. White",
        "line": "Exonerate Tegridy Farms? [a woman walks into the store without stopping to contribute.] Oh yeah! Just ignore us! The Whites are used to it!"
    },
    {
        "character": "Bob",
        "line": "Good one, honey."
    },
    {
        "character": "Crystal",
        "line": "Daddy! Alejandro isn't ringing his bell!"
    },
    {
        "character": "Bob",
        "line": "Alejandro! There's few enough of us as it is! We're not gonna stop this trial unless all the Whites chip in! [takes the bell from Alejandro and rings it] Now ring your bell! [bops him on the head with it, rings it, and gives it back to him.]"
    },
    {
        "character": "Alejandro",
        "line": "[throws his bell away] ¡No quiero estar aquí! [\"I don't want to be here!\"]"
    },
    {
        "character": "Mrs. White",
        "line": "It's like he doesn't appreciate us, Bob."
    },
    {
        "character": "Bob",
        "line": "Oh, I know."
    },
    {
        "character": "Mrs. White",
        "line": "I mean, we give him a place to live, food, we take care of him."
    },
    {
        "character": "Bob",
        "line": "It just... [soft gasp] he just doesn't seem happy. Maybe if we got him a little thing to take care of and feed he'd understand how much responsibility it is."
    },
    {
        "character": "",
        "line": "Texas detention center, day. The Whites are back at the detention center with Alejandro"
    },
    {
        "character": "Jeff",
        "line": "We're so glad you came back, Mr. and Mrs. White. We have even more kids now whose parents have been deported."
    },
    {
        "character": "Bob",
        "line": "See one you like, Alejandro? Now that you're a White, you can pick anyone you want."
    },
    {
        "character": "Jeff",
        "line": "Oh, here's a good one. Four years old, parents just deported yesterday. He's a Panamanian podengo pequeño."
    },
    {
        "character": "Bob",
        "line": "Do you like him, Alejandro?"
    },
    {
        "character": "Jeff",
        "line": "We could see how he gets along with the kids. [opens the kennel door and the boy walks out]"
    },
    {
        "character": "Panamanian",
        "line": "Quiero a mi mamá. [\"I want my mom.\"]"
    },
    {
        "character": "Alejandro",
        "line": "Nunca la vas a ver. [\"You won't see her again\".]"
    },
    {
        "character": "Mrs. White",
        "line": "Oh look. I think he likes him."
    },
    {
        "character": "Bob",
        "line": "Alright, Alejandro, but you have to take care of him and clean up after him."
    },
    {
        "character": "Mrs. White",
        "line": "This is a great addition to our family."
    },
    {
        "character": "Bob",
        "line": "Yeah. [in her ear] Now there will be more Whites to stop those needless hearings."
    },
    {
        "character": "",
        "line": "South Park County Prison, Cell 13. Randy sits alone in this cell looking at a picture of his family."
    },
    {
        "character": "Officer Peterson",
        "line": "Hey Marsh, you got a visitor."
    },
    {
        "character": "Randy",
        "line": "I do?"
    },
    {
        "character": "Officer Peterson",
        "line": "[taking Randy to the visiting room] Fifteen minutes. That's all you get. [Randy goes in]"
    },
    {
        "character": "Giuliani",
        "line": "Hello Mr. Marsh? My name is Mr. Giuliani. I've been sent to try and help you."
    },
    {
        "character": "Randy",
        "line": "Oh. Thanks, but I think I'm just gonna plead guilty."
    },
    {
        "character": "Giuliani",
        "line": "Oh, that sounds like someone who's a little down in the puss. The President said you would be, and he thought you might need a little something special. [proceeds to take down his pants and briefs] Ssshhhhhh. [reaches into his ass and pulls out a joint, then lights it] Would this make you feel better?"
    },
    {
        "character": "Randy",
        "line": "Oh. Ohhh."
    },
    {
        "character": "Giuliani",
        "line": "[waves the joint around] Is this just what the doctor ordered?"
    },
    {
        "character": "Randy",
        "line": "Yeahhh. [jumps forward and takes a long drag]"
    },
    {
        "character": "",
        "line": "Breaking News"
    },
    {
        "character": "Field reporter",
        "line": "Tom, I'm standing outside the government building where Randy Marsh is about to be arraigned. Protesters from both sides have gathered here. Some of them who are for the proceedings..."
    },
    {
        "character": "Crowd",
        "line": "Lock him up! Lock him up! Lock him up! Lock him up! Lock him up!"
    },
    {
        "character": "Field reporter",
        "line": "...and also those in support of ending the investigation."
    },
    {
        "character": "The Whites",
        "line": "Let him go! Let him go!"
    },
    {
        "character": "Mrs. White",
        "line": "These hearings are a waste of the taxpayers' money!"
    },
    {
        "character": "Bob",
        "line": "Nothing in these hearings will change the Whites' minds one bit!"
    },
    {
        "character": "Crystal",
        "line": "Daddy!"
    },
    {
        "character": "Bob",
        "line": "What?"
    },
    {
        "character": "Crystal",
        "line": "Alejandro isn't putting on his sunscreen! [he's holding on to a bottle of it, though]"
    },
    {
        "character": "Bob",
        "line": "Alejandro, what have we told you?! All Whites wear sunscreen! Put it on right now! [takes the sunscreen and bops it on his head]"
    },
    {
        "character": "Alejandro",
        "line": "¡Ahhh! ¡No necesito protector solar! ¡Necesito a mi madre y a mi padre! [\"Ahhh. I don't need sunscreen! I need my mom and my dad!\"]"
    },
    {
        "character": "Bob",
        "line": "¡BIEN, GRACIAS! ¡¿Y TÚ?! Now put it on! [opens the sunscreen and rubs it all over Alejandro's face, giving him the whiteface of a clown.]"
    },
    {
        "character": "Alejandro",
        "line": "¡Alto! ¡Aah! ¡Alto! ¡Te odio! ¡Te odio! [\"Stop! Aah! Stop! I hate you! I hate you!\" He runs away]"
    },
    {
        "character": "",
        "line": "City Hall, day. The Mayor. The City Council of 13 is seated. Mr. Mackey isn't present, as he was protesting outside. The President and Mr. Giuliani are present, flanking Randy. A small crowd of people is witness to the arraignment"
    },
    {
        "character": "Mayor",
        "line": "In the South Park vs. Tegridy Farms matter, we are now ready to proceed with the arraignment. Before doing so, Mr. Marsh, do you have any words?"
    },
    {
        "character": "Randy",
        "line": "Yeah, I have some words to say!"
    },
    {
        "character": "Giuliani",
        "line": "Go get 'em! Go, go get 'em!"
    },
    {
        "character": "Randy",
        "line": "I can't believe I'm being attacked here! You people are monsters! The evidence shows me in a yard taking a dump! Yes! Because I was setting a trap for Mexican Joker! [skeptical cries erupt from the crowd] That's right! And Mexican Joker attacked seconds later! I was trying to protect you people from terrorists! And what do I get for it?! I get a- a bunch of- [the President and Giuliani cheer him on silently] A bunch of... No... No, I can't do this. You wanna know what really happened? The President... sent me his lawyer, and his lawyer told me what to say to get off and gave me a joint in prison."
    },
    {
        "character": "Crowd",
        "line": "[swelling] What??"
    },
    {
        "character": "Randy",
        "line": "And then I smoked that joint! And you know what I thought?! I thought \"this is some shitty-ass weed.\" It wasn't Tegridy. It barely even changed my mental state. The reason I got into the marijuana business was to make quality, simple weed that came from the heart. Weed that was strong, and pure. Somewhere on that journey I lost my way. Tegridy weed is about community. It's a sunrise. It's the smile on a baby. But most of all [reaches a chair and puts a foot up on it], Tegridy weed is about family. I had forgotten I have a loving wife, and son [Sharon, Stan, and Shelly are shown, Shelly with arms crossed], and I'm not gonna forget them anymore. [Shelly uncrosses her arms and puts her palms up] So I'm not gonna fight this. I'll do my time and... maybe someday I'll be back. Making marijuana that's simple. Marijuana that's Tegridy. Because, when you do the right thing, good things happen. [explosions are heard outside, and the people in chambers go to the windows to see what's going on. Sure enough, buildings are exploding all around town. Alejandro is vandalizing police cars with a bat]"
    },
    {
        "character": "Man with orange shirt",
        "line": "It's him! Oh god, it's him!"
    },
    {
        "character": "Townswoman",
        "line": "Oh, Jesus, save us!"
    },
    {
        "character": "Officer 2",
        "line": "G-give it up, Mexican Joker. You don't wanna do this. [Alejandro smashes the cruiser some more, then brings out a Molotov cocktail.]"
    },
    {
        "character": "Bob",
        "line": "Alejandro! Get down from there this minute!"
    },
    {
        "character": "Alejandro",
        "line": "¡Abajo con Estados Unidos! [\"Down with the United States!\" An officer fires a shot and injures Alejandro. Other cops fire away and cause a cloud of smoke to rise up and hide Alejandro. Alejandro seizes the opportunity to make his escape.]"
    },
    {
        "character": "",
        "line": "South Park City Hall, day. Randy and Rudy exit the double doors and approach the podium set up for a press conference"
    },
    {
        "character": "Reporters",
        "line": "Mr. Marsh. Mr. Marsh. Mr. Marsh Marsh Marsh. Over here."
    },
    {
        "character": "Reporter",
        "line": "Mr. Marsh, how does it feel to be exonerated? [as soon as they reach the podium, Giuliani starts massaging Randy's shoulders]"
    },
    {
        "character": "Randy",
        "line": "Thank you. It feels really good to have these charges dropped. Now we can all get back to the business of trying to heal. I'd like to... [notice Giuliani massaging his shoulders] Would you please get the fuck away from me? [Giuliani lets go, adjusts his dentures, and puts his thumbs up in approval] I'd like to take this opportunity to thank those who have always been by my side, supporting me from the very beginning, the people who stood by me since day one and gave me hope. The Whites. [he and Giuliani clap. The Whites look surprised, then they put their hands to their chests.] Thanks for having my back, Mr. and Mrs. White. And now, everybody, if you don't mind, I've got a farm to tend to. [waves to everybody as he leaves]"
    },
    {
        "character": "",
        "line": "Tegridy Farms, day. Winter has come, and snow is falling everywhere. The marijuana plants have been harvested and cut back. Inside, Randy brings a box containing six jars of Tegridy weed to the table. Shelly is suffering a personal hell being around marijuana, so she has buried her face in her arms"
    },
    {
        "character": "Randy",
        "line": "Well gang, I guess that's about it, huh? It's been a really good run, but, looks like the season is over."
    },
    {
        "character": "Shelly",
        "line": "[perks up] The season is over?"
    },
    {
        "character": "Randy",
        "line": "Well sure, the first snow is falling, crops are pretty much dead. Well what'd you all think, huh? I think the season was a little better than anyone expected. I really wanna thank you guys for a great run. [walks to a camera off to his left] And hey, we hope you all enjoyed the season too. It had a little bit of everything, didn't it? And hopefully, the season finale really brought it all home. Of course, if you haven't had a chance to try the season finale yet, it is available now for a special price. This limited-edition weed made from the very last crop of the season is pricey, but worth it. [cuts to the live-action shot of a guy's hand putting the jar of Season Finale next to the five other jars of episode-titled weed.]"
    },
    {
        "character": "Announcer",
        "line": "Now taking pre-orders for Season 2."
    }
]