[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "This episode starts with the PC Babies Theme Song\nPC Babies, they're coming to your town!\nPC Babies, the wokest kids around.\nWhen there's something problematic, they're sure to let you know.\nMaking things fun and gender-neutral everywhere they go!\nThey're everybody's fave-sies!\nThey're PC Babies, yeah!\n\n\n"
    },
    {
        "character": "PC Girl",
        "line": "Now back to PC Babies."
    },
    {
        "character": "PC Boy",
        "line": "Waaa! [giggles]"
    },
    {
        "character": "",
        "line": "The Principal House, basement, day. Strong Woman is using a heavy Everblast punching bag with PC Principal holding it in place."
    },
    {
        "character": "PC Principal",
        "line": "Yeah! Who's strong?"
    },
    {
        "character": "Strong Woman",
        "line": "I'm strong!"
    },
    {
        "character": "PC Principal",
        "line": "Who's Strong Woman?"
    },
    {
        "character": "Strong Woman",
        "line": "I'm Strong Woman! [they switch to dumbbells]"
    },
    {
        "character": "PC Principal",
        "line": "You're gonna smoke the competition!"
    },
    {
        "character": "Strong Woman",
        "line": "I'm gonna smoke the competition! [the babies begin to cry] Oh no. It's the babies."
    },
    {
        "character": "",
        "line": "The living room, moments later. PC Principal and Strong Woman reach the living room and find the kids upset. Two of the kids sit on the sofa, the other three on the floor."
    },
    {
        "character": "PC Principal",
        "line": "Kids, kids. Okay, what the matter?"
    },
    {
        "character": "Strong Woman",
        "line": "Oh, no! I left Disney+ on and it went to Mulan."
    },
    {
        "character": "PC Principal",
        "line": "They don't like Mulan?"
    },
    {
        "character": "Strong Woman",
        "line": "No, because Mulan is a female that identifies as male and yet the movie doesn't take the time to address real trans issues."
    },
    {
        "character": "PC Principal",
        "line": "Okay, okay, we know! [takes the remote and turns the TV off] Mulan is outdated in creating straw dog characters to talk about trans issues! Daddy's turning it off! [switches to another channel]"
    },
    {
        "character": "Anderson Cooper",
        "line": "-But just how many advocates have yet to be seen? [the kids sit up and smile.]"
    },
    {
        "character": "",
        "line": "South Park Elementary Gym, day. PC Principal holds another assembly. Mr. Mackey, Strong Woman, and Mr. Adler sit far behind him"
    },
    {
        "character": "PC Principal",
        "line": "Alright everybody, listen up! As you know, this school is a place where everyone should feel included. Our challenge is to motivate ourselves and others to create an inviting, non-negative and HEY STOTCH, YOU GOT A FUCKING PROBLEM?! [Butters is caught whispering something to Scott]"
    },
    {
        "character": "Butters",
        "line": "[quickly sits correctly] No sir!"
    },
    {
        "character": "PC Principal",
        "line": "Now I think that what we all need are leaders who motivate by example, and so I would like to inform you all that your vice-principal [points to Strong Woman; she's somewhat surprised] is competing in the Strong Woman Competition in Morrison this weekend. Let's hear it for her. [the kids applaud as she takes the mic]"
    },
    {
        "character": "Strong Woman",
        "line": "Well, thank you PC Principal. Um, listen, guys. I just hope I can make you proud, and more importantly, I hope you can see that no matter who you are, you can do anything. We've really come a long way breaking down gender-binary bigotry, and I hope I can especially inspire some of my girl students here."
    },
    {
        "character": "PC Principal",
        "line": "Or those who identify as girls."
    },
    {
        "character": "Strong Woman",
        "line": "Yes, or those who identify as girls. Get out there and get involved in school sports and clubs. If there's something you love, don't ever let anything hold you back."
    },
    {
        "character": "",
        "line": "Five boys are in the room: Clyde, Butters, Cartman, Scott, and Stan. They're playing Dungeons and Dragons"
    },
    {
        "character": "Cartman",
        "line": "The first bugbear lashes out at Stan with its broadsword. [rolls the dice] And it hits with a 17."
    },
    {
        "character": "Stan",
        "line": "How much damage is that?"
    },
    {
        "character": "Cartman",
        "line": "4 + 2 slashing"
    },
    {
        "character": "Butters",
        "line": "Okay. I jump up to the bugbear! And I yell \"FOR WATERDEEP!\" and I kick it in the balls!"
    },
    {
        "character": "Cartman",
        "line": "I don't think bugbears have balls."
    },
    {
        "character": "Clyde",
        "line": "Then how do they make baby bugbears? [the door opens and Mr. Mackey brings in two girls]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh hi, boys. Uh we got some new students who want to be part of the gaming club. You know Tammy and Nichole."
    },
    {
        "character": "Cartman",
        "line": "Ah huh, ah, heh heh neh no."
    },
    {
        "character": "Mr. Mackey",
        "line": "This is a school club, boys. All clubs are inclusive. Have fun, girls. [the girls take their seats in the two remaining chairs and bring out their pieces.]"
    },
    {
        "character": "Nichole",
        "line": "Hey guys. [the other boys look at Cartman, who raises an eyebrow]"
    },
    {
        "character": "Scott",
        "line": "[whispers] What the fuck do we do?"
    },
    {
        "character": "Cartman",
        "line": "Um, guys, we play lots of games here at Dice Studz, but today [puts his hand on the cardboard sheet] we're playing D&D. You don't just show up and start playing, you have to generate characters and-"
    },
    {
        "character": "Tammy",
        "line": "Yeah, we created some this morning. I'm a human paladin and Nichole is a Tiefling warlock. [another long silence]"
    },
    {
        "character": "Clyde",
        "line": "[whispers] Do something, Eric!"
    },
    {
        "character": "Cartman",
        "line": "Eheh, ha, guys, um, they're fighting a bunch of bugbears now that are led by a 12th level druid..."
    },
    {
        "character": "Nichole",
        "line": "Okay, I cast Vampiric Touch on the druid. [rolls her dice] Crit. [the boys look at Cartman]"
    },
    {
        "character": "",
        "line": "The 6th Annual Strong Woman Competition"
    },
    {
        "character": "David",
        "line": "A beautiful morning in Morrison, Colorado as we get ready for the 6th Annual Strong Woman Competition, a two-day long competition of tests built to push athletes to their very limits. [crowd reactions are shown. Lots of clapping and cheers] Joining me now is the current champion of the Strong Woman Competition, Strong Woman. [edges up to her] Ms. Woman, do you feel ready? "
    },
    {
        "character": "Strong Woman",
        "line": "Oh yeah. I'm ready, David. There are just so many amazing women athletes out here today it makes me so proud."
    },
    {
        "character": "David",
        "line": "Now, this is the first year that a trans woman is in the competition. How do you feel about that?"
    },
    {
        "character": "Strong Woman",
        "line": "Amazing. I feel honored to be a part of history. I have a lot of incredible trans friends who are athletes, and so we're all inspired this woman is competing."
    },
    {
        "character": "David",
        "line": "Uh huh, and uh have you ever actually met Heather Swanson?"
    },
    {
        "character": "Strong Woman",
        "line": "Uh, no, I've never competed against her before, no."
    },
    {
        "character": "David",
        "line": "She's not exactly your average trans athlete."
    },
    {
        "character": "Strong Woman",
        "line": "Well, what is an \"average trans athlete\"? Honestly, I find that kind of bigoted, David."
    },
    {
        "character": "David",
        "line": "Okay, Heather Swanson is actually joining us now. Ms. Swanson, how does it feel to be competing today? [Strong Woman looks up at Heather with awe]"
    },
    {
        "character": "Heather",
        "line": "[joins the duo on camera] I can't tell you how free I feel now that I've started identifying as a woman. [adjusts her glasses] Now that I can compete as female, I'm ready to smash the other girls."
    },
    {
        "character": "David",
        "line": "And is it correct you just started identifying as female two weeks ago?"
    },
    {
        "character": "Heather",
        "line": "I'm not here to talk about my transition! I'm here to kick some fuckin' ass! Let me tell you something, dingleberry!"
    },
    {
        "character": "David",
        "line": "David Perry!"
    },
    {
        "character": "Heather",
        "line": "I'm gonna roll up the other women here, and I'm gonna smoke 'em! I am the strongest woman this state has ever seen! [starts posing]"
    },
    {
        "character": "David",
        "line": "Any words for the challenger, Ms. Woman?"
    },
    {
        "character": "Strong Woman",
        "line": "Uh, good luck, Heather."
    },
    {
        "character": "Heather",
        "line": "Huh huh, luck is for dudes. [walks off]"
    },
    {
        "character": "David",
        "line": "Well, with that let's get right to the action."
    },
    {
        "character": "",
        "line": "Scenes of athletes working out and crowd reactions are shown. Strong Woman does a clean and jerk of some 550 lbs. PC Principal and the babies cheer her on. Heather steps up and does a clean and jerk of 850 lbs. Next, Strong Woman defeats a challenger in boxing, then competes in the shot put with Heather and another woman, then defeats another challenger in arm wrestling. Heather defeats her challenger in the same event. In tire-flipping, Heather defeats her challengers easily. PC Principal and the babies are dismayed at the beating Strong Woman is taking. Strong Woman defeats her challenger in wrestling. Heather defeats her challenger in boxing. At the Dice Studz Gamers Club, Tammy and Nichole are beating the boys at the samurai game, Rising Sun. Another shot of PC Principal and the babies being dismayed. Strong Woman and Heather compete with each other in a tug of war, and Heather defeats her soundly. at the awards podium, Strong Woman poses and shames the runners-up. This song plays throughout.\nRising to the top, push it to the edge,\nGive it all you got. Barely break a sweat. Strong Woman. Strong Woman. Go!\nYeah, she's got speed, she's got the moves,\nShe's got the muscle and a whole lot to prove, Strong Woman. Strong Woman.\nHey you! Go, Strong Woman, Go!\nHey you! Your time is now, what'cha gonna do?\nPedal to the metal, find another gear.\nShe takes what she wants, nothing left to fear, Strong Woman. Strong Woman.\nNow hey, girl! You're the best in the world!\nAnd hey, hon! Don't look now, but you've just won.\nStrong Woman. Strong Woman. Strong Woman. Strong Woman. Strong Woman. Strong Woman. Strong Woman.\n\n\n"
    },
    {
        "character": "Heather",
        "line": "[during the shot put] Arrrgh-yeahhhh! [at the awards podium] Hell yeah! I won! I'm a strong woman! Look at it! It's mine! I'm the best! I'm the strongest!"
    },
    {
        "character": "",
        "line": "On the ride home, Strong Woman looks beat. No one says a word until..."
    },
    {
        "character": "PC Principal",
        "line": "So, second place. That's pretty damn good."
    },
    {
        "character": "Strong Woman",
        "line": "Yeah..."
    },
    {
        "character": "PC Principal",
        "line": "I guess she... just started identifying as a woman a few weeks ago. Doesn't really seem.., fair..."
    },
    {
        "character": "Strong Woman",
        "line": "Just don't! You'll upset the PC babies."
    },
    {
        "character": "",
        "line": "The Counselor's Office. Mr. Mackey listens half-heartedly as Cartman lays out his complaints."
    },
    {
        "character": "Cartman",
        "line": "[flanked by Butters and Scott] It is unfair, it is tyrannous, and it is wrong! Ever since these girls were allowed to join Dice Studz Gamers Club, it has been a train wreck! Every single game, they like, figure out all the rules, and they, use the rules, to like, make us look stupid!"
    },
    {
        "character": "Butters",
        "line": "In D&D they killed the dungeon master. [points to Cartman] Well we didn't even think it was possible to kill the dungeon master."
    },
    {
        "character": "Cartman",
        "line": "Shut up, Butters. It's not possible. It's just that we play board games for the themes. We want to be pirates, or Vikings. You know what the girls think about? They think about red cubes versus blue cubes, and how much of this equals how many victory points. They're just doing math."
    },
    {
        "character": "Mr. Mackey",
        "line": "So they're smarter than you and beating you at all the board games."
    },
    {
        "character": "Scott",
        "line": "Yeth."
    },
    {
        "character": "Cartman",
        "line": "NO!"
    },
    {
        "character": "Scott",
        "line": "[frightened] NO!"
    },
    {
        "character": "Cartman",
        "line": "It's it's just, different. [starts tearing up] Look, we started Dice Studz with a dream. A dream that we could actually do something interesting at school, just for like 60 minutes. [Mr. Mackey galls asleep]"
    },
    {
        "character": "",
        "line": "The school cafeteria, day. The boys are eating tacos together"
    },
    {
        "character": "Cartman",
        "line": "\"Nothing we can do,\" he said. \"Hands are tied,\" he said. We're gonna have to deal with this ourselves, you guys."
    },
    {
        "character": "Stan",
        "line": "I think Nichole and Tammy are cool to play with."
    },
    {
        "character": "Cartman",
        "line": "Well you won't think they're cool when the rest of us leave Dice Studz and you're left to play only solo board games!"
    },
    {
        "character": "Stan",
        "line": "You mean like Nemo's War? Nemo's War is sweet."
    },
    {
        "character": "Clyde",
        "line": "Look, maybe we just gotta play harder stuff, you know? Stuff the girls can't keep up with."
    },
    {
        "character": "Butters",
        "line": "Hey, that's not a bad idea. We've been taking it easy on the girls. Time to show 'em what real board gamers play."
    },
    {
        "character": "Scott",
        "line": "What do real board gamers play?"
    },
    {
        "character": "Stan",
        "line": "Well if you want something hard, then you need a really crunchy Euro game, something like a Vital Lacerda's Escape Plan or a Uwe Rosenburg Euro."
    },
    {
        "character": "Cartman",
        "line": "Do they involve math?"
    },
    {
        "character": "Stan",
        "line": "Well all Euros are pretty mathy."
    },
    {
        "character": "Cartman",
        "line": "Nope, no good. We need something with lots of, like WAR and DICE and THEMATIC shit."
    },
    {
        "character": "Stan",
        "line": "So then you want a war miniatures game. Something skirmish-style, like Legion or Blood and Plunder."
    },
    {
        "character": "Kyle",
        "line": "Dude, you're really into board games."
    },
    {
        "character": "Cartman",
        "line": "Alright, that's it, you guys. Dice Studz Gamers Club is about to go [fans his arms out over his lunch tray] tabletop miniatures."
    },
    {
        "character": "",
        "line": "PC Principal's kitchen, day. He's at the stove while Strong Woman fives the PC babies."
    },
    {
        "character": "Strong Woman",
        "line": "Emory, stop playing with your food. [the doorbell rings]"
    },
    {
        "character": "PC Principal",
        "line": "I'll get it. [opens to front door and sees Heather]"
    },
    {
        "character": "Heather",
        "line": "Hey, what's going on? Is your girlfriend home?"
    },
    {
        "character": "PC Principal",
        "line": "Uh, she's sort of busy right now, Ms. Swanson."
    },
    {
        "character": "Heather",
        "line": "Just wanna tell her no hard feelings about me winning the Strong Woman competition. [holds up the trophy]"
    },
    {
        "character": "PC Principal",
        "line": "Yeah, you already told her that at the competition."
    },
    {
        "character": "Heather",
        "line": "You got a problem with me? 'Cause it's starting to seem like you have a problem with me!"
    },
    {
        "character": "Strong Woman",
        "line": "What's going on-? Oh, hi Heather."
    },
    {
        "character": "Heather",
        "line": "I was just stopping by to make sure you're not too beat up."
    },
    {
        "character": "Strong Woman",
        "line": "Oh, that's... really cool. I'm sorry, but I have all the kids right now, and they're-"
    },
    {
        "character": "Heather",
        "line": "Oh, where are the little kiddos? [enters the house] I'd love to meet 'em. [enters the kitchen] Oho hey kids. Whoa, there's a lot of you. Your mom must be a strong woman to take care of all o'you. Of course, I have the Strong Woman trophy though. Heheheheh. Just kidding, right?"
    },
    {
        "character": "PC Principal",
        "line": "Look, why don't you just get out of here?!"
    },
    {
        "character": "Heather",
        "line": "Oh! Sounds like someone here is a transphobe."
    },
    {
        "character": "PC Principal",
        "line": "Don't you dare! I'm trans people's biggest supporter! What I think you are is a terrible sport!"
    },
    {
        "character": "Heather",
        "line": "Transphobe."
    },
    {
        "character": "PC Principal",
        "line": "You'd better knock it off!"
    },
    {
        "character": "Strong Woman",
        "line": "Just don't. You're gonna upset the PC babies."
    },
    {
        "character": "PC Principal",
        "line": "And if you dare call me transphobe again, I'm gonna-"
    },
    {
        "character": "Heather",
        "line": "You're gonna what? Beat me up? You're gonna beat me up, transphobe? [PC Principal stands down] Yeah, I didn't think so. [to the babies]See you later, kids. Come on over and see old Auntie Heather if you want to see what a REAL strong woman is like. [leaves and goes out the front door. Strong Woman moves up next to PC Principal]"
    },
    {
        "character": "PC Principal",
        "line": "Are you feeling what I'm feeling?"
    },
    {
        "character": "Strong Woman",
        "line": "What do you mean?"
    },
    {
        "character": "PC Principal",
        "line": "I don't know what it is, but... something about that woman just doesn't seem right."
    },
    {
        "character": "",
        "line": "School Club Room, day. Tammy and Nichole bring a third girl with them"
    },
    {
        "character": "Emory",
        "line": "Now back to PC Babies."
    },
    {
        "character": "Nichole",
        "line": "Hey guys. Hope it's cool we brought Kelly. She wants to be in the club too."
    },
    {
        "character": "Cartman",
        "line": "[sarcastically] Oho yes! that's very cool, girls! We're just setting up today's game. It's a pirate miniatures game called Blood & Plunder. [the other boys smile]"
    },
    {
        "character": "Nichole",
        "line": "Yeah, we saw it on the schedule."
    },
    {
        "character": "Tammy",
        "line": "We love Blood And Plunder. Are we gonna play like a four-on-four skirmish with two different factions? [the boys' smiles vanish]"
    },
    {
        "character": "Stan",
        "line": "Whoa, you painted your miniatures?"
    },
    {
        "character": "Tammy",
        "line": "Yeah. Who wants unpainted miniatures, right? [Cartman studies his unpainted miniature]"
    },
    {
        "character": "Stan",
        "line": "Where'd you learn to do that?"
    },
    {
        "character": "Nichole",
        "line": "We watch YouTube tutorials. You can find a much on BGG."
    },
    {
        "character": "Stan",
        "line": "I love BGG."
    },
    {
        "character": "Kelly",
        "line": "Oh cool. Do you watch Game Night?"
    },
    {
        "character": "Cartman",
        "line": "Excuse me! [pulls Blood & Plunder off the table and replaces it with a new game] We're going to play the six-hour long, very thematic Nemesis!"
    },
    {
        "character": "Nichole",
        "line": "Oh cool. We just watched the tutorial for that on Dice Tower. [the boys look at Cartman for his next move]"
    },
    {
        "character": "",
        "line": "A splash screen for Women In Sports appears on TV"
    },
    {
        "character": "Announcer",
        "line": "And now, back to Women In Sports, with Janet Spears."
    },
    {
        "character": "Janet",
        "line": "Our next guest has been really lighting it up in women's competitions. Since she's identified as female two weeks ago, she's won every female sport she's entered. Please welcome Heather Swanson. [Heather has brought every trophy she's won with her]"
    },
    {
        "character": "Heather",
        "line": "Well thank you, Janet. It's a great pleasure to be here. I know that I'm an inspiration to all women and trans athletes everywhere."
    },
    {
        "character": "Janet",
        "line": "[dryly] Yes, we are all truly inspired."
    },
    {
        "character": "Heather",
        "line": "Now there are some women out there who just want to run and hide. [stands up menacingly] I'm talkin' to you, Strong Woman! [A shot of the Principal family watching TV] You still dare call yourself that?! Your name is a joke, because ol' Heather Swanson here will beat you anywhere, anytime, at anything! [Strong Woman leaves the sofa and goes to the kitchen]"
    },
    {
        "character": "",
        "line": "The kitchen, moments later. Strong Woman is washing dishes when PC Principal enters"
    },
    {
        "character": "PC Principal",
        "line": "Hey, don't let her get to you, Strong."
    },
    {
        "character": "Strong Woman",
        "line": "She's not getting to me."
    },
    {
        "character": "PC Principal",
        "line": "I, I-I don't know why she has such a grudge against you, and I-"
    },
    {
        "character": "Strong Woman",
        "line": "Because I know her."
    },
    {
        "character": "PC Principal",
        "line": "[jaw drops] What do you mean?"
    },
    {
        "character": "Strong Woman",
        "line": "It's Blade Jaggart. He - she - is my ex-boyfriend."
    },
    {
        "character": "PC Principal",
        "line": "... What?"
    },
    {
        "character": "Strong Woman",
        "line": "Back when we were together he was such an asshole. When I finally broke up with him, he said one day he was going to get me back. And now he's got us both by the balls."
    },
    {
        "character": "PC Principal",
        "line": "But then... she doesn't really care about trans people? Or women?"
    },
    {
        "character": "Strong Woman",
        "line": "He hates wome- she, hates women. When I left him, he felt he got beat by a girl, and nothing makes Blade Jaggart more crazy than getting beat by a girl."
    },
    {
        "character": "PC Principal",
        "line": "I didn't even know people like that existed."
    },
    {
        "character": "",
        "line": "The Colorado General Assembly, day. Cartman speaks to the Assembly and is joined by Butters and Scott, as before"
    },
    {
        "character": "Cartman",
        "line": "[reading a prepared speech] It is unfair. It is tyrannous, and it is wrong. Dice Studz is a board game group that brings thrills and laughter to dozens of boys at our school. But that laughter is being turned into screams as girls constantly invade with their unfairness."
    },
    {
        "character": "Butters",
        "line": "[steps forward, interrupting] The girls found Eric on the first round of Fury of Dracula! [smiles. Cartman glares at him and he wilts and backs away.]"
    },
    {
        "character": "Cartman",
        "line": "[gets back to his speech] Yes, inclusion is wonderful, but we have to admit that boys and girls are simply different in some ways that can sometimes make competitions unfair. Have you ever seen how girls do their homework? They do it... that night, meticulously going over every detail and often finishing before they absolutely have to. This is how girls are with board game rule books. Before we even start playing, they've already strategized a way to win, leaving others in the dust.[puts away his speech] And now I'd like for you to hear from my friend Scott, who has diabetes."
    },
    {
        "character": "Scott",
        "line": "[begins his own speech] My name is Scott Malkinson and I have diabetes."
    },
    {
        "character": "Cartman",
        "line": "[whispers] Terminal diabetes."
    },
    {
        "character": "Scott",
        "line": "[corrects himself] I have terminal diabetes. Board games are the only thing that give me relief from the physical and mental anguish I experience every day."
    },
    {
        "character": "Butters",
        "line": "Wow, Scott. I didn't know it was that bad."
    },
    {
        "character": "Scott",
        "line": "Neither did I. [back to his speech] Dice Studz is my only shot at happiness. Please don't let outdated school policies destroy it. [steps aside]"
    },
    {
        "character": "Cartman",
        "line": "[claps and returns to the mic] Wow, thank you, Scott. Diabetes, everyone. [closing statement] We hope that our presentation has helped to change your minds about school clubs in our country. If not, we will be back, every single day. Please, let Dice Studz be for studs."
    },
    {
        "character": "",
        "line": "An MMA sports show. Heather Swanson is one of the guests on it"
    },
    {
        "character": "MMA Host",
        "line": "Womens' MMA fighting is growing in popularity, and no other female fighter is as explosive as Heather Swanson."
    },
    {
        "character": "Heather",
        "line": "Eee-yeahhh!"
    },
    {
        "character": "MMA Host",
        "line": "Heather, your story is an inspiration to sports fans everywhere. Congratulation on your \"shocking\" success."
    },
    {
        "character": "Heather",
        "line": "I just hope I can motivate little girls out there. Motivate them to understand that I will beat them at any sport they try. Motivate them to run away like that chicken shit Strong Woman did because I-"
    },
    {
        "character": "PC Principal",
        "line": "[interrupts the interview] Alright. Alright, that's enough. You uh, you made your point, Heather. We get it, okay?"
    },
    {
        "character": "Heather",
        "line": "Oh hey, transphobe. This is a nice surprise."
    },
    {
        "character": "Strong Woman",
        "line": "Oh God, what is he doing?"
    },
    {
        "character": "PC Principal",
        "line": "Look, everyone, I know we're all a little... afraid to have any opinions on this stuff, but um, there can be situations where it's... not so easy... to... what I mean is, I..."
    },
    {
        "character": "Heather",
        "line": "I didn't count on being the best since identifying as a woman."
    },
    {
        "character": "PC Principal",
        "line": "Yeah, no shit, 'cause you went through puberty as a male, so your body's completely different! [crowd reactions are shown, including one man motioning PC Principal to stop talking]"
    },
    {
        "character": "Heather",
        "line": "And that's exactly what a transphobe would say!"
    },
    {
        "character": "PC Principal",
        "line": "I told you not to call me a transphobe! All I want is to have a discussion."
    },
    {
        "character": "Heather",
        "line": "Transphobe! [PC Principal pushes Heather back, and Heather staggers back to a table of refreshments, throws herself on the table, and crushes it with her weight. She screams and sobs]"
    },
    {
        "character": "PC Principal",
        "line": "Aw, shit."
    },
    {
        "character": "",
        "line": "Dice Studz Gamers Club, day. The boys are back in the room. Only Cartman is content"
    },
    {
        "character": "Cartman",
        "line": "Ahhh, isn't this nice, you guys? Clean, fresh air, soothing sounds, just us boys and Star Trek: Ascendancy.\""
    },
    {
        "character": "Butters",
        "line": "[rushing in] Uh hey, fellas! Come quick! You gotta see!"
    },
    {
        "character": "Clyde",
        "line": "See what?"
    },
    {
        "character": "Butters",
        "line": "Well, it's the girls! They started their own board game club at the school! [runs out. The other boys look at each other]"
    },
    {
        "character": "",
        "line": "The school cafeteria, day. The boys reach the new club's location. \"Board Girls Gaming Club\"."
    },
    {
        "character": "Cartman",
        "line": "\"Board Girls\"? How lame is that? [opens the cafeteria door and is in shock]"
    },
    {
        "character": "",
        "line": "The scene shows the cafeteria full of girls playing different board games are shown.  Allie, Monica, and another female 4th grader paint mini-figures.  Some of the girls are also seen playing Lords of Waterdeep and Flick 'em Up!"
    },
    {
        "character": "Cartman",
        "line": "The fuck is this?"
    },
    {
        "character": "Stan",
        "line": "Wow!"
    },
    {
        "character": "Butters",
        "line": "[he and the other boys enter the cafeteria] Well this is like what you said Dice Studz would be, Eric."
    },
    {
        "character": "Nichole",
        "line": "[walks in front of the boys] Oh, hey guys, welcome to Board Girls. Want to have a look around? [cuts to her leading a tour of the club] So over [points right of the screen] here we have our co-op games.  I think they’re doing “Sub Terra” right now. [points right of the screen again] And there we do our deck and engine builders. Have you tried “Inuit”?  It’s really cool. [stops walking] We have miniatures painting over there [points towards the screen] and most of our miniatures gaming happens in [points left of the screen] that area."
    },
    {
        "character": "Clyde",
        "line": "Hey, those girls are playing “Crisis Protocol”. That’s not even out yet."
    },
    {
        "character": "Nichole",
        "line": "Yeah, we get advanced copies of games because our club reviews them for our gaming channel. [two girls discuss Abomination on camera]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Hey boys, you need to get out, okay? No boys in the girls' school clubs. Come on, let's go."
    },
    {
        "character": "Stan",
        "line": "What? Who says?"
    },
    {
        "character": "Mr. Mackey",
        "line": "New school policy came down from the top. Now get your asses outta there."
    },
    {
        "character": "Stan",
        "line": "Well, who made up that stupid rule?"
    },
    {
        "character": "Cartman",
        "line": "... Yeah, who made up that stupid rule?"
    },
    {
        "character": "",
        "line": "The neighborhood park, day."
    },
    {
        "character": "Emory",
        "line": "We now return to PC Babies."
    },
    {
        "character": "",
        "line": "PC Principal sits on a park bench, alone. He looks at his phone's screen and sees a news article about his troubles with the trans community, then lowers his phone. Strong Woman finds him on the bench."
    },
    {
        "character": "Strong Woman",
        "line": "Are you just... not gonna come home?"
    },
    {
        "character": "Pete",
        "line": "How am I gonna look my kids in the eyes, Strong? Since they were born, we've taught them to accept and fight for those who are marginalized. That there's no gray area when it comes to inclusion and acceptance. When I go back, all they're gonna see is a big, fat hypocrite. And now I've just used a word to shame people with weight issues. [buries his face in his hands]"
    },
    {
        "character": "Strong Woman",
        "line": "P, you can't just shut down because you're afraid of how the babies are gonna react."
    },
    {
        "character": "Pete",
        "line": "I didn't shove him - her - for being trans. I shoved her because she's your ex-boyfriend and she's being a dick. Do you think the PC babies will see the nuance?/But they're right, Strong. I shoved a trans person. No matter what, I have no right to judge her. Do you think- Could you try to explain it to the babies?"
    },
    {
        "character": "Strong Woman",
        "line": "You know how they are. They're babies. Their minds are made up before anyone says anything."
    },
    {
        "character": "Pete",
        "line": "Then I've really got only one thing I can do. I have to try and make things right with Heather Swanson."
    },
    {
        "character": "",
        "line": "School gymnasium, day. PC Principal - Pete - holds another student assembly with Strong Woman"
    },
    {
        "character": "Strong Woman",
        "line": "Uh, hey students. As you know, we've had some issues here at the school that we're working very hard to correct. So today we are... honored... to have a motivational speaker. She is the current Strong Woman competition, and also the champion in women's MMA fighting, and in women's wrestling. Please welcome the inspiring Heather Swanson."
    },
    {
        "character": "Heather Swanson",
        "line": "[Bursts through a curtain] Yeeaahhhh! Fuck yeeaahhhh! [she dances to a K-pop song, \"I Am the Best\". She then proceeds to rip off her pants and show off her muscular body. She freezes in a pose when the song ends with \"Oh my God.\" Butters is the only kid who claps]"
    },
    {
        "character": "Heather",
        "line": "Hello, boys and girls. I'm here to talk to you because apparently your school leaders have failed you. I'm gonna tell you something, kids. There's only one thing that matters in this world, and that's being the best. Your vice-principal teaches you girls to be strong, but she comes in second. [walks up to Pete and puts her left arm around him] You got anything to say about that, PC Principal?"
    },
    {
        "character": "Pete",
        "line": "No, Ms. Swanson."
    },
    {
        "character": "Heather",
        "line": "\"No, Ms. Swanson.\" [releases the hug and stands in front of them] You see, people don't look up to losers. They look up to champions! Every time I beat another woman, I feel better"
    },
    {
        "character": "Cartman",
        "line": "Dude, I really like this person."
    },
    {
        "character": "Heather",
        "line": "And that's why I'm the best. Because Heather Swanson doesn't get beat. I work to be the best at everything. And Heather Swanson will beat any other woman any time, anywhere!"
    },
    {
        "character": "Tammy",
        "line": "Bet you can't beat Nichole at Blood Rage."
    },
    {
        "character": "Heather",
        "line": "What? Wha-what did you say, transphobe?"
    },
    {
        "character": "Nichole",
        "line": "Yeah, but I bet you can't beat Tammy at War of the Ring."
    },
    {
        "character": "Heather",
        "line": "You don't disrespect a champion, little girls! You think Heather Swanson doesn't know board games?! I was playing board games before your mom even crapped you out of her vagina!"
    },
    {
        "character": "Nichole",
        "line": "Okay, so then let's do it, bitch!"
    },
    {
        "character": "Heather",
        "line": "Oh it's onnn!"
    },
    {
        "character": "",
        "line": "Board Girls Gaming Club, day. The girls compete against Heather and defeat her soundly. First up: Blood Rage. Heather makes her move; Nichole looks on passively and blows a gum bubble until it pops, then knocks off one of Heather's pieces. Heather is stunned. Next game is War of the Ring. Heather is frowning, but makes her move; Tammy is chatting away on the phone as she rolls the die and knocks off some of Heather's miniatures. Tammy sits back and smiles as the kids cheer her on. Next is Twilight Struggle. Nichole places her cards all over the map as Heather looks on in awe. After she places her last card, she rejoices in victory. Heather lifts her hands in gripping rage. Heather then participates in Board Girls Gaming Club, with Kelly tutoring her. Heather and Kelly then face each other and play. Next game is Concordia. Tammy again faces Heather and waits for Heather to finish her move. Then Tammy pulls off a series of card moves and defeats Heather. This song plays throughout the montage:\nTabletop bloodbath, nothing left to say.\nYour moment is here, time to make 'em pay, Strong Woman. Strong Woman. Strong! Woman!\nSmoke the competition, show 'em what you got.\nAll your painted miniatures are really paying off, Strong Woman. Strong Woman. Strong! Woman!\nHey wow! Who's the Strong woman now?\nAnd hey you! Thought you were the best, but you're about to lose\nTo the Board Girls. They got the moves.\nThey pummeled you at Alchemists and kicked your ass in Carcasonne\nBoard Girls, they know all the rules.\nThey watch Rodney Smith, Tom Vasel, and Becca Scott.\nHey, cool. They made you look a fool\nAnd hey, sweet, Take a step down; you just got beat\nBy the Board Girls!\n\n\n"
    },
    {
        "character": "Heather",
        "line": "Do you think that's fair?! You only won 'cause you dumb girls memorized the rule books! When I play games, I just wanna be a pirate or a spaceman! [Cartman joins her]"
    },
    {
        "character": "Cartman",
        "line": "That's right! You and your stupid rules!"
    },
    {
        "character": "Heather",
        "line": "I may identify as a woman now, but I grew up a boy, so you have an unfair advantage over me!"
    },
    {
        "character": "Cartman",
        "line": "Yeah, an unfair advantage, stupid girls! Come on, Ms. Swanson. We can go make our own club. [they turn and walk out together. Once they're gone, the girls erupt in cheers]"
    },
    {
        "character": "",
        "line": "The Principal - er, Charles - house, day. Pete and Strong Woman get home and go inside."
    },
    {
        "character": "Strong Woman",
        "line": "[before entering.] You sure you're ready for this?"
    },
    {
        "character": "Pete",
        "line": "I just wanna get it over with. [they enter, and the babies are happy to see them]"
    },
    {
        "character": "Babies",
        "line": "Mommy! Yay!"
    },
    {
        "character": "Strong Woman",
        "line": "Yes, kids, and look who else is here."
    },
    {
        "character": "Babies",
        "line": "[they look at him for a few seconds] Daddy! Yeah Daddy! Dada!"
    },
    {
        "character": "Emory",
        "line": "Dada. I love you."
    },
    {
        "character": "Pete",
        "line": "I... I don't understand."
    },
    {
        "character": "Strong Woman",
        "line": "They don't care. They must see the nuance to this whole situation."
    },
    {
        "character": "Pete",
        "line": "You're right! They realize that raising a gender-based issue of strength doesn't necessarily make one a bigot or a bully. All this time we were worried what the PC babies would think."
    },
    {
        "character": "Strong Woman",
        "line": "And we didn't realize that our little babies are growing up. [they laugh and start to play with the babies.]"
    }
]