[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Park County Community Center, day. Inside, a meeting is being held featuring all the women of the town. On stage are Sharon Marsh, Strong Woman, Mayor McDaniels, Linda Stotch, Mrs. Testaburger, and a female police officer. Sheila is speaking at the podium."
    },
    {
        "character": "Sheila",
        "line": "When I look out across this room, I see the backbone of our community. The women of this town need to stand together. [applause from the gathered women.] We're here, and we're proud, and it is time to let everyone know that the women of South Park should be treated the same as the men! [farts and begins to groan] Oh God! [farts and groans. Sharon, Strong Woman and the mayor cover their noses] Oh God! [she's helped off the stage by Mrs. Testaburger] Ohh, sorry. [vomits as she reaches the end of the table, getting some of it on Mrs. Testaburger's shirt]"
    },
    {
        "character": "Mrs. Testaburger",
        "line": "Ohoho-kay. [they head for the entrance]"
    },
    {
        "character": "Sheila",
        "line": "I'm alright. Oh... [starts having diarrhea, leaving a mess on her skirt and in the aisle. The audience is shocked and cover their noses]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, day. Kyle is in the waiting room with Ike as their mom gets checked up."
    },
    {
        "character": "Dr. Gauche",
        "line": "Hello boys. Your mommy has a bacterial infection called C. diff. It's very contagious."
    },
    {
        "character": "Kyle",
        "line": "A bacterial infection? In her stomach?"
    },
    {
        "character": "Dr. Gauche",
        "line": "[sits down and shows Kyle his tablet.] All of us have trillions of microscopic critters that grow on and inside our bodies. Just like your mom. [a 3D x-ray of an adult female appears on the tablet's screen] There's tiny creatures that live in your mom's skin, on her eyelashes, in her vagina. But the good bacteria in mommy's tummy are being overrun by bad bacteria. [a 3D rendering of the intestinal tract with both good and bad bacteria floating around].  We can't use antibiotics, because that will kill all the good bacteria too. [a line wipes down on the 3D rendering, showing all the bacteria has now disappeared]"
    },
    {
        "character": "Kyle",
        "line": "So what can you do for her?"
    },
    {
        "character": "Dr. Gauche",
        "line": "We need to take a healthy person's microbiome and start to grow it inside your mother. [A 3D X-Ray is shown again, now with an image of poop in the corner] We do this with a fecal transplant. We'll get a donor's feces, mix it with water, and put it up your mom's anus. [the poop from the x-ray is shown moving up into the figure's rectum]"
    },
    {
        "character": "Kyle, Ike",
        "line": "Eeewww!"
    },
    {
        "character": "Dr. Gauche",
        "line": "Your mom is tough, kids. We're gonna do the very best we can, kids. Try not to worry. [walks away]"
    },
    {
        "character": "Kyle",
        "line": "Ike, if Mom lives, we can't let anyone ever know about this."
    },
    {
        "character": "",
        "line": "Food 4 Little, day. Upbeat music begins to play. Inside, Sheila is shopping with Ike. She grabs a bag of chips and puts it in the basket. She is dressed in workout clothing and begins to sing out loud"
    },
    {
        "character": "Sheila",
        "line": "I am shopping. \nI'm grocery shopping. \nI'm buying food for the people I love!\n\n\n"
    },
    {
        "character": "Laura",
        "line": "Sheila?"
    },
    {
        "character": "Sheila",
        "line": "[turns around] Oh, hi Laura."
    },
    {
        "character": "Laura",
        "line": "My goodness, look at you. Ah, I thought you were sick."
    },
    {
        "character": "Sheila",
        "line": "I was! But I had an amazing procedure."
    },
    {
        "character": "Ike",
        "line": "[tugging on Sheila's sleeve] No no no no no no, Mommy, no no no no no no!"
    },
    {
        "character": "Sheila",
        "line": "I had a fecal transplant."
    },
    {
        "character": "Ike",
        "line": "Oh, god damnit! [buries his face in his hands]"
    },
    {
        "character": "Mrs. Biggle",
        "line": "You had a what?"
    },
    {
        "character": "Sheila",
        "line": "A fecal transplant. It's when they take the feces of a healthy donor and place it in your anus. I feel like a million dollars!"
    },
    {
        "character": "Linda S.",
        "line": "[arrives] Sheila, is that you? I thought you were sick."
    },
    {
        "character": "Sheila",
        "line": "I was! But I had a fecal transplant."
    },
    {
        "character": "Ike",
        "line": "[in despair] Aaaaah!"
    },
    {
        "character": "Sheila",
        "line": "I'm telling you girls, it's solved every problem I've ever had. I've lost weight, I have more energy, I even think my arthritis is clearing up. [Ike takes the bag of chips and dumps it on the shopping store floor, then puts the bag over his head.]"
    },
    {
        "character": "Laura",
        "line": "Well, that certainly is... interesting."
    },
    {
        "character": "Janice",
        "line": "You're looking great, Sheila!"
    },
    {
        "character": "Sheila",
        "line": "Thanks, Janice. Fecal transplant!"
    },
    {
        "character": "",
        "line": "The Broflovski house, living room, day. Kyle enters with a package. When he gets to the sofa he opens it up and takes out its contents. Inside is a DVD titled \"So Your Mom Had a Fecal Transplant\". He pops it into the DVD player and turns on the TV. He sees a hummingbird pollinating a flower"
    },
    {
        "character": "Narrator",
        "line": "If you're watching this video, then your mom probably had a fecal transplant. [a close up of a young boy's eyes looking into the camera] And the one question on your mind is most likely \"How do I keep my friends from ripping on me?\" [the quote is then shown on screen]"
    },
    {
        "character": "Kyle",
        "line": "Yes!"
    },
    {
        "character": "Narrator",
        "line": "People make fun of what they don't understand. [a colorful clown is shown dancing onstage] So let's learn why your mom had a fecal transplant. It was to replace her [the screen freezes on the clown dancing and the word \"microbiome\" appears on screen] microbiome. Germs, bugs. [close up shots of these organisms are quickly shown] Thousands of organisms are all around you, all the time. That remote control you're holding. [Kyle looks at it] It's teeming with life. Bacteria and other organisms."
    },
    {
        "character": "Kyle",
        "line": "Yuch. [tosses it away, then wipes his hands clean on his jacket.]"
    },
    {
        "character": "Narrator",
        "line": "They also live on your clothes."
    },
    {
        "character": "Kyle",
        "line": "Yeesh."
    },
    {
        "character": "Narrator",
        "line": "Small organisms are everywhere. Now, scratch your balls. [Kyle gets a puzzled look] Go on. [Kyle looks around] If you don't have balls, scratch whatever else might be down there. [Kyle puts his hands down his crotch and scratches] Now, smell your fingers. [Kyle smells his fingers] That smell is millions of living organisms that you just scraped from your crotch and are now going up into your nostrils. [Kyle grimaces, shows shock, and then shakes his head trying to get the image out of it] Your microbiome."
    },
    {
        "character": "Kyle",
        "line": "Eewww!"
    },
    {
        "character": "Narrator",
        "line": "Creatures live in your teeth. They live on your eyelashes. On your skin. And trillions and trillions live inside your body. [Kyle looks alarmed. A 3D rendered chart of a human body is shown covered in colorful dots.] In fact, of all the cells in your body, only half are human cells [half of the dots move to the left of the screen and form a square]. The other half are all microscopic organisms. [the remaining dots move to the right, showing the figure as a skeleton]"
    },
    {
        "character": "Kyle",
        "line": "Aaagh! [runs off]"
    },
    {
        "character": "",
        "line": "Café Monet, day. Sheila, Linda S., Laura, and Mrs. Biggle are seated at a table inside."
    },
    {
        "character": "Laura",
        "line": "How was your salmon, Sheila?"
    },
    {
        "character": "Sheila",
        "line": "Oh it's amazing. You know I could never eat like this before. My allergy to shellfish has literally gone away."
    },
    {
        "character": "Linda S.",
        "line": "Oh my gosh, that's so wonderful."
    },
    {
        "character": "Mrs. Biggle",
        "line": "Oh. [giggles and clears her throat] That, that reminds me, so, Sheila, um, the girls and I were talking. Well, you seem so... great, and we thought how nice it would be for us to have a little bit of your poop."
    },
    {
        "character": "Sheila",
        "line": "... Um, what?"
    },
    {
        "character": "Laura",
        "line": "Well, thing is, we asked our doctors about getting fecal transplants too, and they said they only do them for \"medical reasons,\" so we have to do them on our own."
    },
    {
        "character": "Sheila",
        "line": "Oh heh, well, you know girls, if the doctor doesn't think it's safe, you probably shouldn't be doing DIY transplants."
    },
    {
        "character": "Mrs. Biggle",
        "line": "No, that's very true, isn't it? We were just thinking that your microbiome is so healthy now [Laura nods], and it would be nice to share a little. "
    },
    {
        "character": "Sheila",
        "line": "Yeah. [stammers] I mean, i-it's not that I don't want to share everything with my friends, it's just uh, you know, uh, I'm sorry, it's uh, it just doesn't seem right."
    },
    {
        "character": "Mrs. Biggle",
        "line": "And that is totally fine."
    },
    {
        "character": "Laura",
        "line": "If it doesn't feel right, then it probably isn't right. [giggles]"
    },
    {
        "character": "Sheila",
        "line": "[feels her phone vibrate] Oh, this is Kyle. Sorry, girls, let me take this. [leaves the table]"
    },
    {
        "character": "The other ladies",
        "line": "Okay."
    },
    {
        "character": "Mrs. Biggle",
        "line": "[moments later, when Sheila is out of earshot] That cunt! I told you she'd say no!"
    },
    {
        "character": "Laura",
        "line": "How much of a bitch can you be? Won't share your feces? Talk about anal-retentive!"
    },
    {
        "character": "Linda S.",
        "line": "[pounds her fist on the table] Fuck her! Fuck her!"
    },
    {
        "character": "",
        "line": "The Broflovski house, Kyle's bedroom, night. Kyle tosses and turns in his sleep."
    },
    {
        "character": "Kyle (voice-over)",
        "line": "Half the cells in my body. Half...[a close up of multiple cells splitting]  They're inside me right now. Alive. [multiple organisms floating] All over me. [a black bookcase is shown in a living room] The bookcase."
    },
    {
        "character": "Kyle",
        "line": "[wakes up and sits upright] Aaah!"
    },
    {
        "character": "",
        "line": "The boys' favorite eatery, day. The main four sit and eat burgers and fries."
    },
    {
        "character": "Kyle",
        "line": "Do you guys have any idea what I'm saying?! Half the cells in our bodies aren't human! Right now there are alive creatures in your eyelashes and in your teeth!"
    },
    {
        "character": "Cartman",
        "line": "So?"
    },
    {
        "character": "Kyle",
        "line": "So?! Right now, that straw has a bunch of little bugs and they're going in your mouth and mixing with trillions of other little bugs that are alive inside you! You aren't even totally you!"
    },
    {
        "character": "Stan",
        "line": "Dude, Kyle, why are you talking about all this?"
    },
    {
        "character": "Kyle",
        "line": "Okay, guys, listen. My mom had a fecal transplant."
    },
    {
        "character": "Cartman",
        "line": "[spits his soda out and laughs at him] Fecal transplant!"
    },
    {
        "character": "Mrs. Biggle",
        "line": "Hi Kyle. I'm Harriet, Henrietta and Bradley's mommy. I've been looking all over town for you."
    },
    {
        "character": "Kyle",
        "line": "Why?"
    },
    {
        "character": "Harriet",
        "line": "Well, I went to the video game store and I bought this. [reaches into her purse and pulls out a game] Jedi: Fallen Order. It's getting great reviews. Thought you might want it."
    },
    {
        "character": "Cartman",
        "line": "Whaaat?"
    },
    {
        "character": "Stan",
        "line": "Yeah, he wants it."
    },
    {
        "character": "Harriet",
        "line": "Great. Could you do just one little thing for me, Kyle?"
    },
    {
        "character": "Kenny",
        "line": "(Yeah. He'll do anything.) [Kyle did not appreciate that]"
    },
    {
        "character": "Harriet",
        "line": "When you get back home, could you find a way to get a little of your mom's poop, and put it in this jar? [pulls out an empty mason jar]"
    },
    {
        "character": "Kyle",
        "line": "What?! Eww! No!"
    },
    {
        "character": "Cartman",
        "line": "Yes!"
    },
    {
        "character": "Harriet",
        "line": "I don't need much. I'm sure you can find a way to sneak it from her. You do that and the game is all yours."
    },
    {
        "character": "Kyle",
        "line": "That is disgusting. Absolutely not!"
    },
    {
        "character": "Cartman",
        "line": "Kyle!"
    },
    {
        "character": "Harriet",
        "line": "Oh well, think about it. The offer stands. I heard you can customize your own lightsaber. [slides away]"
    },
    {
        "character": "Cartman",
        "line": "What is your problem?!"
    },
    {
        "character": "Kyle",
        "line": "What is MY problem?! I'm not gonna go steal my mom's shit!"
    },
    {
        "character": "Stan",
        "line": "Dude, you realize we won't get that game 'till Christmas. We could be playing it tomorrow."
    },
    {
        "character": "Kenny",
        "line": "(TO-MORROW!)"
    },
    {
        "character": "Kyle",
        "line": "I said \"no\", and that's final!"
    },
    {
        "character": "",
        "line": "The Broflovski house, night. Sheila goes into the bathroom to take a dump. Down in the basement, Stan, Cartman, and Kenny are messing with the plumbing. Stan peeks out through a grill, Cartman works on the drain removing the cleanout, and Kenny waits by an empty bucket"
    },
    {
        "character": "Stan",
        "line": "She's in. Kyle's mom just squatted in the toilet. [gets off his perch and walks over to Cartman]"
    },
    {
        "character": "Cartman",
        "line": "Okay, we've got contact. Are you ready with the bucket, Kenny?"
    },
    {
        "character": "Kenny",
        "line": "Got it. [brings it over]"
    },
    {
        "character": "Cartman",
        "line": "Place it directly under this pipe. [Kenny puts the bucket under the pipe, and Cartman adjusts its position] Alright. That should just about do it. [steps back] Now we just wait. For the flush."
    },
    {
        "character": "Kenny",
        "line": "[a few seconds later] She's not flushing."
    },
    {
        "character": "Cartman",
        "line": "That's good she's not flushing yet. That means she's got more serious business, and serious business is just what we're after."
    },
    {
        "character": "Stan",
        "line": "You think she'll poop a big enough log? [Kyle appears on the steps behind them.]"
    },
    {
        "character": "Cartman",
        "line": "You see how fat Kyle's mom is? That bitch must poop at least two-pounders."
    },
    {
        "character": "Kyle",
        "line": "The fuck are you doing?! [the others turn around]"
    },
    {
        "character": "Cartman",
        "line": "Oh, hey Kyle, What's going on?"
    },
    {
        "character": "Kyle",
        "line": "You are NOT stealing my mom's shit!"
    },
    {
        "character": "Cartman",
        "line": "Kyle, this is the world we're living in, okay? People are finding new and exciting ways to get healthy, and who are we to stand in their way? [behind him, two pieces of poop drop into the bucket]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital. Dr. Gauche talks to Kyle."
    },
    {
        "character": "Kyle",
        "line": "It just freaks me out, Doc. [the doctor listens to Kyle breathing and heartbeat] We all have these... things... living inside our bodies, and everyone just seems fine with it. It's like, as soon as people learn they have microbiomes, the first thing they want to do is start swapping them."
    },
    {
        "character": "Dr. Gauche",
        "line": "[puts his stethoscope around his neck and goes to wash his hands] Well, young man, the truth is we still don't know a lot about the microbiome, but you shouldn't let it \"freak you out.\""
    },
    {
        "character": "Kyle",
        "line": "But where does it stop?! Then, are people just gonna start wanting skinny people's microbiomes to be skinny? Or an athlete's microbiome to feel athletic and young again?"
    },
    {
        "character": "Dr. Gauche",
        "line": "Yes, it's possible, but we don't know enough. There is no superfeces which can make you athletic and young. [turns the faucet off and dries his hands]"
    },
    {
        "character": "Kyle",
        "line": "Well like, what about Tom Brady's poop?"
    },
    {
        "character": "Dr. Gauche",
        "line": "[turns around and faces Kyle. \"The spice. He knows about the spice.\"]"
    },
    {
        "character": "Kyle",
        "line": "I'm just saying that Tom Brady seems to work really hard on his diet and stuff. His shit must be pretty good."
    },
    {
        "character": "Dr. Gauche",
        "line": "[thinking, \"More than pretty good. The spice mélange.\"]"
    },
    {
        "character": "Kyle",
        "line": "[uncomfortable from the hard stare] What?"
    },
    {
        "character": "Dr. Gauche",
        "line": "Nothing. [thinking, \"It's unobtainable. The spice. But could he be the one to bring it here?\"]"
    },
    {
        "character": "",
        "line": "\"One For The Ladies\" resumes"
    },
    {
        "character": "Announcer",
        "line": "And now back to \"One For The Ladies.\""
    },
    {
        "character": "",
        "line": "Linda S. and Laura walk down Main Street"
    },
    {
        "character": "Linda S.",
        "line": "Have you been in that store at all?"
    },
    {
        "character": "Laura",
        "line": "No. I think it's new, isn't it?"
    },
    {
        "character": "Linda S.",
        "line": "It used to be that watch store."
    },
    {
        "character": "Laura",
        "line": "Oh my God. Harriet?"
    },
    {
        "character": "Harriet",
        "line": "[dressed in a tennis outfit, turns around] Oh, hi girls. What's new?"
    },
    {
        "character": "Linda S.",
        "line": "My goodness, look at you!"
    },
    {
        "character": "Laura",
        "line": "You look great! What happened?"
    },
    {
        "character": "Harriet",
        "line": "Fecal transplant. It's true what they say: I feel 20 years younger. [swings her tennis racket around]"
    },
    {
        "character": "A driver",
        "line": "[pulls up in his red sports car] Looking good, Mrs. B."
    },
    {
        "character": "Harriet",
        "line": "Fecal transplant, Damon. Keep your eyes in the road!"
    },
    {
        "character": "Sheila",
        "line": "Harriet?"
    },
    {
        "character": "Harriet",
        "line": "Oh. Hey, Sheila. [smiles]"
    },
    {
        "character": "Sheila",
        "line": "You're looking chipper today."
    },
    {
        "character": "Harriet",
        "line": "Yeah, I had a little procedure done. Fecal transplant."
    },
    {
        "character": "Sheila",
        "line": "I though the doctor wouldn't give you a fecal transplant, Harriet."
    },
    {
        "character": "Harriet",
        "line": "No, I... did it myself. With a turkey baster."
    },
    {
        "character": "Sheila",
        "line": "Where did you get the feces?"
    },
    {
        "character": "Harriet",
        "line": "Well, it's really none of your business, Sheila. It's a private matter, a fecal transplant. I'd really rather not talk about it. See you girls! [walks off]"
    },
    {
        "character": "The other ladies",
        "line": "Bye, Harriet! [smile. But those smiles soon vanish.]"
    },
    {
        "character": "Laura",
        "line": "Two-faced bitch! You know what she said about you at lunch?"
    },
    {
        "character": "Sheila",
        "line": "What?"
    },
    {
        "character": "Linda S.",
        "line": "She called you the C-word!"
    },
    {
        "character": "Sheila",
        "line": "You're joking!"
    },
    {
        "character": "Laura",
        "line": "Oh no! Clearly she couldn't stand that you were the only one whose shit didn't stink."
    },
    {
        "character": "Linda S.",
        "line": "Fuck her! Fuck her!"
    },
    {
        "character": "",
        "line": "The counselor's office, day. Mr. Mackey has Kenny, Stan, and Cartman in for questioning."
    },
    {
        "character": "Mr. Mackey",
        "line": "Boys, I brought you in here because some rumors are floatin' around the school, m'kay? These rumors are that you three somehow stole feces from Kyle's mom, m'kay, and gave it to Mrs. Biggle in return for \"Jedi: Fallen Order.\""
    },
    {
        "character": "Cartman",
        "line": "That is 100% untrue."
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay, well someone in this school is a little turd burglar, and I want some answers!"
    },
    {
        "character": "Stan",
        "line": "How can answer that to which we have no knowledge?"
    },
    {
        "character": "Cartman",
        "line": "Very nice, very nice."
    },
    {
        "character": "Mr. Mackey",
        "line": "It must be hard, having to take turns playing \"Jedi: Fallen Order.\" It's a single-player game, I believe."
    },
    {
        "character": "Cartman",
        "line": "Wouldn't know."
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh. Because... I could get you each your own copy. That would be a lot of fun, wouldn't it? You guys stole the poop. Could you do it again?"
    },
    {
        "character": "Stan",
        "line": "You want us to steal some of Kyle's mom's poop for you?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Not Kyle's mom's. Someone else's."
    },
    {
        "character": "Cartman",
        "line": "Whose?"
    },
    {
        "character": "Mr. Mackey",
        "line": "[thinking, \"The spice. I must have it. The spice mélange.\"]"
    },
    {
        "character": "",
        "line": "A New England Patriots press conference. Tom Brady comes out to speak to the cameras."
    },
    {
        "character": "Tom",
        "line": "Alright. Alright, I'm... proud of our team today. It was uh... You know, I thought our defense did a great job keepin' us in the game, and again, I think the offense has a lot of room for improvement and all that... starts with me. Questions? Yeah."
    },
    {
        "character": "Reporter 1",
        "line": "Can we have your poop?"
    },
    {
        "character": "Tom",
        "line": "No. Guys, I'm not gonna take any requests for my microbiome. I just wanna focus on the team. We're 10-1 now, you know, but, we can't let up. Yeah?"
    },
    {
        "character": "Sportwriter",
        "line": "Please, can we have your poop?"
    },
    {
        "character": "Tom",
        "line": "Okay, I'm not, I'm not gonna stay our here, you guys. It's just- Does anyone have a real question?"
    },
    {
        "character": "Reporter 2",
        "line": "Tom, after you leave here, are you gonna go eat somewhere or go right home and have a-"
    },
    {
        "character": "Tom",
        "line": "Nono, no. See, I'm not gonna tell you where I'm going, because you're all gonna try and follow me into the bathroom. You're not taking my feces, so unless you have a football question, we're done here."
    },
    {
        "character": "Reporter 1",
        "line": "Can we buy your poop?"
    },
    {
        "character": "",
        "line": "Kyle's bedroom, night. He's sleeping with the covers off. \"Microbiome... inside me. They are inside me. Are they apart of me? When I eat, they eat. When I die, they consume me and continue to live. Am I just an Airbnb in Santa Clarita?\" He wakes up, eyes glowing \"They're not a part of me. They ARE me.\" He sits up and looks at his hands. They're teeming with microorganisms. \"The bookcase. THE BOOKCASE."
    },
    {
        "character": "",
        "line": "Kenny, Cartman and Stan are sitting in Tom Brady's publicist's office. Kenny is in a wheelchair with an IV attached to him, wearing Patriots sports gear and holding a football in his lap. His hair is shown, but his eyes are shielded by the sports cap"
    },
    {
        "character": "Publicist",
        "line": "You have to understand. A lot of people want things from Tom Brady. He has to be a little protective."
    },
    {
        "character": "Stan",
        "line": "Yes, we do understand. We just... well, since you're his publicist. we thought that... you could give Mr. Brady our message. [begins crying]"
    },
    {
        "character": "Cartman",
        "line": "[pats Stan on the shoulder] It's all right, Stan. Don't cry. You see, ma'am, our little friend Kenny here is dying, and he's... he's just the biggest Patriots fan."
    },
    {
        "character": "Publicist",
        "line": "You know, I can call him, but he's very busy right now with the season."
    },
    {
        "character": "Stan",
        "line": "Well if Mr. Brady could just, you know, have Kenny stay over at his house for a night."
    },
    {
        "character": "Cartman",
        "line": "Kind of, like a Michael Jackson kind of thing. [Kenny mumbles something] Oh gosh, we're losin' him! We need to make this happen quickly, ma'am."
    },
    {
        "character": "Publicist",
        "line": "[thinking, \"They want the spice, just like the rest. Perhaps they are the ones.\"]"
    },
    {
        "character": "Cartman",
        "line": "Uh, ma'am?"
    },
    {
        "character": "Publicist",
        "line": "[thinking, A chance, perhaps... they could actually obtain the spice mélange.\"] Let me... see what I can do."
    },
    {
        "character": "",
        "line": "Café Monet. The ladies have gathered there for lunch again"
    },
    {
        "character": "Sheila",
        "line": "Girls, can I just say... you both look fantastic."
    },
    {
        "character": "Laura",
        "line": "[chuckles] Oh, thanks, girlfriend. We've been working out and dieting, you know. Not cheating like that bitch Harriet."
    },
    {
        "character": "Sheila",
        "line": "Well, it's great you guys are doing it the natural way. amd we don't have to deal with Harriet anymore. [the doors fly open and Harriet enters, having thrown up on herself.]"
    },
    {
        "character": "Harriet",
        "line": "There you are, you Goddamned bitch! I will take you to court, fat whore!"
    },
    {
        "character": "Sheila",
        "line": "Harriet, I do not like your tone."
    },
    {
        "character": "Harriet",
        "line": "You knew I was gonna steal your poo, and so you tainted it, didn't you?!"
    },
    {
        "character": "Sheila",
        "line": "What are you talking about?"
    },
    {
        "character": "Harriet",
        "line": "I have been shitting and throwing up all day! It has to be from your feces!"
    },
    {
        "character": "Sheila",
        "line": "So you DID take my poo, huh, Harriet?!"
    },
    {
        "character": "Harriet",
        "line": "That's besides the point now!"
    },
    {
        "character": "Sheila",
        "line": "Oh, IS it? 'Cause the girls told me you called me the C-word the other day."
    },
    {
        "character": "Harriet",
        "line": "Oh, you're all backstabbing bitches now?!"
    },
    {
        "character": "Linda S.",
        "line": "Fuck you, Harriet!"
    },
    {
        "character": "Male Diner",
        "line": "Oho. Okay ladies, come on."
    },
    {
        "character": "Harriet",
        "line": "Just admit it! I can't stop puking and shitting because of what you did to me!"
    },
    {
        "character": "Laura",
        "line": "Oh. Gaw! [throws up, then shits herself]"
    },
    {
        "character": "Harriet",
        "line": "What the fuck?!"
    },
    {
        "character": "Linda S.",
        "line": "You thought you were such hot shit, Harriet! We took the leftover feces from your house and put it up our asses with a turkey baster! Oh! Oh God! [moves away from the table and projectile-vomits, then almost falls over as she projective-poops on other diners, then vomits on another table. Soon, Linda S. is also shitting and pooping on patrons.]"
    },
    {
        "character": "",
        "line": "\"One For The Ladies\" resumes"
    },
    {
        "character": "Announcer",
        "line": "And now back to \"One For The Ladies.\""
    },
    {
        "character": "",
        "line": "An alien landscape is shown. A monster with five jaws rises from it, roars, and goes back down into it, burrowing a hole. The camera zooms out and the landscape is just a piece of poo in a toilet somewhere. A man looks in the toilet before flushing it - it's Tom Brady. His doorbell rings and he turns to get it. Downstairs, the housekeeper answers the door and sees the three boys outside."
    },
    {
        "character": "Cartman",
        "line": "Hello, ma'am. We are the darling children whose dying friend is all set to meet Tom Brady."
    },
    {
        "character": "Mabel",
        "line": "[gravelly voice] I am Mabel Gonzales, the housekeeper. [thinking, \"They're here for the spice. I can sense it.\"]"
    },
    {
        "character": "Cartman",
        "line": "[thinking, \"I wonder why everyone keeps taking really long pauses after they talk.\"]"
    },
    {
        "character": "Stan",
        "line": "[thinking, \"People just keep looking at me like I'm supposed to say something.\"]"
    },
    {
        "character": "Kenny",
        "line": "[thinking, \"Why did I agree to this? I don't even have a machine to play Fallen Order on.\"]"
    },
    {
        "character": "Mabel",
        "line": "Come on in. Mr. Brady is just using the bathroom. [thinking, \"Music to your ears, I suppose.\"]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, day. The parking lot is filled with ambulances bringing in sick men and women from everywhere."
    },
    {
        "character": "Dr. Gauche",
        "line": "We've got more sick incoming! Try and make some more room! [Moves over to Det. Yates] We have a major epidemic here, Detective. C. diff. has spread to half the town. We don't have enough staff or enough to supplies to keep up with it."
    },
    {
        "character": "Yates",
        "line": "How does this happen?"
    },
    {
        "character": "Dr. Gauche",
        "line": "Apparently, the outbreak started at a restaurant when some women got sick on everybody. The women contracted C. diff. by giving themselves DIY fecal transplants."
    },
    {
        "character": "Yates",
        "line": "So they got sick from another woman's feces?"
    },
    {
        "character": "Dr. Gauche",
        "line": "No, they got sick from using this, [holds up a turkey baster] A common household turkey baster. It's a thing most people use just once a year, around Thanksgiving. The rest of the year it just sits in a drawer collecting bacteria, and then the ladies went and stuck it up their asses."
    },
    {
        "character": "Yates",
        "line": "Oh, those ladies!"
    },
    {
        "character": "Dr. Gauche",
        "line": "It gets worse. We're completely out of healthy donor feces. Even if we found a donor at this point, it wouldn't be enough to give everyone transplants."
    },
    {
        "character": "Yates",
        "line": "So what happens next?"
    },
    {
        "character": "Dr. Gauche",
        "line": "With how contagious C. diff. is and how deadly, half of South Park is going to die."
    },
    {
        "character": "Yates",
        "line": "[walks off] Jesus. What have those rascally ladies done?"
    },
    {
        "character": "",
        "line": "Tom Brady's living room, day. The boys wait in the living room with a family and a sportswriter"
    },
    {
        "character": "Stan",
        "line": "So, you're all here to meet Tom Brady too?"
    },
    {
        "character": "Sportswriter",
        "line": "Yeah, I'm a sportswriter, getting a little interview. [thinking, \"A little interview, and hopefully more.\"]"
    },
    {
        "character": "Mom",
        "line": "Yes, and we're here with our little girl who's dying, just like your friend."
    },
    {
        "character": "Theresa",
        "line": "I'm dying, mommy?"
    },
    {
        "character": "Mom",
        "line": "Shut up, Theresa! [thinking, \"The spice mélange. It is here in this house.\"]"
    },
    {
        "character": "Mabel",
        "line": "Everyone, the honorable Thomas Brady."
    },
    {
        "character": "Tom",
        "line": "Hey, everybody. [moves to the middle of the room, in front of a bookcase]"
    },
    {
        "character": "Sportswriter",
        "line": "[jumps up with a knife to keep the others away from Tom] The rest of you, stand back! They all deceived you, Mr. Brady! They only want to get the spice mélange."
    },
    {
        "character": "Tom",
        "line": "Oh God, not again. Alright, everybody out. Come on, let's go."
    },
    {
        "character": "Cartman",
        "line": "Mr. Brady, can we just see your basement really fast?"
    },
    {
        "character": "Tom",
        "line": "Nope, nope, that's all. If you people want a healthy microbiome, then proper diet and healthy choices, alright? That's it! You are all being ridiculous! [the doors open and Kyle enters, stepping down into the living room. His eyes are still glowing blue.]"
    },
    {
        "character": "Stan",
        "line": "Kyle, dude, what are you doing here? [Kyle moves forward]"
    },
    {
        "character": "Cartman",
        "line": "You don't get to be part of Turd Burglars now, Kyle! [Kyle continues forward and stops at the bookcase]"
    },
    {
        "character": "Kyle",
        "line": "The bookcase. [presses a button on the panel in front of him and the bookcase recedes and opens up, revealing a vault full of Tom Brady's poop in mason jars.]"
    },
    {
        "character": "All",
        "line": "Whoa!"
    },
    {
        "character": "Tom",
        "line": "Okay, look. I got sick of people going to my basement and screwing with my plumbing"
    },
    {
        "character": "Sportswriter",
        "line": "The spice! So much of it!"
    },
    {
        "character": "Mabel",
        "line": "Enough for everyone! Enough to bring peace to all!"
    },
    {
        "character": "Tom",
        "line": "I stopped flushing them because people kept breaking my pipes to get them."
    },
    {
        "character": "Publicist",
        "line": "Never did I think so much of it could be obtained."
    },
    {
        "character": "Mom",
        "line": "This is enough for all the universe!"
    },
    {
        "character": "Tom",
        "line": "I mean, you'd all do the same thing if people were always trying to steal your shit. [Kyle's glowing eyes check out every bit of the poo cellar, which also serves as the wine cellar]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, day. Dr. Gauche takes a jar of poop and drops it into a blender, adds some water, and starts the blender up. He then takes a sterile syringe and fills it with the fecal juice and injects it into Mrs. Testaburger's anus."
    },
    {
        "character": "Dr. Gauche",
        "line": "That's good. Stay still. Almost there."
    },
    {
        "character": "Harriet",
        "line": "Oh, Sheila, I'm so sorry for stealing your feces."
    },
    {
        "character": "Linda S.",
        "line": "And we're sorry for stealing it from you, Harriet."
    },
    {
        "character": "Sheila",
        "line": "Girls, this was all my fault. I think I got a little carried away bragging about my fecal transplant."
    },
    {
        "character": "Laura",
        "line": "I hope we can all be besties again."
    },
    {
        "character": "Dr. Gauche",
        "line": "[stopping by to visit.] You ladies are pretty lucky. If it hadn't been for these little turd burglars here, you'd be dead. And also responsible for the deaths of countless others."
    },
    {
        "character": "Sheila",
        "line": "Kyle, how did you do it? I mean, how did you even know what was going on?"
    },
    {
        "character": "Kyle",
        "line": "I didn't know. My microbiome did. All along they were trying to tell me something. I really learned that I'm not just me. I'm also all the creatures inside of me. From now on, I'm gonna trust my gut a little more. [pats his belly]"
    },
    {
        "character": "Dr. Gauche",
        "line": "Well, I think we've all learned something. One for the ladies is one too many for the ladies. [everyone laughs.]"
    }
]