[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "A promo is the first thing shown. Live-action shots throughout"
    },
    {
        "character": "Announcer",
        "line": "This Saturday, Pox presents the musical event of the new millennium! You all remember playing the recorder in elementary school! [a recorder resting on a book of sheet music is shown] Well, this Saturday in Oklahoma City [its skyline is shown], over 4 million third-grade students [a crowd of them is shown] from all over the country [a school bus full of students is shown] will gather in one place, and at the same time, play \"My Country 'Tis Of Thee\" on their recorders. [a girl is shown playing a white one] It's the largest third-grade recorder concert ever! [An elderly man instructs three students, one of them in a wheelchair] Special guest conductor Yoko Ono [pictured] and woodwind virtuoso Kenny G [pictured] will lead this fantastic event! This Saturday, at 11 Eastern / 10 Central. The world will be watching! [close-up of a small boy playing his recorder]"
    },
    {
        "character": "",
        "line": "South Park Elementary, day, Mr. Garrison's classroom. He rushes to the front of the class and stands next to a pull-down screen on which is projected \"My Country 'Tis Of Thee\""
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay children, we've still got some time to practice the song before we load up the bus and head out for Oklahoma."
    },
    {
        "character": "Class",
        "line": "[groaning] Awww."
    },
    {
        "character": "Mr. Garrison",
        "line": "Now, come on, there's gonna be over 4 million third-graders from all over the country there, and I wanna make sure South Park is the best! Okay?! [raises his baton] Recorders up. [the students set their recorders between their lips] And a-1 and a-2 and a- [the class begins to play the song. Some students play slow] \"...of liberty.\" You're late! [the kids play faster, but are still off] \"...my father-\" What the hell was that?! [the students lower their recorders] God-damnit, I don't think you children have been working on your fingering!"
    },
    {
        "character": "Cartman",
        "line": "That's not true, Mr. Garrison: Kyle was working on his fingering with his mom all night long."
    },
    {
        "character": "Kyle",
        "line": "[Kenny laughs] Shut up, fatass!"
    },
    {
        "character": "Cartman",
        "line": "Heh, heh. No, seriously. Kyle's mom says Kyle's getting really good at fingering, heh. [Kenny laughs so hard he falls off his seat]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Shut up, Eric! There's gonna be 4 million children playing this song at the same time on their recorders, and, so help me God, South Park Elementary is not gonna be the only ones that don't know the song! Try again! Recorders up. [the students set their recorders between their lips] And a-1 and a-2 and a- [the class begins to play the song. Mr. Garrison genuflects and bangs his head against his desk. Mr. Mackey walks in, looking at this behavior]"
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay, that sounded great, kids. [Mr. Garrison looks up at him]"
    },
    {
        "character": "Mr. Garrison",
        "line": "[rising] Sure, if you like the sound of a peacock getting its neck broken."
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay, kids. Uh, we have some news. Uh, there's been a terrible flood in Oklahoma, m'kay? So the 4-million-recorder-children's event is being moved to Arkansas."
    },
    {
        "character": "Mr. Garrison",
        "line": "[close-up. He's suddenly scared] Arkansas?"
    },
    {
        "character": "Stan",
        "line": "What's Arkansas—is that a state?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Eh, the trip shouldn't take any longer, but I'll hand out these updated contact sheets so that your parents will know where you are, m'kay? [hands them out. Craig reads his sheet.]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Mr. Mackey, can I talk to you for a second?"
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay. [joins Mr. Garrison aside]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Mr. Mackey, um... I can't go to Arkansas. Somebody's gonna have to fill in for me."
    },
    {
        "character": "Mr. Mackey",
        "line": "What? We can't find anybody to fill in for you. Why can't you go to Arkansas?"
    },
    {
        "character": "Mr. Garrison",
        "line": "[wistfully] Arkansas is where I grew up. My parents live there—my [stifles a sob] ...father still lives there."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well, don't you want to see them?"
    },
    {
        "character": "Mr. Garrison",
        "line": "I haven't seen my father for 23 years."
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh, perhaps you should sit down, Mr. Garrison, m'kay? [walks him over to a chair and sits him down] Mr. Garrison, I know this is very difficult, m'kay, but I must ask: is there a history of sexual abuse in your family?"
    },
    {
        "character": "Mr. Garrison",
        "line": "...Some, yes. There was my uncle, Richard. He... he molested me."
    },
    {
        "character": "Mr. Mackey",
        "line": "When was that?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Saturday. Last, last Saturday. He's a paraplegic, but it didn't—"
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay, eh, and your father? He molested you when you were a boy? [Mr. Garrison begins to cry] Mr. Garrison, I think, when we get to Arkansas, you need to see your father. You need to face this demon in your closet, m'kay?"
    },
    {
        "character": "Mr. Garrison",
        "line": "[turns away] Don't look at me! Uh, y'all go on your bastard trip and just- don't look at me! [hurries out of the classroom crying]"
    },
    {
        "character": "Cartman",
        "line": "That was pretty cool."
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay."
    },
    {
        "character": "",
        "line": "The trip begins. Inside the bus, Mr. Mackey is up front reading a book, Mr. Garrison is in the very back opposite Terrence and the redhead"
    },
    {
        "character": "Cartman",
        "line": "[with recorder] Okay, how about this one, Kenny? [plays an A note]"
    },
    {
        "character": "Kenny",
        "line": "(Uh-uh.)"
    },
    {
        "character": "Cartman",
        "line": "No? How about this? [plays a G note]"
    },
    {
        "character": "Kenny",
        "line": "(Nope.)"
    },
    {
        "character": "Cartman",
        "line": "Hm, interesting. Let's see: how about this? [plays a Gb note. Kyle and Stan turn around on their seat]"
    },
    {
        "character": "Kyle",
        "line": "Cartman, what the hell are you doing?"
    },
    {
        "character": "Cartman",
        "line": "We're trying to find the brown noise—it's this one pitch, this certain frequency that makes people lose bowel control."
    },
    {
        "character": "Stan",
        "line": "What's \"lose bowel control?\""
    },
    {
        "character": "Cartman",
        "line": "That's a scientific term for crapping your pants."
    },
    {
        "character": "Kyle",
        "line": "Oh, brother, here we go again. Cartman, there is not a sound frequency that makes people crap their pants!"
    },
    {
        "character": "Cartman",
        "line": "Yes there is! The French experimented with it in World War II!"
    },
    {
        "character": "Kyle",
        "line": "Nuh-uh!"
    },
    {
        "character": "Cartman",
        "line": "How about this one, Kenny? [plays an F note]"
    },
    {
        "character": "Kenny",
        "line": "(Nuh-uh.)"
    },
    {
        "character": "Kyle",
        "line": "There is no brown noise, fat boy!"
    },
    {
        "character": "Cartman",
        "line": "That's nice. When I find it I'll just make you crap yourself so you look like Karen Carpenter."
    },
    {
        "character": "Stan",
        "line": "Who's Karen Carpenter?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Aaaaaah! [apparently, he's seen a sign that reads: \"Arkansas 410 miles. Rest Stop 5 miles\"] Huhh, ohh, [the students and Mr. Mackey look back.]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Mr. Garrison, are you alright?"
    },
    {
        "character": "Mr. Hat",
        "line": "Mr. Garrison isn't here right now."
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay-Mr. Garrison, you're just having a hard time dealing with the memories of your father's sexual abuse, so you switch personalities to Mr. Hat, m'kay?"
    },
    {
        "character": "Mr. Hat",
        "line": "Oh, good one, Sherlock! You figure that out all by yourself?!"
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay-I think the best thing for Mr. Garrison to do is to go see his father."
    },
    {
        "character": "Mr. Hat",
        "line": "No! No, you moron! [Mr. Mackey gets annoyed] Mr. Garrison can't let the memories end! Just leave us alone!"
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay! Mr. Hat, you need to let me talk to Mr. Garrison, m'kay?!"
    },
    {
        "character": "Mr. Hat",
        "line": "Why would he want to talk to a second-rate dopey-ass elementary-school psychologist?!"
    },
    {
        "character": "Mr. Mackey",
        "line": "What did you say?!"
    },
    {
        "character": "Mr. Hat",
        "line": "You heard me, jackass! There's monkeys that make better counselors than you!"
    },
    {
        "character": "Mr. Mackey",
        "line": "Why, you son of a bitch! [rips Mr. Hat from Mr. Garrison's hand and starts beating him up. Mr. Hat smacks Mr. Mackey down in front of Terrence, who looks aghast]"
    },
    {
        "character": "Stan",
        "line": "Whoa! Mr. Mackey and Mr. Hat are fighting. [the other students turn to see the fight]"
    },
    {
        "character": "Mr. Mackey",
        "line": "I'm gonna kick your ass, m'kay?! [resumes fighting Mr. Hat]"
    },
    {
        "character": "Students",
        "line": "[cheering] Yeah! Yeah! Yeah!"
    },
    {
        "character": "Ms. Crabtree",
        "line": "BE QUIET BACK THERE!"
    },
    {
        "character": "Mr. Mackey",
        "line": "Yuh-NO! [panting, dirty and black-eyed, gets up and places Mr. Hat between Mr. Garrison's arms] You may have won this time, Mr. Hat."
    },
    {
        "character": "",
        "line": "The journey continues. The school bus and its passengers finally reach their destination - a large lot filled with buses and tents, and children"
    },
    {
        "character": "Mr. Mackey",
        "line": "M'kay, I want everyone to stay together, m'kay? Nobody move!"
    },
    {
        "character": "Coordinator",
        "line": "[a female with clipboard, walking up] School?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Excuse me?"
    },
    {
        "character": "Coordinator",
        "line": "What school are you from?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh, uh we're from South Park, Colorado?"
    },
    {
        "character": "Coordinator",
        "line": "Ssss, alright. South Park school, you go over there next to the kids from New York. [distracted by something away from the bus] Nono, don't put the Florida kids in the building! [moves away. The class walks past the New York children]"
    },
    {
        "character": "New York kid 1",
        "line": "[sitting on the bus's front right fender] Ey! Look at the little Eskimos in their freakin' hats and gloves."
    },
    {
        "character": "New York kid 2",
        "line": "Yeah, huh? [they begin to snicker as the South Park kids look back]"
    },
    {
        "character": "New York kid 1",
        "line": "Whoa, look at this kid's coat. [Kenny's] Ey, kid. What's the matter—you a freakin' burn victim or somethin'? What? [the others laugh]"
    },
    {
        "character": "Kyle",
        "line": "[aside, to Stan] Who the hell are these guys?"
    },
    {
        "character": "New York kid 1",
        "line": "I didn't know they was invitin' rednecks to this event!"
    },
    {
        "character": "Stan",
        "line": "We're not rednecks!"
    },
    {
        "character": "Kyle",
        "line": "Yeah! That's Texas, butthole!"
    },
    {
        "character": "New York kid 1",
        "line": "Oh yeah? Well, you look like a bunch of queefs to me, huh?! [the other New Yorkers laugh]"
    },
    {
        "character": "Cartman",
        "line": "[aside, to Stan, softly] Stan, what's a queef?"
    },
    {
        "character": "Kyle",
        "line": "Kenny?"
    },
    {
        "character": "Kenny",
        "line": "(I don't know!)"
    },
    {
        "character": "New York kid 1",
        "line": "Oh, brother! You guys don't even know what a queef is, huh?!"
    },
    {
        "character": "Cartman",
        "line": "Of course we know what a queef is, you queef!"
    },
    {
        "character": "Black kid",
        "line": "[wearing EKKO shirt] Oh yeah? Well, what is it, then?!"
    },
    {
        "character": "Cartman",
        "line": "Aaaa-"
    },
    {
        "character": "Stan",
        "line": "Why?! Don't you know?!"
    },
    {
        "character": "New York kid 1",
        "line": "Are all redneck queefs from Colorado as stupid as youse?!"
    },
    {
        "character": "Kyle",
        "line": "Alright, dickhole! [feedback is heard, and all look to the source]"
    },
    {
        "character": "Coordinator",
        "line": "[on bullhorn] I need everyone's attention, please! We will now all be moving in an orderly fashion to our assigned hotels. Please follow your group leader to check in."
    },
    {
        "character": "New York kid 1",
        "line": "[as South Park leaves] Yeah see ya later, queefs! [at least Stan and Kyle are pissed off. They look angry as they look at each other]"
    },
    {
        "character": "",
        "line": "Roman Holiday Inn, night. The four boys share a room with two beds. They sit amid stacks of books looking for information"
    },
    {
        "character": "Kyle",
        "line": "Ungh, I can't find the word \"queef\" anywhere! [drops his book]"
    },
    {
        "character": "Stan",
        "line": "[reading another book] Well keep looking! We gotta find out what it means before we see those New Yorker kids again!"
    },
    {
        "character": "Kyle",
        "line": "Well, let's try the dictionary. [picks it up] queasy, Quebec, queen quelch. No queef."
    },
    {
        "character": "Stan",
        "line": "Damnit! [closes his book]"
    },
    {
        "character": "Cartman",
        "line": "[reading another book, jumps for joy] Hey, I found it, you guys! I found it!"
    },
    {
        "character": "Stan",
        "line": "You did? [the other three gather around]"
    },
    {
        "character": "Kyle",
        "line": "What's it mean?! What's it mean?!"
    },
    {
        "character": "Cartman",
        "line": "I told you guys! Here it is, right here. \"The brown noise.\""
    },
    {
        "character": "Kyle",
        "line": "Awwgh!"
    },
    {
        "character": "Stan",
        "line": "Damnit Cartman, wha-?!"
    },
    {
        "character": "Cartman",
        "line": "\"An oscillation of sound that causes the bowels to loosen.\" See? That means crap your pants. \"The brown noise is believed to be 92 cents below the lowest octave of Eb.\" What does that mean?"
    },
    {
        "character": "Stan",
        "line": "Who cares? We have to find out what queef means! Keep reading! [he and the other two return to their books and read on]"
    },
    {
        "character": "",
        "line": "Garrison's home town, night. He walks to his former home, his parents' house, in the rain"
    },
    {
        "character": "Mr. Garrison",
        "line": "[on the walkway, sighs] I can do this. I have to do this. [approaches the door and rings the bell. His father answers] Hello. Dad."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Oh, hello, son."
    },
    {
        "character": "Mr. Garrison",
        "line": "Can I ...come in?"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Ub. Sure, of course. [Mr. Garrison enters] Your mom's out at Bridge Night. You want a beer or somethin'?"
    },
    {
        "character": "Mr. Garrison",
        "line": "No. I don't think that will solve any of our problems, though you seem to think it did."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Uh, what?"
    },
    {
        "character": "Mr. Garrison",
        "line": "I have a lot of demons that I need to face, father. I need to know some things."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Uh, okay, like what?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Alright, alright, let's just cut right to it! [sighs] I've come to ask you about the sexual abuse, dad!"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "What??"
    },
    {
        "character": "Mr. Garrison",
        "line": "I have to know why! Right here and now—we're gonna talk about this!"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "What the hell are you talking about?! I never sexually abused you!"
    },
    {
        "character": "Mr. Garrison",
        "line": "I know! I wanna know why not?!"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "WHAT??"
    },
    {
        "character": "Mr. Garrison",
        "line": "Was it that I was ugly?!"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Oh, my God! [turns around]"
    },
    {
        "character": "Mr. Garrison",
        "line": "I wasn't good enough for you! Was that it, Dad?!"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Well, NO!! [walks away, but his son rushes up to grab him]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Sure, you can go off and screw any whore on Wyland Street, but when it came to your own son you were just too busy! [runs off crying. Mr. Garrison Sr. can only express shock.]"
    },
    {
        "character": "",
        "line": "The 4 Million Child Blow 2000 lot, next day. Looks like the 4 million kids are assembled"
    },
    {
        "character": "Coordinator",
        "line": "[Onstage] Alright, everyone, quiet please! There are over 4 million of you, so we must have quiet! At this time I would like to introduce the woman who is making this all possible, Yoko Ono! [motions for Yoko to enter]"
    },
    {
        "character": "Yoko Ono",
        "line": "Please [orates 20 seconds of incomprehensible, imitation, Japanese-accented English]... sing song \"My Country 'Tis of Thee.\""
    },
    {
        "character": "Coordinator",
        "line": "You heard her, We'll start the rehearsal in a few minutes."
    },
    {
        "character": "Stan",
        "line": "Those New Yorker kids are gonna be here any second, and we still don't know what queef means."
    },
    {
        "character": "Kyle",
        "line": "Well, we can still pre-tend like we know what it means."
    },
    {
        "character": "Stan",
        "line": "No, they'll catch on. Hey, wait a minute. I've got a great idea. Let's make up our own word. We can make up a word, and then use it, ...and then they'll act like they know it, and then we'll bust 'em."
    },
    {
        "character": "Kyle",
        "line": "Yeah. That'll make 'em look stupid!"
    },
    {
        "character": "Stan",
        "line": "What word could we make up?"
    },
    {
        "character": "Kyle",
        "line": "How about... finkleroy?"
    },
    {
        "character": "Stan",
        "line": "No, uhno, not finkleroy."
    },
    {
        "character": "Cartman",
        "line": "How about geebo, or, or mung?"
    },
    {
        "character": "Stan",
        "line": "Yeah, mung."
    },
    {
        "character": "Kyle",
        "line": "Mung's good."
    },
    {
        "character": "Stan",
        "line": "Sh. Here they come. [the New Yorkers arrive]"
    },
    {
        "character": "New York kid 1",
        "line": "Well hel-lo there, queefs. All bundled up nice and warm, are we?"
    },
    {
        "character": "Stan",
        "line": "You know what you guys are? You guys are nothing but mung?"
    },
    {
        "character": "New York kid 2",
        "line": "We're not mung. You're mung."
    },
    {
        "character": "Kyle",
        "line": "Oh, so you know what mung means, hunh?"
    },
    {
        "character": "New York kid 1",
        "line": "Of course we know what mung means!"
    },
    {
        "character": "Athlete",
        "line": "Yeah, D'ya think we wouldn't know what mung means? [Stan laughs, then Kyle, Cartman, and Kenny join in]"
    },
    {
        "character": "Stan",
        "line": "We busted you!"
    },
    {
        "character": "Kyle",
        "line": "Hyeh. Yeah. Mung isn't even a word! We made it up! [they resume laughing]"
    },
    {
        "character": "New York kid 1",
        "line": "You guys are even stupider than I thought! Mung is so a word!"
    },
    {
        "character": "Stan",
        "line": "[the boys stop laughing] It is?"
    },
    {
        "character": "New Yorkers",
        "line": "[behind the two toughs and two others] Yeah. [they turn around]"
    },
    {
        "character": "Athlete",
        "line": "It sure is."
    },
    {
        "character": "New Yorker 1",
        "line": "Yeah."
    },
    {
        "character": "New Yorker 2",
        "line": "Uh huh. [turns around]"
    },
    {
        "character": "New York kid 1",
        "line": "Yeah! Mung is the stuff that comes out when you push down on a pregnant woman's stomach."
    },
    {
        "character": "Kyle",
        "line": "[winces] Eewww."
    },
    {
        "character": "Stan",
        "line": "Ooogh."
    },
    {
        "character": "New York kid 1",
        "line": "You guys didn't know that? [the rest of the New Yorkers turn around and they all laugh. Then, the rest of the 4 million+ kids laugh with them] Come on, guys. Let's get away from these rednecks before we get redneckasitis, or somethin'! [they leave. Stan, Kyle, and Kenny turn on Cartman]"
    },
    {
        "character": "Stan",
        "line": "You dumbass, Cartman!"
    },
    {
        "character": "Kyle",
        "line": "Yeah! Next time you make up a word, don't make up one that already exists!"
    },
    {
        "character": "",
        "line": "The Garrison residence, day. Mrs. Garrison Sr. and her son are sipping coffee on the sofa"
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "It's so nice to see you, son. I'm so proud that you're part of the 4 Million Child Recorder Blow."
    },
    {
        "character": "Mr. Garrison",
        "line": "Yes. I hope it's okay if I stay here a few nights, Mother, I... I have some things I really need to talk to you about."
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "About what?"
    },
    {
        "character": "Mr. Garrison",
        "line": "[set his cup down and sighs] Mother, did you know that ...Dad... never sexually molested me?"
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "That... that can't be."
    },
    {
        "character": "Mr. Garrison",
        "line": "He never did, Mom, not once."
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "[stands] That's not true! Your father loved you! Often!"
    },
    {
        "character": "Mr. Garrison",
        "line": "[stands] He never did, Mom! And I think you knew he never did!"
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "[cups her ears and shuts her eyes, spilling her coffee] Nohoho! No! If I knew I would have made him do it!"
    },
    {
        "character": "Mr. Garrison",
        "line": "You stood by and let it happen! You saw him come home drunk and then just go right to sleep!"
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "I'm not listening!"
    },
    {
        "character": "Mr. Garrison",
        "line": "Face it, Mother. He never abused me! [his mom starts to cry, and his dad enters the room carrying groceries]"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Uh, what's goin' on?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Mother won't hear the truth!"
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "He says you didn't molest him as a child!"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Ah-I didn't! You knew I didn't!"
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "No! I didn't know! [cups her ears and shuts her eyes again] I'm not listening!"
    },
    {
        "character": "Mr. Garrison",
        "line": "You can't close your eyes forever, Mother! [she walks away, crying] Mother, wait! [runs after her. Again, Mr. Garrison Sr. is shocked]"
    },
    {
        "character": "",
        "line": "The 4 Million Child Blow 2000 lot, later. Kenny G has joined Yoko Ono and the coordinator onstage"
    },
    {
        "character": "Yoko Ono",
        "line": "[Speaks in imitation, harshly thick, Japanese-accented English] Alright people, how many people has a copy. We must have-a practiced the ... song for the performance tomorrow, please."
    },
    {
        "character": "Coordinator",
        "line": "Okay, children. We need to play closer attention to the sheet music. Remember, if you get lost, just follow along with Mr. Kenny G here."
    },
    {
        "character": "Cartman",
        "line": "Hey, that's it, Kenny. Maybe Kenny G can show us where 92 cents below the lowest Eb is. Then we'll know the brown noise."
    },
    {
        "character": "Kenny",
        "line": "(Yeah.)"
    },
    {
        "character": "Yoko Ono",
        "line": "And-a one gop seven to-sand ... [the children begin to play, and she covers her ears in agony] O-o-o-o. Stop! Stop ... beh goos sa buh got pee you got dere. That was-a terrify! That was-a horri-bee! What we gonna do?!"
    },
    {
        "character": "Kyle",
        "line": "What the hell is that lady talking about?"
    },
    {
        "character": "Stan",
        "line": "I have no idea."
    },
    {
        "character": "",
        "line": "The Garrison gas station. Used to be Garrison and Son, but since Mr. Garrison left, the \"Son\" has been crossed out. Mr. Mackey walks up to Mr. Garrison Sr., who is changing the oil on a car on blocks"
    },
    {
        "character": "Mr. Mackey",
        "line": "[bends down and looks in] Uh, Mr. Garrison, Sr.?"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Thuh, that's me."
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh, my name is Mr. Mackey. I'm your school counselor, m'kay."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "[slides out and rises] What can I do for ya?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh-I wanna talk to you about your son—I'm his n-therapist, m'kay."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Uh, brother! Look, I didn't sexually abuse my son when he was younger!"
    },
    {
        "character": "Mr. Mackey",
        "line": "Eh, you didn't?"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "No! He's upset because I didn't molest him!"
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh. Hm. Uh, I guess that's a little different."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "A little, yeah! He thinks if I don't molest him it means I don't love him."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well, now, uh, what's he supposed to think, Mr. Garrison? I mean, uh, look at all the media, all the magazine ads and television ads talkin' about \"sexual molestation\", m'kay? He sees all that and assumes you didn't molest him because of some flaw in his looks or personality."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "I didn't do it because it's wrong!"
    },
    {
        "character": "Mr. Mackey",
        "line": "I know, I know, but I'm afraid this problem has run very deep through Mr. Garrison's mental state. I'm worried that if... you don't do something, well it could kill him."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Hold on a second: are you actually suggesting that I have sex with my 41-year-old son?!"
    },
    {
        "character": "Mr. Mackey",
        "line": "There comes a time in every father's life when he must ask himself, \"How far will I go to save my son's life?\""
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Well, I won't have sex with him!"
    },
    {
        "character": "Mr. Mackey",
        "line": "Well, I've said all I can say. [walks away, then turns] I know it's difficult, but... family... is about compromises. m'kay? [walks away, then turns] Don't lose your son over this, Mr. Garrison. [emphasizes each syllable] Don't lose... your son, m'kay? [walks out of the station]"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Am I the only sane person left on earth?!"
    },
    {
        "character": "",
        "line": "The Garrison residence, night. Mr. Garrison Sr. is now seated in his armchair watching television. News item:"
    },
    {
        "character": "Reporter",
        "line": "Tomorrow the whole world will be tuning in as over 4 million children play \"My Country 'Tis Of Thee\" on their recorders. [Mr. Garrison walks to the stairs behind his father, but stops to watch the report] It is by far the largest gathering of little plastic recorders in human history. Yoko Ono has..."
    },
    {
        "character": "Mr. Garrison",
        "line": "Well, Mom said I could sleep in the guest room tonight. Good night, Dad."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Good night. [Yoko Ono finishes rambling incoherently]"
    },
    {
        "character": "Reporter",
        "line": "Words to live by."
    },
    {
        "character": "Mr. Garrison",
        "line": "[pause] Guess I'll just... go on up to bed now."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Uh huh."
    },
    {
        "character": "Mr. Garrison",
        "line": "[pause] Now, I don't really have any pajamas—guess I'll just... sleep in my boxers or something."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "[flatly] Should be fine."
    },
    {
        "character": "Mr. Garrison",
        "line": "[pause] Uh I'll leave the door open a little in case you ...need to see me about anything."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Won't be necessary."
    },
    {
        "character": "Mr. Garrison",
        "line": "[steps up, then turns again] I'll just... be going up to bed now. [pause] Gueh... guess maybe I won't even wear those boxers."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "I'm not going to molest you!"
    },
    {
        "character": "Mr. Garrison",
        "line": "You don't love me! [runs upstairs crying] I wanna die!"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "God-damnit! [pounds the arms of the chair with his fists, then rises and goes out the door.]"
    },
    {
        "character": "",
        "line": "Roman Holiday Inn, night."
    },
    {
        "character": "Stan",
        "line": "I wish we could find a way to get back at those New Yorker kids."
    },
    {
        "character": "Kyle",
        "line": "Yeah. They think they're so cool."
    },
    {
        "character": "Cartman",
        "line": "[rushing into the room with Kenny wearing earmuffs] You guys! You guys! We found it! We found it, you guys!"
    },
    {
        "character": "Kyle",
        "line": "Calm down, Cartman."
    },
    {
        "character": "Stan",
        "line": "You found what?"
    },
    {
        "character": "Cartman",
        "line": "The brown noise! Kenny and me found the brown noise! Here, look! Look. [places some earmuffs on Stan's head] There, okay. Let's see here. [places some earmuffs on Kyle and rushes back to his side of the room] Right there. Okay. Okay. Ready, Kenny?"
    },
    {
        "character": "Kenny",
        "line": "(Ready.) [Stan and Kyle look at each other and Cartman plays a fat bass note. Kenny farts] (Oh, [farts] shiiit. Damnit! Cartman, I've got to go to the bathroom! [bawling])"
    },
    {
        "character": "Stan",
        "line": "[incredulous, removes his earmuffs] No way."
    },
    {
        "character": "Kyle",
        "line": "[removes his earmuffs] I don't believe it!"
    },
    {
        "character": "Cartman",
        "line": "[removes his earmuffs] Um, seriously, you guys! Come on, watch. [leads them outside where a UPS delivery man is offloading packages, and the three put on their earmuffs. He whispers] Okay. [plays that bass note again]"
    },
    {
        "character": "Delivery man",
        "line": "[farts] Whoa- Oh, my God! [grabs his belly and lets loose a long fart] Aaww, I crapped my pants! [rushes away with a brown stain on the seat of his pants. The boys remove their earmuffs]"
    },
    {
        "character": "Kyle",
        "line": "That's amazing."
    },
    {
        "character": "Cartman",
        "line": "I told you guys!"
    },
    {
        "character": "Stan",
        "line": "[to Kyle] Dude, are you thinking what I'm thinking?"
    },
    {
        "character": "Cartman",
        "line": "That they should bring back Chicago Hope for another season? Totally."
    },
    {
        "character": "Stan",
        "line": "No! That we could use the brown noise to get back at those asshole New Yorker kids."
    },
    {
        "character": "Cartman",
        "line": "Ooooh."
    },
    {
        "character": "Kyle",
        "line": "Yeah, dude!"
    },
    {
        "character": "Cartman",
        "line": "They should bring back another season of Chicago Hope though, seriously."
    },
    {
        "character": "",
        "line": "Night, the Arkansas Bar. Mr. Garrison Sr. sits by himself at the bar sipping a glass of beer while others around him chatter. A man in blue shirt approaches him"
    },
    {
        "character": "Patron 1",
        "line": "Ey, what's the matter there, Garrison? You look kinda sad."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Well, I'm having some troubles at home."
    },
    {
        "character": "Patron 1",
        "line": "Well, come on. Tell us about it. We always help each other out, don't we, fellas?"
    },
    {
        "character": "Patron 2",
        "line": "[with mustache] Yeah."
    },
    {
        "character": "Patron 3",
        "line": "[with goatee] Yeah, that's right."
    },
    {
        "character": "Patron 1",
        "line": "Yeah."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "All right. It's just that... I mean... We're all family men here, right?"
    },
    {
        "character": "Patron 2",
        "line": "Sure!"
    },
    {
        "character": "Patron 3",
        "line": "Yeah we are!"
    },
    {
        "character": "Blond",
        "line": "[at a table] I am. I know that."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Well, can I ask you guys a difficult question?"
    },
    {
        "character": "Patron 1",
        "line": "Absolutely."
    },
    {
        "character": "Patron 2",
        "line": "Of course."
    },
    {
        "character": "Patron 4",
        "line": "Yeah, man."
    },
    {
        "character": "Patron 5",
        "line": "Come on, Garrison!"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Alright. Would you have sex with your son to save his life? [the others ponder the question]"
    },
    {
        "character": "Patron 2",
        "line": "...Oh, this is one of them Scruples questions, ain't it?"
    },
    {
        "character": "Patron 1",
        "line": "Nono, I got a better one: Would you have sex with your mother... to save your father's life?"
    },
    {
        "character": "Patrons",
        "line": "[wondering] Wooo, yeah."
    },
    {
        "character": "Patron 2",
        "line": "Oh, like if someone had a gun to your father's head and said, \"Have sex with your mother or else I'll shoot him\"?"
    },
    {
        "character": "Patron 1",
        "line": "Yeah."
    },
    {
        "character": "Patron 2",
        "line": "Oh, that's a tough one."
    },
    {
        "character": "Patron 3",
        "line": "Hmmm."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "No no wait, uh, you don't understand."
    },
    {
        "character": "Blond",
        "line": "How about if someone made you have sex with your mother and father to save your own life?"
    },
    {
        "character": "Patrons",
        "line": "No, no, no way. No."
    },
    {
        "character": "Patron 6",
        "line": "But if it was to save my mother's life, uh-I think I would have to have sex with my father."
    },
    {
        "character": "Patron 7",
        "line": "Yeup."
    },
    {
        "character": "Patron 8",
        "line": "Me, too."
    },
    {
        "character": "Patron 9",
        "line": "Well, I think that goes without saying."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Weh actually, I'm just... talking about a... son."
    },
    {
        "character": "Patron 8",
        "line": "Well, personally, I would have sex with my son to save to save my mother's life. It depends, uh- how big a gun are we talkin' here?"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Uh, he doesn't have a gun."
    },
    {
        "character": "Blond",
        "line": "The father doesn't have a gun?"
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "No! Nobody's got a gun!"
    },
    {
        "character": "Patron 3",
        "line": "I think if someone said, \"Have sex with your mother or else I'm gonna kill your son,\" but he didn't have a gun, I wouldn't do it."
    },
    {
        "character": "Patron 2",
        "line": "He could have a knife, though."
    },
    {
        "character": "Patron 1",
        "line": "Yeah."
    },
    {
        "character": "Patron 3",
        "line": "Sure."
    },
    {
        "character": "Patron 1",
        "line": "Yeah, a knife."
    },
    {
        "character": "Bartender",
        "line": "If a killer put a knife to my throat, and said, \"Have sex with your father or else I'm gonna kill your mother while having sex with you,\" ...I would have sex with myself."
    },
    {
        "character": "Patron 1",
        "line": "...Yeah, I would [Mr. Garrison Sr. gets up and heads out the door]"
    },
    {
        "character": "Patron 2",
        "line": "That's right."
    },
    {
        "character": "Patron 3",
        "line": "Uh huh."
    },
    {
        "character": "Bartender",
        "line": "That makes sense."
    },
    {
        "character": "Patron 10",
        "line": "Mm-hm."
    },
    {
        "character": "Patron 1",
        "line": "Wasn't that right?"
    },
    {
        "character": "Patron 3",
        "line": "Mm, See?"
    },
    {
        "character": "",
        "line": "Roman Holiday Inn, night. Stan, Kyle, and Cartman are back in their room reading the sheet music"
    },
    {
        "character": "Stan",
        "line": "How do we write the note, Cartman?"
    },
    {
        "character": "Cartman",
        "line": "Lowest Eb, let's see. I think it looks like this. [shows it to them on his book]"
    },
    {
        "character": "Stan",
        "line": "Alright. Now all we do is wipe out the last note on their sheet music, and change it to the note Cartman played. [makes the change] Come on. [the boys leave their room again and head for the New York room.] There. [tapes the music to the door. Kyle sticks a small yellow Post-It note saying \"Revised Music for Tomorrow\" onto the music] That should do it."
    },
    {
        "character": "Cartman",
        "line": "Sweet. I can't wait to see them crap their pants in front of everybody, you guys."
    },
    {
        "character": "Stan",
        "line": "Okay, let's get back to the room. [the three walk off]"
    },
    {
        "character": "Coordinator",
        "line": "[arrives and sees the change] What's this?? [looks more closely at it] \"Revised Music for Tomorrow\"?? Chip, did you get revised music for tomorrow??"
    },
    {
        "character": "Chip",
        "line": "What??"
    },
    {
        "character": "Coordinator",
        "line": "Ms. Ono has made revisions again! We've got to get these copied 4 million times and make the revisions to the projected music! Come on! Hurry! [hurries away.]"
    },
    {
        "character": "",
        "line": "The Garrison residence, later. Mr. Garrison is asleep in the guest room, which used to be his room. The back door rustles and he wakes up. Footsteps are heard"
    },
    {
        "character": "Mr. Garrison",
        "line": "[sighs, then softly] Dad? [the door opens to reveal his dad's shadow.] Pop, I'm just fast asleep—I'm not hearing anything. [the shadow moves closer and closer...]"
    },
    {
        "character": "",
        "line": "The Garrison residence, later. Exterior shot. Energetic motion is heard inside"
    },
    {
        "character": "Mr. Garrison",
        "line": "[ecstatic] Oh! Oh! Oh, Dad! Oh, goodness gracious, uh! Oh, stop Dad, stop! Whahawah, whah, how could you-hoo?!"
    },
    {
        "character": "",
        "line": "The Garrison residence, morning. Mr. Garrison is at the front door with his luggage"
    },
    {
        "character": "Mr. Garrison",
        "line": "[well-rested and confident] Well, Mom, Dad, I guess I'd better be going. The concert is gonna start soon."
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "Are you sure you can't stay one more night, son?"
    },
    {
        "character": "Mr. Garrison",
        "line": "No, I... think all my work here is done. Dad, I... don't know what to say; I feel closer to you than I ever have."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "Well, I just hope that NOW we can put the past behind us and, and try to be a normal family again."
    },
    {
        "character": "Mr. Garrison",
        "line": "We sure can! Well, I've got a worldwide-telecast recorder concert to get to."
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "We'll be watching on TV. Make us proud, son."
    },
    {
        "character": "Mr. Garrison",
        "line": "I will. [hugs each parent] Good-bye, Mom! Good-bye, Dad! [turns and heads cheerfully out the door] Gray skies are gonna clear up; put on a happy face..."
    },
    {
        "character": "Mrs. Garrison Sr.",
        "line": "You did the right thing, Poppa."
    },
    {
        "character": "Mr. Garrison Sr.",
        "line": "I didn't do squat! [goes inside and opens a door behind which is Kenny G] Here you go, a hundred bucks. [hands Kenny G the money]"
    },
    {
        "character": "Kenny G",
        "line": "Oh, that's okay. Keep your money. Thanks. [walks out and away]"
    },
    {
        "character": "",
        "line": "The concert is introduced. Live-action shots throughout"
    },
    {
        "character": "Announcer",
        "line": "Live, from Oklahoma City! [its skyline is shown] Four million third-grade students [a crowd of them is shown] from all over the country [a school bus full of students is shown] playing \"My Country 'Tis Of Thee\" on their recorders... \"MY COUNTRY 'TIS OF THEE\" special."
    },
    {
        "character": "",
        "line": "The 4 Million Child Blow 2000 lot, concert day. The 4 million are assembled. Yoko Ono and Kenny G take the stage"
    },
    {
        "character": "Stan",
        "line": "Dude, I can't wait 'til those New Yorker kids play the brown noise and crap their pants."
    },
    {
        "character": "Kyle",
        "line": "We have to watch them! We can't miss it!"
    },
    {
        "character": "Kenny G",
        "line": "Are we all ready to play? [almost whispering] Thanks. Okay. [loudly] Let's see the music! [the music pops up on the stage wall]"
    },
    {
        "character": "Kyle",
        "line": "This is gonna be sweet!"
    },
    {
        "character": "Stan",
        "line": "Oh no, dude. Look! [the projected music is shown] It's the music we changed! [the camera zooms in on the changed note]"
    },
    {
        "character": "Cartman",
        "line": "Uh-oh. [Kenny finally shows up]"
    },
    {
        "character": "Kyle",
        "line": "Dude, if 4 million people play the brown noise at the same time-"
    },
    {
        "character": "Yoko Ono",
        "line": "One, two, sign paytah. [Kenny G starts the tune, then the children join in]"
    },
    {
        "character": "Stan, Kyle, Kenny, Cartman",
        "line": "No! [they rush towards the stage. The other kids continue playing]"
    },
    {
        "character": "Stan",
        "line": "Stop! Stop! [he and the other three are near the stage...]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh, aren't those our boys?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh, no. What are they doing?"
    },
    {
        "character": "Stan, Kyle, Kenny, Cartman",
        "line": "Noooo!!! [some of the kids part for them, but the end of the song arrives.]"
    },
    {
        "character": "",
        "line": "The kids play the brown noise, Kenny G and Yoko Ono double over in pain. The camera zooms out for a view of the state of Arkansas, then of North America, as people begin to groan. Shots of Beijing and Paris follow, with their citizens grabbing their asses in pain. A shot of Earth follows, then static. New York City is then shown in flames. An ambulance speeds by as people scream"
    },
    {
        "character": "Reporter",
        "line": "[soberly] Tom, I'm standing in New York City, but it could just as well be any town on Earth right now. The desolation, the damage is exactly the same in every city the whole world over. It's been just under 20 hours since everyone on Earth pooped their pants, and people still roam their damaged homes with disbelief, and loss. Rick?"
    },
    {
        "character": "Rick",
        "line": "[A cleanup crew is shown at work, and the camera pans over to the reporter] Alan, I'm standing at ground zero. Here, the damage is greater than anywhere. [the stage and the lot are bare, except for poop everywhere] Like the rest of the world, everyone here has crapped their pants. Some [Kenny lies dead with rats nibbling on him] crapped themselves to death. And still others ...ruined perfectly good pairs of pants. A nation mourns and tries to rebuild, but the big question that remains is, \"How did this happen?\" [Stan, Kyle, and Cartman walk by, whistling]"
    },
    {
        "character": "Kenny G.",
        "line": "Well, I see. Other than making everyone in the world crap their pants, our event went over really well."
    },
    {
        "character": "Yoko Ono",
        "line": "[Chattering quickly in comical Asian-accented English] Wery well?! Wery well?! You're gonna be on Ricki Lake, I tell you again! Look at ad a bah godda circada she doin wery well?!"
    },
    {
        "character": "Mr. Mackey",
        "line": "[the school buses are ready to take all the third graders back to their homes] Alright, come on, everybody. We've got a long bus ride back to Colorado, m'kay? [Stan, Kyle, and Cartman come into view and stop]"
    },
    {
        "character": "Kyle",
        "line": "Well, that whole experience sure did suck."
    },
    {
        "character": "Stan",
        "line": "Yeah, but you know? I learned something today. We were so worried about how cool we looked to those New Yorker kids that we forgot: we're already totally cool, even if we don't know what queef means. [Kyle and Cartman grin]"
    },
    {
        "character": "Mr. Mackey",
        "line": "[passing by behind them] Uh, queef is a vaginal expulsion of gas, m'kay. [the boys look afraid to know]"
    },
    {
        "character": "Kyle",
        "line": "Huh?"
    },
    {
        "character": "New York kid 1",
        "line": "[stopping by with two others] Here they are!"
    },
    {
        "character": "New York kid 2",
        "line": "Yeah!"
    },
    {
        "character": "Stan",
        "line": "[to Kyle] Oh, brother. Let's just get out of here."
    },
    {
        "character": "New York kid 1",
        "line": "Ey! Not so fast! We know it was you guys that changed the music and made everyone on Earth crap their pants!"
    },
    {
        "character": "Stan",
        "line": "Uuuuh..."
    },
    {
        "character": "New York kid 2",
        "line": "Yeah, we knows all about it!"
    },
    {
        "character": "Kyle",
        "line": "Oh, no!"
    },
    {
        "character": "New York kid 1",
        "line": "Yeah. Me and the guys, well we was talking, and well, well we just want you to know that we think you're pretty cool."
    },
    {
        "character": "Kyle",
        "line": "Huh?"
    },
    {
        "character": "Stan",
        "line": "You do?"
    },
    {
        "character": "New York kid 1",
        "line": "Sure. I mean, everyone on Earth shat themselves 'cause of you. And that's pretty cool. I mean, that's pretty amazing!"
    },
    {
        "character": "New York kid 2",
        "line": "Yeah, we was wrong about you guys. We're sorry."
    },
    {
        "character": "Cartman",
        "line": "Well, that's fine, that's fine. Next time, just remember that we're all pretty cool on the Westside, too, if you know what I'm saying, 'kay?"
    },
    {
        "character": "New York kid 1",
        "line": "Yeah. See you guys later. [the three New Yorkers leave]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Come on, boys. You're holdin' up the bus. [the boys get on and Kenny G stops by] Oh, wow, look. It's Kenny G himself. Thank you for a wonderful concert, Mr. G."
    },
    {
        "character": "Kenny G",
        "line": "Huhuh, good- good-bye. [hugs and kisses him]"
    },
    {
        "character": "Mr. Garrison",
        "line": "M-m-m. [Kenny G releases and walks away] Oh, well, thank you! [steps towards the bus, then stops] You know, it's funny: you kiss just like my dad. [steps into the bus and faces the driver] Well, Ms. Crabtree, this certainly has been a great trip. Let's head home."
    },
    {
        "character": "Ms. Crabtree",
        "line": "Which way should we go?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Second star to the right, and straight on 'til morning. [Ms. Crabtree starts the bus and drives as day fades into night. It goes over a rise and blinks out of view.]"
    }
]