[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "The Marsh house, night. Some of the families are gathered there"
    },
    {
        "character": "Randy",
        "line": "Okay, is everyone ready to go?"
    },
    {
        "character": "Sheila",
        "line": "Oh, I'm so excited. I've always wanted to see Cirque du Cheville."
    },
    {
        "character": "Sharon",
        "line": "Me too. We were lucky to get tickets. [calls out] Come on, boys! We're gonna be late. [the boys, dressed in their Sunday best, walk in with heads down in resentment]"
    },
    {
        "character": "Liane",
        "line": "Oh, don't they look precious?"
    },
    {
        "character": "Stan",
        "line": "Why do we have to dress up? Isn't this just a circus, with elephants and lions and stupid clowns"
    },
    {
        "character": "Sharon",
        "line": "No, Stanley. Cirque du Cheville is French-Canadian. They get acrobats and singers from all over the world and then do very artistic things.."
    },
    {
        "character": "Kyle",
        "line": "Awwww!"
    },
    {
        "character": "Grandpa",
        "line": "[rolls up] Why the hell do you wanna take these boys to see that fufu French theater crap? You're gonna turn them into poofders!"
    },
    {
        "character": "Sharon",
        "line": "Dad, Stanley needs to see the arts!"
    },
    {
        "character": "Grandpa",
        "line": "Well, he doesn't need to see a bunch of frogs prance around in tights and make-up wrappin' their peckers around each other's faces!"
    },
    {
        "character": "Sharon",
        "line": "Come on, everybody, let's go. [the others turn and head out the front door.]"
    },
    {
        "character": "Grandpa",
        "line": "[follows] Close your eyes and cover your ears, Billy! Remember, you're a man."
    },
    {
        "character": "",
        "line": "Cirque du Cheville, night. Folks are streaming in to get seats. Next, under the Big Top"
    },
    {
        "character": "Sheila",
        "line": "Oh, this is so exciting"
    },
    {
        "character": "Sharon",
        "line": "Oh, look at the funny clown, Stanley."
    },
    {
        "character": "Stan",
        "line": "Where? [a clown appears next to him, and he looks up] Oh, no. [the clown pulls out an umbrella and a bicycle horn, squeezes the horn and gets showered by the umbrella. The adults laugh, and the clown offers him the umbrella] Ha ha, very funny, thank you, goodbye. [the clown insists Stan take part, and the parents laugh at the sound of the horn] No, thank you. [the clown tries again] Go away, please."
    },
    {
        "character": "Cartman",
        "line": "He doesn't want your dumbass umbrella, clown! Beat it! [Liane smacks him on the back of the head] Ow. [the clown tries once more with Stan. Stan rolls his eyes, takes the umbrella, and is showered by it when the clown presses the horn. The crowd roars with laughter as the clown revels in his cleverness]"
    },
    {
        "character": "Randy",
        "line": "You didn't know that was gonna happen, did you, Stanley? [Stan looks up angrily]"
    },
    {
        "character": "Cartman",
        "line": "[comments] Oh, God, that was soo funny! Oh, man, somebody stop my guts from bursting out of my sides! [the clown gets mad as Cartman talks, then takes the umbrella from Stan and walks away in a huff]"
    },
    {
        "character": "Announcer",
        "line": "[affecting a French accent] Ladies and gentlemen, please, no smoking and no flash-photography during Sarque du Son Bleu."
    },
    {
        "character": "Cartman",
        "line": "[echoes the announcer] Sarque du Son Bleu. [sticks his tongue out. A performer comes out and starts singing] Oho, we've reached fag factor 5, captain."
    },
    {
        "character": "Liane",
        "line": "Eric, sshhhh. [the performer is joined by men rolling by in wheels behind him and others prancing by in front. The parents smile in awe]"
    },
    {
        "character": "Kyle",
        "line": "How long does this thing last?"
    },
    {
        "character": "Stan",
        "line": "Two hours."
    },
    {
        "character": "Cartman, Kyle, Kenny",
        "line": "Awwwgh."
    },
    {
        "character": "",
        "line": "Cirque du Cheville, later. A troupe of twelve dancers leap high and drop down again. The parents are still in thrall, and their eyes follow the dancers' leaps. Cartman is now asleep. Some time elapses, and a singer sings her song. The other three boys are getting sleepy. The smiles are gone from the parents' faces. The singer is shown with a two-person high-wire act overhead. Little \"birds\" pop out from her dress and dance around. A new act appears, and Stan is looking away feeling bored. Kyle and Kenny seem more awake. An invisible man in a visible suit walks on, and a green man with big ears jumps out of the floor in front of him. The green man and the man shake hands, and the green man rips the man's right arm off. A new act comes on, and Stan, Kyle, and Kenny are really drowsy. The curtains open to reveal five girls, and they come forward to dance"
    },
    {
        "character": "Sharon",
        "line": "Ooo, these are the contorting quintuplets from Romania. [Stan, Kyle, and Kenny are curious. Each of the quints lays on her stomach and puts her feet over her back and on her head.]"
    },
    {
        "character": "Kenny",
        "line": "(Woohoo!) [Stan and Kyle stir, and Kyle nudges Cartman]"
    },
    {
        "character": "Cartman",
        "line": "Wha-what? Another gay guy in feathers? [the quints pile on to make an X, then roll off and reposition themselves into a circle]"
    },
    {
        "character": "Kyle",
        "line": "Whoa. [a few twirls, and the middle one is thrust into the air. The two girls on the outside leap up and land on the other two's heads and catch the middle girl, to form a pentagon. Then they form a large cat, then a yacht,...]"
    },
    {
        "character": "Stan",
        "line": "Damn, dude. [...then the Eiffel Tower, and finally, a Tyrannosaurus Rex. The crowd cheers]"
    },
    {
        "character": "Stan, Kyle, Cartman",
        "line": "Yayy!"
    },
    {
        "character": "Kenny",
        "line": "(Oh yeah! Woohoo!)"
    },
    {
        "character": "",
        "line": "Cirque du Cheville, dismissal. The crowd exits the tent"
    },
    {
        "character": "Sheila",
        "line": "Oh, that was wonderful!"
    },
    {
        "character": "Sharon",
        "line": "Yes. Too bad it was their last show, or I'd go see it again."
    },
    {
        "character": "Kyle",
        "line": "Those contorting Romanian chicks rule."
    },
    {
        "character": "Cartman",
        "line": "Yeah, especially that second one from the left. She was fine!"
    },
    {
        "character": "Kyle",
        "line": "Cartman, what the hell are you talking about?! They're identical!"
    },
    {
        "character": "Cartman",
        "line": "Not that second one from the left; she had it goin' on! [they pass \"LE SOUVENIRS,\" a booth manned by a clown dressed in yellow.]"
    },
    {
        "character": "Clown",
        "line": "[the boys turn to see him] Don't forget to buy your souvenirs, folks. [the adults gather and clamor for the items on display. As they do, the boys talk]"
    },
    {
        "character": "Stan",
        "line": "Damn, dude, do you see how much money this place is raking in?"
    },
    {
        "character": "Cartman",
        "line": "Yeah. I could prance around in little tights and sing opera too, for that kind of cash."
    },
    {
        "character": "Kyle",
        "line": "Hey, we should start our own Cirque du Cheville."
    },
    {
        "character": "Kenny",
        "line": "(Yeah.)"
    },
    {
        "character": "Stan",
        "line": "Yeah. This one's moving out of town, so we could take over. [the boys turn to leave]"
    },
    {
        "character": "Kyle",
        "line": "Let's go practice. [they exit]"
    },
    {
        "character": "",
        "line": "Dressing Room #1. \"Vladchick Contorting Quintuplets\" is written over a star."
    },
    {
        "character": "Grandmama",
        "line": "Hurry up, girls. We must bundle up against the cold."
    },
    {
        "character": "A Quint",
        "line": "Did we do good final show, Grandmama?"
    },
    {
        "character": "Grandmama",
        "line": "Very good, my girls. I only wish it weren't your last show. I love this country so very much. [a knock on the dressing room door, and two stern men walk in]"
    },
    {
        "character": "Romanian official",
        "line": "Mrs. Vladchick, it is time. It is time to return to Romania."
    },
    {
        "character": "Grandmama",
        "line": "Yes, yes, of course. Just give me vone second to finish getting them ready. [the men leave, and she looks to the dressing room window. She walks over, opens the window, turns, and] This way, girls. Quickly. [the girls head for the window. Grandmama lifts them out one by one.]"
    },
    {
        "character": "Quint #2",
        "line": "Vhy are we going out the window, Grandmama?"
    },
    {
        "character": "Grandmama",
        "line": "Your mother did not want you to grow up in Romania. This is our only chance. [drops the girl off outside]"
    },
    {
        "character": "Romanian official",
        "line": "Nid kelmin da bushka."
    },
    {
        "character": "Attendant",
        "line": "Nid kelmin da lushka velt"
    },
    {
        "character": "Romanian official",
        "line": "Nid kelmin da bushka ayn zolt! [the men laugh, the attendant looks at his watch]"
    },
    {
        "character": "Attendant",
        "line": "M-Mrs. Vladchick? [the men enter and find the open window and no one at all]"
    },
    {
        "character": "Romanian official",
        "line": "Dash fam da bushka!"
    },
    {
        "character": "",
        "line": "Cirque du Cheville, outside the main tent. The two Romanian men rush out"
    },
    {
        "character": "Attendant",
        "line": "They're trying to defect! [they rush up to the end of a dock just as Mrs. Vladchick and her granddaughters take off in a dinghy]"
    },
    {
        "character": "Romanian official",
        "line": "[pumping a fist] Cauch! We need a boat. [sees two native men in a canoe, about to leave. He and the attendant walk over to them and gives one of the paddlers some money]"
    },
    {
        "character": "Native paddler in vest",
        "line": "Where to, Mack?"
    },
    {
        "character": "Romanian official",
        "line": "[gets on the canoe] Follow that boat. [the attendant gets on, and the four men paddle away]"
    },
    {
        "character": "",
        "line": "The Marsh house, living room. The boys have bought a CD of the show, and Kenny sings to the instrumental of one of the songs. Kenny is wearing the costume the first singer wore. The other three are practicing… um… Stan tries to leap into Kyle's arms, but they end up tumbling on the floor. Cartman runs forth and does some cartwheels, but lands on a coffee table, breaking it to pieces."
    },
    {
        "character": "Stan",
        "line": "Dude, this isn't working."
    },
    {
        "character": "Kyle",
        "line": "It's Kenny's singing!"
    },
    {
        "character": "Kenny",
        "line": "(Hunh?)"
    },
    {
        "character": "Cartman",
        "line": "Yeah, Kenny, you have to sing better!"
    },
    {
        "character": "Kenny",
        "line": "(I'm singing as good as I can!)"
    },
    {
        "character": "Stan",
        "line": "Well, it's not good enough, Kenny! You have to get better! Try it again! [Grandpa rolls by and notices the boys in dance poses]"
    },
    {
        "character": "Grandpa",
        "line": "Aha, I knew it. They turned you into poofders."
    },
    {
        "character": "",
        "line": "Stark's Pond. Grandmama and the girls zoom away."
    },
    {
        "character": "Romanian official",
        "line": "There's nowhere to go, Mrs. Vladchick. Pull over! [the canoe has caught up to the dinghy. Mrs. Vladchick looks back, then looks forward. They are closing in on a dock full of explosives, and she looks on in horror]"
    },
    {
        "character": "Grandmama",
        "line": "Okay girls, the Cam Ay Alta. [the girls pile on Grandmama and form a tower, each female grabbing the head of the one below her. The top girl grabs a branch with a free hand, and all swing up in the air as one. The dinghy goes on with the canoe in pursuit]"
    },
    {
        "character": "Romanian official",
        "line": "[In a high pitched voice] Be careful, Gabul! Be careful, Gabul! Yaaah! [the canoe runs into the dock and they both blow up. Pieces of the four men fall from the air.]"
    },
    {
        "character": "Top girl",
        "line": "Did we do good, Grandmama?"
    },
    {
        "character": "Grandmama",
        "line": "Very good, Glacas."
    },
    {
        "character": "",
        "line": "The 'camera' pulls back to reveal the entire high speed chase took place on Stark's Pond which is about 7 canoe lengths long."
    },
    {
        "character": "",
        "line": "The Marsh house. Snow falls outside. The other boys have gone home"
    },
    {
        "character": "Stan",
        "line": "I'm tired, Grandpa."
    },
    {
        "character": "Grandpa",
        "line": "No, Billy! You're gonna stay here and watch more MacGyver. We've gotta get all the Frenchy-poo fag-nasties out of ya. [the doorbell rings] Who the hell would be ringin' the doorbell at this time of night?"
    },
    {
        "character": "Stan",
        "line": "I don't know. [walks over and opens the door] Whoa. [before him are the contorting Romanian quintuplets and their Grandmama, all shivering. Randy and Sharon show up in their pajamas]"
    },
    {
        "character": "Grandmama",
        "line": "We are very sorry to disturb you. My granddaughters are cold and tired. Is there any possibility we could pay you for a place to sleep?"
    },
    {
        "character": "Randy",
        "line": "You're from Cirque du Cheville. [Grandpa shows up]"
    },
    {
        "character": "Grandmama",
        "line": "Yes. We- missed our train. If we could shelter here; it would only be for one night."
    },
    {
        "character": "Randy",
        "line": "Well…"
    },
    {
        "character": "Sharon",
        "line": "Well, of course you can. Come in out of the snow. [the girls grin and enter]"
    },
    {
        "character": "Grandmama",
        "line": "Oh, thank you so much. [walks in]"
    },
    {
        "character": "Sharon",
        "line": "There's some spare bedrooms upstairs, Mrs....?"
    },
    {
        "character": "Grandmama",
        "line": "Vladchick. [Sharon escorts her and the girls upstairs]"
    },
    {
        "character": "Grandpa",
        "line": "That Grandma is not a bad piece of ass."
    },
    {
        "character": "Randy",
        "line": "Ew, Dad! Not in front of Stanley!"
    },
    {
        "character": "Grandpa",
        "line": "Well, it's good for 'im."
    },
    {
        "character": "",
        "line": "The McCormick house. Kenny is in his room with three books on his bed."
    },
    {
        "character": "Kenny",
        "line": "[reads \"Learning to Sing Better\"] (Let's see…No, not there) [tosses the book away and picks up \"The Essence of Voicing\"] (Let's see. Nothing there) [tosses it away and picks up \"Singing like Bocelli for Dummies\"] (Let's see…here!) [pulls out a tape and pops it into his tape player]"
    },
    {
        "character": "Narrator",
        "line": "Hello, and welcome to: \"Singing like Bocelli for Dummies.\" Lesson 1: Yaaayayeha!"
    },
    {
        "character": "Kenny",
        "line": "(Yaaayaya.)"
    },
    {
        "character": "Narrator",
        "line": "Lesson 2: Hehyayaya hehyayaya!"
    },
    {
        "character": "Kenny",
        "line": "(Hehyayaya hehyayaya!)"
    },
    {
        "character": "Narrator",
        "line": "Good: And now we'll do the entire piece, \"Con te partirò\" [music begins to play]"
    },
    {
        "character": "Kenny",
        "line": "[leafs through the book] (Con te partirò?) [leafs some more and find it. A rat crawls onto the bed as Kenny looks at the tape player, looks around and leaves. Kenny immediately improves and begins singing like a Prima Divo, yet still characteristically Kenny-muffled…](…Su navi per mariche, io lo so,no, no, non esistono piщ.con te io li rivivere. Con te…)[…and it becomes background music as the camera pans over to…]"
    },
    {
        "character": "",
        "line": "'Camera' pans from the McCormick house across the railroad tracks to the Marsh house. Kenny's voice is so powerful it can be heard clearly in the Marsh upper bedroom. Grandmama Vladchick is in her nightgown combing her hair. Grandpa Marsh rolls by"
    },
    {
        "character": "Kenny",
        "line": "(…partirò.)"
    },
    {
        "character": "Grandpa",
        "line": "[startles Grandmama] Got everything you need there, do ya?"
    },
    {
        "character": "Kenny",
        "line": "(Su navi per mari)"
    },
    {
        "character": "Grandmama",
        "line": "Yes. You're avefully soo kind to my little granddaughters."
    },
    {
        "character": "Kenny",
        "line": "(che, io lo so,)"
    },
    {
        "character": "Grandpa",
        "line": "They're quite agile little things, aren't they?"
    },
    {
        "character": "Kenny",
        "line": "(no, no, non esistono più)"
    },
    {
        "character": "Grandmama",
        "line": "Yes, as I was back in my day. I was a contortionist, too."
    },
    {
        "character": "Kenny",
        "line": "(con te io li rivivere.)"
    },
    {
        "character": "Grandpa",
        "line": "Y'don't say. [strokes his chin]"
    },
    {
        "character": "Grandmama",
        "line": "Yes."
    },
    {
        "character": "Grandpa",
        "line": "You…"
    },
    {
        "character": "Kenny",
        "line": "(Con te…)"
    },
    {
        "character": "Grandpa",
        "line": "...remember any of that stuff, do ya? [she looks flattered and intrigued.]"
    },
    {
        "character": "Kenny",
        "line": "(…partirò.Su navi per mariche, io lo so, no, no, non esistono più.)[as Kenny sings, Grandpa returns to Mrs. Vladchick's room naked... and without the wheelchair. She lifts up her left leg over her head, then lets it go. Kenny's getting into the song. The tape speeds up a bit…] (Io con te!)"
    },
    {
        "character": "Grandpa",
        "line": "Ah. [A leg wraps around his chest] Oh. [a second leg wraps around his head] Ah! [an arm appears, then Mrs. Vladchick's head, then a third leg…] Oh. [Kenny is seen on bended knee on his bed during the last note, as Grandmama Vladchick and Grandpa reach climax.] Oh-oooh-oooh!"
    },
    {
        "character": "",
        "line": "The McCormick house, Kenny's room. The music stops with a thump and Kenny collapses on his bed exhausted"
    },
    {
        "character": "Narrator",
        "line": "And now lesson 4: the complete works of Mozart. Let's begin."
    },
    {
        "character": "Kenny",
        "line": "[looks at the radio] (Damn!)"
    },
    {
        "character": "",
        "line": "The Marsh house, morning. Randy and Sharon are in the kitchen enjoying some coffee"
    },
    {
        "character": "Sharon",
        "line": "What should we do, Randy? I like these Romanians fine, but I hope that old woman isn't planning on staying here much longer."
    },
    {
        "character": "Randy",
        "line": "Heh, it's 11 o'clock and she's still sleeping."
    },
    {
        "character": "Sharon",
        "line": "Poor dear must be tired."
    },
    {
        "character": "Grandpa",
        "line": "[rolls in] You're damn right she's tired."
    },
    {
        "character": "Randy",
        "line": "Huh?"
    },
    {
        "character": "Grandpa",
        "line": "Oh, nothin'. She's just gonna have a little trouble walkin' today is all. [rolls out]."
    },
    {
        "character": "",
        "line": "The Marsh house, outside. Stan leads the other three boys in the side gate and to the backyard"
    },
    {
        "character": "Stan",
        "line": "Hurry up, you guys!"
    },
    {
        "character": "Cartman",
        "line": "What's going on?"
    },
    {
        "character": "Stan",
        "line": "Dude, you're not gonna believe this."
    },
    {
        "character": "Kyle",
        "line": "What?! [they all turn, and the quints stand before them]"
    },
    {
        "character": "Quint 1",
        "line": "Hello."
    },
    {
        "character": "Quint 2",
        "line": "Hello."
    },
    {
        "character": "Quint 3",
        "line": "Hi."
    },
    {
        "character": "Quint 4",
        "line": "Hello."
    },
    {
        "character": "Cartman",
        "line": "No way! The bitches from Cirque du Chebleu!"
    },
    {
        "character": "Stan",
        "line": "Yeah. They're quintuplets from Romania."
    },
    {
        "character": "Kyle",
        "line": "What's a \"quin-tuplet\"?"
    },
    {
        "character": "Quint 2",
        "line": "Ve are twins, except there are five of us instead of two."
    },
    {
        "character": "Kyle",
        "line": "But there's only four of you."
    },
    {
        "character": "Quint 2",
        "line": "No no, Natalia is just playing mirror buddies with Nadia."
    },
    {
        "character": "Nadia",
        "line": "[steps out from behind Natalia] Hello."
    },
    {
        "character": "Kyle",
        "line": "So if you're identical, does that mean you all think alike?"
    },
    {
        "character": "All five quints in unison",
        "line": "No, don't be ridiculous."
    },
    {
        "character": "Stan",
        "line": "Will you guys be in our Cirque du Celville?"
    },
    {
        "character": "A Quint",
        "line": "You have your own?"
    },
    {
        "character": "Stan",
        "line": "Well, not yet. Kenny has to get better at singing first."
    },
    {
        "character": "Kenny",
        "line": "(Hey!)"
    },
    {
        "character": "Cartman",
        "line": "But as soon as he starts singing better, we're all gonna make bank!"
    },
    {
        "character": "Quint 1",
        "line": "Okay."
    },
    {
        "character": "Quint 3",
        "line": "Sounds good."
    },
    {
        "character": "Quint 2",
        "line": "Count me in."
    },
    {
        "character": "Quint 5",
        "line": "Okay. [quint 4 says nothing, and the others look at her]"
    },
    {
        "character": "Quint 4",
        "line": "…Oh, and me."
    },
    {
        "character": "The boys",
        "line": "All right!"
    },
    {
        "character": "",
        "line": "The Marsh house, kitchen"
    },
    {
        "character": "Randy",
        "line": "Alright, we've gotta figure out what to do. I'm gonna go wake her up. [leaves, reaches Grandmama's room, and knocks] Hello? Mrs… Mrs., Old Romanian Woman? [knocks twice more] Ma'am? [opens the door, looks in, and flies are heard buzzing around. Mrs. Vladchick is stiff, mouth open, arms up as if holding someone. Randy shuts the door in horror, then opens it and looks in again to be sure, then shuts it again, horrified]"
    },
    {
        "character": "Grandpa",
        "line": "[rolls up] Well, all tuckered, is she? Ha ha ha ha."
    },
    {
        "character": "Randy",
        "line": "[serious] No, Dad."
    },
    {
        "character": "Grandpa",
        "line": "A little cottony in the crotch? Hr hr hr hr."
    },
    {
        "character": "Randy",
        "line": "No, Dad, she's dead!"
    },
    {
        "character": "Grandpa",
        "line": "What?! [Randy opens the door and looks away, Grandpa rolls in to see for himself] Oh, dear Jesus!"
    },
    {
        "character": "Randy",
        "line": "It looks like she had a heart attack."
    },
    {
        "character": "Grandpa",
        "line": "No wonder she didn't say good-night."
    },
    {
        "character": "Randy",
        "line": "[stares at him, then leans away] Ew!"
    },
    {
        "character": "",
        "line": "The Marsh house, the backyard"
    },
    {
        "character": "Stan",
        "line": "Okay, hold it, hold it. [climbs over Cartman and Kyle to form a tower. The quintuplets have executed their X formation. Stan is trying to stand when all three boys tumble to the ground. The quints break their formation and drop down]"
    },
    {
        "character": "The boys",
        "line": "Ow! [Randy and Sharon walk out and approach the kids]"
    },
    {
        "character": "Sharon",
        "line": "I don't know how to tell. You tell them. [they stop]"
    },
    {
        "character": "Randy",
        "line": "Uh, girls, we… have some bad news."
    },
    {
        "character": "Quint 5",
        "line": "What?"
    },
    {
        "character": "Randy",
        "line": "Um... [Sharon holds his hand] Everyone who has a grandma, step forward. [Stan and Cartman step forward, then the girls] Uh, not so fast, girls. [Sharon gasps and glares at him. The girls step back, then realize what has just happened. They begin to sob]"
    },
    {
        "character": "Sharon",
        "line": "Randy! [amid the sobs, some of the quints have questions]"
    },
    {
        "character": "Quint 2",
        "line": "Grandmama is dead?"
    },
    {
        "character": "Quint 1",
        "line": "What are we going to do now? [Randy and Sharon stand there helplessly]"
    },
    {
        "character": "Cartman",
        "line": "[in a low voice] You guys, come here. [steps forward. The others join him] This is totally awesome."
    },
    {
        "character": "Stan",
        "line": "What?!"
    },
    {
        "character": "Kyle",
        "line": "How can you say that?"
    },
    {
        "character": "Cartman",
        "line": "Because now we can convince them to stay here, and now our circus will kick ass!"
    },
    {
        "character": "Kyle",
        "line": "Oh, yeah!"
    },
    {
        "character": "Stan",
        "line": "[rushes up] Mom! Dad! Can the quints stay with us? Please? Can they?"
    },
    {
        "character": "Randy",
        "line": "Well, Stan, it's not really our-"
    },
    {
        "character": "Stan",
        "line": "They have nowhere else to go. [presses hands together] Please?"
    },
    {
        "character": "Sharon",
        "line": "Well, for the time being I, I mean, of course they can stay."
    },
    {
        "character": "Stan, Kyle",
        "line": "Hooray!"
    },
    {
        "character": "Cartman",
        "line": "Hooray!"
    },
    {
        "character": "",
        "line": "The Marsh house, the backyard, some days later. Neighborhood men and women walk up to a fenced-in area of the yard in which the quints play with various toys and balls"
    },
    {
        "character": "Reporter",
        "line": "Tom, I'm standing at the home in South Park where five precious little girls have been rescued from Romania. Their mother passes away some months ago, and then their grandmother died trying to bring them here. But all is well now, and people are coming from all over the country to view the little tykes. [someone takes a picture] If you'd like to come down and visit the quintuplets, admission is only $5, and for a few dollars more [\"FEED THE QUINTS! One Dollar\" A man buys some fishsticks], you can feed them fishsticks."
    },
    {
        "character": "A Quint",
        "line": "[hops up and down, then opens her mouth for a fishstick the man drops down to her] Mmm."
    },
    {
        "character": "Reporter",
        "line": "Tom, it looks like these cute little girls have made it out of that armpit of a country they call Romania."
    },
    {
        "character": "",
        "line": "Romania, daytime with grey sky. Pan across grey, dismal, identical blocky buildings. Government officials watch the report in a run-down office"
    },
    {
        "character": "Reporter",
        "line": "Yes, luckily for them, these quintuplets no longer have to live in Romania, the asshole of the world. [a last shot of the quints is seen] Back to you, Tom."
    },
    {
        "character": "President",
        "line": "This is not good. It makes our country look poor and stupid."
    },
    {
        "character": "Romanian official",
        "line": "This could kill our tourism."
    },
    {
        "character": "President",
        "line": "You know what to do. [they salute him and leave.]"
    },
    {
        "character": "",
        "line": "South Park School of Music"
    },
    {
        "character": "Instructor",
        "line": "[at the piano] Alright, Kenny, let's start with some warm-up exercises. [plays the sequence C E G C G E C]"
    },
    {
        "character": "Kenny",
        "line": "[sings along] (Ha ha ha ha ha ha ha) [his mom looks on. The instructor and Kenny move on to the D and E scales.]"
    },
    {
        "character": "Mrs. McCormick",
        "line": "Well, what do you think? Can you help him become a better singer?"
    },
    {
        "character": "Instructor",
        "line": "Well, he's got potential. Depends on how good he wants to be."
    },
    {
        "character": "Kenny",
        "line": "(I wanna be really good)"
    },
    {
        "character": "Instructor",
        "line": "Well, if you wanna be a real singer, you need to go to a conservatory in Europe. There's no other alternative."
    },
    {
        "character": "Kenny",
        "line": "(Europe?)"
    },
    {
        "character": "Mrs. McCormick",
        "line": "We can't afford that."
    },
    {
        "character": "Instructor",
        "line": "Well, then, I'm afraid your son will always be a hack."
    },
    {
        "character": "Kenny",
        "line": "(Awww.)"
    },
    {
        "character": "Mrs. McCormick",
        "line": "Well, Kenny, if it means that much to you, maybe we can bus it to Europe and… you can sing on the way to make money."
    },
    {
        "character": "Kenny",
        "line": "(Yeah.)"
    },
    {
        "character": "",
        "line": "The Marsh house, breaking news music is heard. Sharon rushes into the kitchen"
    },
    {
        "character": "Sharon",
        "line": "Randy, Randy, you'd better have look at this. [exits to the living room]"
    },
    {
        "character": "Randy",
        "line": "[follows her out] What? [The boys and the quints watch the news. Sharon and Randy join them]"
    },
    {
        "character": "Anchor Tom",
        "line": "...until the U.S. government receives this video, which was sent from Romania just hours ago."
    },
    {
        "character": "Man",
        "line": "[reading a statement at gunpoint] Hello. This is Romanian father. I am desperate to have my girls returned to me in Romania."
    },
    {
        "character": "Randy",
        "line": "Uh-oh."
    },
    {
        "character": "Stan",
        "line": "That's your dad?"
    },
    {
        "character": "Quint 2",
        "line": "Maybe."
    },
    {
        "character": "Quint 1",
        "line": "But we haven't seen papa for more than five years."
    },
    {
        "character": "Man",
        "line": "How I've missed them all. Little Nahlal."
    },
    {
        "character": "Voice",
        "line": "[hits the man on the head with the gun, k'chunk] Nadia!"
    },
    {
        "character": "Man",
        "line": "Nadia, my sweet Barshta"
    },
    {
        "character": "Voice",
        "line": "[k'chunk] Baltania!"
    },
    {
        "character": "Man",
        "line": "Baltania, eh anyway, my heart is aching for their return. I, I know the American government will do what's right. [the TV is turned off]"
    },
    {
        "character": "Kyle",
        "line": "Hoh no, dude. If they get sent back to Romania, we'll never get our Cirque dei Ceville going."
    },
    {
        "character": "Stan",
        "line": "[gets up and runs to his parents] Mom, Dad, you're not gonna send them back, are you??"
    },
    {
        "character": "Sharon",
        "line": "Well, I… think we… have to,… don't we? [looks at Randy]"
    },
    {
        "character": "Randy",
        "line": "I don't know."
    },
    {
        "character": "Kyle",
        "line": "[the girls look at him] You don't wanna go back to stinky Romania, do you? It sucks there."
    },
    {
        "character": "Cartman",
        "line": "Yeah. America is sooo much cooler. In Romania they just oppress you and try to bring you down."
    },
    {
        "character": "Sharon",
        "line": "We'll have to call the police and see what they want us to do. [she and Randy walk away]"
    },
    {
        "character": "Cartman",
        "line": "Damn, we might be screwed."
    },
    {
        "character": "Stan",
        "line": "No! We've just gotta convince these chicks that America kicks the ass out of every other country. Come on! [walks off]"
    },
    {
        "character": "",
        "line": "South Park Train Station. Kenny and his mom await the train. Kenny launches into \"La donna è mobile.\" Carol holds a \"Trying To Get To Europe\" sign. The other boys take the quints to South Park Funland"
    },
    {
        "character": "Cartman",
        "line": "[in a log ride with the other seven, passes a lumberjack scene] You see, in America we have… log rides! [Kenny and his mom are at a bus terminal in Denver. A couple passes by and drops some money into the hat. Next, Cartman and friends are at Burger Cook, a fast-food restaurant] Bacon double-cheeseburgers! [Kenny and his mom are now at Coyote Bus Lines (play on Greyhound Bus Lines) in St. Louis at night. A man peeks through a door, another man drops some money into the hat. Next day] Sheep-shearing contests!"
    },
    {
        "character": "",
        "line": "22nd Annual Sheep Shearing Contest"
    },
    {
        "character": "",
        "line": "A man shears a sheep with a shearer as the eight kids and four adults watch"
    },
    {
        "character": "A fan",
        "line": "Yeah. Woo hoohoohoo. Yeah. [the girls look on expressionless then #2 and #3 look at each other skeptically. Kenny and his mom are now at JFK International Airport in New York. Kenny gets some more money]"
    },
    {
        "character": "Cartman",
        "line": "[showing the others around a three-story shopping mall] And shopping malls! Hooray! [the girls are grinning. Kenny finally lands in Europe and goes out through gate 96]"
    },
    {
        "character": "",
        "line": "Welcome To Europe! Coziest LittlePlace On Earth! Elevation 4200 ft."
    },
    {
        "character": "Kenny",
        "line": "(Woo hoo!)"
    },
    {
        "character": "",
        "line": "the U.S. Capitol. The Romanian father and two Romanian officials sit in Janet Reno's office"
    },
    {
        "character": "Romanian official",
        "line": "[no beard] Mrs. Janet Reno, you must understand, the father has right to his children."
    },
    {
        "character": "Janet Reno",
        "line": "[flanked by two agents in riot gear] Yes, but the girls seem to wanna stay here. Why don't you all stay here in America, and this whole thing can go away."
    },
    {
        "character": "Mr. Vladchick",
        "line": "Okay. [the official smacks him with the back of the hand] Heh!"
    },
    {
        "character": "Romanian official",
        "line": "Our home is Romania. We love it there."
    },
    {
        "character": "Mr. Vladchick",
        "line": "Ah, yes, uwuh we love it there."
    },
    {
        "character": "Romanian official",
        "line": "If daughters will not return on their own, you must force them to return"
    },
    {
        "character": "Janet Reno",
        "line": "Gentlemen, this has to be handled very delicately. You don't understand Americans' power to protest."
    },
    {
        "character": "Romanian official",
        "line": "Protest?"
    },
    {
        "character": "Janet Reno",
        "line": "Look, people have it so good in America that they get bored very easily. And when people get bored they start protesting things."
    },
    {
        "character": "All three men",
        "line": "Oh."
    },
    {
        "character": "Janet Reno",
        "line": "But I want to assure you, and the Romanian people, that we are going to do everything in our power to make this as confusing as possible. [the Romanians already look confused]"
    },
    {
        "character": "",
        "line": "South Park, the Marsh house, day. A crowd of protesters lobby in front of the house with signs like \"No Go!\", \"We (heart) The Quints\" and \"Romania (with red cross-out circle stamp)\". "
    },
    {
        "character": "Protesters",
        "line": "Let the quints stay! Romania is gay! Let the quints stay! Romania is gay!"
    },
    {
        "character": "Stephen Stotch",
        "line": "Fur is murder! Fur is murder! [notices the stares] Oh, what are we protesting here?"
    },
    {
        "character": "A Protester",
        "line": "[with a \"No Romania\" sign] Romania sucks!"
    },
    {
        "character": "Stephen Stotch",
        "line": "Oh, let's see [His professional protest sign has multiple pages and he flips through from \"FUR IS MURDER\" to \"FREE KEVORKIAN,\" \"SLEEPING BAGS KILL,\" then \"ROMANIA SUCKS\"] Here we go. Romania sucks!"
    },
    {
        "character": "Protesters",
        "line": "Romania sucks! Romania sucks!"
    },
    {
        "character": "Sharon",
        "line": "[looks out through the window. \"Romania sucks! Romania sucks! Romania sucks!\"] Oh my God! I didn't know this was going to become such a big deal."
    },
    {
        "character": "Randy",
        "line": "[\"Romania sucks!\"] That'll teach us for taking an old lady and her granddaughters out of the cold."
    },
    {
        "character": "Lead agent Collins",
        "line": "[backed by 11 other agents and a humvee] Attention, people inside the house! [Randy and Sharon look] You must return the quintuplets to their father! You have until… [lowers the bullhorn. An agent comes up and whispers] Oh yeah, that's good. [back on the bullhorn] You have until Easter Sunday to comply."
    },
    {
        "character": "Protester",
        "line": "Nooo!"
    },
    {
        "character": "Protesters",
        "line": "Boooo!"
    },
    {
        "character": "Collins",
        "line": "What?! [the protesters gang up on the agents, beating them with their signs]"
    },
    {
        "character": "",
        "line": "The Marsh house, Stan's room. Stan and friends are oblivious to the action outside"
    },
    {
        "character": "Stan",
        "line": "Okay, let's try it again. Hup!"
    },
    {
        "character": "A quint",
        "line": "Hup! [she leaps into position to complete the arch. Kyle and Cartman dive through and get up]"
    },
    {
        "character": "Kyle",
        "line": "Alright!"
    },
    {
        "character": "Randy",
        "line": "[enters] Stan, we- [the sight of the undressed boys stops him]"
    },
    {
        "character": "Sharon",
        "line": "Stanley, we have some bad news. The courts have decided the girls must go back to Romania."
    },
    {
        "character": "Stan",
        "line": "No, they can't! We've convinced them that they want to stay in America."
    },
    {
        "character": "Kyle",
        "line": "Yeah, we've shown them amusement parks and malls. How can you expect them to go back now??"
    },
    {
        "character": "Randy",
        "line": "I'm sorry, boys, but Janet Reno is having them taken away on Easter Sunday. We... don't have a choice. Sorry, girls. [he and Sharon walk away]"
    },
    {
        "character": "Stan",
        "line": "Now what do we do?"
    },
    {
        "character": "",
        "line": "The Marsh house, outside, day. Several days have passed, and now the protest crowd is larger, and news cameras are present"
    },
    {
        "character": "Reporter",
        "line": "Tom, it is now Easter morning, and as the U.S. government promised, they are here to take the girls back to their father in Romania. Rumor has it that Janet Reno herself will be extraditing the quintuplets. [just then, a helicopter flies in and hovers over the house. Janet Reno, dressed in a bunny suit, waits in the open door to be lowered]"
    },
    {
        "character": "Soldier",
        "line": "Alright, Ms. Reno, let's go over the plan."
    },
    {
        "character": "Janet Reno",
        "line": "Right."
    },
    {
        "character": "Soldier",
        "line": "We'll drop you on the northwest corner of the backyard. You hop into the back of the house and find the quintuplets. When you see them, you say…"
    },
    {
        "character": "Janet Reno",
        "line": "\"Hello, girls. I'm the Easter bunny.\""
    },
    {
        "character": "Soldier",
        "line": "Good. And then hand them the Easter eggs filled with tear gas. Are you ready?"
    },
    {
        "character": "Janet Reno",
        "line": "Ready."
    },
    {
        "character": "Soldier",
        "line": "Code blue!"
    },
    {
        "character": "Janet Reno",
        "line": "Code blue! [drops down onto the yard]"
    },
    {
        "character": "",
        "line": "Romanian School of Music, day. Kenny is heard singing. He is onstage as his song ends, and his mom joins him with three other people"
    },
    {
        "character": "Music instructor",
        "line": "Lad, we would like very much to have you here at the Romanian Music School."
    },
    {
        "character": "Kenny",
        "line": "(Woohoo!)"
    },
    {
        "character": "Carol",
        "line": "How much is all this gonna cost?"
    },
    {
        "character": "Music instructor",
        "line": "Don't worry, Ms. McCormick, Romania is very poor country. Apartment is cheap. Food is cheap, Everything is cheap because we are so God-damned poor."
    },
    {
        "character": "Assistant",
        "line": "Yes, your two hundred American dollars will last months here."
    },
    {
        "character": "Carol",
        "line": "Wow, what a great country. Everybody's poor, like us."
    },
    {
        "character": "Kenny",
        "line": "(Yeah.)"
    },
    {
        "character": "",
        "line": "The Marsh house, day. Protesters and police mill around the front yard"
    },
    {
        "character": "Janet Reno",
        "line": "[enters the kitchen through the back door] Hello, girls. I'm the Easter bunny. [sees nothing but furniture before her. She pulls out a an assault rifle with scope and silencer then moves forth] Happy Easter, kids. Come see what I brought for ya. [Stan, his parents, and the quints watch TV in the living room, and Janet Reno peeks at them. Terrance and Phillip are heard on the TV. Janet Reno pulls back and flattens herself against the kitchen wall]"
    },
    {
        "character": "Phillip",
        "line": "Hey, Terrance, I think I have to fart. [Reno pulls out an Easter egg and throws it at the girls. It ends up right in front of them]"
    },
    {
        "character": "Terrance",
        "line": "Wait. Before you do, pull my thumb."
    },
    {
        "character": "Quint 2",
        "line": "Oh, look. An Easter egg."
    },
    {
        "character": "Randy",
        "line": "Oh, shi- [the Easter egg unleashes its tear gas, and all cough and choke]"
    },
    {
        "character": "Lead soldier",
        "line": "That's it. Let's move, move move move, move! [breaks through the front door and leads the other police officers in.] Give us the kids, now! Now!"
    },
    {
        "character": "Officer 1",
        "line": "Down on the floor. Get down on the God-damned floor! [more officers stream in as Sharon drops down to the floor and assumes the fetal position]"
    },
    {
        "character": "Officer 2",
        "line": "Find them!"
    },
    {
        "character": "Janet Reno",
        "line": "[bursts through the master bedroom door] This is a bust! Hand over the quints! [police officers are already there looking for them under the bed and in dresser drawers. Reno joins them and heads for the closet. She opens a sliding door and finds Randy holding Stan in his arms and points her weapon at them thus comically recreating the famous image of the US Border Patrol agent pointing his MP5 submachine gun at six year old Elian Gonzalez held by his rescuer Donato Dalrymple] Hand over the children! Happy Easter. Hand over the children!!"
    },
    {
        "character": "Grandpa",
        "line": "[rolls in] What the hell's goin' on?! [all guns point to him]"
    },
    {
        "character": "Officer 3",
        "line": "Freeze, asshole!"
    },
    {
        "character": "Grandpa",
        "line": "Aw, go ahead and shoot me! I dare ya!"
    },
    {
        "character": "Officer 3",
        "line": "Don't push me, man!"
    },
    {
        "character": "Grandpa",
        "line": "Pull the trigger, you little pussy!"
    },
    {
        "character": "Officer 3",
        "line": "Gaahhh! [aims away from Grandpa and lets loose with gunfire]"
    },
    {
        "character": "Officer 4",
        "line": "Gun! Gun! [fires into the room. Reno drops down to avoid getting hit. Bullets riddle the wall]"
    },
    {
        "character": "Janet Reno",
        "line": "Down! Down! [outside, the protesters back away from the house]"
    },
    {
        "character": "Protester",
        "line": "Riot! Riot! [protesters now move forward against a wall of police]"
    },
    {
        "character": "Officer 5",
        "line": "Pepper spray! Pepper spray! [the police harden their line, pull out their cans and spray the protesters, who drop down immediately coughing. The house blows up. When the smoke clears, Reno and two officers are seen carrying the quints away. They reach a black van and toss the girls inside.]"
    },
    {
        "character": "Officer 6",
        "line": "Go ahead! In the van! [Reno goes in, followed by the other officers. One of them barks an order to the driver, and the van leaves the scene.]"
    },
    {
        "character": "Stan",
        "line": "[standing in front of the still burning ruins of his house] Dammit, now I'm never gonna have my own circus!"
    },
    {
        "character": "",
        "line": "Romanian School of Music, day. Kenny performs \"Der Hölle Rache\" in front of a full house. He finishes the aria and the audience erupts in applause. Roses rain down upon him as he takes his bow."
    },
    {
        "character": "Music instructor",
        "line": "Oh, your son is so talented, Ms. McCormick. The people of Romania love him."
    },
    {
        "character": "Carol",
        "line": "Good job, Kenny."
    },
    {
        "character": "Music instructor",
        "line": "Mrs. McCormick, we would love for you and your son to stay here in Romania, with us. Will you consider it?"
    },
    {
        "character": "Carol",
        "line": "[She kneels down and places her hand on Kenny's head] Well, what do you think, Kenny? You'd have to leave your friends and your family behind."
    },
    {
        "character": "Kenny",
        "line": "(Sure!)"
    },
    {
        "character": "Music instructor",
        "line": "Alright!"
    },
    {
        "character": "",
        "line": "The Marsh house, day. The protesters leave one by one. The Marshes stand in the bombed-out ruins"
    },
    {
        "character": "Sharon",
        "line": "Oh, Randy, it's gone! It's all gone!"
    },
    {
        "character": "Cartman",
        "line": "[arrives with Kyle] Dude, what the hell happened?"
    },
    {
        "character": "Stan",
        "line": "The government came and got the quintuplets. No more Cirque du Cheville for us."
    },
    {
        "character": "Kyle",
        "line": "Damnit! How come every time we get a sweet idea, the government has to screw it up?!"
    },
    {
        "character": "Stan",
        "line": "Yeah! Well, not this time!"
    },
    {
        "character": "Cartman",
        "line": "Huh?"
    },
    {
        "character": "Stan",
        "line": "We've just gotta get that angry mob back on our side! [addresses the mob] Alright, everybody, listen up! Those bastards broke in here and took those poor quintuplets to the mayor's office downtown! But they haven't won yet! I say we all go over to the mayor's office, and demand to see the quintuplets right now!"
    },
    {
        "character": "Protester 1",
        "line": "Hmm."
    },
    {
        "character": "Protester 2",
        "line": "Yeaahh."
    },
    {
        "character": "Protester 3",
        "line": "I don't know. I usually like to stop protesting by 5:30."
    },
    {
        "character": "Protester 4",
        "line": "Yeah, ah, do we get overtime for this?"
    },
    {
        "character": "Stan",
        "line": "Uh, sure, you can all get overtime."
    },
    {
        "character": "Protester 5",
        "line": "Alright! [Fist pumps]"
    },
    {
        "character": "Protester 6",
        "line": "Yeah!"
    },
    {
        "character": "Protester 7",
        "line": "Down with Japan! [the mob moves away]"
    },
    {
        "character": "",
        "line": "An office. Janet Reno and the two officers meet the Mayor and her aides for a photo-op. The photographer takes his shot."
    },
    {
        "character": "Janet Reno",
        "line": "Alright. We just need to get a few more pictures of the girls reunited with their father so everyone knows they're happy. [The girls are shown with their grinning father. Two of them sit on his laps, the other three stand in front]"
    },
    {
        "character": "Photographer",
        "line": "Come on, girls. Smile. [the girls look downcast] We want you to look happy. Smile. [works a sock puppet on his left hand] Look at the silly frog. Who's got the silly frog? Look at him. I've got- Look at him. It's so silly. \"I'm so silly.\" [the girls still have their eyes cast down]"
    },
    {
        "character": "",
        "line": "Romania, day. A news report on TV"
    },
    {
        "character": "Stuart",
        "line": "Ah, hello? This is Kenny's dad, back in America. I miss my son very much. I would like to see him returned to me so that the U.S. government will buy me a new car and- [the butt of a rifle strikes the side of his head] Ow! I mean, bec- because I miss my son very much. [looks to his right] Man."
    },
    {
        "character": "",
        "line": "A United States Air Force checkpoint, later. Cartman, Kyle, and Stan approach, and a soldier intervenes"
    },
    {
        "character": "Stan",
        "line": "Hey! We wanna see the quintuplets!"
    },
    {
        "character": "Soldier",
        "line": "[Holds out hand to stop their progress] You can't see them, boys. They're happily reunited with their father."
    },
    {
        "character": "Stan",
        "line": "[whistles a signal] Come on, angry mob! [the mob appears behind him. All of them move forward and overrun the checkpoint. A lagging protester runs over a fallen soldier]"
    },
    {
        "character": "Soldier",
        "line": "Aaa-a-a-aaa-ah."
    },
    {
        "character": "",
        "line": "The USAF office. Reno has taken her mask off and stands next to the girls. Behind her are six officers, and next to them are the two Romanian officials and Mr. Vladchick."
    },
    {
        "character": "Romanian official",
        "line": "[the bearded one] Alright, it is time for us to return to Romania."
    },
    {
        "character": "Janet Reno",
        "line": "[hears something] What is that?"
    },
    {
        "character": "Officer 7",
        "line": "[at a window] It's the protesters. They're back."
    },
    {
        "character": "Janet Reno",
        "line": "God-damnit! [Puts back on her Easter Bunny 'helmet'] We'll take care of them. Come on! [leaves the office]"
    },
    {
        "character": "Officer 8",
        "line": "Let's move. Move!"
    },
    {
        "character": "Officer 7",
        "line": "Come on, come on, come on."
    },
    {
        "character": "Officer 9",
        "line": "Come oonn, come oonn. [they follow Reno out, leaving the quints alone in front of a poster that reads \"Join the Army… It's KILLER!!!\". The officers engage the protesters on a runway]"
    },
    {
        "character": "Officer 10",
        "line": "This is government property!"
    },
    {
        "character": "Protester",
        "line": "Let the quints stay! [Reno and Sharon head for each other]"
    },
    {
        "character": "Sharon",
        "line": "You ruined my house! [lays out Reno using a baseball bat to the Bunny helmet. The quints look out the window, then turn around. Quint 2 hops off the bench and walks to the office phone]"
    },
    {
        "character": "Quint 1",
        "line": "What are you doing, Nadia?"
    },
    {
        "character": "Nadia",
        "line": "I'm calling the only person in the vorld who can help us. [picks up the receiver and starts dialing. The other girls look at each other.]"
    },
    {
        "character": "",
        "line": "A USAF airfield, later. Protesters and officers are still brawling. Stan and Kyle each kick an officer on the shin."
    },
    {
        "character": "Cartman",
        "line": "Take that! [kicks an officer on the shin]"
    },
    {
        "character": "Quint 3",
        "line": "[heads towards the battlefield and addresses everyone] Stop it! Stop it! Stop it! [the other four quints are with her. Weapons and signs are lowered]"
    },
    {
        "character": "Quint 1",
        "line": "All of you are acting like idiots!"
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Quint 1",
        "line": "None of you care about us. You only care about yourselves!"
    },
    {
        "character": "Quint 2",
        "line": "Look at you, Father. You walked out on us five years ago [he removes his hat and holds it tight], and now you act like you miss us sooo much! You are a liar and a fake!"
    },
    {
        "character": "Cartman",
        "line": "Yeah, you suck, dude!"
    },
    {
        "character": "Quint 3",
        "line": "And you Romanian leaders [both of them are there], you don't care about us! All you care about is making America look stupid!"
    },
    {
        "character": "Cartman",
        "line": "Yeah! God, you guys are dicks!"
    },
    {
        "character": "Quint 3",
        "line": "And you protesters! Don't you have anything better to do?! Get a life!"
    },
    {
        "character": "Cartman",
        "line": "Yeah!"
    },
    {
        "character": "Quint 3",
        "line": "And you boys are the worst of all!"
    },
    {
        "character": "Stan, Kyle, Cartman",
        "line": "Huh?"
    },
    {
        "character": "Quint 3",
        "line": "You know nothing about Romania, and yet you assume America is so much better! Maybe Romania isn't as nice as America, but it is our home! We are Romanian! All you care about is your own stupid circus! [at this point, a limousine pulls up behind them. It's from the Oprah show. The driver opens the back door and the girls head for the back seat]"
    },
    {
        "character": "Janet Reno",
        "line": "[has a protester in a headlock] Where are you going, girls?"
    },
    {
        "character": "Quint 1",
        "line": "The only place we can go. We're going on Oprah and then a book tour. [turns and climbs in, followed by three others]"
    },
    {
        "character": "Quint 5",
        "line": "Yes. You can all kiss our little white Romanian asses! [wiggles her ass at the crowd and climbs in. The limo leaves and everyone is left in a state of shock.]"
    },
    {
        "character": "Stan",
        "line": "Oh, well. Doing our own circus was a dumb idea anyways."
    },
    {
        "character": "Cartman",
        "line": "Yeah, screw them!"
    },
    {
        "character": "Kyle",
        "line": "Kenny was never gonna get his singing right anyway."
    },
    {
        "character": "Stan",
        "line": "Whatever happened to Kenny?"
    },
    {
        "character": "",
        "line": "Romania, still grey and dismal daytime. Romanian protesters with signs bearing a picture of Kenny's head lobby in front of the house Kenny's in."
    },
    {
        "character": "Romanian protesters",
        "line": "Let Kenny stay! Let Kenny stay! Let Kenny stay! [a van pulls up and police officers all the way from the U.S. pour out]"
    },
    {
        "character": "Officer 1",
        "line": "[sternly] Alright, people, the father wants his son returned to him! Hand him over to us!"
    },
    {
        "character": "Romanian protesters",
        "line": "Boooo!"
    },
    {
        "character": "Officer 2",
        "line": "Shut up, Romanians! All right, let's go. Move move move move! [bursts through the front door. Officers pour in and look all over the place for Kenny. They enter the master bedroom, and look under the bed and in dresser drawers. One of them head for the closet and opens the sliding door and again the Elian Gonzalez scene is recreated with Kenny and his mother facing the police]"
    },
    {
        "character": "Officer 3",
        "line": "[seeing Carol holding Kenny] Hand over the boy, now!"
    },
    {
        "character": "Carol",
        "line": "Okay, okay!"
    },
    {
        "character": "Officer 3",
        "line": "I mean it, lady, you've got about-! [his assault rifle goes off, riddling Kenny with bullets. His mom is distraught and drops Kenny] Whoops."
    }
]