[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Mr. Garrison's classroom. But this day, a substitute teacher enters with a bag of stuff and makes an announcement."
    },
    {
        "character": "Mr. Wyland",
        "line": "Good morning, children. Mr. Garrison is away today. I am your substitute teacher, Mr. Wyland. [writes it on the chalkboard. A shot of the class reveals Kyle missing]"
    },
    {
        "character": "Cartman",
        "line": "[in a low voice] Oh, sweet, dude. Substitute teacher."
    },
    {
        "character": "Mr. Wyland",
        "line": "Now, I understand that some students in this class like to mess with substitute teachers. [Cartman points at Craig] But if we all behave and respect each other, I'm sure we can make this a fun and productive day. Let's start with roll call. Let's see, mmmmm. [runs his finger down the list] Eric Cartman?"
    },
    {
        "character": "Stan",
        "line": "[raises his hand] Here! [he, Kenny, and Cartman laugh heartily]"
    },
    {
        "character": "Mr. Wyland",
        "line": "Alright, and how about Stan Marsh?"
    },
    {
        "character": "Kenny",
        "line": "[raises his hand] (Here.) [he, Stan, and Cartman laugh heartily]"
    },
    {
        "character": "Wendy",
        "line": "It's not that funny, you guys. Jesus."
    },
    {
        "character": "Mr. Wyland",
        "line": "Okay, and where iiiiss… Kenny McCormick?"
    },
    {
        "character": "Cartman",
        "line": "[raises his hand] Here. [he, Stan, and Kenny laugh heartily. A few seconds later his nose bleeds a white liquid all over his desk] Oh, hoho. Ow."
    },
    {
        "character": "Stan",
        "line": "Dude, what the hell was that?"
    },
    {
        "character": "Cartman",
        "line": "Oh, huh. Oh, geez, you know, when you're laughin' so hard that the milk comes out your nose? Uh ho ho, man!"
    },
    {
        "character": "Stan",
        "line": " ...Dude, you weren't drinking any milk."
    },
    {
        "character": "Cartman",
        "line": "Huh?"
    },
    {
        "character": "Stan",
        "line": "You have to be drinking milk for that to happen."
    },
    {
        "character": "Cartman",
        "line": "Not with me, man."
    },
    {
        "character": "Mr. Wyland",
        "line": "Alright. Look, why don't we skip roll call? Here's what we're gonna do today. [reaches into the bag and pulls out some glue and glitter] I've been told that one of your classmates has been ill for several days — Kyle Broflovski?"
    },
    {
        "character": "Stan",
        "line": "[drawn out] He's fakin'!"
    },
    {
        "character": "Mr. Wyland",
        "line": "Well, I've been told that in Mr. Garrison's absence, our activity for the day is to make a get-well card for Kyle. So I got this large piece of poster board, and we're all gonna come up and use glitter.and glue to decorate it."
    },
    {
        "character": "The Class",
        "line": "Awww. [the kids leave their seats and head for the front of the class. Cartman remains in his seat]"
    },
    {
        "character": "Cartman",
        "line": "[drawn out] He's fakin'! [the other kids get busy decorating the card]"
    },
    {
        "character": "Mr. Wyland",
        "line": "Kenny, you come and decorate the get-well card, too."
    },
    {
        "character": "Cartman",
        "line": "But I don't want Kyle to get well. I hate Kyle."
    },
    {
        "character": "Mr. Wyland",
        "line": "I don't care! Get down here and do it!"
    },
    {
        "character": "Butters",
        "line": "Hey, watch it! [Mr. Wyland looks down at the group] Hey, what are you doin'? [the kids back away to reveal Butters decorated, not the poster board. A sign hangs on him saying \"Get Well Kyle\"]"
    },
    {
        "character": "Stan",
        "line": "Now, that's a get-well card! [the others laugh. Cartman soon joins them, but his nose begins to leak that white liquid again. He covers his nostrils and continues laughing]"
    },
    {
        "character": "",
        "line": "Denver, day. The Denver School Administration building is shown. Inside, the South Park School Board is meeting. Principal Victoria is present among the three people seated around a horseshoe-shaped table."
    },
    {
        "character": "Chairman",
        "line": "Mr. Garrison, after very careful review the school board believes that you should take a... hiatus from teaching. Indefinitely."
    },
    {
        "character": "Mr. Garrison",
        "line": "What??"
    },
    {
        "character": "Board Member",
        "line": "Frankly, your conduct has been somewhat disconcerting. [a look of disbelief comes across Mr. Garrison's face]"
    },
    {
        "character": "Chairman",
        "line": "Did you know that not one of your students knew who Sam Adams was?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Well, who cares about a guy that makes beer?! Jesus Christ, I'm trying to teach history!"
    },
    {
        "character": "Chairman",
        "line": "...Frankly, Mr. Garrison, it isn't even your educational record that we're most concerned about. [reviews a sheet of paper] It's your somewhat substantial police record."
    },
    {
        "character": "Mr. Garrison",
        "line": "[stomps his foot down] Oh, whatever!"
    },
    {
        "character": "Principal Victoria",
        "line": "Mr. Garrison, last week's charges of attempting to solicit sex from a minor wa-"
    },
    {
        "character": "Mr. Garrison",
        "line": "That was not me, that was Mr. Hat! [points to his puppet]"
    },
    {
        "character": "Board Member",
        "line": "All we're saying is, perhaps you should take a little hiatus from teaching until this little [does quotes with two fingers on each hand] \"child molestation\" thing dies down a bit."
    },
    {
        "character": "Mr. Garrison",
        "line": "[rises from his chair] Gentlemen, teaching is all I know. It is the air that I breathe."
    },
    {
        "character": "Chairman",
        "line": "We're sorry, Mr. Garrison, we have no choice."
    },
    {
        "character": "Mr. Garrison",
        "line": "[crestfallen] Very well. I guess... I'm not a teacher anymore. [approaches the chairman] I suppose you'll be wanting my badge and gun... [pulls them out and sets them on the table]"
    },
    {
        "character": "Chairman",
        "line": "Mr. Garrison, most teachers do not carry a gun!"
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh, sorry. So I can keep it then? [grabs back his revolver]"
    },
    {
        "character": "",
        "line": "Kyle's house, day, Kyle's room. He's in bed delirious and mumbling. His door opens and in walks Sheila with Sharon and Stan."
    },
    {
        "character": "Sheila",
        "line": "Kyle, Stan and his mother came over to visit you."
    },
    {
        "character": "Sharon",
        "line": "Hello, sweetie. [Stan walks over to Kyle's bed]"
    },
    {
        "character": "Stan",
        "line": "Dude, you can stop faking now. We got a substitute teacher. [Kyle mumbles once more] Kyle?"
    },
    {
        "character": "Sheila",
        "line": "They say it's his kidneys. Kyle always has been a diabetic and lately his kidneys have just been shutting down."
    },
    {
        "character": "Sharon",
        "line": "Well, the kids at school made you a card, Kyle. Look. [Butters walks into the room still decorated from head to toe in glitter and glue, and he carries the sign in his right hand]"
    },
    {
        "character": "Stan",
        "line": "Go on, Butters!"
    },
    {
        "character": "Butters",
        "line": "Ho, I don't wanna!"
    },
    {
        "character": "Stan",
        "line": "Butters, go on!"
    },
    {
        "character": "Butters",
        "line": "Oh, uhuh alright, then. [starts to sing]\nWe're so sorry you're not feeling well\nWe hope you're better soon.\nSo we're bringing you some sunshine\nBy, um, singing you this tune:\n[brings out a cane and dances]\nEverybody misses you\nAnd though we hate to cause a fuss\nWe'd like to say, \"Get well soon!\"\nAnd \"Please don't die on us.\"\n[pulls a rip cord and a bunch of balloons inflate automatically around him. Kyle babbles some more]\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Dude, you really are sick, huh?"
    },
    {
        "character": "Kyle",
        "line": "I don't know, I..."
    },
    {
        "character": "Sheila",
        "line": "I don't know what to do, Sharon. They wanna have him go into surgery, but they're so dangerous."
    },
    {
        "character": "Sharon",
        "line": "Sheila, have you tried holistic natural medicines? They work wonders. I read all about in People."
    },
    {
        "character": "Sheila",
        "line": "Really? In People?"
    },
    {
        "character": "Sharon",
        "line": "There's a brand-new shop in town that sells holistic medicines and all-natural foods. It's run by this fascinating woman named \"Miss Information.\""
    },
    {
        "character": "Sheila",
        "line": "Oh, well, with a name like \"Miss Information\" she must know something."
    },
    {
        "character": "Sharon",
        "line": "Why don't we at least take Kyle down there and see what she has to say."
    },
    {
        "character": "Sheila",
        "line": "Okay. I'll get our coats. [turns and walks out the door. Kyle babbles some more]"
    },
    {
        "character": "Butters",
        "line": "Can I go now?"
    },
    {
        "character": "",
        "line": "South Park Elementary, Mr. Mackey's office. Craig waits outside on a bench."
    },
    {
        "character": "Mr. Garrison",
        "line": "[lying down on a couch] I don't know what I'm goin' tuh do, Mackey. Teaching is all I know."
    },
    {
        "character": "Mr. Mackey",
        "line": "[in a armchair] Okay, well, maybe you need to view this as a chance to do something you've always wanted to do."
    },
    {
        "character": "Mr. Garrison",
        "line": "I've always wanted to write a novel."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well, there you go, m'kay?"
    },
    {
        "character": "Mr. Garrison",
        "line": "But I never know what to write about."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well that's easy. Write about what you know. Write about what you love. What do you love most?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Besides teaching?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Yes."
    },
    {
        "character": "Mr. Garrison",
        "line": "...Poontang."
    },
    {
        "character": "Mr. Mackey",
        "line": "M, m'kay"
    },
    {
        "character": "Mr. Garrison",
        "line": "I can't help it. I'm a womanizer sometimes, I know, but I just think that... taking a woman home and getting some hot poon is about the greatest thing in the world."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well that settles it, Mr. Garrison. What you need to do is go write a great romance novel."
    },
    {
        "character": "Mr. Garrison",
        "line": "Yes, that's it. [sits up brightly] I am going to write the Great American Romance Novel!"
    },
    {
        "character": "",
        "line": "Miss Information's New Age Shop. The sign is framed by two antlers and its entrance is a curtain of beads. In the picture window you see a pyramid with an eye on one side, a crystal ball and stand, a little elephant, and some charms. Outside, under the window, is a bed of flowers. Inside, Miss Information talks to Stan, Kyle, and their moms. Kyle looks fatigued"
    },
    {
        "character": "Miss Information",
        "line": "You see, the reason our body is stale is because of toxins."
    },
    {
        "character": "Sheila",
        "line": "Toxins?"
    },
    {
        "character": "Miss Information",
        "line": "All the horrible food we eat—the sodas and meats are filled with toxins, and the only way for us to get better is to flush those toxins out of our system. Western medicine is so quick to cut and carve up, but all your son needs is a toxin-flushing diet of lemon juice and cayenne pepper."
    },
    {
        "character": "Sharon",
        "line": "Wow, that's amazing, Miss Information!"
    },
    {
        "character": "Sheila",
        "line": "You hear that, Kyle? You don't need surgery after all. [Kyle coughs]"
    },
    {
        "character": "Stan",
        "line": "Uh excuse me, but, what do these toxins look like?"
    },
    {
        "character": "Miss Information",
        "line": "What?"
    },
    {
        "character": "Stan",
        "line": "Wuh, have you ever actually seen a toxin?"
    },
    {
        "character": "Sharon",
        "line": "Don't be a smartass, Stanley."
    },
    {
        "character": "Miss Information",
        "line": "Mrs. Broflovski, I would like to give your son herbs that focus on the kidney. I have these excellent herbs from local Native Americans."
    },
    {
        "character": "Sharon",
        "line": "Ooo, Native Americans. Now, they know how to heal the body spiritually. [Kyle begins to babble]"
    },
    {
        "character": "",
        "line": "Mr. Garrison's house, night. A second-story window casts a shadow of Mr. Garrison at his laptop computer. He types and we hear the words as he says them in his mind..."
    },
    {
        "character": "Mr. Garrison",
        "line": "Out on the balcony, when Reginald kissed Diana's lips, her knees went weak. Slowly, he pulled her top down, exposing her soft, unyielding breasts\nOh yeah, now this is getting good [sips some wine]\nJust the sight of those breasts made Reginald's penis very hard.\n[taps his chin with his left index finger. The computer screen is shown as the words are typed]\nHis penis was of considerable size, and now beads of sweat slowly ran down his\n[pauses]\npenis, making it glisten like a strong swimmer fresh from out of the pool. It was a fantastic penis, that seemed as strong as a horse's leg, yet as delicate as a flower wrapped in silk. What a grand, grand penis. Diana's nipples\n[music cuts off. He thinks] Uh, let's see... [taps his chin with his right index finger] Diana's nipples...[The words on the screen are shown halted at 'nipples'] [aloud] Oh, writer's block, writer's block! Hmmm. Crap! I'm stuck. [turns his body to one side] Oh well, maybe that's enough writing for today, Mr. Hat.\n\n"
    },
    {
        "character": "",
        "line": "Kyle's house, morning. At Kyle's bedside, Sharon, Sheila, and Liane talk to each other while Stan keeps vigil. Three other mothers are there"
    },
    {
        "character": "Mrs. Tweak",
        "line": "Oh my, he looks terrible."
    },
    {
        "character": "Blonde Mother",
        "line": "Yes, poor little dear."
    },
    {
        "character": "Miss Information",
        "line": "[arrives] Good morning, everyone."
    },
    {
        "character": "Blonde Mother",
        "line": "[walks up to her and brings her in] Oh, thanks for coming, Miss. Information. Kyle seems to be getting worse. [Miss Information walks to Kyle's bed as Stan watches. She raises her arms and waves them over Kyle's body]"
    },
    {
        "character": "Miss Information",
        "line": "Huuuuuuuuuh [lowers her arms] Oh, I don't agree. He seems much better."
    },
    {
        "character": "Sheila",
        "line": "Really?"
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Miss Information",
        "line": "Yes, his chi is flowing much nicer than yesterday, and his aura is lighter."
    },
    {
        "character": "Sharon",
        "line": "Oh, that's great news! [Kyle barfs and Stan steps out of the way]"
    },
    {
        "character": "Sheila",
        "line": "Oh no!"
    },
    {
        "character": "Miss Information",
        "line": "Nono, that's good. Those are the toxins flushing out of the system."
    },
    {
        "character": "Sharon",
        "line": "Ooooo."
    },
    {
        "character": "Stan",
        "line": "Those aren't toxins. That's the bean with bacon soup he ate half an hour ago."
    },
    {
        "character": "Sharon",
        "line": "Stanley, what did I say about being a smartass?!"
    },
    {
        "character": "Stan",
        "line": "Don't be a smartass?"
    },
    {
        "character": "Miss Information",
        "line": "Now, don't be fooled. As Kyle's body sheds itself more and more of all the toxins he will appear to be getting worse, but actually, he is getting better!"
    },
    {
        "character": "Sheila",
        "line": "Wow. Well, I am on natural medicines. If only I had known sooner."
    },
    {
        "character": "Other mothers",
        "line": "[ad lib] I agree. Yeah. That's right. [Stan looks defeated]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, day. Dr. Doctor is in his office filling out a form"
    },
    {
        "character": "Nurse",
        "line": "[over an intercom] Mr. Marsh is here to see you."
    },
    {
        "character": "Dr. Doctor",
        "line": "Alright, send him in. [from his desk, golf balls, a cup, and a set of golf clubs can be seen. Stan enters] Oh, Stanley."
    },
    {
        "character": "Stan",
        "line": "Hi, doctor. [takes a seat]"
    },
    {
        "character": "Dr. Doctor",
        "line": "How can I help you?"
    },
    {
        "character": "Stan",
        "line": "Well, it's my friend, Kyle. I think he's really, really sick."
    },
    {
        "character": "Dr. Doctor",
        "line": "He is really, really sick, Stanley. I was seeing him last week when he first got ill, but unfortunately his mother has decided to put all her trust into holistic medicine."
    },
    {
        "character": "Stan",
        "line": "But I don't think it's working."
    },
    {
        "character": "Dr. Doctor",
        "line": "Alright, Stanley, I'm going to be very honest with you. Your little friend Kyle needs a kidney transplant. Or it is very possible that... he will die."
    },
    {
        "character": "Stan",
        "line": "[overwhelmed] Die? But... Kyle's my best friend. In the whole world."
    },
    {
        "character": "Dr. Doctor",
        "line": "I know this is a lot to lay on someone your age, but... the rest of the town is so gung-ho in New Age medicine that I have nowhere else to turn."
    },
    {
        "character": "Stan",
        "line": "...I'll give Kyle my kidney, even if it hurts a whole lot; I don't care."
    },
    {
        "character": "Dr. Doctor",
        "line": "That's very brave, Stan, but I've already checked my records, and you and Kyle aren't a match for kidneys. In fact, [looks at a sheet of paper] there's only one person in South Park with the same blood type as Kyle."
    },
    {
        "character": "Stan",
        "line": "Who? [Dr. Doctor turns the sheet around, and Cartman's picture is on it. A close-up reveals that Cartman has AB-negative blood] Oh, shit."
    },
    {
        "character": "",
        "line": "Cartman's house, day. Cartman and Kenny are playing at dogfights in the air, and Kenny makes sound effects while maneuvering a yellow ship"
    },
    {
        "character": "Kenny",
        "line": "(Rrrrooowwwrrr, rroowwrr, pew, pew, POW.) [crashes the ship into a soldier]"
    },
    {
        "character": "Cartman",
        "line": "\"Coming in for attack, Captain.\" Pipew, pipipew [grabs for the yellow ship] Give me the space cruiser, Kenny."
    },
    {
        "character": "Kenny",
        "line": "(No, no.)"
    },
    {
        "character": "Cartman",
        "line": "Come on, Kenny, you have to give me the subspace cruiser [pulls the cruiser his way] so I can destroy the Gengrins on Crespus 5."
    },
    {
        "character": "Kenny",
        "line": "[gets up as Cartman speaks] (Unngh. Stop, no! No, it's mine!) [pulls the cruiser back] (There! It's mine!) [the doorbell rings and the two boys tug at the ship in opposite directions]"
    },
    {
        "character": "Cartman",
        "line": "No, mine. M'yah! [the ship breaks in two, with Kenny getting the short end] Ha haa ha! I broke your space cruiser, Kenny! Ha haa, ha ha ha [his nose spurts out white fluid again] bluh oh, ha-ow! [blocks his nostrils]"
    },
    {
        "character": "Liane",
        "line": "[walks up] Ooh, sweetums, did you laugh too hard again?"
    },
    {
        "character": "Cartman",
        "line": "Yeah."
    },
    {
        "character": "Liane",
        "line": "Well, some more of your little friends are here to play with you. [Stan enters with a sick Kyle in his arms]"
    },
    {
        "character": "Cartman",
        "line": "Okay, mom."
    },
    {
        "character": "Liane",
        "line": "[genuflects and speaks softly to Cartman] And don't get too close to Kyle. He looks like he might have the AIDS. [Stan leaves Kyle and walks up to Cartman]"
    },
    {
        "character": "Cartman",
        "line": "What's goin' on, guys?"
    },
    {
        "character": "Stan",
        "line": "Cartman, we have to ask you a question. A very serious question."
    },
    {
        "character": "Cartman",
        "line": "Oh-kay."
    },
    {
        "character": "Stan",
        "line": "Kyle's in trouble, Cartman. I can see him getting worse right before my eyes. There might be a way that you... can save his life."
    },
    {
        "character": "Cartman",
        "line": "Uh huh."
    },
    {
        "character": "Stan",
        "line": "What Kyle really needs... is a new kidney."
    },
    {
        "character": "Cartman",
        "line": "Oh, I think I see where this is going. [Kyle moans]"
    },
    {
        "character": "Stan",
        "line": "His mom is trying all this Eastern medicine and New Age bullcrap on him, but it's obviously not working."
    },
    {
        "character": "Cartman",
        "line": "Stan, why don't you just ask the question?"
    },
    {
        "character": "Stan",
        "line": "Alright. Will you donate one of your kidneys to Kyle?"
    },
    {
        "character": "Cartman",
        "line": "[sings and dances]\nNo no, no no, no!\nNo no, no no, no!\n\n\n"
    },
    {
        "character": "Stan",
        "line": "But you only need one, fat boy!"
    },
    {
        "character": "Cartman",
        "line": "'No no, no no, nono no!Nonono, no no!\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Dude, one of your friends is goin' tuh die! Don't you see how serious this is?!"
    },
    {
        "character": "Kenny",
        "line": "[miffed] (It's not that's fucking serious.) [Kyle coughs twice]"
    },
    {
        "character": "Cartman",
        "line": "Well, perhaps I could see my way to giving up a kidney. For a price."
    },
    {
        "character": "Stan",
        "line": "Oh my God!"
    },
    {
        "character": "Kyle",
        "line": "How much?"
    },
    {
        "character": "Cartman",
        "line": "I don't know. How much is your life worth to you, Kyle?"
    },
    {
        "character": "Stan",
        "line": "Cartman, you are so going to hell when you die!"
    },
    {
        "character": "Cartman",
        "line": "Yes, well, until then, I need about ten million dollars."
    },
    {
        "character": "Kenny",
        "line": "(Ten million dollars??)"
    },
    {
        "character": "Stan",
        "line": "What the hell would you do with ten million dollars, fatass?!"
    },
    {
        "character": "Cartman",
        "line": "What I intend to do with the money is not an issue, is it? I suggest you start looking for that money quickly. Kyle doesn't seem to have much time. Tick-tock. Tick-tock."
    },
    {
        "character": "Stan",
        "line": "Come on, Kyle. Let's get out of here. [they walk away]"
    },
    {
        "character": "Cartman",
        "line": "Okay. Where were we, Kenny? Oh yeah. [they return to the floor to continue play] \"Quick, Captain, we must destroy the Gengrin across the fire.\" Give me the space cruiser. Give it, Kenny. M'yah!"
    },
    {
        "character": "",
        "line": "Miss Information's shop, next day. A line of folks wait to enter the shop while a few shoppers exit with their purchases. Inside, the shop is busy."
    },
    {
        "character": "Man 1",
        "line": "Oooh, free-range aspirin!"
    },
    {
        "character": "Man 2",
        "line": "All-natural cell phones! [Two stoners, who appear to be Richard 'Cheech' Marin and Tommy Chong, appear at the door with boxes of stuff]"
    },
    {
        "character": "Miss Information",
        "line": "Oh, look everyone. These are our two resident Native Americans. Chief Running Pinto, and Carlos Ramirez. [shoppers gather around the men]"
    },
    {
        "character": "Man 3",
        "line": "[amid the chatter] Ooo."
    },
    {
        "character": "Man 4",
        "line": "I'd like to buy some more stuff."
    },
    {
        "character": "Man 5",
        "line": "Come in. Come here, guys."
    },
    {
        "character": "Man 6",
        "line": "Do you have any new holistic items for sale?"
    },
    {
        "character": "Carlos Ramirez",
        "line": "Oohh, oh yeah. Aah... [holds up a decorated clothes hanger] Here, uh, this is a- uhh, dream...catcher."
    },
    {
        "character": "Woman 1",
        "line": "Oh, a dreamcatcher. I'll buy one. [other women start ordering them]"
    },
    {
        "character": "Chief Running Pinto",
        "line": "[holds up an item] Yeah. And these here are Cherokee hair tampons. They're, like, tampons made with all-natural hair from the Cherokee people."
    },
    {
        "character": "Sharon",
        "line": "Ooh, a tampon made from Cherokee hair—now that sounds natural."
    },
    {
        "character": "Miss Information",
        "line": "Native Americans are more in tune with the earth than we are."
    },
    {
        "character": "Chief Running Pinto",
        "line": "Oh yeah. We love the earth, man."
    },
    {
        "character": "Carlos Ramirez",
        "line": "Oh yeah, the earth is great."
    },
    {
        "character": "Miss Information",
        "line": "[walks up to Sheila] Mrs. Broflovski's son is a little sick. Perhaps she could bring him in tomorrow and you could give him some spiritual healing."
    },
    {
        "character": "Chief Running Pinto",
        "line": "Oh, sure. We could do that, man. We'll give him, like, a, a brain enema, or somethin'."
    },
    {
        "character": "Carlos Ramirez",
        "line": "[laughs] uh'hm, ho ho hm."
    },
    {
        "character": "Sheila",
        "line": "Wonderful!"
    },
    {
        "character": "Miss Information",
        "line": "[takes Sheila along] Why don't you follow me over to the cash register and I'll take a deposit. [the other shoppers crowd the two men]"
    },
    {
        "character": "Man 7",
        "line": "D'you have anymore stuff to sell? We wanna buy more stuff."
    },
    {
        "character": "Man 8",
        "line": "Yes. Much, much more stuff."
    },
    {
        "character": "Chief Running Pinto",
        "line": "Sure, uh, we just gotta go back to our truck- I'm, I mean our horses and grab some more junk. [Ramirez starts to laugh] Come on. [turns to leave]"
    },
    {
        "character": "Miss Information",
        "line": "Good-bye, Native Americans. The spirit of Maya is with you."
    },
    {
        "character": "Carlos Ramirez",
        "line": "Oh yah. You too and junk. [they head out the door and away]"
    },
    {
        "character": "Chief Running Pinto",
        "line": "[off-screen] That's funny, man. [Stan walks in]"
    },
    {
        "character": "Sharon",
        "line": "Oh hi, Stanley. Look, I'm buying you some more all-natural toothpaste."
    },
    {
        "character": "Stan",
        "line": "You mean the stuff that tastes like ass and doesn't fight cavities?"
    },
    {
        "character": "Sharon",
        "line": "That's right."
    },
    {
        "character": "Stan",
        "line": "Look, um... I know that you all think the earth and its natural healing powers can cure Kyle, but... the doctor at the hospital told me it can't."
    },
    {
        "character": "Miss Information",
        "line": "Well, of course the doctor told you that, because he wants to make money. Holistic medicine is about NATURE. [to Sheila] Two-hundred and thirty-three dollars. [Sheila pays, and Miss Information rings it up]"
    },
    {
        "character": "Sheila",
        "line": "Everything's going to be fine, Stan. We're bringing Kyle in tomorrow to see the Native Americans personally."
    },
    {
        "character": "Stan",
        "line": "Isn't it possible that these Indians don't know what they're talking about?"
    },
    {
        "character": "Sharon",
        "line": "You watch your mouth, Stanley! The Native Americans were raped of their land and resources by white people like us!"
    },
    {
        "character": "Stan",
        "line": "And that has something to do with their medicines because...?"
    },
    {
        "character": "Sharon",
        "line": "Enough, Stanley!"
    },
    {
        "character": "",
        "line": "Miss Information's shop, curbside. Kenny is sitting there. Stan exits the store, walks over to him, and sits down next to him. Somber music plays"
    },
    {
        "character": "Stan",
        "line": "Nobody wants to listen, Kenny."
    },
    {
        "character": "Kenny",
        "line": "(I know.)"
    },
    {
        "character": "Stan",
        "line": "I don't know what else to do. I mean, he could die, Kenny. And that means we'd never see him again."
    },
    {
        "character": "Kenny",
        "line": "(Uh huh.)"
    },
    {
        "character": "Stan",
        "line": "I guess maybe I've always taken friends for granted, like they'd always be there. If a friend died, I don't know what I'd do. [Kenny gets mad, Stan gets resolute] Well, I'm not just gonna stand here and watch my friend die. Kenny, go round up all the kids in town who want to help Kyle! Round them up and meet me at the bus stop at 7:30! Kyle's gonna live! [walks away]"
    },
    {
        "character": "Kenny",
        "line": "(Rrrh!)"
    },
    {
        "character": "",
        "line": "Mr. Garrison's house, night. He's back at his laptop. He's typing with only his left hand now, while Mr. Hat sits on his right hand"
    },
    {
        "character": "Mr. Garrison",
        "line": "[We hear Mr Garrison's thoughts]Chapter 18.\nDiana had never slept with another woman before, but it was an erotic thought she often fantasized about.\n[out loud]Oh yeah, Mr. Hat. Hot lesbo scene comin' up!\nAnd as Rebecca's naked body lay before her, Diana couldn't help but feel aroused. [Words on the computer screen are seen typed] \"Go on\", Rebecca said softly, \"Touch me.\" Diana leaned down slowly and brushed Rebecca's bare stomach with her fingertips... It felt good. Like a penis. A soft, but sturdy penis that felt warn to the touch. In Rebecca's mind, she suddenly felt like she was surrounded by penises. They were all around her, flopping all around and slapping her face. It was as if she were in a redwood forest of penises.\n[unconsciously, his right hand (Mr Hat hand) lowers down towards his crotch and is soon out of view, but the arm moves around some...]\nThey presented themselves tall and mighty all around her, with...\n[catches himself masturbating] Mr. Hat, what the hell are you doing?! [looks around to see that no one is watching, then happily] Oh, Mr. Hat!\n\n"
    },
    {
        "character": "",
        "line": "Bus stop, night. Stan waits with a book under his arm."
    },
    {
        "character": "Stan",
        "line": "[checks his watch] Come on, where are they? [looks around. Three boys approach from his left: Kenny, Butters, and Timmy]"
    },
    {
        "character": "Stan",
        "line": "This is it??"
    },
    {
        "character": "Kenny",
        "line": "(Uh huh)"
    },
    {
        "character": "Timmy",
        "line": "Timmiiihh!"
    },
    {
        "character": "Stan",
        "line": "This is everyone that wanted to help Kyle??"
    },
    {
        "character": "Butters",
        "line": "Well, Clyde was gonna come too, but he, he said his mom was makin' tacos for dinner and Clyde likes tacos a whole lot."
    },
    {
        "character": "Stan",
        "line": "[quite disappointed] Jesus Christ! Alright, Butters, you take this medical book, and everyone follow me!"
    },
    {
        "character": "Butters",
        "line": "Huh, where are we goin'?"
    },
    {
        "character": "Stan",
        "line": "We're gon' tuh take Cartman's kidney. [the others look are shocked]"
    },
    {
        "character": "",
        "line": "Switch to live action. Daytime in a middle class American backyard. A dyed sandy haired, middle-aged, white woman speaks with her sandy haired daughter while seated on the patio lounge."
    },
    {
        "character": "Mother",
        "line": "[Smiling, empty-headed into the distance]"
    },
    {
        "character": "Daughter",
        "line": "[hesitantly] Mom... Do you ever have those heavy flow days?"
    },
    {
        "character": "Mother",
        "line": "[Places her hand comfortingly on her daughter's thigh] Oh absolutely sweetheart, everybody does."
    },
    {
        "character": "Daughter",
        "line": "[Camera zooms in on her face] Mom, remember the movie The Shining where the elevator doors are opening up.."
    },
    {
        "character": "Mother",
        "line": "[Camera switches to close-up on mother's face] Oh honey what you need is a more absorbent tampon. [grabs her daughter's hand and shakes hands in emphasis]"
    },
    {
        "character": "Daughter",
        "line": "[Camera zooms back out] Like what?"
    },
    {
        "character": "Mother",
        "line": "Well, what's the most absorbent thing in the world?"
    },
    {
        "character": "Daughter",
        "line": "[Looks down, plays with her hair and mulls it over] Well... Cherokee hair I guess. [Camera zooms back on her face] But what does that have to do with me?"
    },
    {
        "character": "Mother",
        "line": "[Camera zooms out and mother grabs a box]Because now there is all new, natural \n[Camera zooms in on mother who fakes a broad smile and holds a purple box of 'All Natural Cherokee Hair Tampons' with a Native woman that looks like the Land O' Lakes butter symbol]\nCherokee hair tampons. \n[Broadens her fake smile].\n\n"
    },
    {
        "character": "",
        "line": "Live action continues. Petri dish, on a table, with tampon is shown in front of tampon box while a light brown hand pours dyed blue water over the tampon. The tampon swells quickly."
    },
    {
        "character": "Female announcer",
        "line": "[Speaking like an authority]A cotton tampon can hold only so much liquid. \n[Scene slides over to another petri dish with tampon in front of box where the hand pours blue liquid on that tampon that swells more slowly] \nOther tampons also come up short. \n[Scene slides right again to a Cherokee woman laying on the table with her hair spread flat along the table]\nBut Cherokee hair has been known for ages to be strong and powerful \n[The hand pours dyed blue water along the Cherokee woman's splayed hair, which doesn't absorb any of it, while the woman looks up at her hair]\nEach tampon is hand woven \n[A white woman's manicured hand holds up a hair 'tampon' bundle up with cross-hatched orange yarn, bead wrapped center and a white pull string for extraction] \nfrom over 200 strands of Cherokee hair and then bound together with these decorative native beads.\n\n"
    },
    {
        "character": "",
        "line": "Live action continues. Front yard of suburban home. Daughter runs up to mother who is trimming the roses."
    },
    {
        "character": "Daughter",
        "line": "You were right mom! All natural Cherokee hair tampons really did the trick. [Mother smiles back fakely and continues working]"
    },
    {
        "character": "Mother",
        "line": "And when you're done using them [She holds up Cherokee tampon] they make a great toy for Jessie. [Mother and daughter smile broad, fake smiles] Go get it boy! [Mother tosses Cherokee tampon off camera]"
    },
    {
        "character": "Jessie",
        "line": "[Tampon flies into the grass where Jessie, the white terrier grabs it and shakes it] Grrr... grrrr"
    },
    {
        "character": "Chief Running Pinto (Tommy Chong in his stoner voice)",
        "line": "[Camera shows mother and daughter smiling huge, fake smiles with their arms about each other peering into each other's face with the text 'Cherokee Hair Tampons' on the screen below. Mother mouths 'I love you'] Let the wonders and the mysteries of our people, like, change the way you think about tampons."
    },
    {
        "character": "",
        "line": "Cartman's house, night. Cartman is asleep in his bed... tossing and turning"
    },
    {
        "character": "Cartman",
        "line": "No! NO! Hip- hippies all around me. Help! Mommy! Huhuhippies!"
    },
    {
        "character": "",
        "line": "Cartman's house, outside. Stan and the others approach, and Stan looks in the lower window. Stan now has a hand saw on his right hand"
    },
    {
        "character": "Stan",
        "line": "[softly] Okay, it's clear. [slowly opens the front door] Okay. Me and Butters are gonna go up and take Cartman's kidney out of him. Kenny, you stay here and guard his mom's door here with Timmy."
    },
    {
        "character": "Timmy",
        "line": "Timmiihh!"
    },
    {
        "character": "Stan",
        "line": "Sshhh!"
    },
    {
        "character": "Timmy",
        "line": "[whispering] Timmiihh."
    },
    {
        "character": "Stan",
        "line": "If she hears him screaming, or comes out or anything, just... stall her. Alright?"
    },
    {
        "character": "Kenny",
        "line": "(Okay)"
    },
    {
        "character": "Timmy",
        "line": "[softly] Timmiihh."
    },
    {
        "character": "Stan",
        "line": "Alright Butters, let's go. [they walk away and up the stairs, then down the hall, but Stan stops in his tracks] Uh-oh, Cartman's pig. [Fluffy is seen sleeping in her own little bed. Stan and Butters try to sneak past, but she opens her eyes] Sshh, good pig. Good pig. Goood pig. Sshh. Okay. [Butters accidentally steps on Fluffy's tail and she squeals in panic. This wakes Cartman, who blinks and heads for his door half-asleep] Come on, we gotta get outta here! [runs a bit, then has his back to the wall as Cartman opens the door and walks out] Oh, no!"
    },
    {
        "character": "Butters",
        "line": "Oh well, we're busted. [Cartman continues towards Fluffy, Ignoring the boys]"
    },
    {
        "character": "Cartman",
        "line": "[smacks her] Shut up, Fluffy! [she quiets down and Cartman goes back to sleep, closing his door.]"
    },
    {
        "character": "Stan",
        "line": "Oh, phew."
    },
    {
        "character": "",
        "line": "Cartman's house, later. Cartman's nightmare returns"
    },
    {
        "character": "Cartman",
        "line": "Hippies. Hi-i-ippies. They're everywhere. They wanna save the earth, but all they do is smoke pot and smell bad. He-elp! [Stan rises from the other side of the bed with the medical book, and Butters rises, too]"
    },
    {
        "character": "Stan",
        "line": "Okay, here we go. [opens the book and leafs through. Pictures of the heart, fingers, liver, and cutaway of the male genitalia are shown. Stan giggles softly and turns the page to a picture of the kidney] Okay, let's see. Looks like if we cut here, and here..."
    },
    {
        "character": "Butters",
        "line": "I hope it's not too bloody; I'm wearin' my favorite pants."
    },
    {
        "character": "Stan",
        "line": "...vein right, well- [brings out the saw] Well, here goes nothing. Help me pull his pajamas up. [Butters pulls the sheets, Stan the shirt, and something more is in their way] No way! Kidney Blocker 2000?!"
    },
    {
        "character": "Cartman",
        "line": "[rises quickly] whatwhatwhatwhat? [sees Stan and Butters] Oh, it's Stan and Butters! Trying to take my kidney, are you?!"
    },
    {
        "character": "Stan",
        "line": "You suck, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "[faces them] Maybe so, but at least I was smart enough to wear a Kidney Blocker 2000!"
    },
    {
        "character": "Stan",
        "line": "God-dammit, don't you care that Kyle is gonna die?!"
    },
    {
        "character": "Cartman",
        "line": "I do! I do care! Look how much. [a blank expression is on his face] Look. Look how much I care. [the expressionless face persists]"
    },
    {
        "character": "",
        "line": "Harequin Romance Book Publishing CO. Mr. Garrison has finished his novel and is now inside talking to a publisher"
    },
    {
        "character": "Publisher",
        "line": "First and foremost, Mr. Garrison, I would like to thank you for choosing Harequin Romance."
    },
    {
        "character": "Mr. Garrison",
        "line": "Yeah, yeah, yeah. So, did you read the book?"
    },
    {
        "character": "Publisher",
        "line": "Uh yes, Mr. Garrison, we did read your book. [taps on it a few times]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Well, what did you think?"
    },
    {
        "character": "Publisher",
        "line": "Well, uh, frankly, Mr. Garrison, n-we don't know if the Harequin Romance label is appropriate for you."
    },
    {
        "character": "Mr. Garrison",
        "line": "Ooohhh, why not?"
    },
    {
        "character": "Publisher",
        "line": "Mr. Garrison, uh... are you aware that the word \"penis\" occurs six-thousand and eighty-three times in your novel?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Well, I'm sure there's lots of naughty words. It is a romance novel."
    },
    {
        "character": "Publisher",
        "line": "Nnnno, I don't think that this book really qualifies as a \"romance novel.\""
    },
    {
        "character": "Mr. Garrison",
        "line": "No?"
    },
    {
        "character": "Publisher",
        "line": "[clears his throat] No. No, this is what we in the book-publishing business like to call... gay. Really, really gay."
    },
    {
        "character": "Mr. Garrison",
        "line": "What the hell are you talkin' about?!"
    },
    {
        "character": "Publisher",
        "line": "It's just that the focus really seems to be on the... male organs."
    },
    {
        "character": "Mr. Garrison",
        "line": "Well, I thought it was mostly women that read these things!"
    },
    {
        "character": "Publisher",
        "line": "It is."
    },
    {
        "character": "Mr. Garrison",
        "line": "Well, women want to read about ding-dongs! D'you think women care about the details of female anatomy?! Hell no! Women wanna read about big, powerful schlongs! [the publisher has no answer] Look, I've seen women read these things. They skim along and skim along until they get to the part about the penis! That's what they want, so that's what I'm giving them!"
    },
    {
        "character": "Publisher",
        "line": "[taps his chin] Hmmm."
    },
    {
        "character": "",
        "line": "South Park, next day. Stan and Kenny sit on the curb in front of \"South Park Pianos\""
    },
    {
        "character": "Stan",
        "line": "[despondent, voice cracking] There's nothing more I can do, Kenny. I've tried everything to save Kyle. Holistic medicine is gonna kill my friend!"
    },
    {
        "character": "Kenny",
        "line": "(You never seem to care when I die!)"
    },
    {
        "character": "Stan",
        "line": "[sobs] My friend is gonna die! He's gonna die and there's nothing I can do about it. [begins to break down] Oh, God, he's my best friend... [weeps]"
    },
    {
        "character": "Kenny",
        "line": "[stands up] (Well now, that does it! I have had enough of this bullshit! Screw you, Stan. I'm going home!) [walks away. Above him, a man is hauling a piano, but realizes the ropes are tearing]"
    },
    {
        "character": "Mover",
        "line": "Look out! [the piano snaps from the ropes and crushes Kenny] Oops."
    },
    {
        "character": "Stan",
        "line": "Awgh! I'll never see Kyle again! [weeps]"
    },
    {
        "character": "",
        "line": "South Park, Miss Information's shop, day. More people line up to buy holistic stuff. Inside, Carlos Ramirez and Chief Running Pinto field orders."
    },
    {
        "character": "Mrs.Tucker",
        "line": "Four dozen Cherokee hair tampons, please."
    },
    {
        "character": "Chief Running Pinto",
        "line": "[hands them to her] No problem, man. Pay Miss Information up front. [she walks away with the tampons and Carlos glances at her ass]"
    },
    {
        "character": "Man 7",
        "line": "Hi, uh, I have a little bit of pain in my balls whenever I watch VH1."
    },
    {
        "character": "Carlos Ramirez",
        "line": "Oh, here, try this, man. Ah, this is allll-naturalll ball juice. [the man takes it and drinks. Carlos and Chief Pinto chortle]"
    },
    {
        "character": "Man 7",
        "line": "Wow, I feel better already! [walks away. Carlos and Chief Pinto laugh some more.]"
    },
    {
        "character": "Miss Information",
        "line": "[joining the two men] And next we have Mrs. Broflovski's son. [Sheila drags Kyle in by his jacket collar]"
    },
    {
        "character": "Sheila",
        "line": "[let's him drop to the floor] Okay, here he is."
    },
    {
        "character": "Chief Running Pinto",
        "line": "Ahahem, that kid looks really sick."
    },
    {
        "character": "Miss Information",
        "line": "Yes. He really needs his toxins flushed again."
    },
    {
        "character": "Chief Running Pinto",
        "line": "No. I mean, he looks REALLY sick, man. You should take him to, like, a doctor."
    },
    {
        "character": "Customers",
        "line": "[look at each other] Hmm?"
    },
    {
        "character": "Sheila",
        "line": "But you're more in touch with the earth."
    },
    {
        "character": "Chief Running Pinto",
        "line": "Look, bein' in touch with the earth has nothing to do with dyin', man."
    },
    {
        "character": "Sharon",
        "line": "It's okay. We trust that you know what you're doing. [Carlos and Chief Pinto look at each other. Kyle groans]"
    },
    {
        "character": "Carlos Ramirez",
        "line": "No, man, that kid needs a doctor! And besides, we're not actually Native Americans. I mean, I'm- I'm more like a- a Mexican."
    },
    {
        "character": "Customers",
        "line": "What?!"
    },
    {
        "character": "Man",
        "line": "Hu-uh?!"
    },
    {
        "character": "Carlos Ramirez",
        "line": "Yeah. A Mexican."
    },
    {
        "character": "Man 7",
        "line": "Uugh. [spits out the ball juice] Ptu, ptu."
    },
    {
        "character": "Man 8",
        "line": "I didn't know that."
    },
    {
        "character": "Gerald",
        "line": "Oh my God! [Mrs.Tucker, who had purchased the 48 tampons screams in horror and covers her crotch area]"
    },
    {
        "character": "Sharon",
        "line": "How dare you deceive us like that!"
    },
    {
        "character": "Chief Running Pinto",
        "line": "Hey, we never said we were Native Americans, man. Miss Information said that."
    },
    {
        "character": "Carlos Ramirez",
        "line": "Yeah. She said nobody would buy anything from Mexicans. [the customers blink in anger, then gather around Miss Information]"
    },
    {
        "character": "Miss Information",
        "line": "Uh, toxins are your enemy. [the customers enclose her]"
    },
    {
        "character": "Woman 1",
        "line": "Kill her! [the pummeling begins. Carlos and Chief Pinto just laugh at the sight]"
    },
    {
        "character": "Carlos Ramirez",
        "line": "Funny."
    },
    {
        "character": "",
        "line": "South Park, Miss Information's shop, later. Stan, Sheila, and Kyle are still there"
    },
    {
        "character": "Stan",
        "line": "So NOW can we take Kyle to the hospital?"
    },
    {
        "character": "Sheila",
        "line": "Yes, of course, but we don't have a kidney donor!"
    },
    {
        "character": "Stan",
        "line": "That's alright. If you'll all help, I think I have a plan."
    },
    {
        "character": "",
        "line": "Cartman's house, morning. A cock crows, and Cartman's radio sounds the alarm. Cartman rises on his bed and stretches"
    },
    {
        "character": "Cartman",
        "line": "Oohh, morning, hum, hmyeah. HWAA! [jumps back. His Kidney Blocker 2000 lies at the foot of his bed over streaks of blood] That son of a bitch!"
    },
    {
        "character": "",
        "line": "Stan's house, moments later. Cartman approaches and pounds on the door. Stan quickly opens it."
    },
    {
        "character": "Cartman",
        "line": "[fuming] Okay, asshole! Give me back my kidney!"
    },
    {
        "character": "Stan",
        "line": "Dude, please. Kyle needs it."
    },
    {
        "character": "Cartman",
        "line": "It's MINE! Not yours, MINE! Give it back right now, or there's gonna be HELL to pay!"
    },
    {
        "character": "Stan",
        "line": "Alright, alright, here. [hands him a bloody kidney. Cartman reviews it.]"
    },
    {
        "character": "Cartman",
        "line": "Thank you. And you'd better hope to God it still works, just like it did before."
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, sometime later. Dr. Doctor is in his office."
    },
    {
        "character": "Nurse",
        "line": "[over an intercom] Doctor, Eric Cartman is here- [Cartman enters unbid before she finishes speaking]"
    },
    {
        "character": "Dr. Doctor",
        "line": "Why, hello there, Eric. [Cartman stands on the chair and slaps the kidney down on the desk. The doctor looks on]"
    },
    {
        "character": "Cartman",
        "line": "You see that?! That's MINE! My asshole friend Stan took my kidney, and I need it put back in! [sits] Please."
    },
    {
        "character": "Dr. Doctor",
        "line": "Oh, I see. [holds the kidney up] Are you sure that now that it's already out, you don't wanna just let your friend Kyle have it?"
    },
    {
        "character": "Cartman",
        "line": "No. Because. It doesn't belong to Kyle, it belongs to me! It's MINE!"
    },
    {
        "character": "Dr. Doctor",
        "line": "Well, alright then. We'll get you prepped for surgery. [puts the kidney down and holds up a clipboard] If you'll just sign this release. [sets it in front of Cartman]"
    },
    {
        "character": "Cartman",
        "line": "Thank you. [signs the release form]"
    },
    {
        "character": "",
        "line": "Hell's Pass Hospital, still later. Cartman and Kyle are in the recovery room surrounded by their parents. Stan and his parents are there, too. Balloons, a smiley-face and two banners, \"I HOPE YOU GET BETTER!\" and \"GET WELL SOON\", decorate Kyle's side of the room"
    },
    {
        "character": "Sheila",
        "line": "How are you feeling, boubbie?"
    },
    {
        "character": "Kyle",
        "line": "Better, thanks."
    },
    {
        "character": "Stan",
        "line": "You look a lot better."
    },
    {
        "character": "Sharon",
        "line": "Yeah, it looks like Western medicine really did the trick."
    },
    {
        "character": "Kyle",
        "line": "Hey, thanks for going through all that to save my life, Stan."
    },
    {
        "character": "Stan",
        "line": "Dude, you're my best friend. I don't want you to die until I do."
    },
    {
        "character": "Chief Running Pinto",
        "line": "Yeah. [to Cartman] Hey, man, we're glad you're getting better, too."
    },
    {
        "character": "Cartman",
        "line": "[wakes up] Heh. Hey, what what's going on?"
    },
    {
        "character": "Stan",
        "line": "Kyle's all better, Cartman, thanks to you!"
    },
    {
        "character": "Cartman",
        "line": "Huh?"
    },
    {
        "character": "Stan",
        "line": "It was all a trick. Your mom undid the kidney blocker, and then we put ketchup on your bed so you'd think we took your kidney."
    },
    {
        "character": "Dr. Doctor",
        "line": "Yes, but it was all a trick to get you to come in and sign this release."
    },
    {
        "character": "Liane",
        "line": "Isn't that funny, sweetie?"
    },
    {
        "character": "Cartman",
        "line": "Aarrrrrr! I am SO PISSED OFF!"
    },
    {
        "character": "Mr. Garrison",
        "line": "[enters the room and walks to Kyle's bed] Oh, here's everybody. [in his hand is a book]"
    },
    {
        "character": "Stan",
        "line": "Hey, Mr. Garrison. Where have you been?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Boys, I have an announcement to make: I'm not gonna be your teacher anymore. I've become a best-selling author! And Kyle, I want you to have a signed copy as a get-well present. [hands the book to Kyle, who looks at it]"
    },
    {
        "character": "Kyle",
        "line": "Oh. ...Thanks?"
    },
    {
        "character": "Cartman",
        "line": "[livid] I swear I'm gonna kill you guys!!"
    },
    {
        "character": "Stan",
        "line": "Careful, Cartman, you might pop your stitches. [laughs a long time with Kyle]"
    },
    {
        "character": "Kyle",
        "line": "[white liquid spurts out his nose] Huh? [covers his nose] What the?"
    },
    {
        "character": "Cartman",
        "line": "Oh good, you got the crappy kidney."
    }
]