[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "A large city at night. Klieg lights pierce through the air as a large crowd gathers in front of a large building."
    },
    {
        "character": "Announcer",
        "line": "Tonight, Stellar Productions presents the boy band of the decade! [women scream, jump, and shout. Signs reading \"FINGERBANG RULES,\" \"FINGER BANG,\" \"WE LOVE FINGER BANG,\" AND \"FINGER BANG 4EVER\" bob throughout the audience] It's Fingerbang, live from Madison Square Gardens! [the interior is shown, with cheering crowds. A heralding sound effect plays, and spotlights flicker around the stage. A burst of fireworks cues the music and the familiar silhouettes of four boys are shown on stage. A few women faint]"
    },
    {
        "character": "Fingerbang",
        "line": "[the lights go on them, and it's the boys, dressed in white outfits. Their hats are all white, too. A green shirt indicates Kyle, a blue one Stan. Kenny wears an orange visor over his white hood. All wear headsets]\nFingerbang!\n[they each spin towards the audience once, then stop]\nBang-bang!\nFingerbang-bang!\n[they spin back to their first positions]\nBangbangbang!\n[all step forward and do their routine]\nI'm gonna fingerbang-bang you into my life\nGirl, you like to fingerbang, and it's alright\n'Cause I'm the king of fingerbang; let's not fight\nI'm gonna fingerbang-bang you ever-y night\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[steps forward for a solo bridge as the others sway back and forth]\nAnd girl, you know that you're the only girl for me, girl\nGirl, you're the girl of my fantasy\nYou're my girl, you're my girl\n\n\n"
    },
    {
        "character": "Woman",
        "line": "[as Cartman sings] Cartman, I want youuu!"
    },
    {
        "character": "Cartman",
        "line": "[continues] My... girrrrrrrl... [lifts up his shirt to show off the right breast—um, pec. The others turn to their right while maintaining their gaze and pointing their gun fingers at the audience. The music builds as women scream at the sight]\n\n\n"
    },
    {
        "character": "Fingerbang",
        "line": "[Cartman rejoins the others and all point their gun fingers at the audience, then resume the routine]\nFingerbang!\nBang... Bang bang bang\nFingerbang-bang!\nBangbangbang!\nI'm gonna fingerbang-bang--\n\n\n"
    },
    {
        "character": "",
        "line": "Cartman's room, night. He's tossing and turning joyfully in his sleep. The song continues playing in his mind:\n\"--you into my life\nGirl, you like to fingerbang, and it's alright\"\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Yes! Yes! I'm a star! I'm a star! I'm-- [wakes up, then looks angry] Aaawww, I'm nobody! God-dammit! [suddenly thinks] Wait a minute. Maybe that was a sign from God. That's it, isn't it? You want me to start a boy band so I can make $10 million, don't you? That's it! [rushes out of bed]"
    },
    {
        "character": "",
        "line": "Cartman residence, day. Cartman has Stan, Kyle, and Kenny over in the living room."
    },
    {
        "character": "Cartman",
        "line": "[pacing back and forth] Gentlemen, thank you for coming. This is the beginning of a great time in our lives. [stops and faces them] God has finally spoken to me, you guys. And he has told me how I can make $10 million."
    },
    {
        "character": "Kyle",
        "line": "...How?"
    },
    {
        "character": "Cartman",
        "line": "Boy band."
    },
    {
        "character": "Stan",
        "line": "Boy band?"
    },
    {
        "character": "Cartman",
        "line": "Boy band."
    },
    {
        "character": "Kyle",
        "line": "I'm not being in any [crosses his arms over his chest] faggy boy band!"
    },
    {
        "character": "Cartman",
        "line": "There's nothing faggy about $10 million, asshole! This was a message from God!"
    },
    {
        "character": "Stan",
        "line": "Dude, we don't have any musical talent."
    },
    {
        "character": "Cartman",
        "line": "That didn't stop any of the other boy bands, dumbass! [pulls out a tape from his back pocket] I've got prerecorded music we can sing to, just like they do. All we need to do is practice our choreography over and over and over!"
    },
    {
        "character": "Kenny",
        "line": "(That sounds totally fuckin' stupid.)"
    },
    {
        "character": "Cartman",
        "line": "Shut up, Kenny. And then, I know I can get us a gig at the South Park Mall. [intense] So everybody get in a straight line, we're gonna listen to a song from the top, and take it--"
    },
    {
        "character": "Kyle",
        "line": "Wait a minute. There's only four of us."
    },
    {
        "character": "Cartman",
        "line": "So?"
    },
    {
        "character": "Kyle",
        "line": "So, all boy bands have five members."
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Kyle",
        "line": "'N Sync, Backstreet Boys, New Kids on the Block. All had five members."
    },
    {
        "character": "Stan",
        "line": "He's right."
    },
    {
        "character": "Cartman",
        "line": "[throws down the tape] Dammit! Okay, okay okayokayokay. We'll put off practice for now, and hold auditions for a fifth member. Get the word out that auditions will be tomorrow morning!"
    },
    {
        "character": "",
        "line": "Marsh residence, night. The family is gathered for dinner, enjoying ham and turkey"
    },
    {
        "character": "Sharon",
        "line": "Did you have fun at Eric's house today, Stanley?"
    },
    {
        "character": "Stan",
        "line": "Well, I guess."
    },
    {
        "character": "Sharon",
        "line": "What did you do?"
    },
    {
        "character": "Stan",
        "line": "Well, Cartman wants to start a boy band, so we're gonna rehearse and then try to perform at the South Park Mall. [Randy reacts, and Shelly takes notice]"
    },
    {
        "character": "Sharon",
        "line": "Oh well, that sounds nice."
    },
    {
        "character": "Randy",
        "line": "[to Sharon, angrily] No, it does NOT sound nice! [to Stan] Stanley, you are gonna have no part in that boy band."
    },
    {
        "character": "Stan",
        "line": "Well but, Dad, all my friends are doing it."
    },
    {
        "character": "Randy",
        "line": "[rises] If all your friends jumped off a cliff, [jabs his finger at Stan] would you do that too?"
    },
    {
        "character": "Stan",
        "line": "[voice shaking] Cartman says we can make $10 million."
    },
    {
        "character": "Randy",
        "line": "You are not gonna be in a boy band, Stanley! AND THAT IS FINAL! [storms out]"
    },
    {
        "character": "Shelly",
        "line": "Geez, what's up Dad's ass?"
    },
    {
        "character": "",
        "line": "Cartman residence, next morning, \"BOY BAND AUDITIONS TODAY!!\" Music begins. Inside, Butters is singing his song in front of the sofa"
    },
    {
        "character": "Butters",
        "line": "[holds two fingers on his right hand up to indicate a hopping bunny]\nLittle Bunny Foo-Foo hoppin' through the forest\n[scoops up imaginary mice, makes two fists, and bops the right one with the left]\nScoopin' up the field mice and boppin' 'em on the head\n[shimmies down with hands outstretched. The auditors look half-asleep]\nDown came a white angel and she said\n[the angel (left finger) reprimands the bunny]\n\"Little Bunny Foo-Foo, I don't wanna see you\n[the piano player seems familiar. The angle bops the bunny]\nScoopin' up the field mice and boppin' 'em on the head\"\nSo now I'm gonna turn you into a worm, mbuh, mBunny Foo-Foo... Eh, beh-POOF\n[slaps his right hand with his left, and one finger goes down, leaving a worm]\nLittle Wormy Foo-Foo crawlin' through the forest\nGettin scooped up by the field mice who mah-m then they bopped 'im on the head\n[grins, then does a little kick forward]\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[through the mic] Eheh, thank you Butters. We'll let you know."
    },
    {
        "character": "Butters",
        "line": "Ah, I can do it again."
    },
    {
        "character": "Cartman",
        "line": "[through the mic] We'll let you know, Butters."
    },
    {
        "character": "Butters",
        "line": "Ahah-oo well, alright then. [walks off to his left, unsure]"
    },
    {
        "character": "Cartman",
        "line": "Pffft! Oh my God, his intonation was so off!"
    },
    {
        "character": "Kyle",
        "line": "It was?"
    },
    {
        "character": "Stan",
        "line": "Dude, I don't think I could sing any better than that."
    },
    {
        "character": "Cartman",
        "line": "Guys, if we're gonna impress the mall owner and get that gig, we'd better do it better than that. [into the mic] Next!"
    },
    {
        "character": "Stan",
        "line": "[reads from a list] Uhhh, next is Ike Broflovski."
    },
    {
        "character": "Cartman",
        "line": "Kyle's brother?"
    },
    {
        "character": "Kyle",
        "line": "I promised my mom I'd let him try. [Ike hops in with some sheet music]"
    },
    {
        "character": "Cartman",
        "line": "Christ's sake..!"
    },
    {
        "character": "Schroeder",
        "line": "What key?"
    },
    {
        "character": "Ike",
        "line": "[hands him the sheet] G. [hops back to the sofa as the kid plays]\nItsy bitsy spider, out the water spout--\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[through the mic] Next!"
    },
    {
        "character": "Ike",
        "line": "Oh Danny Boy, the parson's callingClang, clang and clang\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[through the mic] Next audition!"
    },
    {
        "character": "Ike",
        "line": "E F G, H I J K L-M-N-O-P\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[through the mic] Goddammit, NEXT!"
    },
    {
        "character": "Ike",
        "line": "One on a teacher on a palm tree\"G-U-B, When the teacher wanna punch me\"\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[through the mic] Not the next song, the next PERSON! [Ike goes for his sheet music, then returns to flip Cartman off.] Aw, man, this is gonna be a long-ass day. [the front door opens and in walks Wendy with her sheet music. She walks to the piano player, gives it to him--] Oh no! Nononononono! Sorry, Wendy, this tryout's for a boy band! [a grinning Wendy suddenly frowns and her head hangs.]"
    },
    {
        "character": "Stan",
        "line": "Aw, come on, dude. Let her try."
    },
    {
        "character": "Cartman",
        "line": "[moves the mic away] No way!"
    },
    {
        "character": "Kyle",
        "line": "Come on, Cartman! You haven't liked anybody else!"
    },
    {
        "character": "Cartman",
        "line": "Okayokay, fine. Wow me."
    },
    {
        "character": "Wendy",
        "line": "[cues the player]\nMiiis-suuus Landers was a health nut; She cooked food in a wok\nMr. Harris was her boyfriend, and he had a great big-\nCock-a-doodle-doodle, the rooster just won't quit\nAnd I don't want my breakfast, because it tastes like-\nShih tzus make good house pets; They're cuddly and sweet\nMonkeys aren't good to have, because they like to beat their-\nMeeting in the office or meeting in the hall,\nThe boss, he wants to see you so you can suck his\nBalzac was a writer, he lived with Allen Funt\nMrs. Roberts didn't like him, but that's 'cause she's a-\nContaminated water can really make you sick\nYour bladder gets infected, and blood comes out your-\nDictate what I'm saying, 'cause it will bring you luck\nAnd if you all don't like it, I don't give a flying fuck!\n[Stan, Kyle, and Kenny applaud]\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Thanks, Wendy. Don't call us. We won't call you either, heheh. [Wendy is angered]"
    },
    {
        "character": "Kyle",
        "line": "Dude, what are you talkin' about? That was awesome!"
    },
    {
        "character": "Cartman",
        "line": "Dude, she's a chick!"
    },
    {
        "character": "Stan",
        "line": "Come on, nobody's gonna notice."
    },
    {
        "character": "Cartman",
        "line": "\"Nobody's gonna notice\"?! What about her huge freakin' hooters, huh?! [Wendy looks down at her chest]"
    },
    {
        "character": "Stan",
        "line": "She's the best chance we have! I say she's in."
    },
    {
        "character": "Kyle",
        "line": "Me too."
    },
    {
        "character": "Kenny",
        "line": "(Me too.)"
    },
    {
        "character": "Cartman",
        "line": "Oh, this is a democratic boy band, is it? Alright, fine! She's in until she screws up!"
    },
    {
        "character": "Wendy",
        "line": "[exults] Yeah!"
    },
    {
        "character": "",
        "line": "Cartman's house, next morning, early. A rooster crows. Cartman has his band in his room, and they are still drowsy. Stan is about to fall over..."
    },
    {
        "character": "Cartman",
        "line": "Okaaay! You guys all ready to rehearse?"
    },
    {
        "character": "Stan",
        "line": "Cartman, it's six in the morning. Do we have to rehearse this early?"
    },
    {
        "character": "Cartman",
        "line": "We have to rehearse all that we can! [moves away] Now, check this out: [returns with a box of clothes and sets it on the floor] My mom made us costumes!"
    },
    {
        "character": "Stan",
        "line": "Costumes? [the band gathers around the box]"
    },
    {
        "character": "Cartman",
        "line": "Yeah. [starts handing out the costumes] This one's yours, Stan. This one is Kyle's. This one will cover up Wendy's hooters... [she looks a little embarrassed]"
    },
    {
        "character": "Stan",
        "line": "Hey, Cartman, how come your costume has like, nose rings and facial hair?"
    },
    {
        "character": "Cartman",
        "line": "'Cause I'm like, you know, the tough one. Every boy band has to have the one member that, you know, is tough."
    },
    {
        "character": "Kyle",
        "line": "[dryly] I wanna be the tough one."
    },
    {
        "character": "Cartman",
        "line": "[looks back blankly] ...Kyle, you are the sweet one. Will you please just cooperate and not--"
    },
    {
        "character": "Kyle",
        "line": "[determined] I wanna be the tough one!"
    },
    {
        "character": "Cartman",
        "line": "You can't be the tough one because you're Jewish!"
    },
    {
        "character": "Kyle",
        "line": "Jews are tough!"
    },
    {
        "character": "Cartman",
        "line": "Since when?!"
    },
    {
        "character": "Kyle",
        "line": "Since Abraham, fatass!"
    },
    {
        "character": "Cartman",
        "line": "Alright, fine! Here! [tosses the tough costume at Kyle, knocking him down] Jesus Christ, I wonder if every boy band has to go through this! [moves away. The band dresses. Kenny is a baseball player, Stan is a fighter pilot, Cartman is an Elvis impersonator, Kyle is a tough dude with nose ring and Fu Manchu mustache]"
    },
    {
        "character": "Stan",
        "line": "Hey, Cartman, what does \"fingerbang\" mean, anyways?"
    },
    {
        "character": "Cartman",
        "line": "I heard it on HBO. It means, like, you know, when you... [waves his finger around] pretend to use your finger like a gun or something."
    },
    {
        "character": "Kenny",
        "line": "[chuckling] (Hm hm, noho, that's not what it means.)"
    },
    {
        "character": "Stan",
        "line": "Kenny says that's not what it means."
    },
    {
        "character": "Cartman",
        "line": "[testy] Okay, Kenny, what does \"fingerbang\" mean, then?"
    },
    {
        "character": "Kenny",
        "line": "(It's when you take your finger, and you stick it in a vagina and you stick it in again and again.)"
    },
    {
        "character": "Cartman",
        "line": "...What?! Who the hell would do that?! Jesus Christ! Grow up Kenny, would you?! Alright, boys, let's do it from the top. 1, 2, 3, 4!"
    },
    {
        "character": "",
        "line": "South Park Mall, day. South Park is not so small anymore. Two guards on the second floor relax against a glass railing"
    },
    {
        "character": "Veteran guard",
        "line": "[with a drawl] Now, I know that this is your first day on the job of mall security, rookie. Keepin' the law in a mall is just like any tough city, and especially because they don't let us have guns. It can be very dangerous."
    },
    {
        "character": "Cartman",
        "line": "[leading the band members through the mall] Alright, guys. Let's do it like we rehearsed! We need energy! We need to be up!"
    },
    {
        "character": "Veteran guard",
        "line": "[blocking the way to Mall Management] Excuse me, just where do you think you're goin'?"
    },
    {
        "character": "Cartman",
        "line": "We're goin' to see the mall manager."
    },
    {
        "character": "Veteran guard",
        "line": "Do you have the proper clearance?"
    },
    {
        "character": "Stan",
        "line": "[to Kyle] Uh oh, mall cops."
    },
    {
        "character": "Veteran guard",
        "line": "You have to make an appointment first. Now move along, sir."
    },
    {
        "character": "Cartman",
        "line": "[pleading] But we practiced for days. All we want to do is show the guy what we can do, [the veteran guard pulls out a small bottle of pepper spray and shakes it up] so that maybe we'll have a chance to perform in the plaza of the-- [the veteran guard sprays his face all over] Aagh! Aagh! Ooww! Ow! Oh! God-dammit..! [squeezes his eyes shut and rubs them]"
    },
    {
        "character": "Kyle",
        "line": "Jesus Christ!"
    },
    {
        "character": "Cartman",
        "line": "Oh, God, I can't see! [rubs his eyes]"
    },
    {
        "character": "Veteran guard",
        "line": "Move along, sir. Or I'll do it again. [Cartman walks off and the others join him. Stan retrieves the boom box. Then] You see, you put your life on the line every day."
    },
    {
        "character": "Stan",
        "line": "Well, I guess we can't get in to see the mall manager."
    },
    {
        "character": "Cartman",
        "line": "[coughs a few times] The hell we can't! I'm not lettin' no washed-up law cops ruin my divine quest! Come on! [all join him down the mall]"
    },
    {
        "character": "",
        "line": "South Park Mall, later. The two guards are watching shoppers move along. A blond man with two bags walks by."
    },
    {
        "character": "Veteran guard",
        "line": "Ey! [the man turns to look at him] What are you doin'?"
    },
    {
        "character": "Man",
        "line": "Nothin'. Just... shopping."
    },
    {
        "character": "Veteran guard",
        "line": "Move along, sir. [the man leaves and the veteran looks at the rookie] You see, sometimes you gotta just do that. Keeps shoppers on their toes — try it. [the rookie gets determined and a woman and girl walk by]"
    },
    {
        "character": "Rookie guard",
        "line": "Ey! [they turn to look at him] What are you doin'?"
    },
    {
        "character": "Woman",
        "line": "Nothing. Why?"
    },
    {
        "character": "Rookie guard",
        "line": "Move along, ma'am. [she leaves looking angry]"
    },
    {
        "character": "Veteran guard",
        "line": "That's what being a mall cop is all about. Hyeuup."
    },
    {
        "character": "Rookie guard",
        "line": "Cool."
    },
    {
        "character": "Cartman",
        "line": "[over the PA system] Attention mall shoppers: the next twenty people to buy an orange smoothie will also receive a complimentary Nissan Sentra. Hurry up. [crowds rush off to get their Nissans]"
    },
    {
        "character": "Veteran guard",
        "line": "Jesus, they're gonna start a riot! [both cops follow the crowd while Cartman and friends return to the mall manager's office]"
    },
    {
        "character": "Cartman",
        "line": "Alright, guys, here we go. [enters the office with the others] Hello, sir!"
    },
    {
        "character": "Manager",
        "line": "[a harried man who's speech is nearly emotionless with odd exclamations] What? Hey. Who are you? [the office is a bit unkempt. Stacks of paper here and there, hanging out of cabinet drawers, scraps on the floor and desk...]"
    },
    {
        "character": "Cartman",
        "line": "We... are Fingerbang!"
    },
    {
        "character": "Manager",
        "line": "O-o-oh. What? How'd you get in here? Hey."
    },
    {
        "character": "Cartman",
        "line": "We would like to audition for you for a gig in the central plaza of your fine mall."
    },
    {
        "character": "Manager",
        "line": "What? O-oh. You wanna play at the mall? Like Tiffany?"
    },
    {
        "character": "Cartman",
        "line": "Sort of like Tiffany, yes. Can we audition?"
    },
    {
        "character": "Manager",
        "line": "Oh. Well, I guess. ...What?"
    },
    {
        "character": "Cartman",
        "line": "Alright! Let's do it, boys! [moves aside and sets the boom box down, then sets the tape to play. He returns to the group, and they begin. All of them are all off-key, They all sing too ahead of the music and Wendy's voice is squeaky and lags behind the others...]"
    },
    {
        "character": "Fingerbang",
        "line": "I'm gonna fingerbang-bang you into my life\nGirl, you like to fingerbang, and it's alright\nI'm goin' to fingerbang-bang you ever-y night\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "[goes into his solo, and back into his dream]\nAnd girl you know you're cool, you're good, you're so much nicer, girl\nYou're good, You're gonna be--\n\n\n"
    },
    {
        "character": "Manager",
        "line": "[cuts him off] Alright, that's enough!"
    },
    {
        "character": "Cartman",
        "line": "--you're my fantasy, you fanta--\n\n\n"
    },
    {
        "character": "Manager",
        "line": "Thank you."
    },
    {
        "character": "Cartman",
        "line": "[backs up into the band] Well, so can we play here?"
    },
    {
        "character": "Manager",
        "line": "What?? ...No."
    },
    {
        "character": "Cartman",
        "line": "No??"
    },
    {
        "character": "Manager",
        "line": "Who?? No!"
    },
    {
        "character": "Cartman",
        "line": "Why not?!"
    },
    {
        "character": "Manager",
        "line": "Well uh, uh, oh... Right now there's a cheese and sausage cart in the plaza. And I would uh, I'd hate to have to move it off to the side for a while. What?"
    },
    {
        "character": "Cartman",
        "line": "You don't think we're any good, do you?!"
    },
    {
        "character": "Manager",
        "line": "No. I mean, you're just not as good as sausage and cheese."
    },
    {
        "character": "Cartman",
        "line": "Well, come on guys. We gave it our best. [goes to get his boom box]"
    },
    {
        "character": "Manager",
        "line": "Wow. That was your best? [Cartman flashes an angry look at him, then walks off in a huff.]"
    },
    {
        "character": "",
        "line": "South Park Mall, later. The five are sitting on a bench on the first floor"
    },
    {
        "character": "Kyle",
        "line": "Wow. I feel so rejected."
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Veteran guard",
        "line": "There you are! You're the hoodlums who got on the intercom and started an orange smoothie riot!"
    },
    {
        "character": "Stan",
        "line": "Uh-oh."
    },
    {
        "character": "Veteran guard",
        "line": "I will now read you your mall rights! You have the right to shop at a variety of malls in all--"
    },
    {
        "character": "Kyle",
        "line": "Run for it! [the five bolt and rush out of there]"
    },
    {
        "character": "Veteran guard",
        "line": "Go get 'em, rookie! [gives the rookie a stern look; the rookie just looks back]"
    },
    {
        "character": "",
        "line": "Stan's house, later. Shelly's eating cereal, Sharon is at the sink. Randy enters"
    },
    {
        "character": "Randy",
        "line": "Where is Stan?"
    },
    {
        "character": "Sharon",
        "line": "Oh, he's over at Eric's house practicing for his boy band."
    },
    {
        "character": "Randy",
        "line": "What?! I specifically told him not to do that!"
    },
    {
        "character": "Sharon",
        "line": "Now, Randy, calm down. It's just a silly little dream. They're not gonna actually make it."
    },
    {
        "character": "Randy",
        "line": "And what if they do make it, Sharon? What if they do make it? Are you gonna be the one to tell 'im?! [turns around and walks out]"
    },
    {
        "character": "Shelly",
        "line": "Mom, what's up Dad's ass?"
    },
    {
        "character": "Sharon",
        "line": "It's a long story, Shelly. Let's just say your father... has a lot up his ass right now."
    },
    {
        "character": "",
        "line": "Chef's house. Cartman arrives and rings the bell"
    },
    {
        "character": "Chef",
        "line": "[opens the door and appears in a towel around his waist] Oh! Oh-h, hello Eric."
    },
    {
        "character": "Cartman",
        "line": "[eyes downcast] Problem, Chef. I have m-many problems."
    },
    {
        "character": "Chef",
        "line": "Wellll, if you uhhh, come back in just a little bit, Eric, I'll see if I can help you out. [a blonde woman comes up behind Chef]"
    },
    {
        "character": "Cartman",
        "line": "I just don't know what I'm gonna do. [lets himself in] Sometimes I wonder if God isn't toying with me. [goes to the sofa and pulls out some Cheesy Poofs to eat]"
    },
    {
        "character": "Chef",
        "line": "[sits next to Cartman] Alright, Eric, what's the matter?"
    },
    {
        "character": "Cartman",
        "line": "Chef, God told me I was to start a boy band and make $10 million. The problem is, it isn't working. I mean, [with feeling] I feel the music burning inside me. But I just can't express it right, you know? [the woman sits on Chef's left side and strokes his arm]"
    },
    {
        "character": "Chef",
        "line": "Well, Eric, I, I think you were just focusin' in on the wrong thing. Boy bands aren't about music, boy bands are created by corporations to make money. They're all based on the Gomlich effect."
    },
    {
        "character": "Cartman",
        "line": "What's the Gomlich effect?"
    },
    {
        "character": "Chef",
        "line": "The law of physics that states, \"If one girl screams for something, it will make other girls scream. And then, it grows exponentiously until all girls within a five-mile radius are screaming.\""
    },
    {
        "character": "Cartman",
        "line": "So how do boy bands use that?"
    },
    {
        "character": "Chef",
        "line": "All they do is make videos, showing tons and tons of girls screaming for the boy band. Once you get girls screaming, you can't stop 'em. They're crazy! [the blonde gets cross and scoots away; Chef quickly makes amends] Uh-uh, except for Lillith, of course. [she goes sweet on him again]"
    },
    {
        "character": "Cartman",
        "line": "Thanks!"
    },
    {
        "character": "Chef",
        "line": "You're welcome. Now, go away!"
    },
    {
        "character": "Cartman",
        "line": "Okay. [Chef watches as Cartman drops down and heads for the front door, exits...]"
    },
    {
        "character": "Chef",
        "line": "A-and a cucumber in the pants never hurt either!"
    },
    {
        "character": "Cartman",
        "line": "[outside] Cucumber in the pants. Got it. [and closes the door]"
    },
    {
        "character": "",
        "line": "South Park Elementary, playground, day. Nine kids are there: the five band members and the four other girls in class. Cartman is talking to Bebe, Red, Annie, and Milly. He seems to have taken Chef's advice..."
    },
    {
        "character": "Cartman",
        "line": "Alright, everybody, listen up! This is how this first shot is gonna work: The girls are standing here, and then the members of the band walk by looking cool. When you see us, you girls all scream like, \"Oh my God, it's Fingerbang! Oh my God!\" Okay?"
    },
    {
        "character": "Bebe",
        "line": "Are we gonna get paid now, or after?"
    },
    {
        "character": "Cartman",
        "line": "I'll pay you afterwards. Promise. Okay, Timmy, roll camera. [Timmy sits in the cameraman's chair]"
    },
    {
        "character": "Timmy",
        "line": "Tiimmmaaayyy! [Cartman inches his way to the group sideways]"
    },
    {
        "character": "Kyle",
        "line": "Dude, what's wrong with your leg?"
    },
    {
        "character": "Cartman",
        "line": "Huh? Oh, Chef says to put a cucumber down my pants for good luck. [the band walks across the ground in front of the girls]"
    },
    {
        "character": "Girls",
        "line": "[ad lib] Ahhh. Wow. Woohoo. Yay."
    },
    {
        "character": "Cartman",
        "line": "Waitwaitwaitwait, cut!"
    },
    {
        "character": "Timmy",
        "line": "Huhaaaaah!"
    },
    {
        "character": "Cartman",
        "line": "Let's go crazier than that! I mean, you have to act like it's freakin' Leonardo DiCaprio!"
    },
    {
        "character": "Bebe",
        "line": "We wouldn't give a rat's ass if Leonardo DiCaprio came walking past us."
    },
    {
        "character": "Other Girls (Red, Annie, and Milly)",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "Fine! Who would you go crazy for?"
    },
    {
        "character": "Girls",
        "line": "...Matt Lauer."
    },
    {
        "character": "Cartman",
        "line": "...Okay, fine! Pretend that we're Matt Lauer."
    },
    {
        "character": "Bebe",
        "line": "Oh... Okay. [Cartman positions himself in front of them]"
    },
    {
        "character": "Cartman",
        "line": "Roll camera!"
    },
    {
        "character": "Timmy",
        "line": "Timmuh! [the band tries again]"
    },
    {
        "character": "Girls",
        "line": "AAAGGGGHHH! [the band scatters away from the screaming. Cartman falls, then gets up]"
    },
    {
        "character": "Cartman",
        "line": "Jesus Christ!"
    },
    {
        "character": "",
        "line": "South Park Elementary, playground, later. The band is still shooting the video. Bebe and Red hug Cartman tightly."
    },
    {
        "character": "Fingerbang",
        "line": "Fingerbang-bang you ever-y night\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Aaand cut! [music stops] Alright, our video's complete. Through the grace of God I can now go back to that mall manager and show him what we've got!"
    },
    {
        "character": "Bebe",
        "line": "Okay, so where's our money?"
    },
    {
        "character": "Cartman",
        "line": "Oh uh, Kyle has it. [the girls move to Kyle. Cartman walks away]"
    },
    {
        "character": "Randy",
        "line": "[arrives] Stanley, what the hell are you doing?"
    },
    {
        "character": "Stan",
        "line": "We are making a music video."
    },
    {
        "character": "Randy",
        "line": "You get in the truck right now! [points at it]"
    },
    {
        "character": "Stan",
        "line": "Dad, I was just a--"
    },
    {
        "character": "Randy",
        "line": "[pointing] Get in the truck! [Stan walks to the truck dejected]"
    },
    {
        "character": "",
        "line": "The road, the Marsh truck. Randy drives Stan home."
    },
    {
        "character": "Stan",
        "line": "Dad, I did all my chores. Why can't I play with my friends?"
    },
    {
        "character": "Randy",
        "line": "Stanley, it's just that there's better things you could be doing on a Saturday than singing and dancing. You could be watching TV or, laying in bed."
    },
    {
        "character": "Stan",
        "line": "Dad, I like being in a boy band. I think it's interesting."
    },
    {
        "character": "Randy",
        "line": "Well, there's plenty of other interesting you can do. Have you ever tried marijuana?"
    },
    {
        "character": "Stan",
        "line": "No."
    },
    {
        "character": "Randy",
        "line": "Well, maybe it's time."
    },
    {
        "character": "Stan",
        "line": "Dad!"
    },
    {
        "character": "",
        "line": "South Park Mall, late morning. The guards relax on the second floor railings. A stooped man with a clear vessel filled with a green substance walks past them"
    },
    {
        "character": "Veteran guard",
        "line": "Ey! What are you doin'?"
    },
    {
        "character": "Madman",
        "line": "I've got a new strain of anthrax that I will soon unleash upon all of North America!"
    },
    {
        "character": "Veteran guard",
        "line": "Move along, sir."
    },
    {
        "character": "Madman",
        "line": "Wuh? [walks away]"
    },
    {
        "character": "Cartman",
        "line": "Attention, shoppers: There are naked people at the orange smoothie machine. There are naked people at the orange smoothie machine. [crowds of mall shoppers head for the orange smoothie machine]"
    },
    {
        "character": "Veteran guard",
        "line": "God dammit! [he and the rookie give chase]"
    },
    {
        "character": "Cartman",
        "line": "[enters the manager's office] Hello again!"
    },
    {
        "character": "Manager",
        "line": "What? Oh. It's you. I don't like you."
    },
    {
        "character": "Cartman",
        "line": "I know you didn't love our audition. But now we have a video."
    },
    {
        "character": "Manager",
        "line": "Oh. What?"
    },
    {
        "character": "Cartman",
        "line": "[retrieves a TV cart with VCR and pops the VCR in. The video pops up] If you would, sir, just watch this and prepare to be wowed! [at first, only the boys' hats are seen, near the play elephants. The camera spins right, then down, and the girls' feet are seen. The camera spins up and left, and finally rests on Timmy]"
    },
    {
        "character": "Timmy",
        "line": "Timmiihh! [The camera turns left again and catches a glimpse of the girls, then ends up on Cartman, and zooms in on the cucumber]"
    },
    {
        "character": "Cartman",
        "line": "Uh, god dammit..! Our camera guy kinda sucks, but this next shot we did was really cool. [the camera gets a glimpse of the four girls, then moves off them a second after Cartman appears]"
    },
    {
        "character": "Timmy",
        "line": "Haaghh. [waves at the camera, then moves his wheelchair back and dances to the music] Timmih, livin' a lie!"
    },
    {
        "character": "Cartman",
        "line": "Son of a bitch!"
    },
    {
        "character": "Manager",
        "line": "Hey. This video is dumb."
    },
    {
        "character": "Cartman",
        "line": "[dead air on tape] You don't understand. Girls were going crazy for it. Please. This is what God want me to do. Ple-ease."
    },
    {
        "character": "Manager",
        "line": "Alright alright. What? Well, I guess I can move the sausage and cheese cart off to one side. [gives a warning face] For a little while."
    },
    {
        "character": "Cartman",
        "line": "Really? You will?"
    },
    {
        "character": "Manager",
        "line": "Only for twenty minutes, though."
    },
    {
        "character": "Cartman",
        "line": "That's all we need! How about this afternoon at 3 o'clock?"
    },
    {
        "character": "Manager",
        "line": "Oh. Okay. [static shows up on the video]"
    },
    {
        "character": "Cartman",
        "line": "Yes! Thank you sir, you will not be disappointed! [a previous recording is shown:]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh, Mrs. Cartman, I've been uh very bad. M'kay? [he's handcuffed against a brick wall. Mrs. Cartman appears as a dominatrix]"
    },
    {
        "character": "Liane",
        "line": "You have been bad, so you're gonna have to drink from this glass. [points to it, then spreads her legs and pisses into it as he watches]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh, yeah, that makes me hot, m'kay? [Cartman is shocked at what he sees; the manager is pleased]"
    },
    {
        "character": "Cartman",
        "line": "Aw, Mom!"
    },
    {
        "character": "Manager",
        "line": "Wow. What?"
    },
    {
        "character": "",
        "line": "Marsh residence, later. Stan sits on the sofa as Randy paces the floor back and forth"
    },
    {
        "character": "Stan",
        "line": "It's not fair, Dad! Why can't I be in a boy band?"
    },
    {
        "character": "Randy",
        "line": "Because I said so!"
    },
    {
        "character": "Stan",
        "line": "Dad, Cartman said we're gonna perform at the mall at 3 o'clock. My friends are gonna be pissed off at me."
    },
    {
        "character": "Randy",
        "line": "Let 'em be pissed off, then!"
    },
    {
        "character": "Stan",
        "line": "I don't understand! Just let me go do this one thing, and I won't ever--"
    },
    {
        "character": "Randy",
        "line": "No!! [walks over to the china cabinet] NOOO!! [smashes his head through its glass doors, causing the dishes to slide out and break up. Stan looks at him with his mouth hanging open in shock, and Randy stands up, ashamed and shocked at his behavior. He walks back to Stan, then turns away defeated]"
    },
    {
        "character": "Stan",
        "line": "Dad? What the hell is going on?"
    },
    {
        "character": "Randy",
        "line": " ...I was... I was 18 when my high-school men's choir performed at the grand opening of a sporting-goods store in Denver. [a flashback starts. A young Randy is at lower left corner of the choir, and the choir begins this song: \"Everything will wait / Weave all ye little reins...\"] I was just one of fifteen members and I had no idea that a record producer was in the audience. [the audience claps. The producer is in the second row of spectators. The choir members split up and the producer rushes up to Randy]"
    },
    {
        "character": "Producer",
        "line": "Kid, can I talk to you?"
    },
    {
        "character": "Randy",
        "line": "Uh sure."
    },
    {
        "character": "Producer",
        "line": "Heh, you were really great up there. Too good for a pissant choir in a pissant mountain town."
    },
    {
        "character": "Randy",
        "line": "Ohh, thanks."
    },
    {
        "character": "Producer",
        "line": "Listen: I'm putting together a rock group. A vocal group called the Ghetto Avenue Boys. I think you would make a perfect member."
    },
    {
        "character": "Randy",
        "line": "What? Me? Do you like my singing that much?"
    },
    {
        "character": "Producer",
        "line": "Yeah, I think your mustache is perfect. How would you like to come to New York and start a singing career?"
    },
    {
        "character": "Randy",
        "line": "Oh my God, I don't know. I mean, I still have another year of high school, and I--"
    },
    {
        "character": "Producer",
        "line": "Hey, look, if you don't want it, I'll keep looking--"
    },
    {
        "character": "Randy",
        "line": "[interrupting] No! Wait. I mean, ah-I'll think about it."
    },
    {
        "character": "Producer",
        "line": "I take it that means yes. Call me in the morning. [slips a business card into Randy's coat pocket and pats it]"
    },
    {
        "character": "Randy",
        "line": "And just like that I left everything. I dropped out of high school..."
    },
    {
        "character": "Randy",
        "line": "[walks by Denver High] See ya. [walks away]"
    },
    {
        "character": "Randy",
        "line": "...I said good-bye to my girlfriend..."
    },
    {
        "character": "Randy",
        "line": "See ya. [waves, turns and walks away, leaving a distraught girl with mouth open]"
    },
    {
        "character": "Randy",
        "line": "...And I left my family."
    },
    {
        "character": "Randy",
        "line": "See ya. [gets into his beat-up pale-yellow car and drives off, leaving his parents at the front door]"
    },
    {
        "character": "Randy",
        "line": "And suddenly there I was, thrown into a group with four other young men who I didn't even know. [the five are recording their first song]"
    },
    {
        "character": "Producer",
        "line": "Take 112!"
    },
    {
        "character": "Ghetto Avenue Boys",
        "line": "You've... got... it!\nYou know you've got... it\n[Randy: Girl]\nWhat you've got is it!\n\n\n"
    },
    {
        "character": "Randy",
        "line": "It's obvious to me, girl\n\n\n"
    },
    {
        "character": "Randy",
        "line": "The songs were terrible. But believe it or not, the country ate them up. The next thing I knew, we were the biggest thing in the world. [the song continues as he speaks, and the scene changes from the studio, to a poster, to a concert as the camera leaves the poster]"
    },
    {
        "character": "Ghetto Avenue Boys",
        "line": "Shirl! You've... got... it!\nIt... is what you've got, girl!\nWhat you've got is it!\n\n\n"
    },
    {
        "character": "Randy",
        "line": "Now, give it to me, 'cause...\n\n\n"
    },
    {
        "character": "Randy",
        "line": "[more scenes from his glory days] I had everything. A huge house, [the backyard pool: he's resting on an inflatable chaise longue while women surround him] and all the women you can imagine. [nine bikini-clad women are in his bed, and he's rolling back and forth over all of them] And then one day, just as quick as it started..."
    },
    {
        "character": "Mr. Allens",
        "line": "[the Ghetto Avenue Boys enter to rehearse, but...] Alright, guys, let's take it from the top."
    },
    {
        "character": "Randy",
        "line": "Hey, Mr. Allens."
    },
    {
        "character": "Mr. Allens",
        "line": "Heh? Woh. Uh... R-Randy."
    },
    {
        "character": "Randy",
        "line": "Who are they? [five new guys are in the recording booth]"
    },
    {
        "character": "Mr. Allens",
        "line": "These are the Avenue Ghetto Street Boys, my... new boy band."
    },
    {
        "character": "Randy",
        "line": "But, w-we're still selling records, right?"
    },
    {
        "character": "Mr. Allens",
        "line": "Look, kid, you're just getting a little... old to be in a boy band."
    },
    {
        "character": "Randy",
        "line": "I'm 19."
    },
    {
        "character": "Mr. Allens",
        "line": "Get a life, Marsh! [the Ghetto Avenue Boys turn around and walk out the door] Alright, guys, let's take it from the top."
    },
    {
        "character": "Randy",
        "line": "They said that after all the money we had made we were in debt to the studio, so they towed my car..."
    },
    {
        "character": "Tow Truck Driver",
        "line": "[wearing a \"Tacos\" hat] See ya. [tows a blue sports car away]"
    },
    {
        "character": "Randy",
        "line": "...the women all left..."
    },
    {
        "character": "Women",
        "line": "See ya. [the women pour out of bed and leave]"
    },
    {
        "character": "Randy",
        "line": "...and they took back my house."
    },
    {
        "character": "Randy",
        "line": "[gets kicked out of the house] Ugh..! [the producer stands at the French doors]"
    },
    {
        "character": "Mr. Allens",
        "line": "See ya. [Randy gets up and walks away]"
    },
    {
        "character": "Randy",
        "line": "The only thing I could do was come back to Colorado, and face everyone that I had abandoned."
    },
    {
        "character": "Woman",
        "line": "Hey! Weren't you the guy in that stupid boy band, the Ghetto Avenue Boys?"
    },
    {
        "character": "Man",
        "line": "Sure, I remember you! [starts mocking] You got it, baby... You got it, baby [he and the others begin to laugh, and it soon gets overwhelming. Randy looks around, scared. The flashback ends]"
    },
    {
        "character": "Randy",
        "line": "[voice full of emotion] And so you see, Stanley, I... do know what I'm talking about."
    },
    {
        "character": "Stan",
        "line": "Jesus Christ. ...I never knew."
    },
    {
        "character": "Randy",
        "line": "I didn't want you to know. Because now I'm a joke. Ever since then, I've wished every single day that I could go back to that moment when I was offered the job and say, \"No!\" Because all the fame and the money, the women... All it did was build me up, so that I could be knocked down harder than anybody in the world. [Stan is listening] That is what being in a boy band is all about, Stanley. [bitterness creeps in] It's people smothering you and embracing you and loving you and then spitting you out and throwing you away like you were last night's pork chops. Now we wander the Earth in disarray—us, New Kids on the Block, the Osmonds... We're all the same. And that... is why you can't go to the mall. [walks off]"
    },
    {
        "character": "Stan",
        "line": "[left with his thoughts] ...Oh-kay."
    },
    {
        "character": "",
        "line": "South Park Mall, afternoon. Most of Fingerbang is on the plaza stage, peeking out from behind a curtain with the band's name on it. People begin to gather in front of the stage."
    },
    {
        "character": "Kyle",
        "line": "Wow. There must be at least 20 people out there. [the band regroups]"
    },
    {
        "character": "Cartman",
        "line": "Where the hell is Stan?!"
    },
    {
        "character": "Kyle",
        "line": "He'll be here. Stan wouldn't douche."
    },
    {
        "character": "Cartman",
        "line": "I swear to God, if he ruins this dream of mine I will have his nuts!"
    },
    {
        "character": "Manager",
        "line": "[approaches] Hey. Uh, are you gonna do that thing or what?"
    },
    {
        "character": "Cartman",
        "line": "Yes. Yes, sir, any second—we're just waiting on one more member."
    },
    {
        "character": "Manager",
        "line": "Well hurry up. I can't keep the sausage and cheese cart off this spot much longer. [the cart is shown with Swiss cheese and sausage, and a pissed-off vendor]"
    },
    {
        "character": "Cartman",
        "line": "Yeah. We'll start right away. [the manager walks away. Cartman turns to Kyle] We'll have to do it without him."
    },
    {
        "character": "Kyle",
        "line": "Hell no! I'm not being part of a four-member boy band! We'll look stupid!"
    },
    {
        "character": "Kenny",
        "line": "(Yeah!)"
    },
    {
        "character": "Cartman",
        "line": "Oh, god-dammit!"
    },
    {
        "character": "",
        "line": "Marsh residence, later. Randy is sitting at the foot of his bed, reading from an issue of Teen Heat dedicated to the band. The camera zooms out from the magazine cover to Randy reading"
    },
    {
        "character": "Stan",
        "line": "[enters] Dad?"
    },
    {
        "character": "Randy",
        "line": "Huh? Yeah?"
    },
    {
        "character": "Stan",
        "line": "Well... I just wanted to tell you... that I don't think you're a joke. I mean, whatever you used to be, you're just my dad. And you're the best dad I've ever had."
    },
    {
        "character": "Randy",
        "line": "[thinks, then lowers the magazine] Come here, Stanley. [Stan approaches and sits next to his dad] Stan, it was wrong of me to try and stop you from joining a boy band without explaining why. I've made some mistakes in my life, and now... I have to let you make your own mistakes."
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Randy",
        "line": "You know, in a way, I think I was even jealous of you being in a boy band. Isn't that stupid?"
    },
    {
        "character": "Stan",
        "line": "Not really. Not any more stupid than some of the other stuff you've done."
    },
    {
        "character": "Randy",
        "line": "Well, come on. I'll drive you down to the mall."
    },
    {
        "character": "Stan",
        "line": "Really?"
    },
    {
        "character": "Randy",
        "line": "Yeah. I wanna see what you guys can do. And then we'll go buy you a small toy so that you can forget all about this."
    },
    {
        "character": "Stan",
        "line": "Alright! [father and son get up and leave the bedroom. Randy tosses his magazine aside]"
    },
    {
        "character": "",
        "line": "South Park Mall, afternoon. Everyone is waiting for Fingerbang to sing"
    },
    {
        "character": "Man",
        "line": "What's happening here?"
    },
    {
        "character": "Woman",
        "line": "I don't know, uh. I guess nothing."
    },
    {
        "character": "Man",
        "line": "Hm... Well, let's just walk away then. [man and woman leave]"
    },
    {
        "character": "Cartman",
        "line": "God dammit! People are walking away! [drops back behind the curtain]"
    },
    {
        "character": "Manager",
        "line": "[arrives again] Alright, kids, uh, that does it. You're gonna have to move and make way for the sausage and cheese cart."
    },
    {
        "character": "Cartman",
        "line": "Just another minute."
    },
    {
        "character": "Manager",
        "line": "Sorry. Get out! [the band members walk sullenly away]"
    },
    {
        "character": "Cartman",
        "line": "[stops and looks up] Well God, I guess you got me again, didn't you? Hyeah, that was a good one, God. Hope it made you laugh, you sick bastard."
    },
    {
        "character": "Wendy",
        "line": "[rushes up to Cartman and points] What's that? [a grinning Randy and Stan arrive in an elevator]"
    },
    {
        "character": "Kyle",
        "line": "It's Stan! [the other members have returned]"
    },
    {
        "character": "Cartman",
        "line": "Oh, thank you God! Oh, praise his name! [walks off smiling as Stan arrives]"
    },
    {
        "character": "Kyle",
        "line": "Dude, where the hell have you been?!"
    },
    {
        "character": "Cartman",
        "line": "[approaches the manager] Sir! We're all here now! Can we go on, please?"
    },
    {
        "character": "Manager",
        "line": "Who? Well. Okay, I guess. But hurry up."
    },
    {
        "character": "Cartman",
        "line": "We will! [moves to the front of the stage and addresses the audience] Ladies and gentlemen, we are about to witness the next great boy band of the country! Someday you will all be among those who can say, \"I saw Fingerbang when they first performed at some crappy little mall.\" [the manager takes offense] And so, without further ado, all five members of the..."
    },
    {
        "character": "Kenny",
        "line": "[while Cartman talks] (Uff--!) [an elevator crushes him and Cartman stops. Everyone around, including Cartman, is stunned. The doors open and the occupants exit]"
    },
    {
        "character": "Stan",
        "line": "Oh my God, they killed Kenny!"
    },
    {
        "character": "Kyle",
        "line": "You bastards!"
    },
    {
        "character": "Cartman",
        "line": "[traumatized] No! He can't be dead!"
    },
    {
        "character": "Kyle",
        "line": "Dude, he's pretty dead."
    },
    {
        "character": "Cartman",
        "line": "No! We were so close!"
    },
    {
        "character": "Manager",
        "line": "Alright, that's it, kids. Get out!"
    },
    {
        "character": "Cartman",
        "line": "But we have to perform!"
    },
    {
        "character": "Kyle",
        "line": "We don't have a fifth member, Cartman!"
    },
    {
        "character": "Stan",
        "line": "Oh, yes we do."
    },
    {
        "character": "",
        "line": "South Park Mall, later. The stage is set, the intro begins"
    },
    {
        "character": "Cartman",
        "line": "Thank you all for your patience, and now get ready for Fingerbang!"
    },
    {
        "character": "Fingerbang",
        "line": "[the new fifth member: Randy]\nFingerbang!\nBang bang [audience members look at each other]\nFingerbang-bang!\nBangbangbang [people begin to leave]\nI'm gonna fingerbang-bang you into my life\nGirl, you like to fingerbang, and it's alright\n[Janitors wearing face masks scrape Kenny's remains off the elevator]\n'Cause I'm the king of fingerbang; let's not fight\n[the veteran mall guard swivels his hips around happily as the rookie looks on]\nI'm goin' tuh fingerbang-bang you ever-y night\n[Cartman: I'll just...]\nFingerbang-bang you ever-y night!\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Chuh! [only four shoppers remain to clap for them] Yes! Yes! Thank you, yes!"
    },
    {
        "character": "",
        "line": "South Park Mall, later. Janitors continue cleaning the elevator that crushed Kenny, the sausage and cheese cart is rolled back on stage, and Fingerbang sits on the edge of the stage, dropping pieces of their costumes into the pit below"
    },
    {
        "character": "Kyle",
        "line": "We made two dollars."
    },
    {
        "character": "Stan",
        "line": "You were great, Dad."
    },
    {
        "character": "Randy",
        "line": "Yeah. I guess I still got it in me a little."
    },
    {
        "character": "Little Girl",
        "line": "Can I get your autograph?"
    },
    {
        "character": "Cartman",
        "line": "Ok-Okay, okay."
    },
    {
        "character": "Veteran guard",
        "line": "[arrives with the rookie and moves the girl aside] Hey, don't hassle the talent, ma'am."
    },
    {
        "character": "Little Girl",
        "line": "[looks at the guard] I actually don't really know who they are, I was just getting an autograph and-- [the veteran guard sprays her with pepper] A-a-agg-g-ggh!"
    },
    {
        "character": "Veteran guard",
        "line": "Move along, ma'am. [the little girl runs off stage] Eh, that was pretty good, kids. Maybe you can come perform at my Elks Club sometime."
    },
    {
        "character": "Cartman",
        "line": "Okay, yeah, maybe. [the mall cops walk away] God..! Now it's like everybody wants a piece of us."
    },
    {
        "character": "Kyle",
        "line": "Yeah."
    },
    {
        "character": "Cartman",
        "line": "I don't know if I can handle all this fame. I mean, I always thought I'd wanna become famous, but now that I am, I don't know if I like it. I mean, I probably can't even walk through this mall right now without people goin', \"Oh my God, it's the Fingerbang guy! Oh my God!\""
    },
    {
        "character": "Kyle",
        "line": "...Yeah. That's gonna suck."
    },
    {
        "character": "Stan",
        "line": "Yeah. I just wanna be a normal kid again. Have a normal life and appreciate what I have."
    },
    {
        "character": "Randy",
        "line": "[looks at Stan and pats him on the back] Well, I think you boys are very smart for your age. Come on. I'll buy you all an orange smoothie. [gets up and moves off the stage]"
    },
    {
        "character": "Stan",
        "line": "I don't think they sell those anymore. [gets up and follows his dad off; Wendy gets up and follows him]"
    },
    {
        "character": "Kyle",
        "line": "Hey, Cartman, do you think God's getting mad at you for not making $10 million? [gets up and follows the others off the stage. Cartman gets up and follows him]"
    },
    {
        "character": "Cartman",
        "line": "Aw, screw God. I'm not scared o' him. He's a pussy. [the stage is empty now, but Cartman returns and looks up] You know I'm just kiddin', right? Heheyeah. [turns and walks off again]"
    }
]