[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park, the church, day. The congregation is heard singing along with an organ. Inside, the town has assembled for services"
    },
    {
        "character": "Congregation",
        "line": "I walk hand-in-hand with Jesus\nOver at the park by where he lives\nI tell him all my problems\n[the cantor is shown at the pulpit]\nAnd sometimes he tells me his\nWhat a friend I have in Jesus\n[Stan, Kenny, and Cartman are shown]\nI can say that honestly\n[other townsfolk are shown]\nHe's not like all my other friends\nWho really don't care about me.\nAmen.\n\n\n"
    },
    {
        "character": "Stan",
        "line": "[to Kenny] Bo-ring."
    },
    {
        "character": "Cantor",
        "line": "And now Mr. Mackey will read his favorite psalm for us, Psalm 46. [steps out of the way]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh, God is our refuge and strength, m'kay. A very present help in trouble, m'kay. [Cartman starts talking to Stan and Kenny] Therefore will not we fear, though the earth be removed, and though the mountains be carried into the midst of the sea..."
    },
    {
        "character": "Cartman",
        "line": "[as Mackey speaks] Hey, you guys, you wanna know what my favorite psalm is? \"It's a man's obligation to stick his boneration in a woman's separation. [Stan and Kenny begin to laugh] This sort of penetration will increase the population of the younger generation.\" [stops]"
    },
    {
        "character": "Mr. Mackey",
        "line": "God is in the midst of her, m'kay. She shall not be moved, m'kay. [Stan resumes conversing with the other two] Though the waters thereof roar and be troubled, m'kay, though the mountains shake with the swelling thereof, m'kay. There is a river, the streams whereof shall make glad the city of God, the holy place- [interrupted by the priest]"
    },
    {
        "character": "Stan",
        "line": "[as Mackey speaks] Waiwaiwaiwaiwait. \"It's a man's obligation to stick his boneration in a woman's...\""
    },
    {
        "character": "Cartman",
        "line": "\"It's a man's obligation to stick his boneration in a woman's separation [Stan and Kenny begin to laugh] to increase the population of the younger generation.\""
    },
    {
        "character": "Kenny",
        "line": "(It's a man's obligation to stick his boneration in a woman's operation-)"
    },
    {
        "character": "Cartman",
        "line": "No no, no. Separation."
    },
    {
        "character": "Stan",
        "line": "\"It's a man's obligation to stick his boneration in a woman's-\""
    },
    {
        "character": "Priest Maxi",
        "line": "BOYS! You are in CHURCH! [Liane raises her arm and slaps Cartman across the back.]"
    },
    {
        "character": "Cartman",
        "line": "[falls off the pew and onto the floor] Ugh!"
    },
    {
        "character": "Mr. Mackey",
        "line": " -m'kay. The God of Jacob is our refuge, m'kay. [walks from the pulpit back to his seat. The priest replaces him]"
    },
    {
        "character": "Priest Maxi",
        "line": "Thank you, Mr. Mackey. Hello, everyone. Today, we're going to talk about hell. [an organ swells into a dreadful chord. The boys are afraid] Hell is not a very nice place. Burning, searing, flames. Screaming, torture. For eternity. Once you are in hell, you cannot escape. You live forever in horrible pain, in burning agony. All sinners are there in misery, dying over and over and over. [the camera begins to descend through the floor, past the foundation, several layers of dirt, a sewage pipe...] If you be cast down into this black bog of stench, then woe is thou, [...more layers of dirt and some fossils...] for Satan has made it the most miserable place in the universe! [...and finally, an inferno full of skulls] And he will be your ruler! [the camera stops at this sign: \"Welcome to Hell\"] Your ruler of pain and agony!"
    },
    {
        "character": "",
        "line": "Hell. Music is heard, and the camera pans right, past this sign: \"Don't Forget! IT'S LUAU SUNDAY!!!\""
    },
    {
        "character": "Singers:",
        "line": "Are we going to the Hukilau?\nThe Huki Huki Huki Huki Hukilau?\n[Satan joins them]\nAre we going to the Hukilau?\nThe Huki Huki Huki Huki Hukilau?\n[Jerry Garcia is seen]\nEverybody loves a hukilau-\n\n\n"
    },
    {
        "character": "Gene Siskel",
        "line": "I do!"
    },
    {
        "character": "Singers",
        "line": "Where the laulau is the kaukau at the luau\n[A monster band plays]\nWe throw our nets out into the sea\n[Satan does throw out a net]\nAnd all the ama-ama come swimmin' to me\n[two demons retrieve the net, with fish in it]\nAre we going to the Hukilau?\nThe Huki Huki Huki Huki Hukilau?\n\n\n"
    },
    {
        "character": "Hula Dancers",
        "line": "Are we going to the Hukilau?\n\n\n"
    },
    {
        "character": "Men",
        "line": "The Huki Huki Huki Huki Hukilau?\n\n\n"
    },
    {
        "character": "Hula Dancers",
        "line": "Everybody loves a Hukilau,[a hula dancer's head falls off]\n\n\n"
    },
    {
        "character": "Singers",
        "line": "Where the laulau is the kaukau at the luau[Three other tortured souls watch as Satan and George Burns meet at the spit and Satan roasts the man attached]\n\n\n"
    },
    {
        "character": "All",
        "line": "'We throw our nets out into the sea.\n[Frank Sinatra and Dean Martin motion for the nets to be dropped]\nAnd all the ama-ama come a-swimming to me\n[The demons harvest the catch, Tiny Tim surfs and plays his ukulele]\nAre we going to the Hukilau?\n[A three-person band of monsters sings and plays, then a group shot of Satan and others]\nThe Huki Huki Huki Huki Hukilau?\nHuki... Luki... Lau?...\n[the camera pulls back to show everyone. An Aloha sign appears above.]\n\n\n"
    },
    {
        "character": "Satan",
        "line": "Yeah!"
    },
    {
        "character": "Demon",
        "line": "Hennnh! [bites a damned soul]"
    },
    {
        "character": "Man",
        "line": "Aaawwwwwww! [the others laugh]"
    },
    {
        "character": "Gary",
        "line": "Great luau, Satan."
    },
    {
        "character": "Satan",
        "line": "Thanks. See ya, Gary. Thanks for comin'. Oh- Hi, Marsha."
    },
    {
        "character": "Walter",
        "line": "Satan, a few of us are gonna go pound some brews. You wanna join us?"
    },
    {
        "character": "Satan",
        "line": "Oh, I'd love to, Mr. Matthau, but I can't. Chris and I just moved to the west side and we have to unpack."
    },
    {
        "character": "Walter",
        "line": "Oh, well, maybe next time. Great luau!"
    },
    {
        "character": "Satan",
        "line": "Bye."
    },
    {
        "character": "",
        "line": "Hell, a marina. Boats, yachts, and one big ship are docked on the liquid lava below. A complex of buildings is shown. A woman somewhere screams. At the main entrance the sign reads, \"RIVER STYX CONDOMINIUMS. UNITS STILL AVAILABLE.\" Inside his condo, Satan sets up a ceramic doll display and hums a bit"
    },
    {
        "character": "Satan",
        "line": "Chris?"
    },
    {
        "character": "Chris",
        "line": "[off-screen] Yeah?"
    },
    {
        "character": "Satan",
        "line": "Did you, uh, see my \"Boy With An Umbrella\" Hummel?"
    },
    {
        "character": "Chris",
        "line": "Uuh, no, but there's still some boxes coming from the movers."
    },
    {
        "character": "Satan",
        "line": "Oh, okay, thanks. [the doorbell rings.] Oh, that must be them now. [goes to answer the door, and opens it] Just put the boxes by the-"
    },
    {
        "character": "Saddam",
        "line": "Hello, Satan! [opens his arms wide and grins big. He has two suitcases, one on either side of him]"
    },
    {
        "character": "Satan",
        "line": "[stunned] Saddam..."
    },
    {
        "character": "Saddam",
        "line": "[cuddly] Did you miss me, buttercup?"
    },
    {
        "character": "Satan",
        "line": "No, it can't be! You're dead! I killed you!"
    },
    {
        "character": "Saddam",
        "line": "Yeah, you killed me. So? Where was I gonna go? Detroit?"
    },
    {
        "character": "Satan",
        "line": "Oh no. [looks up] Oh, God no."
    },
    {
        "character": "",
        "line": "South Park, the church, day. Priest Maxi finishes his sermon. Fear is shown across the faces of many of the congregants"
    },
    {
        "character": "Priest Maxi",
        "line": "A place of everlasting agony and pain! Hell awaits all sinners and all who do not accept Christ! [Stan grits his teeth, Cartman's jaw drops, Kenny trembles a little] Children in this town have not been attending Sunday school after Mass! And adults have not been coming to Confession! If this does not change, I promise you, you will be going to the black pit of Satan's world! [Cartman grits his teeth] That is all. Peace be with you. [congregants rise and file out of church. Randy and Sharon Marsh are the last two adults out]"
    },
    {
        "character": "Randy",
        "line": "Well, that was quite an uplifting sermon."
    },
    {
        "character": "Sharon",
        "line": "Yeah. [Stan, Cartman, and Kenny run up to them from behind]"
    },
    {
        "character": "Stan",
        "line": "Mom, wuh we're staying for Sunday school."
    },
    {
        "character": "Sharon",
        "line": "[she, Liane, and Randy spin around] What?"
    },
    {
        "character": "Stan",
        "line": "We have to go to Sunday school so we don't burn! [turns around, runs to the altar, and turns right. Kenny follows him]"
    },
    {
        "character": "Cartman",
        "line": "Yeah. I'll see ya later, mom. [runs out after the other two.]"
    },
    {
        "character": "Randy",
        "line": "Oh, now look at that. They're scared to death."
    },
    {
        "character": "Priest Maxi",
        "line": "[comes up behind them] Hell is a very real place, Mr. and Mrs. Marsh. I'm trying to save their souls and the souls of everyone in this town from the wretched lake of fire!"
    },
    {
        "character": "",
        "line": "The wretched lake of fire — I mean, Hell, the River Styx Condominiums, Satan's front door. Satan has taken refuge behind the door and peeks out"
    },
    {
        "character": "Saddam",
        "line": "Come on, guy. Just let me in so we can talk."
    },
    {
        "character": "Satan",
        "line": "I don't want to talk to you, Saddam! This isn't what I need in my life right now."
    },
    {
        "character": "Chris",
        "line": "[peeks out from another room] Is that the movers, Satan?"
    },
    {
        "character": "Satan",
        "line": "[hides his disdain] Ah. Yeah. Yeah, it's just the movers"
    },
    {
        "character": "Chris",
        "line": "Oh, well, tell them I'm leavin' their check on the counter. [disappears]"
    },
    {
        "character": "Satan",
        "line": "Okay, Chris."
    },
    {
        "character": "Saddam",
        "line": "Satan, look: I know our relationship wasn't perfect. Okay? I know that. I was too busy tryin' to take over the world to give you what you needed. But I've changed, Satan. [flashes his charm]"
    },
    {
        "character": "Satan",
        "line": "[sarcastically] Oh, why, I haven't heard that one before."
    },
    {
        "character": "Saddam",
        "line": "COME ON, can't we just go out for a burrito? [Satan thinks about it. Saddam appears dressed for a fiesta and shakes the maracas around] ¡Me gusta burrito mucho!"
    },
    {
        "character": "Satan",
        "line": "I can't, Saddam. I'm with Chris now."
    },
    {
        "character": "Saddam",
        "line": "Who?? Screw 'im! He can't pound your ass like I can!"
    },
    {
        "character": "Satan",
        "line": "Good-bye, Saddam!"
    },
    {
        "character": "Saddam",
        "line": "Wait. Wait, I'm sorry, heh. But Satan, you can't deny what's between us. [pats his hair] You can try, but you know we belong together."
    },
    {
        "character": "Satan",
        "line": "My life is good now, Saddam. Chris treats me well. You and I are through. Good-bye. [closes the door, sighs, and walks off to his left, past a window]"
    },
    {
        "character": "Saddam",
        "line": "[pops up outside the window] Hey, come on, guy! Give me a break! [Satan looks, then lowers the blinds, and continues walking]"
    },
    {
        "character": "",
        "line": "South Park, the church, day. Sunday school is in session, apparently at the church basement. A nun and eleven children sit around a table. Clockwise: the nun, a blonde girl, Clyde, Butters, Tolkien, Kenny, Stan, Cartman, Pip, Bebe, Tweek, and a blond boy. A Twister game in on one side of the room, a bicycle on the other"
    },
    {
        "character": "Nun",
        "line": "Hello, children. I'm Sister Anne. And I'll be teaching you so that you can all receive your First Communion."
    },
    {
        "character": "Stan",
        "line": "[quite afraid] Are we gonna go to hell?"
    },
    {
        "character": "Sister Anne",
        "line": "Well, hopefully not. That's why you're gonna need to receive Communion."
    },
    {
        "character": "Cartman",
        "line": "A- And as long as we get this Communion thing, we're safe?"
    },
    {
        "character": "Stan",
        "line": "What if we haven't really done anything that horribly bad in our lives."
    },
    {
        "character": "Cartman",
        "line": "Yeah, what if we haven't?"
    },
    {
        "character": "Sister Anne",
        "line": "It doesn't matter, because we are all born with Original Sin. Now, let me explain how Communion works. [brings out a golden dish with round wafers on it] The priest will give you this round cracker, [lifts up and displays a wafer] and he will say, \"The Body of Christ,\" and then you eat it. [silence]"
    },
    {
        "character": "Cartman",
        "line": "Jesus was made of crackers?"
    },
    {
        "character": "Sister Anne",
        "line": "No."
    },
    {
        "character": "Stan",
        "line": "But crackers are his- body."
    },
    {
        "character": "Sister Anne",
        "line": "Yes."
    },
    {
        "character": "Kenny",
        "line": "[thinks a while, then] (What?!)"
    },
    {
        "character": "Sister Anne",
        "line": "In the Book of Mark, Jesus distributed bread and said, \"eat this, for it is my body.\""
    },
    {
        "character": "Cartman",
        "line": "So wwe won't go to hell as long as we eat crackers."
    },
    {
        "character": "Sister Anne",
        "line": "Nononono!"
    },
    {
        "character": "Butters",
        "line": "Uhwell, uhwhat are we eatin' then?"
    },
    {
        "character": "Sister Anne",
        "line": "The Body of Christ! [confused faces all around]"
    },
    {
        "character": "Stan",
        "line": "Nonono, I get it. Jesus wanted us to eat him, but he didn't want us to be cannibals, so he turned himself into crackers, and then told people to eat him."
    },
    {
        "character": "Sister Anne",
        "line": "No!"
    },
    {
        "character": "Stan",
        "line": "No??"
    },
    {
        "character": "Butters",
        "line": "Huh-I can't whistle if I eat too many crackers."
    },
    {
        "character": "Sister Anne",
        "line": "Look: all you have to know is that when the priest gives you the cracker, you eat it! Okay?!"
    },
    {
        "character": "Kenny, Stan, Cartman",
        "line": "O-kay."
    },
    {
        "character": "Sister Anne",
        "line": "And then, you will drink a very small amount of wine, for that, is the Blood of Christ."
    },
    {
        "character": "Cartman",
        "line": "[unconvinced, closes his Bible] Aw, come on now, this is just getting silly! [rests his head on his left hand]"
    },
    {
        "character": "Sister Anne",
        "line": "Eric, do you wanna go to hell?!"
    },
    {
        "character": "Cartman",
        "line": "[startled] Nno!"
    },
    {
        "character": "Sister Anne",
        "line": "Then stop questioning me."
    },
    {
        "character": "Cartman",
        "line": "But now we can have Communion and not go to hell, right?"
    },
    {
        "character": "Sister Anne",
        "line": "No. Because before you can take your first Communion, you have to have your first Confession."
    },
    {
        "character": "Stan",
        "line": "Confession? [Kenny snaps to attention, jarring music plays in the background]"
    },
    {
        "character": "Sister Anne",
        "line": "You'll be getting in the Confession box with a priest and confessing all your sins, so that God can forgive you. You kids will all have to go to your first Confession this Tuesday, so I want you all to go home tonight and think long and hard about all your sins, so that you can tell the priest everything. [All the kids look towards Stan Kenny and Cartman, who's faces are stricken with fear]"
    },
    {
        "character": "Kenny",
        "line": "(OH, SHIT!)"
    },
    {
        "character": "",
        "line": "Hell, the River Styx Condominiums, Satan's kitchen. He and Chris are washing dishes. He soaks, Chris rinses"
    },
    {
        "character": "Chris",
        "line": "Those were some great pork chops, Satan."
    },
    {
        "character": "Satan",
        "line": "Yeah."
    },
    {
        "character": "Chris",
        "line": "Hey, you. [puts a dish away] You've been actin' strange all night. What's up?"
    },
    {
        "character": "Satan",
        "line": "[jittery] Nothing. Why?"
    },
    {
        "character": "Chris",
        "line": "Well, it's... just that you've washed that same dish seven times now, silly."
    },
    {
        "character": "Satan",
        "line": "[sheepish] Oh, huh. Sorry, huh-huh. [holds a plate in his hands, then gives it to Chris]"
    },
    {
        "character": "Chris",
        "line": "[puts it away] Come on, Satan. You know you can tell me anything. What's up?"
    },
    {
        "character": "Satan",
        "line": "Well, Chris, Saddam showed up today."
    },
    {
        "character": "Chris",
        "line": "[stung] Oh. [thinks] Woww! [sighs] I wasn't ready for that."
    },
    {
        "character": "Satan",
        "line": "He showed up spouting all kinds of things about how he's changed and he still loves me..."
    },
    {
        "character": "Chris",
        "line": "I thought you... killed him."
    },
    {
        "character": "Satan",
        "line": "Yeah, well, where was he gonna go? Detroit?"
    },
    {
        "character": "Chris",
        "line": "...Do you still love him?"
    },
    {
        "character": "Satan",
        "line": "No, Chris."
    },
    {
        "character": "Chris",
        "line": "It's okay of you do."
    },
    {
        "character": "Satan",
        "line": "Well, I mean- [sighs] Of course, there's a part of me that will always love him, I... But I also know how abusive he was—I'm much happier with you."
    },
    {
        "character": "Chris",
        "line": "Well, you know what I think we should do? I think we should all get together and just talk, like adults."
    },
    {
        "character": "Satan",
        "line": "What?"
    },
    {
        "character": "Chris",
        "line": "We're all grown men here, Satan. I wanna just go meet this guy."
    },
    {
        "character": "Satan",
        "line": "No, Chris, you don't understand. Saddam is fucking crazy."
    },
    {
        "character": "Chris",
        "line": "Oh, I know he's got the whole bad-boy thing going. But I think that's what you were attracted to. But I can be a pretty rough tumbler myself. [tosses a plate into the air. It falls onto the floor and breaks up, startling him] Oops! [bends down to pick up the pieces.] Aw, butternuts! [Satan just glances away]"
    },
    {
        "character": "",
        "line": "South Park, curbside. Stan, Cartman, and Kenny are seated there. Cartman has pen and notebook in hand"
    },
    {
        "character": "Stan",
        "line": "Okay, let's see. Uuh, oh yeah, there was the time we threw a fish into the busdriver's hair and she didn't find it for seven days."
    },
    {
        "character": "Cartman",
        "line": "Oh yeah, okay."
    },
    {
        "character": "Stan",
        "line": "And thennn there was the time we held that little first-grader down and farted on him for 28 minutes."
    },
    {
        "character": "Cartman",
        "line": "Right, I already got that one."
    },
    {
        "character": "Kyle",
        "line": "[stops by] Hey, dudes. What are you doin'?"
    },
    {
        "character": "Stan",
        "line": "We're trying to remember all our sins. Sister Anne told us we have to confess all our sins or else we're gonna go to hell."
    },
    {
        "character": "Kyle",
        "line": "Uhwuwhat?"
    },
    {
        "character": "Stan",
        "line": "Have you confessed all your sins yet?"
    },
    {
        "character": "Kyle",
        "line": "No-o-o-o-o!"
    },
    {
        "character": "Cartman",
        "line": "Dude, he's Jewish. He doesn't have to confess his sins."
    },
    {
        "character": "Kyle",
        "line": "Oh good. I don't?"
    },
    {
        "character": "Cartman",
        "line": "No, you're already going to hell."
    },
    {
        "character": "Kyle",
        "line": "I am not!"
    },
    {
        "character": "Cartman",
        "line": "You are, too!"
    },
    {
        "character": "Stan",
        "line": "Dude, this lady told us if you don't confess all your sins and you don't eat crackers and drink wine, then you go to hell. Period."
    },
    {
        "character": "Kyle",
        "line": "I'm gonna go ask my mom! [walks away]"
    },
    {
        "character": "Stan",
        "line": "Now, let's see. What about the time we set Mr. Garrison's cat on fire?"
    },
    {
        "character": "Cartman",
        "line": "Alright. That was mostly Kenny's fault."
    },
    {
        "character": "Kenny",
        "line": "(What?)"
    },
    {
        "character": "Butters",
        "line": "[rushes in with Timmy and Tolkien] Eyou guys! Eyou guys! Uh we just thought of somethin'!"
    },
    {
        "character": "Stan",
        "line": "What, Butters?"
    },
    {
        "character": "Butters",
        "line": "Uhwell, uh what about the handicapped kid, uh-Timmy?"
    },
    {
        "character": "Timmy",
        "line": "Timmiih!"
    },
    {
        "character": "Cartman",
        "line": "What'd we do to Timmy?"
    },
    {
        "character": "Butters",
        "line": "No! I mean, poor Timmy's gonna go to hell! He can't confess his sins, 'cause all he can say is his name!"
    },
    {
        "character": "Timmy",
        "line": "Timmiih!"
    },
    {
        "character": "Cartman",
        "line": "Oh yeah, you're right. I guess Timmy's pretty screwed."
    },
    {
        "character": "Stan",
        "line": "Oh man, we can't let Timmy go to hell. We have to do something."
    },
    {
        "character": "Kenny",
        "line": "(What are we gonna do?)"
    },
    {
        "character": "Stan",
        "line": "I don't know. I don't know what we're gonna do."
    },
    {
        "character": "",
        "line": "Hell. Satan sits on a boulder with four demons and a small monster off to his left"
    },
    {
        "character": "Satan",
        "line": "[pensive] I don't know what I'm gonna do. I can't deny my feelings for Saddam, but... my life is so much better now with Chris. [the monster gives him some commentary in gibberish] Yeah. It's like Chris is so perfect in every way, but there's just something about Saddam that I'm more attracted to. [the monster makes a suggestion] In what way? [the monster tells him] Yeah, you're right. Saddam would just treat me bad again. I'm just gonna have to not see Saddam. Put him out of my mind and focus on Chris. If I don't see Saddam, then I won't have such strong feelings for him. Thanks guys. [turns right to walk away]"
    },
    {
        "character": "Chris",
        "line": "[arrives] There you are."
    },
    {
        "character": "Satan",
        "line": "[turns right] Oh hi, Chris!"
    },
    {
        "character": "Chris",
        "line": "I've been lookin' all over for you. I have to tell you somethin' that might make you... a little mad."
    },
    {
        "character": "Satan",
        "line": "What?"
    },
    {
        "character": "Chris",
        "line": "Well, I called Saddam Hussein and invited him over for dinner tonight."
    },
    {
        "character": "Satan",
        "line": "You WHAT?!"
    },
    {
        "character": "Chris",
        "line": "I just think we all need to get this out in the open."
    },
    {
        "character": "Satan",
        "line": "Oh, Chris! Rraarr! [raises his arms in fury and points his right hand away. Lightning comes out from his index finger and scorches a tree.] Rraahh! [points his left hand away. Lightning comes out from his index finger and scorches the aboriginal monster he was talking with earlier.]"
    },
    {
        "character": "Chris",
        "line": "[walks up to Satan] Come on, Satan. We're all adults here. He was an important person in your life, for better or for worse. So, I wanna know him. If he sees that I'ma real person too, then... well, maybe he'll see how happy we are together."
    },
    {
        "character": "Satan",
        "line": "No, Chris! He'll try to kill you is what he'll do!"
    },
    {
        "character": "Chris",
        "line": "Satan, we're not in junior high school anymore."
    },
    {
        "character": "Satan",
        "line": "[incredulous] Oh, dear God. [slaps his hand to his face]"
    },
    {
        "character": "",
        "line": "South Park, the church. Stan sits on a bench praying. A confession box stands nearby with two doors, one of which is open. Apparently, he's already confessed his sins."
    },
    {
        "character": "Stan",
        "line": "Hail Mary, full of grace, the Lord is with thee. Blessed art though amongst wo-"
    },
    {
        "character": "Cartman",
        "line": "[approaches] How was it?"
    },
    {
        "character": "Stan",
        "line": "Uh- Aw, dude, you screwed me up!"
    },
    {
        "character": "Cartman",
        "line": "Huh?"
    },
    {
        "character": "Stan",
        "line": "The guy in there said I have to say 54 Hail Marys. Now I can't remember if I was on number seven or eight."
    },
    {
        "character": "Cartman",
        "line": "Who's in there?"
    },
    {
        "character": "Stan",
        "line": "I don't know. You can't see him; it's just some anonymous guy."
    },
    {
        "character": "Cartman",
        "line": "Well, here goes everything. [walks to the penitent side of the confession box and enters.]"
    },
    {
        "character": "",
        "line": "The confessional, inside. Cartman sits and faces the partition."
    },
    {
        "character": "Cartman",
        "line": "[hesitantly] Forgive me, Father, for I have sinned."
    },
    {
        "character": "Priest Maxi",
        "line": "[in the confessor's side] Blessed art thou, child. Now, what do you have to confess?"
    },
    {
        "character": "Cartman",
        "line": "Well, let's see. I'd like to start, if I may, back when I was two and a half. It was a cold April morning, and the dew on the grass was frozen, like tiny beads of glass..."
    },
    {
        "character": "",
        "line": "The church, inside, next to the confessional. Stan continues his prayers"
    },
    {
        "character": "Stan",
        "line": "...Hail Mary, full of grace, the Lord is with thee. Ble-"
    },
    {
        "character": "Kenny",
        "line": "[arrives] (Hey, dude.)"
    },
    {
        "character": "Stan",
        "line": "God damnit!"
    },
    {
        "character": "Kenny",
        "line": "(What??)"
    },
    {
        "character": "Stan",
        "line": "[notices someone and points] Oh, there's Sister Anne! Come on, we've got to ask her about Timmy. [he and Kenny walk over to her. She's kneeling before a table of candles and a portrait of Jesus] Sister Anne?"
    },
    {
        "character": "Sister Anne",
        "line": "Oh, hello, children."
    },
    {
        "character": "Stan",
        "line": "We have a question."
    },
    {
        "character": "Sister Anne",
        "line": "[rises] Okay, shoot."
    },
    {
        "character": "Stan",
        "line": "Where do handicapped people go when they die?"
    },
    {
        "character": "Sister Anne",
        "line": "[thinks a moment, then] The handicapped are just people like you and me, so the same rules apply. They need to be baptized, take Communion, and confess their sins."
    },
    {
        "character": "Stan",
        "line": "But our friend Timmy can't really talk. All he can do is say his own name, so he can't really confess his sins. So is he goin' to go to hell?"
    },
    {
        "character": "Sister Anne",
        "line": "Uugh. This really isn't a question for me, it's for the priest. [begins to hurry away] I'll see if I can find him. Bye. [Stan and Kenny look at each other]"
    },
    {
        "character": "",
        "line": "The confessional, inside. Cartman goes through his extensive list of sins"
    },
    {
        "character": "Cartman",
        "line": "And that was about everything from first grade. Then last year, well, you can't tell anybody about this stuff, right?"
    },
    {
        "character": "Priest Maxi",
        "line": "Your [clears his throat] con- confession does not leave this box."
    },
    {
        "character": "Cartman",
        "line": "Okay, because, last year, I took a sandwich that the priest of this church had been eating."
    },
    {
        "character": "Priest Maxi",
        "line": "[guarded] Oh. Well, Uh arr-I'm sure he would forgive you if he knew."
    },
    {
        "character": "Cartman",
        "line": "No, but I'm not finished yet. I took the sandwich that the priest was eating, took the piece of ham out of it, put it between my butt cheeks, and then put the sandwich back and watched him eat it. [Cartman looks up for a response, but nothing happens]"
    },
    {
        "character": "Priest Maxi",
        "line": "[after a pause] I... see."
    },
    {
        "character": "Cartman",
        "line": "Yeah, and then this other time, I went pee-pee in the holy water thing, and the priest blessed himself on the forehead with it every day for about a week. [the priest grows more concerned and his jaw drops] And then this one time, I was at the park, and the priest was out walking his dog and I went-... number two on the sidewalk and then told Officer Barbrady that it was the priest's dog. [Priest Maxi's worry has turned to anger he's trying to contain] And so the priest got find like a hundred dollars for not cleaning it up. And then this one time, I put super glue all over the priest's bottle of- [an arm tears through the partition and grabs Cartman by the throat] -eh- Ow! [throttles him back and forth] D'ow! Jesus! Ooww-ah! Ow! [the priest pulls him up into the partition a few times] Eh! Oh! Help. [The confession box rocks back and forth] Oh! Somebody help! God damnit! Let me out of here!"
    },
    {
        "character": "Sister Anne",
        "line": "[arrives and knocks on the priest's door as Cartman screams] Father! I need to talk to you. Father! [an angry Priest Maxi exits the box] I have to ask you a question."
    },
    {
        "character": "Priest Maxi",
        "line": "Okayokay, fine! [walks away with Sister Anne]"
    },
    {
        "character": "Cartman",
        "line": "[the door opens and he falls to the floor] Uh-huh- [Stan and Kenny rush up] Oho! Ohoho."
    },
    {
        "character": "Stan",
        "line": "What happened??"
    },
    {
        "character": "Cartman",
        "line": "I felt it, you guys. I felt the angry hands of God. [Stan and Kenny get afraid] He is an angry God, you guys. We all have to start taking this very seriously."
    },
    {
        "character": "",
        "line": "Hell, River Styx Condominiums. The doorbell rings at Satan and Chris's condo. Chris walks to the door and opens it"
    },
    {
        "character": "Chris",
        "line": "Oh, hello. You must be Saddam Hussein."
    },
    {
        "character": "Saddam",
        "line": "And you must be Mr. Assface. [cocks his head in an open grin] Just kidding. You're Chris, right? Thanks for inviting me to dinner, guy. [reaches into his coat] Here, I brought you a potato. [hands him a baked potato still wrapped in aluminum foil]"
    },
    {
        "character": "Chris",
        "line": "[takes the potato] Oh, thank you."
    },
    {
        "character": "Satan",
        "line": "[sees this and rushes up to Chris] Chris, no! It's a bomb! [takes the potato and chucks it clear of the condo]"
    },
    {
        "character": "Chris",
        "line": "Satan, what the heck is wrong with you?"
    },
    {
        "character": "Saddam",
        "line": "Yeah! Hey, relax, guy. We're all here to act like adults, right? [the potato explodes in a manner that reveals it was a bomb after all] Oh, gee. I guess I must've overcooked it. [chuckles]"
    },
    {
        "character": "Chris",
        "line": "Well, come on in. Dinner's just about ready."
    },
    {
        "character": "",
        "line": "The Broflovski house, day. Sheila and Gerald sit on the living room sofa, and Ike reads from a book between them"
    },
    {
        "character": "Ike",
        "line": "behayin' glah, and the he find de eye. [reads from \"Cannery Row\" by John Steinbeck]"
    },
    {
        "character": "Gerald",
        "line": "Very good, Ike. That's two John Steinbeck books in one day."
    },
    {
        "character": "Ike",
        "line": "Cookie monstooh."
    },
    {
        "character": "Sheila",
        "line": "[affectionately] Oh, he's growing up so fast! [a door opens and closes]"
    },
    {
        "character": "Kyle",
        "line": "[rushes into the room] Mom! Dad! Am I gong to hell?"
    },
    {
        "character": "Sheila",
        "line": "Why? What did you do, Kyle?!"
    },
    {
        "character": "Kyle",
        "line": "Nothing. But the guys said if I don't confess my sins and eat crackers, I'm gonna go to hell."
    },
    {
        "character": "Sheila",
        "line": "Oh noooo, that's just Catholics. Us Jews don't believe in hell."
    },
    {
        "character": "Kyle",
        "line": "We don't? But what if we're wrong?"
    },
    {
        "character": "Sheila",
        "line": "Well..., Kyle..., they could be wrong, too."
    },
    {
        "character": "Kyle",
        "line": "Yeah, but if they're wrong, no big deal. If we're wrong, we burn in hell."
    },
    {
        "character": "Ike",
        "line": "Oh, no."
    },
    {
        "character": "Gerald",
        "line": "Kyle, it's all about being a good person now! You see, Christians use hell as a way to scare people into believing what they believe. But to believe in something just because you're afraid of the consequences if you don't believe in something is no reason to believe in something. Understand?"
    },
    {
        "character": "Ike",
        "line": "No-o-o."
    },
    {
        "character": "Kyle",
        "line": "Well, you guys can do what you want! I'm going down to that church to confess my sins and eat crackers! And I'm taking Ike with me! [goes up to him and takes him away towards the front door. The book falls to the floor]"
    },
    {
        "character": "Sheila",
        "line": "Kyle!"
    },
    {
        "character": "",
        "line": "Hell, River Styx Condominiums. Dinner has been served. Saddam, Satan, and Chris sit at a round table, eating. Satan sits between the other two."
    },
    {
        "character": "Chris",
        "line": "So Saddam. Satan told me all about how you guys almost took over the world once."
    },
    {
        "character": "Saddam",
        "line": "Hn-yeah, those were the days, boy. What the hell is this crap we're eating, anyway?"
    },
    {
        "character": "Satan",
        "line": "It's all vegetarian, Saddam. Chris was a nutritionist before he died."
    },
    {
        "character": "Saddam",
        "line": "Oh, isn't that fascinating. So, tell me, Chris. How is it that you died?"
    },
    {
        "character": "Chris",
        "line": "Oh, well I, I actually slipped down an escalator, in a mall. Those things can be pretty sketchy."
    },
    {
        "character": "Saddam",
        "line": "An escalator? What kind of pussy way of dying is that?!"
    },
    {
        "character": "Chris",
        "line": "L-look, Saddam, I know that you and Satan had a relationship [Saddam reaches down to stroke Satan's right leg] And I just want you to know [Satan swats Saddam's arm away] that I'm totally okay with you guys staying friends."
    },
    {
        "character": "Saddam",
        "line": "Uh huh."
    },
    {
        "character": "Chris",
        "line": "I think it's important to stay friends with people you've had relationships with. [Saddam tries twice more with Satan, but Satan keeps swatting Saddam's arm off] And I know that Satan and my relationship is strong enough that it can handle anything. [looks up to Satan] Right? [a tormented Satan looks down at a grinning Saddam, who is still stroking his leg] Right."
    },
    {
        "character": "",
        "line": "The church, day. The rectory. Sister Anne, Stan, Cartman, and Kenny wait for Priest Maxi at his desk. On one side of the desk is a tray with holders that say, \"The LORD Giveth\" and \"The LORD Taketh\""
    },
    {
        "character": "Sister Anne",
        "line": "Father, the children asked me about their handicapped friend. I wanna explain to them that he's fine."
    },
    {
        "character": "Priest Maxi",
        "line": "Well, has your friend ever confessed or been baptized?"
    },
    {
        "character": "Stan",
        "line": "I don't think so."
    },
    {
        "character": "Priest Maxi",
        "line": "Then, hell awaits him."
    },
    {
        "character": "Sister Anne",
        "line": "Father, these boys are really worried because they think they have to-"
    },
    {
        "character": "Priest Maxi",
        "line": "They SHOULD be worried! Boys, it is your Christian duty to save the souls of your friends!"
    },
    {
        "character": "Sister Anne",
        "line": "Yes, but-"
    },
    {
        "character": "Kyle",
        "line": "[rushes in with Ike in tow] Mister Father! [Sister Anne looks back at him] We have to ask you something."
    },
    {
        "character": "Priest Maxi",
        "line": "Oh. You're the little Jewish boy, right?"
    },
    {
        "character": "Kyle",
        "line": "Yeah. If we're Jewish, are we gonna go to hell?"
    },
    {
        "character": "Priest Maxi",
        "line": "Well, young man, you can rest assured that according to Matthew 25, when you die you will stand before God and he will will say, \"Depart from me, you cursèd, into the eternal fire prepared for the devil and his angels.\" Yes! As a Jew, your home will be the lake of fire."
    },
    {
        "character": "Ike",
        "line": "[hiding behind a frightened Kyle] Oh no."
    },
    {
        "character": "Sister Anne",
        "line": "Father-"
    },
    {
        "character": "Priest Maxi",
        "line": "I hope to see all of you in church this Sunday."
    },
    {
        "character": "Stan, Kyle, Cartman, Kenny",
        "line": "We will be. [the boys turn and walk out with Ike. Priest Maxi gloats]"
    },
    {
        "character": "Sister Anne",
        "line": "[concerned] Father, I don't know if I agree fully with what you're saying. I think that as long as Jewish people are good, they will get into heaven."
    },
    {
        "character": "Priest Maxi",
        "line": "Sister, the Jews crucified our Savior. I mean, if you don't go to hell for crucifying the Savior, then what the hell do you go to hell for?!"
    },
    {
        "character": "",
        "line": "The church, day. The boys stand in front of the candle table Sister Anne prayed at earlier"
    },
    {
        "character": "Kyle",
        "line": "[breathless] Stan! You've got to help us become good Christians. Please."
    },
    {
        "character": "Stan",
        "line": "Alrightalrightalright. You heard the priest: the first thing we have to do is get you guys all baptized. Come on. [the boys exit]"
    },
    {
        "character": "",
        "line": "Cartman's house, day. Timmy, Kyle, and Ike stand in a row as a hose splashes on each one for a few seconds. Cartman is the one doing the spraying while Stan and Kenny watch from the steps"
    },
    {
        "character": "Stan",
        "line": "Okay, you'd better baptize Kyle some more."
    },
    {
        "character": "Cartman",
        "line": "[points the hose at Kyle] Halleluyah! Wash away the sin-eh!"
    },
    {
        "character": "Kyle",
        "line": "HAAAAH!"
    },
    {
        "character": "Cartman",
        "line": "Turn around so I can clean out your ass."
    },
    {
        "character": "Stan",
        "line": "Cartman!"
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Stan",
        "line": "Dude, you just said \"ass\"! That's a sin!"
    },
    {
        "character": "Cartman",
        "line": "Oh, now you've said it, too!"
    },
    {
        "character": "Stan",
        "line": "Oh, shit! [covers his mouth with his gloves.] Oh!"
    },
    {
        "character": "Kenny",
        "line": "(Fuck! Oops!) [covers his own mouth]"
    },
    {
        "character": "Cartman",
        "line": "Aw, dude, we've gotta go back to church and confess again."
    },
    {
        "character": "Stan",
        "line": "But what about them?"
    },
    {
        "character": "Cartman",
        "line": "Ugh. Oh, I know. [runs away, but returns with an attachment] We can use Wacky Water Weasel! [sets everything up, and the Weasel sets to work spraying Timmy, Kyle, and Ike.]"
    },
    {
        "character": "Timmy",
        "line": "Haaaaah!"
    },
    {
        "character": "Stan",
        "line": "Okay, come on. [he, Cartman, and Kenny leave]"
    },
    {
        "character": "Timmy",
        "line": "Haaa-ay, Timmmiih!"
    },
    {
        "character": "",
        "line": "Hell, River Styx Condominiums. Dinner is over. Chris collects the dishes"
    },
    {
        "character": "Chris",
        "line": "Hoof. Well, I don't know about you guys, but all that ginger made me tired."
    },
    {
        "character": "Saddam",
        "line": "Yes. I guess I should be gettin' back. [leaves the table]"
    },
    {
        "character": "Satan",
        "line": "Good. I'll show you out."
    },
    {
        "character": "Chris",
        "line": "Nice to meet you, Saddam! Have a safe walk back!"
    },
    {
        "character": "Saddam",
        "line": "Yeah. Thanks for the weak grass and twigs and stuff. [Satan shows him out; he faces Satan] Satan, that guy is a pussy!"
    },
    {
        "character": "Satan",
        "line": "He's stable, Saddam!"
    },
    {
        "character": "Saddam",
        "line": "Yes, that's what I said! He's a pussy!"
    },
    {
        "character": "Satan",
        "line": "Having stability in your life is a great thing! You should try it!"
    },
    {
        "character": "Saddam",
        "line": "For some people, maybe. But you like excitement. I know you, Satan. [grins]"
    },
    {
        "character": "Satan",
        "line": "I'm very happy with my life now."
    },
    {
        "character": "Saddam",
        "line": "Here. [slips a key into Satan's hand] I'm at the bargain hotel on Monte Vista. Room 16."
    },
    {
        "character": "Satan",
        "line": "No, Saddam! I won't be needing this!"
    },
    {
        "character": "Saddam",
        "line": "D'oh, I know you won't. But just keep it, just in case. It was good seeing you again, Satan. Goodnight. [to Chris, still inside the condo] Goodnight, pussy! I mean, Chris!"
    },
    {
        "character": "Chris",
        "line": "[off screen] Goodnight [Satan looks torn]"
    },
    {
        "character": "",
        "line": "Rome, St. Peter's Square. A phone rings somewhere and someone answers"
    },
    {
        "character": "Voice",
        "line": "Hello. Your Excellency? [the scene switches to the church in South Park. The voice is Sister Anne's] This is Sister Anne, the Bleeding Eyes of Jesus, calling from the United States?"
    },
    {
        "character": "Secretary",
        "line": "Yes, I understand you want to speak-a wit the pope."
    },
    {
        "character": "Sister Anne",
        "line": "Yes. The priest here has been telling the children some pretty radical things, and I just wanted to see what the Church thinks about Jews and the mentally handicapped."
    },
    {
        "character": "Secretary",
        "line": "Yes, well the pope is here, but please keep it brief. He is a-very old. [the secretary hands the phone over to the pope, who is seated in a throne inside a tiny temple at one end of the cathedral]"
    },
    {
        "character": "The Pope",
        "line": "Heh??"
    },
    {
        "character": "Sister Anne",
        "line": "Hello, His Holiness. I want to ask you about people with mental disabilities."
    },
    {
        "character": "The Pope",
        "line": "Heh?"
    },
    {
        "character": "Sister Anne",
        "line": "Do mentally-challenged people go to hell?"
    },
    {
        "character": "The Pope",
        "line": "[soft] Ehhhhh, what's that you say? [loud] Heh?!"
    },
    {
        "character": "Sister Anne",
        "line": "[enunciates] Handicap. Mental handicap."
    },
    {
        "character": "The Pope",
        "line": "[flaps his lips around with his tongue] Fibibiibibibibiibibih."
    },
    {
        "character": "Sister Anne",
        "line": "[waits, then] ...The priest here said that people with mental handicaps might end up in hell. Is that true?"
    },
    {
        "character": "The Pope",
        "line": "[snores, then] Eh-bibibiibibibibiibibibih. [Sister Anne says nothing.]"
    },
    {
        "character": "",
        "line": "South Park Avenue, day. Stan, Cartman, and Kenny are at a crosswalk waiting for the light to turn green"
    },
    {
        "character": "Stan",
        "line": "Come on! This stupid light won't change."
    },
    {
        "character": "Tolkien",
        "line": "[arrives, followed by Butters, Clyde, and Bebe] Come on! Hurry up! [sees the other three boys] Hey, what are you guys doin'?"
    },
    {
        "character": "Stan",
        "line": "We're goin' to church. We've sinned and so we have to confess again."
    },
    {
        "character": "Butters",
        "line": "Uh us too. Uh we saw a picture of a naked lady. We could see her whole beaver."
    },
    {
        "character": "Clyde",
        "line": "Yeah. If we died right now, we'd have unclean souls and we'd burn in hell. [the crosswalk light turns green]"
    },
    {
        "character": "Stan",
        "line": "Uh, come on, let's go. [the kids begin to cross the street, Kenny first, but...]"
    },
    {
        "character": "Kenny",
        "line": "(Yow!) [a tour bus slams into Kenny and takes him away. The other kids freeze where they are, petrified]"
    },
    {
        "character": "Stan",
        "line": "[finally reacts, shrilly] ...Oh my God, they've killed Kenny!"
    },
    {
        "character": "Butters",
        "line": "He had sins that he didn't confess!"
    },
    {
        "character": "Cartman",
        "line": "And he never took Communion!"
    },
    {
        "character": "Stan",
        "line": "He's doomed."
    },
    {
        "character": "Clyde",
        "line": "...We've gotta get to that church before we die."
    },
    {
        "character": "Cartman",
        "line": "Yeah. [the kids make their way slowly across the street]"
    },
    {
        "character": "",
        "line": "Hell, River Styx Condominiums, night. Satan and Chris are in bed in the dark. Chris is trying to arouse Satan, but Satan doesn't move"
    },
    {
        "character": "Chris",
        "line": "[grabbing Satan's privates] Yeah. [moves up to Satan's left shoulder] That's hot. [then to the right one] You take it! [Satan turns on the lights as Chris makes his way down to his crotch] You take it now!"
    },
    {
        "character": "Satan",
        "line": "Chris, what are you doing?"
    },
    {
        "character": "Chris",
        "line": "I'm just... I'm just trying to be a little more naughty in bed. I uh... I know that's what you like about sex with Saddam. I'm just... showin' you that I can be that way, too."
    },
    {
        "character": "Satan",
        "line": "Oh boy."
    },
    {
        "character": "Chris",
        "line": "[resumes his naughtiness] Uh huh. Yeah. You like that, don't you, bitch? [Satan begins to grimace] I'm a bad boy. Yeah. Take that."
    },
    {
        "character": "Satan",
        "line": "Chris, just... don't... don't do that."
    },
    {
        "character": "Chris",
        "line": "But it turns you on."
    },
    {
        "character": "Satan",
        "line": "No, it's a- When Saddam did it, yeah, but uh..."
    },
    {
        "character": "Chris",
        "line": "But what?"
    },
    {
        "character": "Satan",
        "line": "Nothing. I just- I'm just- really tired is all. Can we- just, please go to sleep? [Chris looks let down] Chris, seriously. I'm just tired, okay?"
    },
    {
        "character": "Chris",
        "line": "[closes his eyes] Okay. I love you, Satan."
    },
    {
        "character": "Satan",
        "line": "I love you too, Saddam."
    },
    {
        "character": "Satan, Chris",
        "line": "[immediately react] Wuh?!"
    },
    {
        "character": "Satan",
        "line": "Waw. Uhuh. I'm sorry, I mean, Chris. [grimaces]"
    },
    {
        "character": "Chris",
        "line": "It's okay. It's okay. I, uh, I, I understand. ...I do."
    },
    {
        "character": "Satan",
        "line": "I just need to go get some air. okay? I'll be back... really quick. [gets out of bed and leaves]"
    },
    {
        "character": "Chris",
        "line": "Yeah. Sure. Okay."
    },
    {
        "character": "",
        "line": "South Park, the church, day. The kids race towards the church"
    },
    {
        "character": "Cartman",
        "line": "Come on, hurry up! [Stan reaches the door]"
    },
    {
        "character": "Stan",
        "line": "[tries to open it] Oh no! It's locked!"
    },
    {
        "character": "Cartman",
        "line": "[moves in and tries to open it] What? No! It shouldn't be locked! We have to confess! We have to confess our sins before we die!"
    },
    {
        "character": "Butters",
        "line": "Hey, there's a window in the back that's usually open. [the kids go around to the back of the church, find the window, and climb in]"
    },
    {
        "character": "Stan",
        "line": "[sees something off to the side] Confession box is over there! [moves towards it]"
    },
    {
        "character": "Cartman",
        "line": "I'm first, I'm first! [trips Tolkien and runs past Stan. Tolkien quickly gets up and walks with the others. Cartman opens the penitent door and sees a woman with her exposed ass up against the partition]"
    },
    {
        "character": "Woman",
        "line": "Oh, huhuh."
    },
    {
        "character": "Cartman",
        "line": "[closes the door] What the? [opens the priest's door. Priest Maxi, in a sexual act with the woman on the other side, looks out and grins. The kids look back in horror, and his face changes]"
    },
    {
        "character": "Priest Maxi",
        "line": "Whoa! [turns and faces the partition while zipping up his pants] Son of a bitch!"
    },
    {
        "character": "Woman",
        "line": "[flits out of the penitent side] Eh, heheheheheheh."
    },
    {
        "character": "Priest Maxi",
        "line": "[exits] Uhuh. Kids, uh."
    },
    {
        "character": "Stan",
        "line": "You're a sinner!"
    },
    {
        "character": "Cartman",
        "line": "You're doing unnatural things in the house of God!"
    },
    {
        "character": "Priest Maxi",
        "line": "Oh! Huh huh. Huh huh. [drops to his knees and prays] Oh, forgive me, heavenly Father! I've sinned against you!"
    },
    {
        "character": "Cartman",
        "line": "Oh, this guy is so gonna burn!"
    },
    {
        "character": "Priest Maxi",
        "line": "M-Mrs. Donovan is a temptress from hell! [begins to weep]"
    },
    {
        "character": "Stan",
        "line": "Dude, if this guy's goin' to hell, who's gonna save us?"
    },
    {
        "character": "Cartman",
        "line": "Well, it looks like we're gonna have to save Timmy, Kyle, and everyone else in this town from the angry hand of God ourselves!"
    },
    {
        "character": "",
        "line": "Hell. Satan walks down its streets"
    },
    {
        "character": "Damned Soul",
        "line": "Oh, the pain! Oh, the pain! [Satan stops and looks at the key Saddam gave him. The handle looks like a coffin]"
    },
    {
        "character": "Satan",
        "line": "[lowers the key] No, I can't. [in front of him is the Bargain Hotel] What am I doing? I know this is the wrong thing to do. I could lose Chris. I can't do this. [turns around and walks away] I can't do this. [stops and turns back]"
    },
    {
        "character": "",
        "line": "South Park, day. A street corner. Cartman holds court on a soapbox. At least 17 other kids surround him. Some adults look at the action from across the street"
    },
    {
        "character": "Cartman",
        "line": "We have-uh repeatedly broken God's commandments-uh! We have lived our lives for ourselves-uh! Totally ignoring the Lord-uh! [Chef and Mr. Garrison arrive] If thy hand offend thee, cut it off! [Stan's parents and the nun are there] It is much better for thee to enter into life maimed-"
    },
    {
        "character": "Randy",
        "line": "Oh, what the hell are they doing now?!"
    },
    {
        "character": "Cartman",
        "line": ""
    },
    {
        "character": "Sister Anne",
        "line": "[steps up] Oh no."
    },
    {
        "character": "Cartman",
        "line": ""
    },
    {
        "character": "Stan",
        "line": "[passes out material] Pamphlet. Pamphlet. [from a child's view, the pamphlet is seen. It's called \"Kids Against Hell\" and has a quote from Ezekiel 5:10. It is soon lowered for a good shot at the growing crowd of kids at the street corner]"
    },
    {
        "character": "Cartman",
        "line": "There is only one answer! As kids we must abandon this town of sin and start anew!"
    },
    {
        "character": "Heidi",
        "line": "I don't wanna to go to hell. [joins the kids, leaving her parents stunned]"
    },
    {
        "character": "Cartman",
        "line": "It will be a long road, but at the end of that road is Salvation! And I am going to lead you there!"
    },
    {
        "character": "",
        "line": "End of Do The Handicapped Go To Hell? — To Be Continued..."
    }
]