[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Stage rehearsal, day. Stan, Kyle, and Wendy are in costume on stage. Stan is dressed in a white suit and bowtie, and a fake beard and mustache. Kyle is dressed as a country doctor with starched collar, and Wendy is dressed in white pants, purple coat and beret, and bowtie. The stage itself has a door prop and a tripod table with a bowl and jar atop it. Kyle enters through the door."
    },
    {
        "character": "Wendy",
        "line": "Doctor, doctor! Will our daughter be okay?"
    },
    {
        "character": "Kyle",
        "line": "I am sorry, Mr. and Mrs. Keller, but I'm afraid your daughter Helen still cannot see, hear, or speak."
    },
    {
        "character": "Wendy",
        "line": "Oh no! NO!"
    },
    {
        "character": "Stan",
        "line": "'Ere 'ere, my good wife, 'ere is nothing we can do."
    },
    {
        "character": "Wendy",
        "line": "My poor little Helen."
    },
    {
        "character": "Timmy",
        "line": "[enters through the prop door in blue dress and wig, and holding a doll - Helen Keller!] Timmiihhh!"
    },
    {
        "character": "Wendy",
        "line": "She can't see or hear us, John."
    },
    {
        "character": "Timmy",
        "line": "Heh-aaaah, Timmih!"
    },
    {
        "character": "Stan",
        "line": "[very slurred - John Keller] E-yes. Perhaps she should go to an asyluh."
    },
    {
        "character": "Cartman",
        "line": "[in the second front row, directing] Stan, what the hell is wrong with you? I can't understand your lines!"
    },
    {
        "character": "Stan",
        "line": "'Cause the 'eard 'urts my 'ace."
    },
    {
        "character": "Kyle",
        "line": "Can we take a lunch break now?"
    },
    {
        "character": "Cartman",
        "line": "No! If we want our play to be better than the kindergartners' play, we have to rehearse as much as possible! Now let's continue the scene!"
    },
    {
        "character": "Bebe",
        "line": "[enters the scene] Hello. My name is Anne Sullivan, and I believe I can teach this child to communicate."
    },
    {
        "character": "Stan",
        "line": "Uh-eally? Uh you think so?"
    },
    {
        "character": "Bebe",
        "line": "[slaps some water from a pitcher into Timmy's right hand] Water, Helen! Waaa-terr!"
    },
    {
        "character": "Timmy",
        "line": "Agh oh-ight, Timmih!"
    },
    {
        "character": "Cartman",
        "line": "God-damnit, Timmy! Helen Keller isn't supposed to talk!"
    },
    {
        "character": "Butters",
        "line": "[a camera follows him to the auditorium at butt level; another camera shows him entering the room] Hey you guys! We got a big problem! [rushes onto the stage]"
    },
    {
        "character": "Kyle",
        "line": "What is it, Butters?"
    },
    {
        "character": "Butters",
        "line": "The kindergartners! I just came from their dress rehearsal. Hoh, it's good, you guys. It's real good!"
    },
    {
        "character": "Cartman",
        "line": "How good?"
    },
    {
        "character": "Butters",
        "line": "They got Pilgrim outfits! And Indian ones, too! They've got singing and dancing and boy you've never seen such a show! Why, it's a Thanksgiving extravaganza!"
    },
    {
        "character": "Clyde",
        "line": "Oh, no!"
    },
    {
        "character": "Kyle",
        "line": "We can't be outdone by the kindergartners!"
    },
    {
        "character": "Clyde",
        "line": "Oh, now what?"
    },
    {
        "character": "Stan",
        "line": "Oh yeah, we can't!"
    },
    {
        "character": "Cartman",
        "line": "Alright, alright! Quiet down! Look, we still got four days until the Thanksgiving festival; that's plenty of time to revamp our play!"
    },
    {
        "character": "Kyle",
        "line": "Revamp how? The rules are that the fourth grade class has to perform the Helen Keller Story."
    },
    {
        "character": "Cartman",
        "line": "Yeah, but nobody told us how we had to do it. We can have Thanksgiving stuff and music numbers, too."
    },
    {
        "character": "Clyde",
        "line": "Well, we can add music numbers, but how do we make the Helen Keller story more Thanksgivingy?"
    },
    {
        "character": "Wendy",
        "line": "I know! How about, instead of a dog, Helen Keller has a pet turkey."
    },
    {
        "character": "Tolkien",
        "line": "Yeah, a turkey that could do tricks."
    },
    {
        "character": "Kids",
        "line": "Yeah"
    },
    {
        "character": "Cartman",
        "line": "That's the spirit, gang! Alright. Stan and Wendy, you go out and find some musical instruments! Kenny and Clyde, take some kids and buy some Thanksgiving decorations for the set! Kyle and Timmy, you go out and find a turkey!"
    },
    {
        "character": "Kyle",
        "line": "Okay!"
    },
    {
        "character": "Cartman",
        "line": "This is gonna be the best version of the Miracle Worker ever!"
    },
    {
        "character": "Kids",
        "line": "Yay!"
    },
    {
        "character": "",
        "line": "a barn, with no snow around it. Cows are grazing on the grass outside. Inside, a rancher shows Timmy and Kyle around the barn."
    },
    {
        "character": "Rancher",
        "line": "What kind of turkey are you lookin' for?"
    },
    {
        "character": "Kyle",
        "line": "A smart one, that can do tricks."
    },
    {
        "character": "Rancher",
        "line": "Well, I ain't got a whole lot left, it bein' almost Thanksgiving and all. [opens a turkey pen so the boys can see] Go ahead, just pick one out. [Timmy looks pleased, looks around, and settles on a deformed turkey which walks with its head against the ground]"
    },
    {
        "character": "Timmy",
        "line": "[apparently having chosen his turkey] Timmaay! [the turkey blinks at him]"
    },
    {
        "character": "Rancher",
        "line": "[notices the turkey] Oh, that one's a little messed up. Not exactly the... pick of the litter."
    },
    {
        "character": "Timmy",
        "line": "Haaaaa!"
    },
    {
        "character": "Kyle",
        "line": "Uh, Timmy, if we back to the other kids with that turkey they're gonna be pissed!"
    },
    {
        "character": "Timmy",
        "line": "TIMMAY!"
    },
    {
        "character": "Rancher",
        "line": "Yeah. Best you not take that one. I was just about to take it out in the yard and putt a bullet in its head."
    },
    {
        "character": "Kyle",
        "line": "What?! Aw, dude, don't say that!"
    },
    {
        "character": "Timmy",
        "line": "T-TIIMMAY TIMMAY!"
    },
    {
        "character": "Kyle",
        "line": "Alright, we'll take him. How much?"
    },
    {
        "character": "Rancher",
        "line": "Fifty bucks."
    },
    {
        "character": "Kyle",
        "line": "But you were just gonna take it out in the backyard and put a bullet in its head!"
    },
    {
        "character": "Rancher",
        "line": "I know! Now I gotta find somethin' else to shoot."
    },
    {
        "character": "Kyle",
        "line": "[thinks] ...God-damnit, here! [the rancher takes the money, walks over to get the turkey, and delivers the turkey to Timmy] Alright, Timmy, let's go! [Kyle and Timmy leave]"
    },
    {
        "character": "Rancher",
        "line": "I've got a one-legged pig if you'd like, too."
    },
    {
        "character": "Kyle",
        "line": "Aw, blow it out your ass!"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre. Here is where the class has been rehearsing for the play. The marquee reads: \"THANKSGIVING EXTRAVAGANZA WEDNESDAY\" Inside, Cartman has most of the kids on stage with a man..."
    },
    {
        "character": "Cartman",
        "line": "Guys, I want you all to meet Jeffrey Maynard. He's South Park's biggest expert on musical theater, AND, he played the lead in Les Misérables at the Denver Community Playhouse for five weeks."
    },
    {
        "character": "Kids",
        "line": "[flatly] Bravo."
    },
    {
        "character": "Wendy",
        "line": "Do you think we could make up a good Thanksgiving play in four days?"
    },
    {
        "character": "Jeffrey Maynard",
        "line": "[lyrically] I would swear it on my life. Your play shall want for nothing."
    },
    {
        "character": "Kids",
        "line": "Hooray!"
    },
    {
        "character": "Jeffrey Maynard",
        "line": "Now, the first thing a good musical needs is a big opening number. Something that sets up the entire show."
    },
    {
        "character": "Cartman",
        "line": "Alright! Places, everybody! Bring in the turkey! [Timmy's turkey sidles in with its head on the ground. Kyle and Timmy follow] What the hell is that?"
    },
    {
        "character": "Kyle",
        "line": "It's a turkey. [long pause] His name is Gobbles."
    },
    {
        "character": "Timmy",
        "line": "GOBBLES! [Gobbles gobbles]"
    },
    {
        "character": "Cartman",
        "line": "And where... pray... is our beautiful trick performing turkey?"
    },
    {
        "character": "Kyle",
        "line": "Um, we... sssort of spend all the money on this... one..."
    },
    {
        "character": "Timmy",
        "line": "GOBBLES! [Gobbles gobbles]"
    },
    {
        "character": "Cartman",
        "line": "[looks at Kyle for a long time] Kyle, can I talk to you over here for a second? [they walk off to one side of the stage and stop, out of earshot] Kyle? Why do you do these things to me?"
    },
    {
        "character": "Kyle",
        "line": "I didn't do anything to you. Timmy saw the turkey and wanted to get it. What do you want me to say to him?"
    },
    {
        "character": "Cartman",
        "line": "You say, \"No, Timmy, you can't have that turkey! Bad Timmy!\""
    },
    {
        "character": "Kyle",
        "line": "[the rest of the cast approaches] Look, I know it isn't exactly what we wanted, but maybe we can train it."
    },
    {
        "character": "?????",
        "line": "He's not gonna work, Kyle. The whole point was to make our play better than the kindergartners."
    },
    {
        "character": "Tolkien",
        "line": "Yeah, that turkey sucks."
    },
    {
        "character": "Jeffrey Maynard",
        "line": "[lyrically] Wait! What's that, you say? A thanksgiving turkey is what you require? I know of a turkey."
    },
    {
        "character": "Stan",
        "line": "You do?"
    },
    {
        "character": "Jeffrey Maynard",
        "line": "[lyrically] During my years on Broadway I... worked with a turkey who could do all kinds of tricks. She even jumped through a hoop of fire."
    },
    {
        "character": "Cartman",
        "line": "Cool! Can you get it for us?"
    },
    {
        "character": "Jeffrey Maynard",
        "line": "I will go promptly and call her trainer. On the morrow you shall have your trick performing turkey."
    },
    {
        "character": "Kids",
        "line": "Alright! [Timmy takes Gobbles and wheels off stage]"
    },
    {
        "character": "",
        "line": "South Park, Timmy's house, night. Timmy is in his room with a hula hoop in hand, sitting on the floor"
    },
    {
        "character": "Timmy",
        "line": "Gobbles! [shows him the hoop and points to it. Gobbles just blinks. Timmy tries again] Gobbles! [Gobbles blinks, then walks up to the hoop and lifts his head through it. Timmy is dismayed] Up, heh. Uh! [coaxes Gobbles through the hoop. Gobbles trips and falls out. Timmy grins] Heeey, Gobbles! [Gobbles gets up and walks away. Timmy pulls out a lighter and sets the hoop aflame] Gobbles. [Gobbles just stares and Timmy urges] Gobbles! [Gobbles poops]"
    },
    {
        "character": "",
        "line": "South Park, Cartman's house, night. Cartman is in his room rewriting a part of the play."
    },
    {
        "character": "Cartman",
        "line": "No no! [tosse another sheet over his shoulder, to join other wads on the floor. His mother enters the room]"
    },
    {
        "character": "Liane",
        "line": "Boopsie-kins, It's late. You need to be in bed."
    },
    {
        "character": "Cartman",
        "line": "I can't sleep, Mom! I have to write the lyrics for the opening song of our Helen Keller Thanksgiving spectacular!"
    },
    {
        "character": "Liane",
        "line": "Now, hon!"
    },
    {
        "character": "Cartman",
        "line": "[whining a bit] But [turns around] Mo-o-om, I have to write these lyrics so the plight of Helen Keller can be realized by the common man."
    },
    {
        "character": "Liane",
        "line": "Twenty more minutes, and that's it. [exits and closes the door]"
    },
    {
        "character": "Cartman",
        "line": "[spins around and gets back to work] Twenty minutes! Does Tim Rice's mom give him twenty minutes to write the lyrics to \"Phantom Of The Opera\"?! [looks at a small portrait of Helen Keller on his desk, picks it up and studies it] Speak to me Helen. Let me be your voice. [after looking at the portrait some more, he gets frustrated and slams the portrait onto the desk] Come on, you blind bitch! Channel your spirit through me!"
    },
    {
        "character": "",
        "line": "South Park, Timmy's house. Timmy is in bed asleep. Soon, Gobbles hops up on the bed and drops his head on the covers. He slowly inches up to Timmy's face, looking at Timmy all the while, and settles in next to him. Gobbles soon falls asleep. Timmy's left hand comes to rest on Gobbles' body. An exterior shot with the moon low in the sky is shown and fades out."
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, the stage, next day. rehearsal. Clyde is speaking under a spotlight"
    },
    {
        "character": "Clyde",
        "line": "Tonight we present the story of a courageous girl and her fight against depression"
    },
    {
        "character": "Cartman",
        "line": "[in the audience] OP-pression!"
    },
    {
        "character": "Clyde",
        "line": "Oppression. Our play begins in a simpler time. [music comes up] Alabama, in the late 1800s [spotlight goes off, Clyde walks off stage, curtains open. A lone house stands against a desert background and clouds float high against the sky-blue backdrop. Dancing singers begin]"
    },
    {
        "character": "Actors",
        "line": "1800's, Alabama! What a great place and time!We're so happy that we live in 1800's Alabama 'cause it's sunny and there is no crime!\n\n\n"
    },
    {
        "character": "Jeffrey",
        "line": "[in the audience] Now to the refrain!"
    },
    {
        "character": "Actors",
        "line": "And in this little town in 1800's Alabama there's a family by the name of Keller!\n[They dance off to one side of the house. A water pump appears]\nTheir daughter's deaf and mute and blind as a bat, and her parents can't even tell her!!\n\n\n"
    },
    {
        "character": "Lamond",
        "line": "[a man with a small animal cage enters] Excuse me, I am Lamond, the animal trainer."
    },
    {
        "character": "Clyde",
        "line": "Oh. [quickly calls the others] Cool! He's here! [the other kids gather]"
    },
    {
        "character": "Cartman",
        "line": "Awesome! Do you have a turkey that can do tricks?"
    },
    {
        "character": "Lamond",
        "line": "Ap ap! Do not call them tricks! She's a very sensitive turkey! She performs feats, not tricks. Ladies and gentlemen, may I present the most beautiful bird in America! [sets the cage down] Four-time prize winner of the National Western Stock Show and reigning poster child of turkeylovers.com! I give you Alinicia! [one serious turkey walks out of the cage, and the kids are impressed]"
    },
    {
        "character": "Cartman",
        "line": "Yeh."
    },
    {
        "character": "Others",
        "line": "Wow."
    },
    {
        "character": "Cartman",
        "line": "Whoa."
    },
    {
        "character": "Bebe",
        "line": "Her feathers are beautiful."
    },
    {
        "character": "Clyde",
        "line": "That's the prettiest turkey I ever saw."
    },
    {
        "character": "Lamond",
        "line": "Of course she is! [she looks back at the kids and thrusts her beak in the air]"
    },
    {
        "character": "Cartman",
        "line": "Okay! Now we can really get this thing underway! Places, everybody! [the kids move back...] Where the hell is Timmy?"
    },
    {
        "character": "Timmy",
        "line": "[off screen] TIM-MIH! [all turn and face him. He's in costume with Gobbles before him. Gobbles raises his head and gobbles]"
    },
    {
        "character": "Lamond",
        "line": "What... is... that?!"
    },
    {
        "character": "Cartman",
        "line": "Uh, that's Gobbles, the physically challenged turkey. [Timmy takes his lighter and sets his hoop on fire, then lowers it for his bird]"
    },
    {
        "character": "Timmy",
        "line": "Gobbles! [Gobbles makes no move] Gobbles?!"
    },
    {
        "character": "Kyle",
        "line": "Timmy, we already got a turkey."
    },
    {
        "character": "Clyde",
        "line": "Yeah, and it's from Broadway."
    },
    {
        "character": "Timmy",
        "line": "[indicates his turkey] Gobbles."
    },
    {
        "character": "Cartman",
        "line": "No, Timmy! That handicapped turkey does not go in our play!"
    },
    {
        "character": "Kyle",
        "line": "Dude, don't forget: Timmy is the only kid who can play Helen Keller. Don't piss him off."
    },
    {
        "character": "Cartman",
        "line": "No, that's right. Only Timmy knows the part."
    },
    {
        "character": "Timmy",
        "line": "[stubborn] Tim-mih."
    },
    {
        "character": "Cartman",
        "line": "Oh, Jesus! Okay, fine! Helen Keller can have TWO pet turkeys! [Alinicia protests vigorously, shedding feathers everywhere]"
    },
    {
        "character": "Lamond",
        "line": "My turkey does not work with other turkeys!"
    },
    {
        "character": "Cartman",
        "line": "Oh, God-damnit, now what are we gonna do?!"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, later. Hallway outside a dressing room. The door opens and Lamond stands there trying to calm Alinicia down"
    },
    {
        "character": "Lamond",
        "line": "Alright, ah ah alright! Alri- ah a-alright. Alright. [exits and closes the door]"
    },
    {
        "character": "Cartman",
        "line": "[walks up] Dude, we need your turkey for our play!"
    },
    {
        "character": "Lamond",
        "line": "She's not coming out. She's very upset! She's pooped all over the room!"
    },
    {
        "character": "Cartman",
        "line": "I know, I know, but listen: Uh, let me try to explain the position I'm in here. The retarded turkey belongs to our friend, Timmy. And Timmy's the only person who knows the part of Helen Keller. So, so tell me what I can do here to make everybody happy?"
    },
    {
        "character": "Lamond",
        "line": "[ominously] Kill the other turkey!"
    },
    {
        "character": "Cartman",
        "line": "I can't dude. Timmy has a boner for it."
    },
    {
        "character": "Lamond",
        "line": "Well, it could meet with \"an unfortunate accident.\""
    },
    {
        "character": "Cartman",
        "line": "Unfortunate accident? You mean, like Geena Davis getting her own TV show? [laughs, but realizes he's alone in this] Oh."
    },
    {
        "character": "Lamond",
        "line": "It's very simple! Either that turkey meets with an unfortunate accident, or you don't have a feat-performing turkey for your Helen Keller Thanksgiving musical!"
    },
    {
        "character": "Cartman",
        "line": "Alright, alright! Just get your turkey to stop crapping all over the dressing room and come out for rehearsal! I'll take care of everything. [walks off]"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, the stage, later. Bebe and Timmy are front and center while the others stand in a row in the background"
    },
    {
        "character": "Bebe",
        "line": "[enunciating] Water, Helen. It has a name. Oh, why can't you understand?"
    },
    {
        "character": "Timmy",
        "line": "Dehh haaa. [unimpressed looks from Cartman, Jeffrey, and Lamond]"
    },
    {
        "character": "Bebe",
        "line": "Water, Helen, Water.\n\n\n"
    },
    {
        "character": "Kids",
        "line": "She's never gonna do it. There's no way she'll ever do it.\n\n\n"
    },
    {
        "character": "Bebe",
        "line": "Helen, Helen. Water, Helen.\n\n\n"
    },
    {
        "character": "Kids",
        "line": "How can she talk if she can't hear? This is absolutely pointless!\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Okay, uh, hold it. Uh, let's hold it right there a second. [whisks himself onstage] Okay, I just want to adjust the blocking real quick. Hm-let's see. Uh, why don't we have Turkey #2 [starts moving Gobbles along] stand just a little bit more over... [puts it behind the Comedy Central logo] here. [mulls over the position] Let's see, maybe a little more up in here. [moves it a bit towards stage center] And just a wee bit over here. [Gobbles is back behind the logo, a bit] And right about... [moves Gobbles a bit back] hm'ere. [steps back] There we go. Good. [goes off stage. A cable whips out of place somewhere. A lighting fixture falls on Kenny and kills him]"
    },
    {
        "character": "Stan",
        "line": "Oh my God, they've killed Kenny!"
    },
    {
        "character": "Jeffrey",
        "line": "Whoa-aaaa [dances away]"
    },
    {
        "character": "Cartman",
        "line": "Aw, crap! I must've rigged the wrong light!"
    },
    {
        "character": "Jeffrey",
        "line": "[onstage, walks up to Kenny's corpse, then gets lyrical] Let him rest in peace. Let him rest. Why must he die?"
    },
    {
        "character": "Butters",
        "line": "[a camera follows him to the auditorium at butt level; another camera shows him entering the room] They've got special effects! [Jeffrey continues singing in the background]"
    },
    {
        "character": "Kyle",
        "line": "What Butters? [Butters meets the others onstage]"
    },
    {
        "character": "Butters",
        "line": "The kindergartners! They've got amazing stage effects. Pyrotechnics and what have yous. Why, it's a regular feast for the eyes!"
    },
    {
        "character": "Wendy",
        "line": "Oh, no!"
    },
    {
        "character": "Clyde",
        "line": "We're never gonna outdo them now! [the kids begin to chatter amongst themselves]"
    },
    {
        "character": "Tolkien",
        "line": "But what are we gonna do?"
    },
    {
        "character": "Cartman",
        "line": "[Jeffrey continues his dirge] Calm down! Calm down! We can have special effects, too. Now, I know a lot is going wrong, but we've got to stick together to make this play work! [looks at Lamond] All of us! [Lamond crosses his arms]"
    },
    {
        "character": "Jeffrey",
        "line": "—and into your hands [the kids now pay attention to him] uh he... buh... [hums, then stops singing, stares, then gets up and walks offstage]"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, the stage, later. Timmy is in another hallway trying to get Gobbles to hop through the hoop"
    },
    {
        "character": "Timmy",
        "line": "Gobbles! [Gobbles lifts his head and drops it away from Timmy] Hu-ugh, Gobbles! [they hear the door open. Timmy puts the hoop away and gathers Gobbles on his lap]"
    },
    {
        "character": "Lamond",
        "line": "[peeks in] Little boy."
    },
    {
        "character": "Timmy",
        "line": "[spins around] Timmy."
    },
    {
        "character": "Lamond",
        "line": "Yes, Tim. I feel I must speak with you. [walks up to Timmy] The others, well, they don't want you to know, but, oh, I don't know what to do. Should I tell you?"
    },
    {
        "character": "Timmy",
        "line": "T-Timmih? [a bit afraid]"
    },
    {
        "character": "Lamond",
        "line": "I feel I'm the only one who can be honest with you. [genuflects next to Timmy] The animal shelter is on its way to...take your turkey away from you."
    },
    {
        "character": "Timmy",
        "line": "Gobbles? [scared]"
    },
    {
        "character": "Lamond",
        "line": "You see, they don't allow children in your... situation... to have wild animals as pets. You can't take him running, you can't take care of him. They... have to take it away."
    },
    {
        "character": "Timmy",
        "line": "Gobbles!"
    },
    {
        "character": "Lamond",
        "line": "They take wild pets away from people like you... and hand them over for experiments. And they're shocked, dissected, and flayed while they're still alive. And no matter where you go, the shelter people will find you. The only way for that turkey to avoid years of torture is for you to... let him go. Back into the wild. [listens for something] Oh no! Here they come now! [two men round the corner] Quick, go! And set your turkey free! I'll try to stall them."
    },
    {
        "character": "Timmy",
        "line": "[turns and wheels away from the oncoming men] T-tim-mih."
    },
    {
        "character": "Installer",
        "line": "Eh, excuse me, we're here to install the water effects for the musical?"
    },
    {
        "character": "Lamond",
        "line": "Uh, the stage is right through there."
    },
    {
        "character": "Installer",
        "line": "Thanks. [he and his partner walk towards the stage. Lamond looks after them as they leave]"
    },
    {
        "character": "",
        "line": "South Park, Cartman's house, night. Cartman is at his desk in his room rewriting a song."
    },
    {
        "character": "Cartman",
        "line": "Alright, got to write the new lyrics. Lemme see. [writes] no [writes] No. [writes] NO! [writes] God-damnit [takes the sheet and squeezes it into a wad]"
    },
    {
        "character": "Jeffrey",
        "line": "[enters the room] How is it going, Eric?\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "Terrible! [turns and faces Jeffrey] I can't write the lyrics for the third act! Nothing's coming to me."
    },
    {
        "character": "Jeffrey",
        "line": "Well, you know in theater sometimes, we try different tricks to get the creative juices flowing."
    },
    {
        "character": "Cartman",
        "line": "Like what?"
    },
    {
        "character": "Jeffrey",
        "line": "Let's see. [closes the door behind him] Helen Keller was blind and deaf. [walks to Cartman's side desk] Perhaps you should see what it is like. Deprive yourself of your senses and see what plays inside your mind. Here. [turns Cartman around and puts a blindfold on him.]"
    },
    {
        "character": "Cartman",
        "line": "Hey, that's not a bad idea."
    },
    {
        "character": "Jeffrey",
        "line": "[puts some headphones on him] Just relax. Just try to let your mind wander and let the juices flow... [a long pause. then a series of images present themselves]"
    },
    {
        "character": "",
        "line": "First, the portrait of Helen Keller. Then nothing. Then Helen Keller again, then a banana split, then Helen again, then a human skull. Cartman is disturbed. Then Helen, the skull, another skull, Helen, a mummy whose hair moves a bit, bombs dropping from planes, a sinister clown, the banana split, a body being prepped for operation, the banana split, a wall with \"GO DEAD BE DEAD\" written in blood on it, a Russian show of military might, Helen, animals tearing at something, a riot, a close-up of a snake, an atomic bomb test, a lasik experiment. Cartman. The first skull, \"GO DEAD BE DEAD\", the skull, the experiment, the skull, the experiment, a woman wailing in the flames, open-heart surgery, a rat eating a dead rat, the banana split, a mouth being pulled open, Helen, a Nazi troop march, a fireman in an inferno, the Hindenburg bursting in flame, an alien opening its mouth and the camera zooms in... Cartman takes the blindfold and headphones off"
    },
    {
        "character": "Cartman",
        "line": "Oh, man!"
    },
    {
        "character": "Jeffrey",
        "line": "Well, did you see anything?"
    },
    {
        "character": "Cartman",
        "line": "No, just the same old crap I always see when I close my eyes."
    },
    {
        "character": "Jeffrey",
        "line": "...Oh, that's too bad."
    },
    {
        "character": "Cartman",
        "line": "Wait. I've got it! The perfect setup for when Helen Keller's pet turkey jumps through the hoop of fire! [starts writing furiously] Yes! Yes! I have it now!"
    },
    {
        "character": "",
        "line": "South Park, residential street, day. Timmy rolls along dejected and turns to another street. He remembers what Lamond said as he rolls"
    },
    {
        "character": "Lamond",
        "line": "[his head appears beside Timmy] The only way for that turkey to avoid years of torture is for you to... let him go... [fades as it echoes] let him go... let him go...[the head disappears]"
    },
    {
        "character": "Timmy",
        "line": "[stops and lets Gobbles go] Gobbles! [points away so Gobbles could leave. Gobbles moves his head in that direction, but nothing else] Gobbles!! [turns around and rolls away. Gobbles follows him and gobbles. Timmy turns around again and face Gobbles] Gobbles. Gobbles! [points away again, turns and rolls away. Gobbles follows some more] Timmih. [a tear appears in his eye] Timmih, Gobbles. [turns away and rolls off, leaving Gobbles alone. The camera pulls back and moves to the first house on the right side. A man and son sit on their doorway]"
    },
    {
        "character": "Boy",
        "line": "Daddy, why did Mommy leave and go to heaven?"
    },
    {
        "character": "Father",
        "line": "She didn't want to, Kevin. She... had no choice."
    },
    {
        "character": "Boy",
        "line": "But I miss her. [father and son start to cry. The camera moves to a bench on which two men sit]"
    },
    {
        "character": "Elderly man",
        "line": "[his middle-aged son comforts him] I could have so much more with my life, son. I've wasted it. I've wasted it, not ever telling you and Mark that I love you. [both men start to cry. The camera moves to Heidi Turner crying over a dead dog.]"
    },
    {
        "character": "Heidi",
        "line": "Robby! Robby, no! [cries uncontrollably. The camera moves to a couple in discord. the woman is sad]"
    },
    {
        "character": "Woman",
        "line": "...Because now, every time I look at you [he tries to console her], I see her! [she swats his arm away] I have to move on."
    },
    {
        "character": "Man",
        "line": "Kelly, please. Don't do this. I'm sorry."
    },
    {
        "character": "Kelly",
        "line": "Then why did you do it?? [breaks down and sobs]"
    },
    {
        "character": "Man",
        "line": "I don't know! [beings to cry, too, and rests his head on her shoulder. The camera moves to a lady with something to say]"
    },
    {
        "character": "Lady",
        "line": "Have you done the right things in your life? [the camera looks up into the sky as it fades into night]"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, Wednesday, play day. The parents arrive and take seats. Mrs. Marsh finds Mrs. Broflovski siting in the audience already, and walks up to her"
    },
    {
        "character": "Sharon",
        "line": "Hi, Sheila."
    },
    {
        "character": "Sheila",
        "line": "Hello, Sharon. Where's your husband?"
    },
    {
        "character": "Sharon",
        "line": "Oh, he's in the back. He set up a video camera so he can tape the performance."
    },
    {
        "character": "Sheila",
        "line": "Oh, so did Gerald. [indeed, all the husbands are in the back of the theatre with video cameras at the ready]"
    },
    {
        "character": "Gerald",
        "line": "Oh yeah, I got a great angle here."
    },
    {
        "character": "Randy",
        "line": "Ey, Gerald, maybe after the show we can make copies of each other's tape so we have both."
    },
    {
        "character": "Gerald",
        "line": "Good idea."
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, stage. The kids mill around backstage"
    },
    {
        "character": "Kyle",
        "line": "So wait. Do we do that spin-around thing on the last beat?"
    },
    {
        "character": "Stan",
        "line": "No, it's on the 'en or the 'ay. [Timmy rolls slowly in ]"
    },
    {
        "character": "Kyle",
        "line": "You ready for the big show, Timmy?"
    },
    {
        "character": "Stan",
        "line": "Where's Gobbles, Timmy?"
    },
    {
        "character": "Timmy",
        "line": "Gobbles."
    },
    {
        "character": "Cartman",
        "line": "[cheerfully] Alright everybody, let's take our places!"
    },
    {
        "character": "Kyle",
        "line": "Cartman, where's Timmy's turkey?"
    },
    {
        "character": "Cartman",
        "line": "I don't know. [Stan and Kyle cross their arms] I don't know, you guys! Alright, maybe I tried to have Timmy's turkey crushed by a stage light, but I didn't do anything else. I'm not an asshole."
    },
    {
        "character": "Lamond",
        "line": "You're going to be brilliant, you sexy, gorgeous turkey. With that other meddling animal out of the way, you'll steal the show! [Alinicia gobbles]"
    },
    {
        "character": "",
        "line": "South Park, business district, day. Gobbles walks along the curb as cars zip by, then decides to cross the street. A car zips be and Gobbles steps back. The camera angle shows Gobbles' view of the car that almost ran over him"
    },
    {
        "character": "Driver",
        "line": "[walks up to collect Gobbles] Well, well, what are doing out here? [picks him up] You shouldn't be out walking the streets. [opens his truck, tosses Gobbles in, and rushes to the cab of the truck. The side of the truck reads, \"Uncle Joe's Fresh Turkey. Succulent and Juicy Turkeys,\" with a plump turkey in the background. The driver takes off quickly]"
    },
    {
        "character": "",
        "line": "Uncle Joe's Fresh Turkey truck, trailer section. Gobbles finds himself along near the doors and looks up to see a group of turkeys looking back at him. Then the turkeys look up, and Gobbles does also. What they see is a sign that reads, \"Thanksgiving Turkey. Killed Humanely.\" Gobbles looks at the turkeys, who look back, and then drops his head"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, stage. Mr. Garrison is present to introduce the show."
    },
    {
        "character": "Mr. Garrison",
        "line": "Hello, parents, and welcome to the 13th annual South Park Thanksgiving Pageant."
    },
    {
        "character": "Mr. Mackey",
        "line": "[bored, rests his head on his hand] Every year the fourth graders do \"The Miracle Worker,\" and every year I have to sit and watch it."
    },
    {
        "character": "Principal Victoria",
        "line": "Yeah, I swore that if I had to see it one more time, I'd put a bullet in my head. [demonstrates with her finger] But luckily I got really stoned before I came."
    },
    {
        "character": "Mr. Garrison",
        "line": "And now, here it is. The touching story of Helen Keller, \"The Miracle Worker.\" [walks off. The parents are seen clapping, and then the curtains open up to reveal kids dancing and doing acrobatic feats]"
    },
    {
        "character": "Kids",
        "line": "Helen Keller, Helen Keller, blind as a bat.She can't hear us speak. What's up with that?\n\n\n"
    },
    {
        "character": "Sheila",
        "line": "This is \"The Miracle Worker\"?"
    },
    {
        "character": "Sharon",
        "line": "I... well... maybe. [more dancing follows]"
    },
    {
        "character": "Principal Victoria",
        "line": "Oh, oh, haha. Wow."
    },
    {
        "character": "",
        "line": "Uncle Joe's Fresh Turkey factory. The truck backs up to building 2B and dumps its cargo into a chute. The turkeys tumble down into a holding room and recover. Gobbles ends up there and looks up at a sign: \"Our Turkeys are killed... HUMANELY!!!\""
    },
    {
        "character": "Wrangler",
        "line": "[a vertical door rises and he directs the turkeys] Come on. Yaah! Move it!"
    },
    {
        "character": "",
        "line": "the turkeys leave the room and enter another one. A movie screen faces them. Another worker appears and closes the door behind the turkeys. The turkeys remain excited until a movie comes up with sweeping views of nature. The turkeys calm down, and a view of clouds zipping along the sky follows. Then waterfalls. The lights come up and a giant saw comes out and chops the heads off all the turkeys save one. The saw rises. Only Gobbles survives, and he keeps his head low as he finds a clearing. A large board appears and pushes the decapitated turkeys out an opening on the opposite wall. The bodies are then lifted up and returned to the truck they came in, but the building they come out of is 3C. Gobbles falls off the truck and ends up on the floor. Jimbo and other South Park hunters pass by and notice"
    },
    {
        "character": "Jimbo",
        "line": "Holy crow. Look, boys! A real live wild turkey! [Gobbles sees the hunters and tries to run away.] It's tryin' to outsmart us! Come on, fellas! [they pursue Gobbles]"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, stage. The audience watches as Wendy"
    },
    {
        "character": "Wendy",
        "line": "John, come quick! Our little baby's very sick\n[Stan rushes in]\nWhen I pout she doesn't flinch, and when she doesn't move an inch.\n\n\n"
    },
    {
        "character": "Stan",
        "line": "No, that cannot be. Honey you are scaring me.\n\n\n"
    },
    {
        "character": "Wendy",
        "line": "She can't see hear, John. Watch. Helen!"
    },
    {
        "character": "Stan",
        "line": "Helen!"
    },
    {
        "character": "Wendy",
        "line": "...Helen! [the audience stares in disbelief]\nI think our baby's deaf and blind. Oh no!\n\n\n"
    },
    {
        "character": "Stan",
        "line": "Oh no! [they lean on each other]"
    },
    {
        "character": "Wendy",
        "line": "Oh no! Oh no!!! [both collapse to the floor, and the curtains close. Alinicia trots in and gets the spotlight. She then performs her feats. She hops up on a small stand, walks a tightrope, and hops off the stand at the other end. She hops through a hoop and lands on a third stand, then pulls the cover off a sign introducing the next scene: \"Scene 2, Eight Years Later\" and takes a bow. A few people clap]"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, backstage. Timmy and Lamond watch Alinicia perform."
    },
    {
        "character": "Lamond",
        "line": "She's brilliant! Everyone loves her so far. [the two workers approach him]"
    },
    {
        "character": "Cartman",
        "line": "[rushes up] Hey, the fountains you guys installed are shorting out some of our lights."
    },
    {
        "character": "Installer",
        "line": "Look, we're only here to do the water effects. We're not in charge of electrical. That's a different union."
    },
    {
        "character": "Timmy",
        "line": "[looks at Cartman] Timmih?"
    },
    {
        "character": "Cartman",
        "line": "Union Mafia bastards! [Timmy looks at Lamond in fear]"
    },
    {
        "character": "Lamond",
        "line": "Oh, heh. Look, Tim, all is well in love and theatre, right? Haha."
    },
    {
        "character": "Timmy",
        "line": "[throws off his wig and turns to wheel away] Gobbles!! [zips out]"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, stage. Cartman rushes up to the other kids"
    },
    {
        "character": "Cartma",
        "line": "Were is Timmy?! He's on in one minute!"
    },
    {
        "character": "Kyle",
        "line": "He's gone, dude! Butters says he saw him leave."
    },
    {
        "character": "Cartman",
        "line": "Leave?? Leave?? But nobody else knows the part of Helen Keller!"
    },
    {
        "character": "Jeffrey",
        "line": "[approaches the boys] I do. I know the part. If I must, I can go on."
    },
    {
        "character": "Cartman",
        "line": "...Alright, fine! Get in costume!"
    },
    {
        "character": "",
        "line": "South Park, business district, day. Timmy wheels down the street past Tele's calling out..."
    },
    {
        "character": "Timmy",
        "line": "Gobbles! Gobbles!"
    },
    {
        "character": "",
        "line": "The barn. Gobbles returns to his prior home, and the hunters follow him there"
    },
    {
        "character": "Jimbo",
        "line": "[prepares his rifle] There it is! [three other men prepare their rifles] Hey, hey! I saw it first! I get the first shot! [aims his rifle and spots the turkey] Here, turkey turkey. [focuses on the turkey]"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, stage. Stan, Kyle, Wendy, and Jeffrey are in costume"
    },
    {
        "character": "Wendy",
        "line": "There is nothing we can do for our poor daughter. We cannot reach her."
    },
    {
        "character": "Jeffrey",
        "line": "[lyrically] I cannot hear what they are saying. I cannot tell them how I feel [in disbelief]I think our baby's deaf and blind. Oh no!\n\n\n"
    },
    {
        "character": "Cartman",
        "line": "What the hell is he doing? Helen Keller isn't supposed to sing!"
    },
    {
        "character": "Jeffrey",
        "line": "If only I could say things that go on in my mind. [in disbelief]\nI think our baby's deaf and blind. Oh no!\n\n\n"
    },
    {
        "character": "Principal Victoria",
        "line": "[touched] Oh, wow."
    },
    {
        "character": "",
        "line": "The barn. Jimbo still has Gobbles in his sights"
    },
    {
        "character": "Jimbo",
        "line": "That's it. Thaaat's it! [about to pull the trigger]"
    },
    {
        "character": "Timmy",
        "line": "Gobbles! [sees Jimbo and is alarmed]"
    },
    {
        "character": "Jimbo",
        "line": "Gotcha!"
    },
    {
        "character": "Timmy",
        "line": "[Slow motion, jumps out of his chair and dives towards] Gobbles! [flies through the air. Jimbo fires his rifle, and Timmy falls on the floor limp. Jimbo sees what he's done, and all the hunters lower their rifles. Gobble's head pops up behind Timmy. The other hunters whistle and move away slowly, leaving Jimbo and Ned alone. Gobbles walks up to Timmy and nudges him] T-timmih? [Gobbles pokes him] Gobbles? [slowly comes to, then quickly sits up] Gobbles! Haaaah. [brushes himself off and gathers Gobbles up in his arms]"
    },
    {
        "character": "Jimbo",
        "line": "[rushes up to Timmy and is relived that he's okay] Aw, thank God you're alright, kid. [goes down on one knee] It was an accident, I swear. Uh, is there any way we can make it up to you?"
    },
    {
        "character": "Timmy",
        "line": "[determined] Timmih."
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, stage. Bebe, and Jeffrey are in costume. Bebe pumps water onto Jeffrey's hand"
    },
    {
        "character": "Bebe",
        "line": "Yes, that's it. [Jeffrey keeps his hand under the water] That's it, Helen. Water! WA-TER!"
    },
    {
        "character": "Jeffrey",
        "line": "Wawa."
    },
    {
        "character": "Bebe",
        "line": "She did it!"
    },
    {
        "character": "Kids",
        "line": "[in the background, come forward] She did it! She did it! Water! Water water aaaaaaaa!\nWater, Helen, Water.\nWe can't believe she did it. The dumb kid really did it.\nWater, Helen, Water.\n\n\n"
    },
    {
        "character": "Jeffrey",
        "line": "Now that I can communicate the world is not so cold and dark. [Cartman slaps his head and the waterworks begin]\n\n\n"
    },
    {
        "character": "Kids",
        "line": "[slowing] Water, Helen, Aaa-aaaaaa![the waterworks go up real high and two fountainheads crash into each other]\n\n\n"
    },
    {
        "character": "Lamond",
        "line": "[prepping Alinicia] Here it comes, angel! Your big finale! The audience is going to go wild! [a shadow enters the scene and Lamond looks up. He sees Gobbles and an angry Timmy with arms crossed glaring at him] Oh. Back already? Don't worry. Maynard covered your part flawlessly."
    },
    {
        "character": "Timmy",
        "line": "Timmih! [the hunters gather and take aim at Alinicia]"
    },
    {
        "character": "Jimbo",
        "line": "Turkey shoot! [the hunters fire away and decimate Alinicia. Her blood spurts all over Lamond, who shields his eyes.]"
    },
    {
        "character": "Lamond",
        "line": "[He falls on one knee at the horror] Alinicia! Jesus, no!"
    },
    {
        "character": "Timmy",
        "line": "Aaaa, Timmih!"
    },
    {
        "character": "Cartman",
        "line": "[walks up with Kyle] Okay, we're ready for the- [stops in his tracks and stares at the dead Alinicia.] What the hell did you assholes do?! This is supposed to be the big finale where the turkey jumps through the ring of fire!"
    },
    {
        "character": "Kyle",
        "line": "[steps forward and points] Hey, look! [onstage, Gobbles approaches the ring of fire and steps through it. The kids grin immediately]"
    },
    {
        "character": "Principal Victoria",
        "line": "[in awe] Oh. Oh, wow! WOWuh! [starts to clap. The audience soon follows]"
    },
    {
        "character": "Cartman",
        "line": "[exults] They loved it! They LOVED it!"
    },
    {
        "character": "Timmy",
        "line": "Gobbles!"
    },
    {
        "character": "",
        "line": "The South Park Community Theatre, stage, night. Mr. Garrison is onstage to introduce the last skit of the night"
    },
    {
        "character": "Mr. Garrison",
        "line": "And finally tonight, parents, we have the South Park Kindergarten class. Their play is titled, \"Thanksgiving, Mon Ami.\""
    },
    {
        "character": "Stan",
        "line": "Okay, here we go. [the kids are still backstage, but in their street clothes]"
    },
    {
        "character": "Kyle",
        "line": "Dude, it just can't be better than ours. It just can't be."
    },
    {
        "character": "Kindergartners",
        "line": "[four little pilgrims enter singing badly to a long table in front of a cabin and a tipi]\nIt's getting dinner. Let's all eat.\nE I E I O.\nAnd on that dinner we'll invite some Indians\nE I E I O.\n[four little Indians appear and take their seats at the table]\nWith an Indian here and an Indian there\nEverywhere an Indian, Indian. Uh thank, thank-\n[something pops by the middle of the table...]\n\n\n"
    },
    {
        "character": "Pilgrim Girl",
        "line": "[runs off] Aaaaaaa!"
    },
    {
        "character": "Kindergartners",
        "line": "Happy Thanksgiving. [another kindergartner wheels a horse prop onstage. The curtains then close]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Alright, see you next year, parents. [a hush falls over the audience and the actors backstage]"
    },
    {
        "character": "Cartman",
        "line": "That's it?"
    },
    {
        "character": "Stan",
        "line": "We worked our asses off to compete with that?!"
    },
    {
        "character": "Kyle",
        "line": "Butters told us their play was awesome! [the kids move away from Butters a bit]"
    },
    {
        "character": "Butters",
        "line": "...Wow, did you see that? They had a horse, too!"
    },
    {
        "character": "Timmy",
        "line": "Gobbles, Timmy!"
    }
]