[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "The camera pans across a nicely appointed study, rests a bit, and \"South Park Classics\" appears on screen as a classical piece plays"
    },
    {
        "character": "Narrator",
        "line": "[seated in an armchair reading a book] Aaah. [looks at the camera] Dickens. The imagery of cobblestone streets, cragging London buildings, and nutmeg-filled Yorkshire puddings. [closes the book] Hello, I'm a British person. For years now, the character Pip has been featured prominently in the American show, South Park. However, many Americans don't realize where Pip came from. He's the prowling little adorable Englishman from Charles Dickens' timeless classic, \"Great Expectations\" [displays the title] And so tonight, the makers of South Park have agreed to take a break from their regular show, and instead present the prestigious Dickens tale in its entirety from beginning to end. Indeed, after watching this show, you'll know the timeless classic as if you'd... read the Cliff Notes themselves. Our story is set in England, in the small town of Drop-A-Chair-Upon-Top-Snot, [the town is now shown, with Pip walking up the street from a distance] where a young blond-haired boy named Pip was on his way to see his parents."
    },
    {
        "character": "",
        "line": "Drop-A-Chair-Upon-Top-Snot, day. Pip leaves the town, crosses an open field, enters an enclosed lot and stops right in front of the camera"
    },
    {
        "character": "Pip",
        "line": "[holding a bunch of flowers] 'Ello Mom. 'Ello Dad. It certainly is nice to see you again. [before him are two tombstones. They are of his parents, Phillip and Georgina Pirrip. Pip is in the town graveyard.] Don't worry. Sister is still taking very good care of me. She just loves to smack me in the face and tell me I'm worthless. O, we have such fun together. [a wind comes up and begins to howl. Pip takes notice] But it's getting dark, Mom and Dad. I'll see you again soon. [walks off, but there's a fear in him as he walks through the graveyard. He has his hands in his coat pockets. He is snatched up from behind] Wa-a-ah!"
    },
    {
        "character": "Escaped Convict",
        "line": "Wha' are you doin' 'ere, you little whippersham!"
    },
    {
        "character": "Pip",
        "line": "[fearless] Oh, hello. Why, you look like an escaped convict. Did we breaky-wakys out of prison? [the surprised man lets him down] Oh dear! But you're shackled. Here, let me help you. [whips out some bolt cutters]"
    },
    {
        "character": "Escaped Convict",
        "line": "Wha' are you doin' wit' those?"
    },
    {
        "character": "Pip",
        "line": "I'm an apprentice blacksmith. [snips the arm and leg shackles in two] There you are. [puts the bolt cutters away and whips out some food] And here's a sandwich. You must be starving! [the man takes the sandwich, then walks away]"
    },
    {
        "character": "Escaped Convict",
        "line": "[stops and turns] Here. W-why are you easy to help me?"
    },
    {
        "character": "Pip",
        "line": "Well, it's not for me to judge you, sir. We are all the same. [the man turns and walks away] Don't quite all smell the same, I'm afraid. [walks out of the graveyard towards his residence, a rambling one-story shack. The sound of smithing is heard in the background]"
    },
    {
        "character": "Mrs. Joe",
        "line": "[sees him enter and grabs him by the scarf] Pip, where 'ave you been?!"
    },
    {
        "character": "Pip",
        "line": "Waaah! [is whipped towards the opposite wall, which he hits hard, but he recovers instantly] Lovely day, isn't it?"
    },
    {
        "character": "Mrs. Joe",
        "line": "What the hell's lovely about it?! [to someone else - a burly man working on some metal] Joe, teach this boy some bloody cynicism!"
    },
    {
        "character": "Joe",
        "line": "I don't know about that. I just thought I'd keep to me blacksmithing. [looks at his project] Ey, look! I've made me a metal fire poker. [holds it up]"
    },
    {
        "character": "Mrs. Joe",
        "line": "A lot of bloody good a fire poker's gonna do while I'm starvin' to death! Why don't you make us some bloody food to eat!"
    },
    {
        "character": "Joe",
        "line": "[finishes another item and sets down his hammer] Alright. Look 'ere, I made me a metal orange. [shows it off]"
    },
    {
        "character": "Mrs. Joe",
        "line": "STOP your metal orange, you bastard! You never want a tablespoon of nigh'ingale droppin's, you me'al-poundin' fairy! [Pip is shown] And you! Why don't you ge' a job?! You're eight years old now!"
    },
    {
        "character": "Joe",
        "line": "[finishing yet another project] Oh, lookie heeah! [holds up a newspaper] I've gone and made a metal newspaper!"
    },
    {
        "character": "Mrs. Joe",
        "line": "Shut up, you silly lip! What are we supposed to do with a metal newspaper?"
    },
    {
        "character": "Joe",
        "line": "Well, for starters we can look in the want ads and see if we can find Pip a job. Ohhh, lookie here! Young man wanted for paid position!"
    },
    {
        "character": "Mrs. Joe",
        "line": "Where? [Joe shows her the paper]"
    },
    {
        "character": "Pip",
        "line": "Where?"
    },
    {
        "character": "Mrs. Joe",
        "line": "\"Havisham residence seeks young boy to play with lonely daughter. Will pay up to...\" TWENTY QUID A DAY??"
    },
    {
        "character": "Pip",
        "line": "That's a lot of [hops] money-loney."
    },
    {
        "character": "Joe",
        "line": "You can keep a little girl company for 20 quid a day, Pip. And Old Mrs. Havisham is the wealthiest woman in the town. [Mrs. Joe walks away]"
    },
    {
        "character": "",
        "line": "The Havisham Residence is shown from the gates, next day."
    },
    {
        "character": "",
        "line": "The South Park Classics study. The British is seated in an armchair reading a book"
    },
    {
        "character": "Narrator",
        "line": "Well, the very next day, Pip went to Old Ms. Havisham's house to inquire about the job. [Pip rings the door bell pulley at Havisham Estate, then a shot of the narrator] and it was there that he met the girl of his dreams."
    },
    {
        "character": "",
        "line": "A girl approached the gate at the Havisham Residence. She's got flowing blonde hair and a bowler for a hat"
    },
    {
        "character": "Girl",
        "line": "Who are you?! [there's venom in her voice]"
    },
    {
        "character": "Pip",
        "line": "...I've come to answer the want ad."
    },
    {
        "character": "Girl",
        "line": "Is that so, you smelly little bastard?!"
    },
    {
        "character": "Pip",
        "line": "[jarred] What??"
    },
    {
        "character": "Girl",
        "line": "[opens the gate and lets him in] This way, you pathetic squirt of vaginal discharge! [leads him to the entrance and through the front doors, then to their left] This way, you beef-witted shriveled-up monkey's penis. [leads him up the grand stairway] Up here, you gamy mass of baby vomit! [the place suffers from neglect, as spiderwebs hang from the chandeliers and walls around the mansion. The windows are covered over with paper. The girl leads Pip down the hall upstairs] In here."
    },
    {
        "character": "Pip",
        "line": "Eho. After you, miss."
    },
    {
        "character": "Girl",
        "line": "I'm not going in there, you stupid puddle of a homeless man urine!"
    },
    {
        "character": "",
        "line": "The Havisham Estate, upstairs. Pip enters a grand dining room in which everything is covered, and has been for a long time. He scans the room until a voice gets his attention."
    },
    {
        "character": "Ms. Havisham",
        "line": "[an elderly lady still in wedding veil] Who is that?"
    },
    {
        "character": "Pip",
        "line": "I've come to answer the want ad, ma'am."
    },
    {
        "character": "Ms. Havisham",
        "line": "[beckons] Come closer. Look at me. [Pip closes the door and approaches] Does it frighten you to look upon a woman who has not seen the sun in over 20 years?"
    },
    {
        "character": "Pip",
        "line": "Oh, no, no! You you sort of look upon one when you have not seen the sun for over 20 years quite a lot these... days."
    },
    {
        "character": "Ms. Havisham",
        "line": "I sometimes have sick fancies. [puts her hands together] And I have a fancy I should like to see someone play. So, play. Play."
    },
    {
        "character": "Pip",
        "line": "[not sure what she wants] Um. [begins to dance. The girl enters, glances at him, then continues to Ms. Havisham]"
    },
    {
        "character": "Ms. Havisham",
        "line": "Estella, play with this boy."
    },
    {
        "character": "Estella",
        "line": "[the blonde girl] With HIM? [Pip dances faster] But he's just a commoner!"
    },
    {
        "character": "Ms. Havisham",
        "line": "[leans over and whispers] But, you can break his heart."
    },
    {
        "character": "Estella",
        "line": "...Alright, boy, let us play."
    },
    {
        "character": "Pip",
        "line": "Righty-o. What are we going to play?"
    },
    {
        "character": "Estella",
        "line": "[walks over to a wood pile, gets a log, and brings it with her] We're going to play a little game called, \"Smack the Blond Boy In the Head With a Large Log.\""
    },
    {
        "character": "Pip",
        "line": "[hops excitedly] Oh, yes! My sister and I play that game at home all the time! [gladly bows to Estella] Who will go first? [Estella is taken aback by this gesture, as is Ms. Havisham]"
    },
    {
        "character": "Estella",
        "line": "[frustrated] Oh, you stupid pathetic boy! [drops the log and rushes out of the room unnerved. Pip looks up quizzically]"
    },
    {
        "character": "Ms. Havisham",
        "line": "What do you think of her?"
    },
    {
        "character": "Pip",
        "line": "Well, uh... I think she's very pretty."
    },
    {
        "character": "Ms. Havisham",
        "line": "Hm-m-m. What else?"
    },
    {
        "character": "Pip",
        "line": "I think she's rather insulting."
    },
    {
        "character": "Ms. Havisham",
        "line": "Hm, you quite fancy her, don't you? Come back again next week. We shall \"play\" some more. [Pip turns and exits the room.]"
    },
    {
        "character": "",
        "line": "The blacksmith's house, night. Pip returns to his sister's place and gets ready to bed for the night. He falls asleep"
    },
    {
        "character": "Narrator",
        "line": "[Off-screen] That night, Pip spent all his sleeping hours unable to get Estella's beautiful face out of his mind."
    },
    {
        "character": "Dream Estella",
        "line": "Stop dreaming about me, you slow-witted rectal belch!"
    },
    {
        "character": "Narrator",
        "line": "Day after day Pip visited Estella. Sometimes they would play, sometimes they would talk. But every single day Pip's love for Estella grew."
    },
    {
        "character": "",
        "line": "The Havisham Estate, garden, day. Estella is whacking Pip over the head with her log. Twice she does it, then tries a third time, but can't"
    },
    {
        "character": "Pip",
        "line": "[stands up straight] Don't you wanna play anymore?"
    },
    {
        "character": "Estella",
        "line": "[tosses her log away] Boy, do you still think I'm pretty? [draws near]"
    },
    {
        "character": "Pip",
        "line": "Oho. Well, yes, miss."
    },
    {
        "character": "Estella",
        "line": "And, do you still think I'm insulting?"
    },
    {
        "character": "Pip",
        "line": "Oh, um, not so much as before. [slapped by Estella] Ow!"
    },
    {
        "character": "Estella",
        "line": "I hate you! You're an oozing, painful hemorrhoid that belches pus!"
    },
    {
        "character": "Pip",
        "line": "[exasperated. puts hands in coat pockets] Oh, dear."
    },
    {
        "character": "Estella",
        "line": "You may kiss me if you like. [offers her cheek. He looks, then kisses her on the cheek. She softens] Come. Let us walk in the daisy garden. [she leads him past a fountain in which a boy is splashing about merrily]"
    },
    {
        "character": "A Boy",
        "line": "Oh, what fun it is to splash about in the fountain! [points at Pip] You there, the prowling little boy! I bet you can't jump on my back! [shows Pip his back] Go on, then. Try and jump on my back!"
    },
    {
        "character": "Pip",
        "line": "Who is that?"
    },
    {
        "character": "Estella",
        "line": "Just another playmate hired to amuse me. You didn't think you were the only one, did you?"
    },
    {
        "character": "Pip",
        "line": "Oh I... rather thought I was."
    },
    {
        "character": "Estella",
        "line": "Oh, you silly small-testicled boy. Come, let us walk through the rose garden. [takes his hand and leads him onward]"
    },
    {
        "character": "",
        "line": "The Havisham Estate, exterior. The camera looks at the second floor, focusing on Ms. Havisham"
    },
    {
        "character": "Ms. Havisham",
        "line": "Yes, good. She will break his pathetic heart into a million pieces."
    },
    {
        "character": "",
        "line": "The South Park Classics study. The British Person resumes narrating"
    },
    {
        "character": "Narrator",
        "line": "Well, what a spot poor Pip was in. He was hired to be the friend of the very harsh and beautiful Estella. And although she treated him like dirt, or perhaps because she treated him like dirt, Pip found himself more in love with the little girl each and every day. [excitedly] Oh, bless him! Isn't he lovely?? [the cheer vanishes] But, isn't it sad? Because Pip knew that someone as sophisticated and as wealthy as Estella could never love him, for he was just a simple blacksmith's apprentice."
    },
    {
        "character": "",
        "line": "The blacksmith's house, night. Joe is working on another creation. Pip watches"
    },
    {
        "character": "Joe",
        "line": "[hammering away] And so you bang on this side, and bang on that side, and there you have it. [holds up some steel dice and hands them to Pip.] Your very own metal fuzzy dice."
    },
    {
        "character": "Pip",
        "line": "[takes the dice] Yes. I see. [walks to a chair and sits in it] Hoh, lovely."
    },
    {
        "character": "Joe",
        "line": "Eeyyyy, what's all this, Pip?"
    },
    {
        "character": "Pip",
        "line": "Joe, do you know anything about girls?"
    },
    {
        "character": "Joe",
        "line": "[resumes hammering] Sure! They're those things with vaginas in them."
    },
    {
        "character": "Pip",
        "line": "[blank look then] But, do you know anything about them? About how they work."
    },
    {
        "character": "Joe",
        "line": "[pauses and looks back at Pip] Oh, I don't know about that. I just like to keep to me blacksmithin'. [begins to hammer more vigorously]"
    },
    {
        "character": "Pip",
        "line": "Do you think that a girl who is rich and educated would ever want to be with a blacksmith?"
    },
    {
        "character": "Joe",
        "line": "Oh. D'ooooh. No, I don't think so, Pip. [a knock is heard at the door] Who could that be? [goes to answer the door. A lawyer, with cane and tall hat, addresses him]"
    },
    {
        "character": "Lawyer",
        "line": "Joe, the blacksmith?"
    },
    {
        "character": "Joe",
        "line": "The same."
    },
    {
        "character": "Lawyer",
        "line": "I'm a lawyer from London in search of a young lad named Pip."
    },
    {
        "character": "Pip",
        "line": "I'm Pip, sir."
    },
    {
        "character": "Lawyer",
        "line": "Mr. Blacksmith, I've been sent here to offer you a reasonable sum of money in exchange for your apprentice. [walks over to Pip]"
    },
    {
        "character": "Joe",
        "line": "Oh, well, uh Pip's not for sale, sir."
    },
    {
        "character": "Lawyer",
        "line": "I have a client who wishes to give this bright child a future. Anything he desires. [Joe approaches] Do you still object?"
    },
    {
        "character": "Joe",
        "line": "Heaven forbid I should stand in the way of Pip's future, but-"
    },
    {
        "character": "Lawyer",
        "line": "He will one day inherit a handsome property. But the owner of that property wants him first to travel to London and learn to be a gentleman."
    },
    {
        "character": "Joe",
        "line": "That's great news! [Pip grins]"
    },
    {
        "character": "Lawyer",
        "line": "There's only one condition, Pip. Your benefactor wishes to remain anonymous."
    },
    {
        "character": "Pip",
        "line": "Oho. But it must be Ms. Havisham!"
    },
    {
        "character": "Lawyer",
        "line": "OH OH! If you have any suspicion of who that person might be, you are to keep it in your own breast. Understood?"
    },
    {
        "character": "Pip",
        "line": "Yes sir."
    },
    {
        "character": "Lawyer",
        "line": "Then you will go to London in a week's time. [deposits some money on the table] Here's 20 sterling. Well, blacksmith, you look stunned."
    },
    {
        "character": "Joe",
        "line": "I am, sir."
    },
    {
        "character": "Lawyer",
        "line": "Then I should take my leave. [heads for the door] Good evening, gentlemen, and we shall see you in London next week, Pip. [exits]"
    },
    {
        "character": "Pip",
        "line": "Good-bye, sir."
    },
    {
        "character": "Joe",
        "line": "[picks Pip up] Pip! [close-up on a grinning Pip] A young gentleman! Of great expectations!"
    },
    {
        "character": "",
        "line": "London, a foggy night. Big Ben peals in the background. The camera pans down from the skyline to a horse-drawn carriage, which comes to a stop. Pip and the lawyer get out"
    },
    {
        "character": "Lawyer",
        "line": "You shall stay here with your roommate, Mr. Pocket. He is a distinguished young lad who will help you on your way to being a gentleman. I trust you see no problem with this?"
    },
    {
        "character": "Pip",
        "line": "None, sir."
    },
    {
        "character": "Lawyer",
        "line": "I should think not. [taps his cane on the ground twice] On up, then, and prepare for school on the morrow."
    },
    {
        "character": "Pip",
        "line": "Yes, sir. Thank you, sir. [goes to the residence and opens the front door, then enters]"
    },
    {
        "character": "",
        "line": "The Dormitory. Pip walks down the hall and finds a door with his name under that of Mr. Pocket. He is about to knock when a boy opens the door"
    },
    {
        "character": "A Boy",
        "line": "Mr. Pip? [it's the same one seen in the fountain earlier]"
    },
    {
        "character": "Pip",
        "line": "Mr. Pocket?"
    },
    {
        "character": "Pocket",
        "line": "Pray, come in! [drags him in.]"
    },
    {
        "character": "Pip",
        "line": "Thank you kindly. You do look rather familiar"
    },
    {
        "character": "Pocket",
        "line": "As do you. Perhaps we've seen each other before. As to our lodging, it's not by any means splendid. This is our sitting room - just chairs and tables and carpet and so forth. [leads Pip to the bedrooms] This is my little room - rather musty, and this is your bedroom. [displays the next room over]"
    },
    {
        "character": "Pip",
        "line": "My, how lovely."
    },
    {
        "character": "Pocket",
        "line": "Oh, what a gay time we shall have, and I do mean gay as in festive, not as in penetration of the bum. Oh, but dear me! I beg your pardon! You're holding your bags all this time! Pray, let me take them! [takes the bags to Pip's room] I'm quite ashamed!"
    },
    {
        "character": "Pip",
        "line": "Oh it's... quite alright. [remembers] Lord bless me! Why, you're the pale young man I saw at Ms. Havisham's house!"
    },
    {
        "character": "Pocket",
        "line": "Why, yes of course! You're the prowling little boy! Boy, what a smashing coincidence!"
    },
    {
        "character": "Pip",
        "line": "Perhaps, but perhaps not. Ms. Havisham is very generous indeed."
    },
    {
        "character": "Pocket",
        "line": "That old biddy? Oh, I assure you, I have nothing to do with her anymore. She's absolutely mad!"
    },
    {
        "character": "Pip",
        "line": "Well, what do you mean?"
    },
    {
        "character": "Pocket",
        "line": "Well, don't you know about Ms. Havisham's melancholy past? Dear me, it's quite a story, and should be discussed over dinner. Come! [Pip removes his hat and they walk over to the table at one corner of the sitting room, by the windows. A cooked bird and two glasses wait for them] Right, time for a smashing meal and the story of Ms. Havisham."
    },
    {
        "character": "Pip",
        "line": "Pocket, may I ask you a favor? I am desperately trying to become a gentleman! For the love of a certain girl. So, will you please tell me if I do something wrong at the table?"
    },
    {
        "character": "Pocket",
        "line": "You'll do fine, dear fellow, just fine. Now on to Ms. Havisham: She was raised by a wealthy father and grew up to be a somewhat of a spoiled brat. [Pip eats his food with his knife] And now I might mention, Pip, that in London it is not the custom to put the knife in the mouth."
    },
    {
        "character": "Pip",
        "line": "[with knife by lips] Hoh, dear, I'm terribly sorry! [lowers the knife]"
    },
    {
        "character": "Pocket",
        "line": "[joyfully] Not at all, I'm sure. [looks at Pip] Anyway, Ms. Havisham grew up to be a lovely young lady, and soon a man came along, which gets me to the cruel part of the story, merely breaking off, Pip [who has placed his napkin in his glass], to remark that a dinner napkin should never be placed into the tumbler."
    },
    {
        "character": "Pip",
        "line": "[quickly retracts it] Sorry! Sorry!"
    },
    {
        "character": "Pocket",
        "line": "[joyfully] Not at all, I'm sure. [resumes] So this man pursued Ms. Havisham closely and professed to be devoted to her. She passionately loved him back. The marriage day was fixed, the wedding dress was bought, the wedding guests were all invited, and finally the day came. But not the groom. [Pip farts] And I break from the tale now only to mention that one should never pass gas at the dinner table!"
    },
    {
        "character": "Pip",
        "line": "Oh. Excuse me."
    },
    {
        "character": "Pocket",
        "line": "Not at all, I'm sure. So the groom never showed. He simply wrote a letter, a letter that Ms. Havisham received 20 minutes before the wedding."
    },
    {
        "character": "Pip",
        "line": "At half nine, the time when she stopped all the clocks in the house."
    },
    {
        "character": "Pocket",
        "line": "But afterward she laid waste to the entire house, as you have seen it, and has never since looked upon the light of day. And the story ends, Pip, with me suggesting that one should never pull out the wee wee and check it for scabs whilst at the table."
    },
    {
        "character": "Pip",
        "line": "Terribly sorry, Pocket."
    },
    {
        "character": "Pocket",
        "line": "[joyfully] Not at all, I'm sure!"
    },
    {
        "character": "",
        "line": "The South Park Classics study. The British Person resumes narrating"
    },
    {
        "character": "Narrator",
        "line": "And so Pip spent the next several months learning how to be a gentleman. He was schooled in several languages. He was taught fencing and marksmanship, and he was shown how to dance and eat box. And after it all, after WEEKS and weeks of intense schooling, Pip was finally a full-fledged gentleman. Proud of himself, Pip decided to pay Ms. Havisham a visit, to thank her for her generosity, and to see if he was indeed, now, good enough for Estella."
    },
    {
        "character": "",
        "line": "The Havisham Estate, exterior, then interior, at the dining room."
    },
    {
        "character": "Pip",
        "line": "[enters the dining room] Good evening, Ms. Havisham. [she hasn't moved from her spot]"
    },
    {
        "character": "Ms. Havisham",
        "line": "Come closer, Pip. [he doffs his hat and approaches] My, you're quite the gentleman now, aren't you?"
    },
    {
        "character": "Pip",
        "line": "[cheerfully] Thanks to you."
    },
    {
        "character": "Ms. Havisham",
        "line": "Perhaps. Estella's been off to school as well. [Pip walks to Ms. Havisham's side] She's become quite the lady. Would you like to see a picture of her? [shows him a portrait]"
    },
    {
        "character": "Pip",
        "line": "Oh, my! She is even prettier than before. [she is shown wearing a beautiful pink dress and a makeover]"
    },
    {
        "character": "Ms. Havisham",
        "line": "Ohoh, you love her, don't you, Pip?"
    },
    {
        "character": "Pip",
        "line": "[pensive] I don't know. I mean, I think about her every day."
    },
    {
        "character": "Ms. Havisham",
        "line": "Do you know what love is, Pip? It is blind devotion, unquestioning self-humiliation, utter submission, trust and belief against yourself and against the whole world, giving up your whole heart and soul to snip it."
    },
    {
        "character": "Pip",
        "line": "Righto."
    },
    {
        "character": "Ms. Havisham",
        "line": "Love her, Pip. I developed her into what she is so that she might... be loved."
    },
    {
        "character": "Pip",
        "line": "Yes, but... where will I find her?"
    },
    {
        "character": "Ms. Havisham",
        "line": "There's a dance at the Palace tomorrow night. Estella will be there. Go and seek her out. And love her. Love her!"
    },
    {
        "character": "Pip",
        "line": "Thank you, Ms. Havisham! For everything! [heads for the door] I'm the happiest boy in the land!"
    },
    {
        "character": "Ms. Havisham",
        "line": "And if she warms to you, love her; she tears your heart into pieces. And as you get older it will tear deeper. [whispers] Lover her."
    },
    {
        "character": "",
        "line": "The South Park Classics study. The British Person resumes narrating"
    },
    {
        "character": "Narrator",
        "line": "Yes. Our young Pip had come a long way. From the apprentice of a blacksmith to a fine young gentleman of great expectations. And now he was to finally see his beloved Estella again at a Grand Ball held by the King of England, Tony Blair. It was here that Pip would finally and formally ask Estella to be his girlfriend. And all would be right with the world."
    },
    {
        "character": "",
        "line": "The Grand Ballroom at the Palace, evening. Tony Blair and wife descend the Grand Staircase as dozens of couples dance before them. The camera then pans across the scene and stops on Estella. Pip comes in from the side"
    },
    {
        "character": "Pip",
        "line": "Hello, Estella."
    },
    {
        "character": "Estella",
        "line": "Pip. [impressed] My goodness, how you've changed!"
    },
    {
        "character": "Pip",
        "line": "Yes. I've become a gentleman. May I? [signals an invitation to dance]"
    },
    {
        "character": "Estella",
        "line": "I suppose. [a waltz starts and all couples begin to dance.] So how is it that you've learned to dress and dance?"
    },
    {
        "character": "Pip",
        "line": "Well, I was sent to be schooled in London."
    },
    {
        "character": "Estella",
        "line": "Iiii see, and you no longer live with the blacksmith?"
    },
    {
        "character": "Pip",
        "line": "Oh. I see Joe once in a while. But I don't have much in common with him anymore, now that I'm a gentleman and all."
    },
    {
        "character": "Estella",
        "line": "Naturally. [overview of the Grand Ballroom]"
    },
    {
        "character": "Pip",
        "line": "[walks off to one side with Estella] It is wonderful to see you again, Estella."
    },
    {
        "character": "Estella",
        "line": "Is it? Why? [they resume dancing]"
    },
    {
        "character": "Pip",
        "line": "Because I believe I'm in love with you."
    },
    {
        "character": "Estella",
        "line": "Pip, you must know that I have no heart."
    },
    {
        "character": "Pip",
        "line": "[confidently] I think you do."
    },
    {
        "character": "Estella",
        "line": "Oh, I have a heart to be shot or stabbed in, no doubt, and if it cease to beat I should cease to be, but [sighs] you know what I mean. I have no softness there, no sympathy, sentiment."
    },
    {
        "character": "Pip",
        "line": "I see past that, Estella. I see a little girl who wants to be warm and kind."
    },
    {
        "character": "Older Boy",
        "line": "[walks up to the kids] Hey, Estella, let's get out of here."
    },
    {
        "character": "Estella",
        "line": "Alright, Steve. Just one moment. [Steve walks off]"
    },
    {
        "character": "Pip",
        "line": "Who...? Who is that?"
    },
    {
        "character": "Estella",
        "line": "That is Steve. He is seventeen and has a car."
    },
    {
        "character": "Pip",
        "line": "I see, and you... fancy this Steve fellow?"
    },
    {
        "character": "Estella",
        "line": "I should. He's my boyfriend."
    },
    {
        "character": "Pip",
        "line": "[scared] Boyfriend??"
    },
    {
        "character": "Estella",
        "line": "What's the matter, Pip?!"
    },
    {
        "character": "Pip",
        "line": "I don't understand! I did everything right! I stopped being a poor commoner! I even blew off my lovin' Joe!"
    },
    {
        "character": "Estella",
        "line": "It's... it's... the way it goes sometimes, Pip. [Steve waits for her off to the side] He's... seventeen and has a car. I'm... I'm... very [pause] I'm [pause] leaving. [walks off with Steve.]"
    },
    {
        "character": "",
        "line": "The Havisham Estate, outside, a stormy night. Pip reaches the Havisham estate and enters the front gates. He heads into the house, up the spiral staircase, and into the dining room."
    },
    {
        "character": "Pip",
        "line": "Ms. Havisham! You have to talk to Estella! She's going out with a- [a surprised look comes over his face]"
    },
    {
        "character": "Ms. Havisham",
        "line": "Well well well, if it isn't Mr. Pip. [Estella and Steve are already there, sitting behind a small table at her side, next to each other, sharing a float between them]"
    },
    {
        "character": "Pip",
        "line": "Ms. Havisham! But um..."
    },
    {
        "character": "Ms. Havisham",
        "line": "Don't they make a handsome couple, Pip? [Steve reaches for Estella's right hand with his left] Look at the way he holds her hand."
    },
    {
        "character": "Pip",
        "line": "But I don't understand. [doffs his hat] You sent me away to become a gentleman so that I could be with Estella."
    },
    {
        "character": "Ms. Havisham",
        "line": "Things aren't always as they seem, Pip. [Pip looks defeated] Oh, what's the matter? Did she... break your heart?"
    },
    {
        "character": "Pip",
        "line": "[close-up] ...Well, I suppose that if you set out to break my heart, you did a very good job of it. Because it certainly does hurt."
    },
    {
        "character": "Ms. Havisham",
        "line": "Yes. Tell me about the pain. [Estella looks distressed] Tell me about the crushing and the prickly things."
    },
    {
        "character": "Pip",
        "line": "It's... a-as if...[winces] sssomeone has a hold of my heart and isss [winces] squeezing it very tightly."
    },
    {
        "character": "Ms. Havisham",
        "line": "Yes, and it is somewhat difficult to breathe."
    },
    {
        "character": "Steve",
        "line": "Hey, wait a second. You mean that this whole thing was just a setup by your mom?"
    },
    {
        "character": "Ms. Havisham",
        "line": "[turns her head to look at Steve] Is your heart broken as well? Tell me all about it."
    },
    {
        "character": "Pip",
        "line": "But why do you make your daughter hurt people?"
    },
    {
        "character": "Ms. Havisham",
        "line": "Wuh-hy? Well, that's simple. Because I need the tears of broken-hearted men to use in my Genesis device. [Pip looks at her in horror] You see, my foolish child, I'm growing very old. But tonight I will fuse my soul into Estella's once and for all. And then I can go on breaking men's hearts for another generation."
    },
    {
        "character": "Steve",
        "line": "What the hell??"
    },
    {
        "character": "Ms. Havisham",
        "line": "Estella, prepare yourself for the Genesis platform. [Estella draws away from Steve]"
    },
    {
        "character": "Steve",
        "line": "[holds on to Estella's left arm] Oh no, you don't! You're my girl! And I'm not lettin' you walk out on me! [Ms. Havisham flips opens a panel on the right arm of her chair and presses a red button. A contraption appears and wraps itself around Steve] What the?! [a cathode at the top of the head completes the contraption]"
    },
    {
        "character": "Ms. Havisham",
        "line": "And as for you, Pip, my robot monkeys should take care of you! [presses the button again and robot monkeys descend from the ceiling and clamor around Pip. He is startled and rushes out the door, down the stairs, out the front door, and out the front gates, only to stop and faint outside the gates]"
    },
    {
        "character": "",
        "line": "The blacksmith's house, day. A shadow appears at Pip's door and falls on him. He awakens and looks at the source of the shadow"
    },
    {
        "character": "Joe",
        "line": "Pip? Pip, old chap? [appears blurry to Pip.]"
    },
    {
        "character": "Pip",
        "line": "[rises a bit] Joe?"
    },
    {
        "character": "Joe",
        "line": "That's right. You're safe and warm now."
    },
    {
        "character": "Pocket",
        "line": "[stands next to Joe] Joe found you lying face down in the street, Mr. Pip, You were in such a state. You've been unconscious here for nearly three hours."
    },
    {
        "character": "Pip",
        "line": "[sits up and says urgently] Ms. Havisham! She has all the men who have had their hearts broken by Estella trapped in her house! [laments] Oh, why would she have wasted all that time sending me to school and making me into a gentleman?"
    },
    {
        "character": "Joe",
        "line": "Well, about that, Pip: There's another person who wants to see you. [the convict Pip had set free earlier returns, but he's nicely dressed now, in three-piece suit and gloves]"
    },
    {
        "character": "Escaped Convict",
        "line": "Allo, Pip. You remember me? [Pip cowers and remembers...]"
    },
    {
        "character": "Escaped Convict",
        "line": "[threatening him back at the graveyard when they first met] I'll rip off your arms and shove 'em up your arse!"
    },
    {
        "character": "Pip",
        "line": "Why, you're the escaped convict I helped a long time ago."
    },
    {
        "character": "Escaped Convict",
        "line": "Yes. After you helped me I moved to Wales and made somethin' o' myself. If it weren't for you, I'd have never become a millionaire."
    },
    {
        "character": "Joe",
        "line": "'E's the one that sent you to London, Pip! 'E's the one who sent you off to be a gentleman!"
    },
    {
        "character": "Pip",
        "line": "You? But why?"
    },
    {
        "character": "Escaped Convict",
        "line": "Because back then you treated me like any other person. You're weren't a snob and you helped me as you would a rich man."
    },
    {
        "character": "Pip",
        "line": "Oh, dear. All this time I thought it was Ms. Havisham. She totally let me believe it. [Pocket approaches]"
    },
    {
        "character": "Pocket",
        "line": "I tried to tell you, Pip. She's a vengeful, spiteful woman, who wanted nothing more than to see you hurt along with the rest of the male sex."
    },
    {
        "character": "Pip",
        "line": "Well, I've certainly learned a lot. That being a gentleman doesn't mean learning to dance, or proper table manners. It means being a gentle man. Gentle to everyone."
    },
    {
        "character": "Pocket",
        "line": "Righto. Pip. Righto."
    },
    {
        "character": "Pip",
        "line": "And now I suppose there's only one thing left to do."
    },
    {
        "character": "Joe",
        "line": "What's that, Pip."
    },
    {
        "character": "Pip",
        "line": "If Ms. Havisham is determined to do this to others, let's go KICK HER ARSE!"
    },
    {
        "character": "Joe",
        "line": "Yeah! [Pocket raises his hands, Joe and the convict pump their fists]"
    },
    {
        "character": "",
        "line": "The South Park Classics study. The British Person resumes narrating"
    },
    {
        "character": "Narrator",
        "line": "And now we come to the final act of the Dickens classic tale, in which the stage is set for an epic showdown. Ms. Havisham's robot monkeys prove a formidable foe, but Pip is not about to let Estella's soul be forever consumed by the Genesis device. And now the thrilling conclusion of Great Expectations!"
    },
    {
        "character": "",
        "line": "The Havisham Estate, outside, a stormy night. In the dining room Ms. Havisham prepares Estella for the Genesis device"
    },
    {
        "character": "Ms. Havisham",
        "line": "Are you ready, Estella? Are you ready to complete the cycle?"
    },
    {
        "character": "Estella",
        "line": "Yes, Mother. [Ms. Havisham straps herself into her seat, and the main door fly open. In come Joe and Pocket with swords, the Escaped Convict with a pistol, and Pip with a filled bag]"
    },
    {
        "character": "Pip",
        "line": "Not so fast, you ugly ancient bitch."
    },
    {
        "character": "Estella",
        "line": "Pip? [Ms. Havisham presses the red button once again.and her chair floats forward]"
    },
    {
        "character": "Joe",
        "line": "[wielding his sward] Your manhating days are over, Ms. Havisham!"
    },
    {
        "character": "Ms. Havisham",
        "line": "Quite the contrary, blacksmith. My revenge on the male race is only about to begin."
    },
    {
        "character": "Pocket",
        "line": "Dear God, Pip, look! [points to a long contraption containing men and boys hanging upside down from their ankles. Bowls wait underneath them to receive their tears.]"
    },
    {
        "character": "Steve",
        "line": "[second from left] Estella, help me! I'm your boyfriend!"
    },
    {
        "character": "Boy",
        "line": "[third from right] So am I."
    },
    {
        "character": "Man",
        "line": "[left of center] And me."
    },
    {
        "character": "Man In Middle",
        "line": "We were all Estella's boyfriends at one time or another. Now we're doomed."
    },
    {
        "character": "Ms. Havisham",
        "line": "Yes. Cry away, males. [returns to her original position] Once your tears have collected into the Genesis device, the fusion of Estella and me will be complete."
    },
    {
        "character": "Pip",
        "line": "You won't get away with this!"
    },
    {
        "character": "Ms. Havisham",
        "line": "Won't I? [presses the red button, and robot monkeys again descend from the ceiling and come at the guests. Joe and the others use their weapons to fend off the attacks.] Let the transformation begin. [the cables have been activated]"
    },
    {
        "character": "Joe",
        "line": "[disables a robot monkey by slicing its leg off] Pip, she started the device! [the men on the torture device bawl]"
    },
    {
        "character": "Pip",
        "line": "[approaches among the robot monkey corpses] Pocket! Get over there, and do whatever it takes to keep those blokes from crying!"
    },
    {
        "character": "Pocket",
        "line": "Righto, Pip. [they do their tasks]"
    },
    {
        "character": "Ms. Havisham",
        "line": "[activates the device full throttle] It begins."
    },
    {
        "character": "Pip",
        "line": "[approaches Estella] Come, Estella! You can't want to be part of this."
    },
    {
        "character": "Estella",
        "line": "It is... what I was raised for. [a robot monkey jumps at the Escaped Convict, and the Escaped Convict shoots at it and kills it off]"
    },
    {
        "character": "Robot Monkey",
        "line": "AAAAAAA!!!"
    },
    {
        "character": "Pocket",
        "line": "Hello, gentlemen. Oh, whatever you do, please do not cry. Havisham's device fuels itself on your tears, I'm afraid."
    },
    {
        "character": "Man",
        "line": "How are we not to cry. Our hearts have been broken, our lives ruined, and now we are set to die!"
    },
    {
        "character": "Pocket",
        "line": "Yes, but just think about... panda bears! [the hanging males just look at him] Oh, they're so cuddly and sweet, panda bears are. [grabs his own nose] What silly little noses they have!"
    },
    {
        "character": "Man",
        "line": "[third from left] Panda bears make me sad. They're almost extinct."
    },
    {
        "character": "Pocket",
        "line": "[quickly waves the thought away with both hands] Oh, right, right, let's not think about panda bears, then. Let's think about ...swimming! Oh, what jolly fun swimming is, with a splishy-splash and a hold-your-breath dive. [the males just look at him]"
    },
    {
        "character": "Ms. Havisham",
        "line": "...Yes..."
    },
    {
        "character": "Escaped Convict",
        "line": "[quickly approaches] Get out of that chair, you old cow! [points a gun at her, and she spits a green fluid into his face. A few moments later he turns away and his face has been eaten away by the fluid, revealing bones and teeth.. He babbles on a bit, then drops down dead.]"
    },
    {
        "character": "Pip",
        "line": "[still before Estella] Estella! Listen to me! You are a wonderful girl, with a kind heart."
    },
    {
        "character": "Estella",
        "line": "I told you, Pip. I have no heart."
    },
    {
        "character": "Pip",
        "line": "But you do! And I shall prove it to you once and for all! [reaches into his bag. Joe is still fending off the robot monkeys. Pip pulls out a bunny] Look at this adorable little bunny."
    },
    {
        "character": "Estella",
        "line": "[flatly] Oh my. 'E's very cute."
    },
    {
        "character": "Pip",
        "line": "You see that? A heartless person wouldn't care at all about this bunny. They'd just as soon break its neck. [she reaches out to grab it, then breaks its neck with nary a flinch] ...Oh. But look at this bunny. [pulls out another bunny from the bag and presents it to her] There. You see that? You have too big a heart to kill two baby bunnies. [she reaches out to grab it, then breaks its neck. Pip gets worried] ...Right."
    },
    {
        "character": "Pocket",
        "line": "[still diverting the guys on the rack] Oh what fun it is to collect stamps! Lick the backs, put them into books all neat and tidy with those smashing little pictures and bright colors."
    },
    {
        "character": "Man",
        "line": "[left of center] My father died in a stamp-collecting accident."
    },
    {
        "character": "Pocket",
        "line": "Right, let's not talk about stamp-collecting, then. Let's talk about... [thinks a bit]"
    },
    {
        "character": "Man In Middle",
        "line": "Ice-skating!"
    },
    {
        "character": "Pocket",
        "line": "Oh what fun ice-skating is! [moves around as if ice-skating] Who can catch me? Who can catch the ice-skating king? That's me."
    },
    {
        "character": "Joe",
        "line": "[now covered in robot monkeys] Oy can't figh' 'em off no moh!"
    },
    {
        "character": "Pip",
        "line": "Nine. Nine baby bunnies. A person with a heart could never kill nine baby bunnies. So you do have too big a heart to- [crrrack. Estella has killed another bunny] Ten baby bunnies!"
    },
    {
        "character": "Joe",
        "line": "[still fighting the robot monkeys] ...There's too many of them! [the males on the rack begin to cry]"
    },
    {
        "character": "Pocket",
        "line": "Please, sirs, you must not cry!"
    },
    {
        "character": "Man",
        "line": "[left of center] We can't help it! You're bawlin' us to tears! [lights under the rack flick on one by one, and the sequence leads to a computer, and then to the Genesis device]"
    },
    {
        "character": "Pocket",
        "line": "Philip, it's too late!!"
    },
    {
        "character": "Pip",
        "line": "Twenty-six baby bunnies"
    },
    {
        "character": "Estella",
        "line": "I don't want to. I don't see the point in this."
    },
    {
        "character": "Pip",
        "line": "What?"
    },
    {
        "character": "Estella",
        "line": "I don't want to kill any more of them."
    },
    {
        "character": "Pip",
        "line": "There! You see?! You do have a heart!"
    },
    {
        "character": "Estella",
        "line": "You think so? Let me see it [referring to the bunny] Maybe I can kill it."
    },
    {
        "character": "Pip",
        "line": "[quickly hides the bunny] No no, I'm sure of it. You have a heart! You've bought your own life! Come with me now! [she looks back at him]"
    },
    {
        "character": "Ms. Havisham",
        "line": "Yessss! [electricity crackles and then moves over to Estella's part of the Genesis device. Estella looks up at Ms. Havisham, then stretches her hand out to Pip. Pip takes her hand and quickly takes her away from the device. Ms. Havisham looks over] Noooo! [her chair bursts into flames and she screams horribly, twisting here and there]"
    },
    {
        "character": "Pocket",
        "line": "Ooooo, top smart, Pip! [Ms. Havisham's body quickly turns to ashes]"
    },
    {
        "character": "Joe",
        "line": "You did it, Pip! [the last of the robot monkeys falls away]"
    },
    {
        "character": "",
        "line": "The Havisham Estate, outside, a stormy night. Joe, Pip, Pocket, the nine males, and Estella leave the house as flames spread from the dining room to other rooms and onto the yard. The party moves towards the gate, then turns back to watch the burning house"
    },
    {
        "character": "Joe",
        "line": "Well, I guess Old Ms. Havisham won't be takin' any revenge on any more blokes, ey?"
    },
    {
        "character": "Estella",
        "line": "Yes. her poor miserable life is finally over."
    },
    {
        "character": "Pip",
        "line": "You're released from her now, Estella! Now we can begin our life together!"
    },
    {
        "character": "Estella",
        "line": "Yes! Yes, my small-testicled love! [she and Pip embrace]"
    },
    {
        "character": "Pocket",
        "line": "Oh, I'm so glad everything has worked out. [Pip and Estella break the embrace] Where are all my little bunnies that you borrowed then, Pip?"
    },
    {
        "character": "",
        "line": "The South Park Classics study. The British Person finishes narrating"
    },
    {
        "character": "Narrator",
        "line": "And they all lived happily ever after. Except for Pocket, who died of hepatitis B. [closes the book and rests it on his laps] So ends Charles Dickens' Great Expectations. We hope you now have a deeper appreciation for Pip, and indeed, [holds up the book] all masterpieces of literature like this one. [rests it again] Until next time, I'm a British person. Good night."
    }
]