[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park, day. People mill around, but a group of them has gathered around a magician, tall and slender, with a severe face"
    },
    {
        "character": "Magician",
        "line": "Okay, Carol, put the card you picked back into the deck so I can't see ittwah. [Butters and Kenny are watching as Stan and Kyle rush up]"
    },
    {
        "character": "Stan",
        "line": "What's going on? [he and Kyle have ice cream cones. He has vanilla, Kyle strawberry]"
    },
    {
        "character": "Butters",
        "line": "Uh this feller David Blaine. He's doin' magic tricks. Hey, where'd you get that ice cream?"
    },
    {
        "character": "Blaine",
        "line": "Okay, now hold this card up to the crowd. [Carol takes the card and shows it to the crowd. It is an ace of clubs] Was that the card you picked?"
    },
    {
        "character": "Carol",
        "line": "No, I'm sorry. I picked the four of hearts."
    },
    {
        "character": "Blaine",
        "line": "Four of hearts? Really? Look again."
    },
    {
        "character": "Carol",
        "line": "[looks and find the four of hearts in her hand] Daa-ah!"
    },
    {
        "character": "Crowd",
        "line": "Oooohhhh! [applause]"
    },
    {
        "character": "Woman",
        "line": "Whoa"
    },
    {
        "character": "Kyle",
        "line": "That's pretty cool, dude!"
    },
    {
        "character": "Cartman",
        "line": "[walking up] Who's this asshole?"
    },
    {
        "character": "Kyle",
        "line": "He's a magician named David Blaine, dude. He kicks ass."
    },
    {
        "character": "Cartman",
        "line": "Hey, where'd you guys get that ice cream?"
    },
    {
        "character": "Blaine",
        "line": "Sir, c- could you come over here? [Jimbo walks over] Now, what I want you to do, Mr..."
    },
    {
        "character": "Jimbo",
        "line": "Kern."
    },
    {
        "character": "Blaine",
        "line": "Mr. Kern, I want you to just... think about a card. Pick any card, and picture it in your mind."
    },
    {
        "character": "Jimbo",
        "line": "[shuts his eyes and keeps them shut] O-kay."
    },
    {
        "character": "Blaine",
        "line": "Okay, jus... s think about your card. [a few seconds pass] okay, look at me. [Jimbo looks at him] Look at me... Look at me... okay, now reach up your ass."
    },
    {
        "character": "Jimbo",
        "line": "Huh??"
    },
    {
        "character": "Blaine",
        "line": "Go on, reach up your ass."
    },
    {
        "character": "Jimbo",
        "line": "[reaches into his ass and digs around] Uh, I don't feel nothin'."
    },
    {
        "character": "Blaine",
        "line": "Deeper."
    },
    {
        "character": "Jimbo",
        "line": "[groans as he goes deeper] Hhud. I don't feel... hello... wait... wait... [pulls out a card and cleans the crap off it]"
    },
    {
        "character": "Blaine",
        "line": "Was that the card you picked?"
    },
    {
        "character": "Jimbo",
        "line": "[in disbelief] Yes! Oh my God!"
    },
    {
        "character": "Man",
        "line": "O-hoho! [more crowd reaction]"
    },
    {
        "character": "Kyle",
        "line": "Wow, that's cool!"
    },
    {
        "character": "Stan",
        "line": "How'd he do that??"
    },
    {
        "character": "Blaine",
        "line": "Thank you. I've been traveling from town to town for quite a while. I've started quite a following, mostly because of my levitation tricktwah. Watch. [goes into a meditative state] Watch. [slowly, he rises into the air]"
    },
    {
        "character": "Crowd",
        "line": "Whoa!!!"
    },
    {
        "character": "Stan",
        "line": "No way!"
    },
    {
        "character": "Kyle",
        "line": "Damn. That guy is the coolest guy in the universe!"
    },
    {
        "character": "Blaintologist",
        "line": "[passing out pamphlets through the crowd] Pamphlet. Pamphlet. Here you go, kids,  take a pamphlet. [Kyle takes one and reads from it]"
    },
    {
        "character": "Kyle",
        "line": "\"David Blaine Workshop. Learn all about David Blaine at the Center for Magic.\" Dude, we gotta go."
    },
    {
        "character": "Cartman",
        "line": "Yeah, and they probably teach you how to do magic tricks!"
    },
    {
        "character": "",
        "line": "The David Blaine Complex, in the middle of nowhere, day."
    },
    {
        "character": "Speaker",
        "line": "Hello, everyone. My name is Steven and I've been a Blaintologist for about three years. So, when David Blaine performed his miracles out on the street, what moved you the most?"
    },
    {
        "character": "Stan",
        "line": "His a-miracles?"
    },
    {
        "character": "Steven",
        "line": "Oh yes, you see, David Blaine is much more than a magician. He's a scholar, a visionary, a leader."
    },
    {
        "character": "Cartman",
        "line": "When are we gonna learn magic tricks?"
    },
    {
        "character": "Stan",
        "line": "Yeah!"
    },
    {
        "character": "Steven",
        "line": "Oh, I've got a trick for you to learn: I can show you how to make your true self appear. Let me ask you all something: Do you consider yourselves to be happy?"
    },
    {
        "character": "Butters",
        "line": "I don't think I'm very happy. I always fall asleep to the sounds of my own screams. "
    },
    {
        "character": "Steven",
        "line": "...Right, yeh. Eh, see, the reason that you are unha-"
    },
    {
        "character": "Butters",
        "line": "And then I always get woken up in the morning by the sounds of my own screams. Do you think I'm unhappy?"
    },
    {
        "character": "Steven",
        "line": "Wait, the.. the point is... that you can be happy. You see, your friends and parents have programmed you in a way that makes you feel isolated and alone. How many times have you felt like nobody knows the real... you? [focus on a stunned Kyle] You're not really happy."
    },
    {
        "character": "Kyle",
        "line": "[thinking] I'm not really happy."
    },
    {
        "character": "Steven",
        "line": "Your potential hasn't even been reached."
    },
    {
        "character": "Kyle",
        "line": "[thinking] My potential hasn't even been reached."
    },
    {
        "character": "Steven",
        "line": "[holds up the book] If you look through David Blaine's incredible book, you'll find a lot of life's answers. Let's read some of the book together, shall we?"
    },
    {
        "character": "Cartman",
        "line": "Then we get to be in David Blaine's secret club?"
    },
    {
        "character": "Steven",
        "line": "That's right."
    },
    {
        "character": "Cartman",
        "line": "Cool."
    },
    {
        "character": "",
        "line": "Kyle's house, day. In the dining room, Sheila is trying to feed Ike, who is in a baby chair."
    },
    {
        "character": "Sheila",
        "line": "Ike, eat your gefilte fish. [Ike pulls away as far as he can]"
    },
    {
        "character": "Ike",
        "line": "No-oo."
    },
    {
        "character": "Kyle",
        "line": "[rushes in with Blaine's book] Mom. Mom. I found out all about this great new magician named David Blaine."
    },
    {
        "character": "Sheila",
        "line": "That's nice, Kyle. Ike, eat!"
    },
    {
        "character": "Kyle",
        "line": "We spent all afternoon learning about how we aren't actually happy. I had no idea how unhappy I was until today. They gave me this cool book to read, and I'm already on chapter four...."
    },
    {
        "character": "Sheila",
        "line": "Well, it's nice to see you so interested in something, Kyle. Ike, for the love of Abraham, you are gonna eat this."
    },
    {
        "character": "Kyle",
        "line": "So can I go to the Magic Camp, to learn how to become a full member? All the other guys are doin' it, and it's only $69.95."
    },
    {
        "character": "Sheila",
        "line": "Magic Camp? I don't know, bubbe, ask your father. [Kyle turns and walks out] Ike, you will eat this!"
    },
    {
        "character": "",
        "line": "The David Blaine Complex, in the middle of nowhere, day. The new recruits are having their hair shaved off their heads"
    },
    {
        "character": "Barber",
        "line": "Prepare to be cleansed and release the magic inside you."
    },
    {
        "character": "Butters",
        "line": "[Solemnly] I am prepared. [the barber takes the clippers and clips Butters' hair off in one swoop. The hair ends up on the floor in one piece] Hoh, jeez, eh it sure got cold in here."
    },
    {
        "character": "Barber",
        "line": "Next? [Mr. Garrison appears...]"
    },
    {
        "character": "",
        "line": "The David Blaine Complex, main room"
    },
    {
        "character": "Steven",
        "line": "Congratulations, young Blaintologists. From this day, you are clean. [a shot of the new recruits. They all look the same] Now, we have very important work to do! David Blaine is going to put on a big magic show in Denver tomorrow night, where he's going to eat his own head."
    },
    {
        "character": "Recruits",
        "line": "Wow!"
    },
    {
        "character": "Steven",
        "line": "So it's up to all you new Blaintologists to get as many people there as you can. Whoever gets the most people to come gets a prize! [eight boys gravitate towards each other]"
    },
    {
        "character": "Stan",
        "line": "[talking to a boy between him and Cartman] Kyle, I'm starting to think that this is a really bad idea."
    },
    {
        "character": "Butters",
        "line": "Ha-I'm not Kyle, I'm Butters. I thought you were Kyle."
    },
    {
        "character": "Stan",
        "line": "No, I'm Stan."
    },
    {
        "character": "Kyle",
        "line": "[behind Butters] You're Stan? Where's Kenny?"
    },
    {
        "character": "Stan",
        "line": "Who are you?"
    },
    {
        "character": "Kyle",
        "line": "I'm Kyle."
    },
    {
        "character": "Cartman",
        "line": "[thinking he's indistinguishable] Heheh, guess who I am, you guys?"
    },
    {
        "character": "Stan",
        "line": "Kyle, I think we may have gotten into something bad here."
    },
    {
        "character": "Kyle",
        "line": "[steps back to join Stan] What do you mean? We're learning all kinds of cool stuff."
    },
    {
        "character": "Stan",
        "line": "Look at us, dude. These people are trying to change us somehow. I think it's time we went home."
    },
    {
        "character": "Kyle",
        "line": "But David Blaine is gonna do more miracles in Denver tomorrow."
    },
    {
        "character": "Stan",
        "line": "I don't care! I'm leaving! [walks towards the door, but a man blocks the way] 'Scuse me. [eerie music begins]"
    },
    {
        "character": "Aide",
        "line": "Where are you going?"
    },
    {
        "character": "Stan",
        "line": "I'm going home."
    },
    {
        "character": "Aide",
        "line": "You don't want to go home."
    },
    {
        "character": "Stan",
        "line": "You said we're free to leave whenever we want"
    },
    {
        "character": "Aide",
        "line": "You are."
    },
    {
        "character": "Stan",
        "line": "Move out of the way."
    },
    {
        "character": "Aide",
        "line": "I'm not in the way. You are. Are you unhappy with the Church's teachings? Let's just talk about it"
    },
    {
        "character": "Stan",
        "line": "I don't wanna talk about it, I jus' wanna leave."
    },
    {
        "character": "Aide",
        "line": "Why don't we go into the back room for a second, and talk? Then you can leave."
    },
    {
        "character": "Stan",
        "line": "[begins to back away, intimidated] That's okay, I... I changed my mind. I'm... gonna stay."
    },
    {
        "character": "Aide",
        "line": "That's great news. [escorts Stan back to the group]"
    },
    {
        "character": "",
        "line": "The David Blaine Complex, dorm, night. Stan peers out from a door into a hall."
    },
    {
        "character": "Stan",
        "line": "Okay, it's all clear. [exits with Kyle]"
    },
    {
        "character": "Kyle",
        "line": "What are we doing?"
    },
    {
        "character": "Stan",
        "line": "We're getting out of here. This whole thing has gotten way out of hand."
    },
    {
        "character": "Kyle",
        "line": "Whoa whoa, I'm not going anywhere."
    },
    {
        "character": "Stan",
        "line": "Come on, Kyle, this is stupid!"
    },
    {
        "character": "Kyle",
        "line": "It's not stupid, Stan. For once in my life I feel like I'm part of something."
    },
    {
        "character": "Stan",
        "line": "A part of what?! Some gaywad magician's crazy life plan?!"
    },
    {
        "character": "Kyle",
        "line": "Don't call Mr. Blaine a gaywad! He's a brilliant man."
    },
    {
        "character": "Stan",
        "line": "No, they've just convinced you that he's a brilliant man! Let's go!"
    },
    {
        "character": "Kyle",
        "line": "I'm not going anywhere!"
    },
    {
        "character": "Stan",
        "line": "Goddamnit, I'm not going with you! I wanna stay here!"
    },
    {
        "character": "Kyle",
        "line": "Huh? I thought you wanted to leave."
    },
    {
        "character": "Stan",
        "line": "Oh wait, who am I again?"
    },
    {
        "character": "Kyle",
        "line": "You're Stan."
    },
    {
        "character": "Stan",
        "line": "Oh- oh yeah. God- Goddamnnit, hold on a second. [pulls out his hat and puts it on] Okay. Now look, dude, I'm getting out of here, and you're a dumbass if you don't come with me!"
    },
    {
        "character": "Kyle",
        "line": "Then I guess... I'm a dumbass. [turns and walks back to his room. Stan turns back to face the hall and watched Kyle walk away]"
    },
    {
        "character": "Stan",
        "line": "Kyle, please. You- [looks down and to the left, then looks up] You're my best friend."
    },
    {
        "character": "Kyle",
        "line": "Well, this is what I believe in now, Stan. And if you can't respect that,... then I guess we're not best friends anymore. [opens the door to his room and walks in. Stan looks, then turns towards the exit and walks out]"
    },
    {
        "character": "",
        "line": "South Park, next day. Cartman and Kyle walk down a sidewalk visiting houses. They approach a pink house."
    },
    {
        "character": "Kyle",
        "line": "Hello, ma'am. My name is Kyle. And this is Cartman. We'd like to share our interest in David Blaine with you."
    },
    {
        "character": "Elderly woman",
        "line": "Uh oh. My husband warned me about you Blainiacs. I'm sorry, but I'm a Catholic."
    },
    {
        "character": "Cartman",
        "line": "Uh it... doesn't matter, ma'am. Blaintology is for everyone. There are Blaintologists who are Catholics, Buddhists - why even Kyle here is a Goddamn Jew."
    },
    {
        "character": "Kyle",
        "line": "That's right."
    },
    {
        "character": "Elderly woman",
        "line": "So you're not a cult?"
    },
    {
        "character": "Cartman",
        "line": "[giggles] Of course, no. David Blaine is a real person. You may have seen his television specials on ABC. He also wrote a book, and we'd like to share it with you."
    },
    {
        "character": "Elderly woman",
        "line": "Well, alright, come on in."
    },
    {
        "character": "Cartman",
        "line": "Cool. [the woman shows the boys in]"
    },
    {
        "character": "",
        "line": "Elderly woman's house, living room, moments later. The woman and the two boys sit on the sofa. Kyle has his book open."
    },
    {
        "character": "Kyle",
        "line": "...And if you look here, you can see how David Blaine performed the miracle of being frozen in ice at Times Square."
    },
    {
        "character": "Cartman",
        "line": "Ma'am, have you ever wondered what David Blaine's plan is for you?"
    },
    {
        "character": "Elderly woman",
        "line": "No, not really."
    },
    {
        "character": "Cartman",
        "line": "Oh, you see, that, that's interesting because... I'm so thankful for David Blaine's book, and, I'm so thankful that he showed me the way to true happiness but, I think about his plan often."
    },
    {
        "character": "Kyle",
        "line": "David Blaine is doing a big performance in Denver tomorrow night. [closes his book] We're sure his magic will entertain and astound you!"
    },
    {
        "character": "Cartman",
        "line": "He's going to eat his own head."
    },
    {
        "character": "Kyle",
        "line": "How many tickets can we put you down for?"
    },
    {
        "character": "Elderly woman",
        "line": "Oh, I can't go."
    },
    {
        "character": "Cartman",
        "line": "Oh, come on, it'll make you a happy person."
    },
    {
        "character": "Elderly woman",
        "line": "I am happy."
    },
    {
        "character": "Cartman",
        "line": "No you're not."
    },
    {
        "character": "Elderly woman",
        "line": "Yes I am."
    },
    {
        "character": "Cartman",
        "line": "No you're not."
    },
    {
        "character": "Elderly woman",
        "line": "I really am."
    },
    {
        "character": "Cartman",
        "line": "No you're not."
    },
    {
        "character": "Elderly woman",
        "line": "But I am."
    },
    {
        "character": "Cartman",
        "line": "No you're not."
    },
    {
        "character": "Elderly woman",
        "line": "Alright, two tickets"
    },
    {
        "character": "Kyle",
        "line": "Great!"
    },
    {
        "character": "",
        "line": "Sidewalk. Kyle and Cartman exit the elderly woman's house"
    },
    {
        "character": "Kyle",
        "line": "That's 15 people we got to agree to come see David Blaine perform in Denver."
    },
    {
        "character": "Cartman",
        "line": "Yes, Brother Kyle hmm, but our work is not over. We must still recruit ten more audience members in order to get the prize."
    },
    {
        "character": "Kyle",
        "line": "I think if we try Kenny's neighborhood, we might find a- [they reach the corner. Facing them on the opposite corner is Stan, standing by his bike]"
    },
    {
        "character": "Cartman",
        "line": "Come, Brother Kyle, we have no time for him. [turns right and walks down the street. Kyle looks back at Stan for a few seconds, then follows Cartman. Stan turns and walks down the street in the same direction Kyle and Cartman were walking, but stops when a car appears in front of him. He sees some adult Blaintologists inside. The driver starts the car and moves towards Stan, who turns about face and begins to run with his bike. The car looms behind him and he lets go of his bike.]"
    },
    {
        "character": "Stan",
        "line": "HaaAAAA! [the car totals the bike, bumps Stan onto the sidewalk, and peels away.]"
    },
    {
        "character": "Driver",
        "line": "You'd better watch yourself next time, abandoner! [Stan looks at the car, scared.]"
    },
    {
        "character": "",
        "line": "Jesus' house, next day. Stan walks up and rings the doorbell"
    },
    {
        "character": "Stan",
        "line": "Hi, Jesus. It's me."
    },
    {
        "character": "Stan, Jesus",
        "line": "Stan Marsh."
    },
    {
        "character": "Jesus",
        "line": "Of course. I know you, my child. Come in."
    },
    {
        "character": "",
        "line": "Jesus' house, living room. A pitcher of water sits on the coffee table"
    },
    {
        "character": "Stan",
        "line": "This guy is going around doing magic tricks and saying they're miracles! My friend Kyle thinks he's totally awesome!"
    },
    {
        "character": "Jesus",
        "line": "You're good to bring this to my attention, Stan. Cults are a very dangerous thing."
    },
    {
        "character": "Stan",
        "line": "I read in the Bible that you did miracles, too. If you could go in front of these people and do your miracles, then, they'll all see that David Blaine isn't so special."
    },
    {
        "character": "Jesus",
        "line": "The miracle I'm most famous for is turning water into wine."
    },
    {
        "character": "Stan",
        "line": "Can you do it again?"
    },
    {
        "character": "Jesus",
        "line": "Very well. I shall perform the miracle. Behold. Here you can see ordinary water, clear, clean. Okay now, turn around. [Stan looks at Jesus quizzically. Jesus is now holding the pitcher] Er, nuh, tur- turn around. [Stan turns away and Jesus quickly switches pitchers] Uh, okay now, turn back. [Stan turns back] It is now wine!"
    },
    {
        "character": "Stan",
        "line": "That's it? That's how you did that trick?"
    },
    {
        "character": "Jesus",
        "line": "Wuh well, yeah."
    },
    {
        "character": "Stan",
        "line": "That trick sucks, Jesus."
    },
    {
        "character": "Jesus",
        "line": "Oh. Well, I guess it worked a little better on people 2000 years ago."
    },
    {
        "character": "Stan",
        "line": "Dude, we have to do something. This guy is performing more miracles in Denver tonight. He's gonna get more followers, and it'll be impossible for me to get Kyle out."
    },
    {
        "character": "Jesus",
        "line": "Then let's go."
    },
    {
        "character": "Stan",
        "line": "But dude, I'd I don't think you should do that lame water-to-wine trick."
    },
    {
        "character": "Jesus",
        "line": "Oh,don't worry [rises and joins Stan out the door] I have a few more miracles up my sleeve."
    },
    {
        "character": "",
        "line": "Denver, night. An arena is shown, and the place is packed. Kyle and Cartman are seated in the third row, with around Blaintologists around them"
    },
    {
        "character": "Kyle",
        "line": "This is a really good turnout."
    },
    {
        "character": "Announcer",
        "line": "And now, ladies and gentlemen, David Blaine. [pyrotechnics go off all around, three spotlights shine on Blaine, and the crowd cheers]"
    },
    {
        "character": "Blaine",
        "line": "Hello, my children."
    },
    {
        "character": "Announcer",
        "line": "Ladies and gentlemen, may we have silence, please, as magician David Blaine will now eat... his... own... head. [Blaine looks around, and a drumroll begins. Blaine then proceeds to eat his own head, then falls over. A few moments later the crowd roars with approval]"
    },
    {
        "character": "Kyle",
        "line": "Dude, no way! [two female Blaintology assistants rush up and help Blaine stand. One has a little cage, another has a small curtain and rod. The one to his right places the cage where the head would be, while the one on the left places the curtain in front. A few seconds later, Blaine's head is back on his shoulders. The audience cheers]"
    },
    {
        "character": "Blaine",
        "line": "Thank you, everyone. [the audience quiets down] Our organization grows larger every day. Soon, the government will even have to give us tax-exempt status as a bona fide religion."
    },
    {
        "character": "Jesus",
        "line": "[walking down the steps towards the stage] Hold!"
    },
    {
        "character": "Man",
        "line": "It's Jesus! [more murmurs]"
    },
    {
        "character": "Cartman",
        "line": "What's he doin' here? [Jesus goes on stage]"
    },
    {
        "character": "Jesus",
        "line": "My children, it is time for you to go home and stop following this false prophet. You should be using your money and time for other things. These are simple magic tricks. His magic is interesting, but will it put food on your table? Feeding the hungry - now that is a miracle! [a cart with loaves and fishes is wheeled in by Stan.] Behold! I have here fives loaves of bread and three fish. Certainly not enough to feed this entire crowd, but now - turn around [the crowd stares back blankly] Ya need tuh- turn around. [Stan slaps his hand to his forehead, but the crowd turns around. Jesus proceeds to pull bread and fish from behind the cart and pour it over the original bread and fish. Soon the cart is hidden under the food] Okay, now turn back. [the crowd turns back and just looks]"
    },
    {
        "character": "Cartman",
        "line": "Now how the hell did he do that? [Blaine simply extends his right arm, lifts the bread and fish mentally from the cart and drops them over by Stan]"
    },
    {
        "character": "Crowd",
        "line": "Wow!"
    },
    {
        "character": "Blaine",
        "line": "Your magic is old and outdated, Jesus! Twah. Just like you are."
    },
    {
        "character": "Jesus",
        "line": "Oh, really. Then what's this [reaches behind Blaine's ear and pulls out a card] Ace of Spades doing behind your ear?"
    },
    {
        "character": "Crowd",
        "line": "Whoa. [some chatter. Blaine then levitates, goes into a spin and disappears into a deck of cards, which then splits in two. Each half traces a circle and then both halves combine to make a larger circle. This circle then becomes a tornado of cards, and David Blaine emerges from the tornado triumphant.]"
    },
    {
        "character": "Jesus",
        "line": "[overwhelmed] Jesus Christ!"
    },
    {
        "character": "Elderly woman",
        "line": "[seated with her husband] He's incredible!"
    },
    {
        "character": "Blaine",
        "line": "The old religions have failed you! Twah. What have they offered except for war, poverty, and sadness? Blaintology offers you the key to living your life to the fullest! Will you join us?"
    },
    {
        "character": "Crowd",
        "line": "Yes!!"
    },
    {
        "character": "",
        "line": "The arena, outside. Jesus and Stan exit the arena"
    },
    {
        "character": "Jesus",
        "line": "His magic is too powerful, Stanley. I've never seen anything like it."
    },
    {
        "character": "Stan",
        "line": "Then what are we going to do."
    },
    {
        "character": "Jesus",
        "line": "I cannot face him alone. We must get the help of all the super best friends. [speaks into his left wrist] Buddha. Buddha, come in!"
    },
    {
        "character": "Stan",
        "line": "Super best friends?"
    },
    {
        "character": "Buddha",
        "line": "[on a little screen on Jesus' unique watch] This is Buddha, Jesus. Go ahead."
    },
    {
        "character": "",
        "line": "A futuristic headquarters, somewhere... Jesus appears on a giant screen as Buddha awaits Jesus' answer"
    },
    {
        "character": "Jesus",
        "line": "Buddha, we may have a problem. I've just encountered a magic I've never seen before."
    },
    {
        "character": "Buddha",
        "line": "I'll call everyone together. Come as fast as you can."
    },
    {
        "character": "Jesus",
        "line": "Come, Stanley. We must travel far and long."
    },
    {
        "character": "Stan",
        "line": "To where?"
    },
    {
        "character": "Jesus",
        "line": "Distances unfathomable to man. Yea, take hold of my robe, Stanley, and do not open your eyes."
    },
    {
        "character": "Stan",
        "line": "[shuts his eyes] I am ready."
    },
    {
        "character": "",
        "line": "Inside an airplane. Jesus and Stan have center seats, and Stan's eyes are still shut"
    },
    {
        "character": "Jesus",
        "line": "Are you still keeping your eyes closed?"
    },
    {
        "character": "Stan",
        "line": "Yeah."
    },
    {
        "character": "Jesus",
        "line": "Good. Want some peanuts?"
    },
    {
        "character": "",
        "line": "The David Blaine Complex, night. Blaintologists gather in the main room, and a new member is having his hair shaved off"
    },
    {
        "character": "Kyle",
        "line": "Congratulations, sister. You have heard the noble truth and are now a Blaintologist."
    },
    {
        "character": "Steven",
        "line": "[rushes up to the podium] Everyone! Everyone, gather 'round! I have great news for all Blaintologists, and for our new members as well. We've just gotten word from Mr. Blaine himself: The government has denied our church's request for tax-exempt status!"
    },
    {
        "character": "Member",
        "line": "But... we want tax-exempt status."
    },
    {
        "character": "Kyle",
        "line": "Yeah. Why is that good news?"
    },
    {
        "character": "Steven",
        "line": "Be-cause! Mr. Blaine has arranged for all Blaintologists members from every city and state to march into Washington and demand our right for tax-exempt status by committing a mass suicide!"
    },
    {
        "character": "Kyle",
        "line": "Mass suicide?"
    },
    {
        "character": "Steven",
        "line": "Mr. Blaine has said that by killing ourselves in Washington, we are guaranteed everlasting happiness in the afterlife!"
    },
    {
        "character": "Member",
        "line": "Hehehe, that sounds good. [other members echo the sentiment]"
    },
    {
        "character": "Steven",
        "line": "Get your things ready. We leave for Washington at dawn!"
    },
    {
        "character": "Cartman",
        "line": "[jubilant] Did you hear that, guys? We're finally gonna die!"
    },
    {
        "character": "",
        "line": "A blue sky in a big city. The camera pans down to show Jesus and Stan in a park-like setting"
    },
    {
        "character": "Jesus",
        "line": "Alright, Stanley. You can open your eyes now. [before them is a stone-and-glass building] This is the hall of the super best friends, Stanley, the headquarters for those who stand for what's right."
    },
    {
        "character": "Mohammad",
        "line": "Jesus, we've been working hard since we got your distress call!"
    },
    {
        "character": "Loa Tse",
        "line": "Who the kid?"
    },
    {
        "character": "Jesus",
        "line": "Stanley, I want you to meet some of the super best friends [they are shown when mentioned]: Buddha, with the powers of invisibility; Mohammad, the Muslim prophet with the powers of flame [he raises his hands palm up and a blast of flame emerges from each hand]; Krishna, the Hindu deity; Joseph Smith, the Mormon prophet; Lao Tse, the found of Taoism [performs some martial arts moves with his cane]; and Seaman, with the ability to breathe underwater and link mentally with fish."
    },
    {
        "character": "Stan",
        "line": "So you mean to tell me that even though people fight and argue over different religions, you guys are all actually friends?"
    },
    {
        "character": "Mohammad",
        "line": "More than friends, young boy, we are super best friends, with the desire to fight for justice."
    },
    {
        "character": "Joseph Smith",
        "line": "We all believe in the power of good over evil. Except for Buddha, of course, who doesn't believe in evil. [Buddha shrugs and grins]"
    },
    {
        "character": "Stan",
        "line": "Wow."
    },
    {
        "character": "Mohammad",
        "line": "Jesus, come look at this. [they walk to the monitor console with Stan following] After your distress call, we entered David Blaine in the super best friends' computer."
    },
    {
        "character": "Seaman",
        "line": "[operating the console] Many interesting things showed up. He was raised in New York city by a decent family, but a freak washing-machine accident at the age of 12 made him learn the ways of the black arts."
    },
    {
        "character": "Buddha",
        "line": "That's right, Seamen. [the other super best friends laugh at how Buddha said Seaman's name]"
    },
    {
        "character": "Seaman",
        "line": "[insulted] Sea Man!"
    },
    {
        "character": "Buddha",
        "line": "Uh that's what I said. Seamen. [the others laugh some more]"
    },
    {
        "character": "Seaman",
        "line": "Stop it!"
    },
    {
        "character": "",
        "line": "The David Blaine Complex, dorm, night. Kyle walks up to Cartman's bunk."
    },
    {
        "character": "Kyle",
        "line": "[whispering] Cartman! Cartman, wake up! Cartman!"
    },
    {
        "character": "Cartman",
        "line": "[sits up abruptly, knocking Kyle off the bed] No, Paula Poundstone! Leave me alone! Eyuh! Uh? [now alert, if confused, and Kyle stands up]"
    },
    {
        "character": "Kyle",
        "line": "It's just me."
    },
    {
        "character": "Cartman",
        "line": "[sighs silently] Brother Kyle? Why do you disturb my rest?"
    },
    {
        "character": "Kyle",
        "line": "Dude. I don't think I wanna be a part of this anymore."
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Kyle",
        "line": "I think Stan might've been right. Anyway, I think it's going too far. I mean, if I kill myself, it's gonna make my family really sad."
    },
    {
        "character": "Cartman",
        "line": "Yeah, I know what you mean. I don't wanna die either. [points to his groin] I haven't even gotten my pubes yet."
    },
    {
        "character": "Kyle",
        "line": "I think we should bail. If we leave the group, maybe other people will get the courage to leave, too."
    },
    {
        "character": "Cartman",
        "line": "That co- ugh. [drops to a whisper] That could be difficult, Brother Kyle. But alright, listen: Why don't we sleep on it? If we decide to leave the faction, we can... do it in the morning."
    },
    {
        "character": "Kyle",
        "line": "Okay. Okay, you're right. [goes down the ladder to his own bunk, underneath Cartman's, and Cartman turns over to sleep] Oh uh Cartman: thanks. [goes to sleep. Later, he wakes up inside a large domed platform. Reflections of five adult Blaintologists and Cartman can be seen on the glass dome. He sits up and blinks] Cartman? [He tries to move, but encounters the glass. He taps to make sure] What the hell? [Camera pulls back to reveal...]"
    },
    {
        "character": "",
        "line": "The David Blaine Complex, main room. The Blaintologists and Cartman look on."
    },
    {
        "character": "Cartman",
        "line": "I told on yoo-ou. I told on yoo-ou."
    },
    {
        "character": "Kyle",
        "line": "What have you done, Cartman?!"
    },
    {
        "character": "Cartman",
        "line": "This is for your own good, Brother Kyle."
    },
    {
        "character": "Blaine",
        "line": "You must understand, brother Kyle, twah, you know too much about the Church. If you left now, you'd become a danger to our cause."
    },
    {
        "character": "Cartman",
        "line": "Ah, and you know what else Kyle said? Um Kyyyle, he said that if we were all gonna commit suicide, that he wouldn't do iiit."
    },
    {
        "character": "Kyle",
        "line": "[knocking on the dome] Cartman, you fatass tattle-tale!"
    },
    {
        "character": "Cartman",
        "line": "At least I'm not the boy in the plastic bubble!"
    },
    {
        "character": "Blaine",
        "line": "The suicide pact will go as planned. If we die, we all die together. [Cartman and the Blaintologists exit and leave Kyle alone, afraid]"
    },
    {
        "character": "",
        "line": "the Hall of the Super Best Friends, day."
    },
    {
        "character": "Narrator",
        "line": "[speaks for the fist time] Meanwhile, at the Hall of Super Best Friends..."
    },
    {
        "character": "Joseph Smith",
        "line": "Look at that, Jesus. His followers are growing at a rate even faster than mine! It appears this David Blaine is as dangerous as you and your young friend had feared."
    },
    {
        "character": "Stan",
        "line": "I knew it."
    },
    {
        "character": "Jesus",
        "line": "Here. I have a videotape of his performance the other night."
    },
    {
        "character": "Joseph Smith",
        "line": "Perhaps we should have Moses look at the tape and see what he comes up with. [Mohammad takes the tape to Moses]"
    },
    {
        "character": "Mohammad",
        "line": "Moses, scan this tape. Can you tell us the source of Blaine's power?"
    },
    {
        "character": "Moses",
        "line": "[just as he appeared in \"Jewbilee\"] Give me the information. [Mohammad slips the tape into a slot near Moses' tip. Stan smiles]"
    },
    {
        "character": "Stan",
        "line": "Wow, the Moses."
    },
    {
        "character": "Moses",
        "line": "His magic is a combination of centrifugal line and sleight of hand. Wait a minute: I'm picking up movement from Blaintologists from all over the country."
    },
    {
        "character": "Lao Tse",
        "line": "The Blaintologists are heading to Washington. But why?"
    },
    {
        "character": "Jesus",
        "line": "Wait a minute. At his performance David Blaine said something about trying to get tax-exempt status."
    },
    {
        "character": "Joseph Smith",
        "line": "Omigod!"
    },
    {
        "character": "Lao Tse",
        "line": "What?"
    },
    {
        "character": "Joseph Smith",
        "line": "If he gets tax-exempt status, then he'll become a real religion."
    },
    {
        "character": "Krishna",
        "line": "He would become unstoppable"
    },
    {
        "character": "",
        "line": "Washington D.C., day. The Blaintologists have gathered around the Reflecting Pool in front of the Lincoln Memorial"
    },
    {
        "character": "Narrator",
        "line": "Meanwhile, in the nation's capital, Blaintologists from all over the country have gathered to commit mass suicide!"
    },
    {
        "character": "Blaine",
        "line": "[facing the audience, with the Washington Monument in the distance] If the government will not give us tax-exempt status, then we must prove that we are willing to die for our beliefs, twah."
    },
    {
        "character": "Steven",
        "line": "Alright, brothers and sisters, gather around. [they do so] It's time to drown ourselves in the Reflecting Pool! [he steps down into the pool] However, the-ah Reflecting Pool is a little more shallow than we originally thought, so to drown ourselves, you will need to lie on your stomach, face down, until you die, as such. [drops down into the water and floats on his stomach, expelling air for a few seconds, then groans to death as water fills his lungs. The corpse begins to float away]"
    },
    {
        "character": "Man",
        "line": "Next! [A woman drops in, than a man...]"
    },
    {
        "character": "",
        "line": "The White House, day. The White House staff gathers at one of the windows to watch. Shown are Princess, Laura and George W. Bush, Karl Rove, and Maggie"
    },
    {
        "character": "Narrator",
        "line": "Meanwhile, at the White House..."
    },
    {
        "character": "Karl Rove",
        "line": "Mr. President, we can't let them all kill themselves!"
    },
    {
        "character": "George Bush",
        "line": "Well we can't give them tax-exempt status either, Karl!"
    },
    {
        "character": "Larry",
        "line": "[walks in] He-e-ey George! What's gon' on?"
    },
    {
        "character": "",
        "line": "Washington D.C., day. Cartman gets ready to flood Kyle, who's still in the glass dome, with a fire hose. More corpses float in the Reflecting Pool"
    },
    {
        "character": "Cartman",
        "line": "Alright, Brother Kyle, it is time for us to die! [pushes the dome into the pool]"
    },
    {
        "character": "Kyle",
        "line": "Cartman! We've been brainwashed, don't you see? We don't have to do this!"
    },
    {
        "character": "Cartman",
        "line": "[brings the hose over] But it's the only way for us to be happy. [plugs the hose into the dome and releases the water]"
    },
    {
        "character": "Kyle",
        "line": "Cartman, no!"
    },
    {
        "character": "",
        "line": "The Reflecting Pool, later"
    },
    {
        "character": "Blaine",
        "line": "Give us what we want or we will continue to die"
    },
    {
        "character": "Jesus",
        "line": "Not so fast, David Blaine!"
    },
    {
        "character": "Blaine",
        "line": "Jesus! Not again."
    },
    {
        "character": "Jesus",
        "line": "Yes! But this time, I've brought some help! Super Best Friends! [they fly down as they are announced]"
    },
    {
        "character": "Buddha",
        "line": "Buddha!"
    },
    {
        "character": "Mohammad",
        "line": "Mohammad!"
    },
    {
        "character": "Joseph Smith",
        "line": "Joseph Smith!"
    },
    {
        "character": "Krishna",
        "line": "Krishna!"
    },
    {
        "character": "Lao Tse",
        "line": "Lao Tse!"
    },
    {
        "character": "Seaman",
        "line": "Sea-Man!"
    },
    {
        "character": "Jesus",
        "line": "The mass suicide is over, Blaine! And so are you!"
    },
    {
        "character": "Blaine",
        "line": "I don't think so. Get them! [Blaintologists go on the attack. Two of them go for Mohammad, who shoots flames at them. They scream.]"
    },
    {
        "character": "Joseph Smith",
        "line": "My ice breath should take care of you. [blasts some air at an oncoming Blaintologist, who freezes in place]"
    },
    {
        "character": "Stan",
        "line": "[emerges from the crowd and looks around the Reflecting Pool] Kyle! Kyle!"
    },
    {
        "character": "Blaintologist",
        "line": "Sweet Salvation! [Stan sees the man drown, then notices a boy in the pool]"
    },
    {
        "character": "Stan",
        "line": "Kyle?? [frantically, he goes into the pool and reaches the boy, turning him over. A few seconds of observation and... gasp] Oh my God, they've killed Kenny!"
    },
    {
        "character": "Kyle",
        "line": "[off-screen] You bastards!"
    },
    {
        "character": "Stan",
        "line": "Kyle? [looks to his left and calls out] Oh my God, they've killed Kenny!"
    },
    {
        "character": "Kyle",
        "line": "[off-screen] You bastards! [Stan looks up and follows Kyle's voice]"
    },
    {
        "character": "Stan",
        "line": "Oh my God, they've killed Kenny!"
    },
    {
        "character": "Jesus",
        "line": "That takes care of them."
    },
    {
        "character": "Joseph Smith",
        "line": "Now it's your turn, Blaine!"
    },
    {
        "character": "Blaine",
        "line": "Perhaps you need to see some real magic. [floats up to Lincoln's left foot and touches it. His magic infuses the statue with life, and Lincoln breaks free from his chair]"
    },
    {
        "character": "Lincoln",
        "line": "Raaargh! [steps down towards the crowd]"
    },
    {
        "character": "Buddha",
        "line": "Oh this looks like trouble."
    },
    {
        "character": "Blaine",
        "line": "[floating high above the crowd] So long, Super Best Fools!"
    },
    {
        "character": "Stan",
        "line": "[reaches Kyle] Kyle!"
    },
    {
        "character": "Kyle",
        "line": "Stan!"
    },
    {
        "character": "Stan",
        "line": "Kyle, you can't kill yourself!"
    },
    {
        "character": "Kyle",
        "line": "I don't want to kill myself. They rigged this thing to fill with water! [tremulous footsteps are felt, and Lincoln is shown walking among the crowd of Blaintologists]"
    },
    {
        "character": "Jesus",
        "line": "We've gotta stop that oversized Abraham Lincoln! Mohammad! [Mohammad rises into the air and blasts Lincoln with flames. Lincoln growls and swats Mohammad away with ease] Great Scott!"
    },
    {
        "character": "Cartman",
        "line": "[trying to drown himself from the edge of the Reflecting Pool] Bliegh! [rises. His body is on land] Yugh. Uh, okay, try again. Hep [dunks his head in the water again]."
    },
    {
        "character": "",
        "line": "Shot of Washington D.C. from the Vietnam Memorial. Lincoln is taking buildings off their foundations and tossing them aside. Krishna, in the form of an eagle, flies over the scene. Flames are everywhere."
    },
    {
        "character": "Mohammad",
        "line": "It is too powerful, Jesus!"
    },
    {
        "character": "Krishna",
        "line": "[lands] It seems to have no weakness!"
    },
    {
        "character": "Jesus",
        "line": "There has to be a way to destroy it. [raises his left wrist to speak into the watch] Jesus to Moses!"
    },
    {
        "character": "",
        "line": "The Hall of Super Best Friends, day, at that moment"
    },
    {
        "character": "Narrator",
        "line": "Meanwhile, at the Super Best Friends League..."
    },
    {
        "character": "Jesus",
        "line": "Come in, Moses!"
    },
    {
        "character": "Moses",
        "line": "What?"
    },
    {
        "character": "Jesus",
        "line": "We need to know how to kill a giant stone Abraham Lincoln."
    },
    {
        "character": "Moses",
        "line": "...Um... Let me think, um... a giant stone John Wilkes Booth?"
    },
    {
        "character": "Jesus",
        "line": "[thinks for a moment] You heard him, Super Best Friends! We've got to make a giant stone John Wilkes Booth!"
    },
    {
        "character": "Mohammad",
        "line": "Krishna, we're going to need wood for a mold!"
    },
    {
        "character": "Krishna",
        "line": "Form of... a beaver! [transforms into a beaver and runs off to chop down trees]"
    },
    {
        "character": "Mohammad",
        "line": "I will find sources to concrete. [points to Seaman] You, get the water to mix it with, Seaman. [the other friends laugh]"
    },
    {
        "character": "Narrator",
        "line": "Using the wood that Krishna cut down as a beaver, Jesus uses his master carpentry skills to make a giant mold."
    },
    {
        "character": "Jesus",
        "line": "That should do the trick. Now for some concrete."
    },
    {
        "character": "Narrator",
        "line": "Meanwhile, in the ocean depths, Seaman seeks out water to mix with the concrete."
    },
    {
        "character": "Seaman",
        "line": "Sea-Man! [lands on the ocean bottom] Look, Swallow, we should be able to divert the water with that pipe."
    },
    {
        "character": "Narrator",
        "line": "And so, Seaman and Swallow get to... get to work [laughs]"
    },
    {
        "character": "",
        "line": "The Reflecting Pool, later. Water fills the bubble Kyle is in, and he struggles to breathe"
    },
    {
        "character": "Stan",
        "line": "Kyle, you have to hold your breath! [a giant stone hand comes down and grabs the bubble as Stan looks on helplessly. Everyone backs away from the stone Lincoln as it holds Kyle in its left hand. Lincoln shakes Kyle around like a snow globe, and Stan gets mad] Oh, very funny! [Seaman and Joseph Smith pour the raw materials needed for a statue into Jesus' mold, and Mohammad fires the statue like a piece of clay. The likeness of John Wilkes Booth appears on the statue]"
    },
    {
        "character": "Jesus",
        "line": "Lao Tse, bring it to life. [Lao Tse puts index fingers to temples and shuts his eyes to concentrate on the task at hand]"
    },
    {
        "character": "Narrator",
        "line": "Using his power of Taoism, Lao Tse becomes one with the giant stone John Wilkes Booth. [the Booth statue begins to move. It breaks out of its mold, walks up behind the Lincoln statue, and fires one stone bullet into the back of Lincoln's head. Lincoln's head jerks back, and he falls forward, ending up face down. The bubble falls out of his hand and breaks up on the ground. Kyle is washed out]"
    },
    {
        "character": "Kyle",
        "line": "Wagh. [sits up]"
    },
    {
        "character": "Jesus",
        "line": "It worked. Now freeze over the pool so no one else can drown themselves! [Quickly, Joseph Smith reaches the Reflecting Pool and blows ice-cold air over it. The water turns to white ice as other Blaintologists try to drown themselves. Cartman tries once more, but looks up quickly]"
    },
    {
        "character": "Cartman",
        "line": "Hey, I was just about to do it."
    },
    {
        "character": "",
        "line": "The Reflecting Pool, later. The crowd of Blaintologists is still there, and the water has melted"
    },
    {
        "character": "Narrator",
        "line": "Later, at exactly the same location..."
    },
    {
        "character": "Blaine",
        "line": "[now in his escape vehicle, on its own launcher] Damn you, Super Best Friends!"
    },
    {
        "character": "Jesus",
        "line": "Your magic is no match for our powers combined, Blaine!"
    },
    {
        "character": "Blaine",
        "line": "Then I guess you win this time, Super Best Fools! But I'll be back! [he fires up the little rocket ship and takes off into the sky]"
    },
    {
        "character": "Jesus",
        "line": "Goddamnit! [behind him and the other Super Best Friends is a city in ruins]"
    },
    {
        "character": "Buddha",
        "line": "It's alright. Everything is as it should be."
    },
    {
        "character": "Jesus",
        "line": "Oh, shut up, Buddha!"
    },
    {
        "character": "Steven",
        "line": "Our leader, he... he's leaving us! [a Blaintologist, about to drown himself, looks up and sees the ship fly away]"
    },
    {
        "character": "Blaintologist",
        "line": "Don't leave us, David Blaine!"
    },
    {
        "character": "Stan",
        "line": "[with mic. Kyle and Cartman stand some distance to his left] Listen up, everyone! [the Super Best Friends gather behind him] You don't need David Blaine to tell you how to live. See, cults are dangerous because they promise you hope, happiness and, maybe even an afterlife. But in return, they demand you pay money. Any religion that requires you to pay money in order to move up and... learn its tenets is wrong. See, all religions have something valuable to teach, but, just like the Super Best Friends learned, it requires a little bit of them all."
    },
    {
        "character": "Blaintologist",
        "line": "He's right. He... he's right! [the crowd cheers, and Stan walks over to Kyle]"
    },
    {
        "character": "Kyle",
        "line": "Thanks for saving us Stan. You're my Super Best Friend."
    },
    {
        "character": "Stan",
        "line": "Your my Super Best Friend too, Kyle."
    },
    {
        "character": "Cartman",
        "line": "Oh, that's so sweet you guys. [Stan and Kyle are not amused] You wanna go get a room so you can make out for a while? Heheheheheh [Kyle turns and kicks Cartman in the groin, knocking him down]"
    },
    {
        "character": "Kyle",
        "line": "[moves away so Stan can have a turn] Haha, hehahaha."
    },
    {
        "character": "Cartman",
        "line": "[Stan kicks him] Ah! [Kyle's turn] Ow, stop it! [Stan's turn] Ah! [they continue taking turns kicking Cartman in the groin  Roshambo!]"
    },
    {
        "character": "Jesus",
        "line": "Well, it looks like everything worked out. [the Super Best Friends take off into the air]"
    },
    {
        "character": "Narrator",
        "line": "And so, Jesus and his companions leave Washington. But their return is assured, for there will always be a need for... the Super Best Friends!"
    }
]