[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary School Gym, day. Stan, without his hat, is seated on a stool, none too pleased, before a backdrop of a meadow. Behind the photographer are the kindergartners and Mr. Adler's class"
    },
    {
        "character": "Photographer",
        "line": "Okay, now lift your chin a little. [no change on Stan's face] Look right here. Right here. [points at the camera lens] Hey, where's my smile? Come on, I bet you got a smile for me. I-I'm startin' to see a smile. [Stan doesn't smile] There it is. [FLASH!] Okay great, next."
    },
    {
        "character": "Stan",
        "line": "[reaches for his hat and puts it on] I didn't smile. [hops off the stool and walks away. A wider view shows Ms. Choksondik's class in line off to the right. The kids move forward. Butters heads for the stool]"
    },
    {
        "character": "Kyle",
        "line": "I hate picture day at school! It's always some gay-ass photographer with some gay-ass backdrop of New England!"
    },
    {
        "character": "Butters",
        "line": "[in dress shirt and tie, holds out his palms] Ah, hang on a second. My mom said to make sure I look good this time in... the school pictures. [pulls out a comb and some gel, dabs the gel on the comb, and combs his hair back. Four strokes, and he's done]"
    },
    {
        "character": "Photographer",
        "line": "Okay, smile [Butters smiles, a lock of his hair goes up, and he blinks. Then the picture is taken, and Butters opens his eyes] Okay, next? [Butters hops off; Bebe, wearing heavy makeup, approaches and hops onto the stool]"
    },
    {
        "character": "Stan",
        "line": "[joins Kyle at the end of the line] Did you go yet?"
    },
    {
        "character": "Kyle",
        "line": "No. This is taking forever."
    },
    {
        "character": "Cartman",
        "line": "[rushes up, giddily breathless] You guys! You guys! This is sooo funny!"
    },
    {
        "character": "Kyle",
        "line": "What, Cartman?"
    },
    {
        "character": "Cartman",
        "line": "Dude, check it out: for picture day, Kenny got into his parka backwards, so that his ass shows through his hood. Look! [points]. Kenny, Kenny, over here! [Kenny comes in looking as Cartman described, with his hands on the floor and his feet in the air, laughing uncontrollably. After Kenny stands still, Cartman roars with laughter]"
    },
    {
        "character": "Kyle",
        "line": "It isn't that funny, Cartman."
    },
    {
        "character": "Cartman",
        "line": "Yes it is! [while this is going on, the other kids get their pictures taken, Tolkien being the last one. He hops off the stool and walks away.]"
    },
    {
        "character": "Ms. Choksondik",
        "line": "Next in line! Come on, let's keep it moving, kids! [Kyle walks up to the stool]"
    },
    {
        "character": "Cartman",
        "line": "...Don't listen to that Jew, Kenny, it's totally funny."
    },
    {
        "character": "Photographer",
        "line": "[Kyle sits for the camera] Take off your hat, please."
    },
    {
        "character": "Kyle",
        "line": "But I never take off my hat."
    },
    {
        "character": "Photographer",
        "line": "Come on now, I bet your parents want a picture of YOU lookin' natural."
    },
    {
        "character": "Kyle",
        "line": "This is how I look natural."
    },
    {
        "character": "Ms. Choksondik",
        "line": "Kyle, we're taking pictures without hats today!"
    },
    {
        "character": "Kyle",
        "line": "[angrily] Crap. [takes off his hat to reveal big red bushy hair]"
    },
    {
        "character": "Photographer",
        "line": "Smile! Come on, where's that smile? Is it gonna kill you to smile? I see a smile. [Kyle gives a small grin, and the picture is taken. He goes back to being angry, re-dons his hat and hops off the stool] Next!"
    },
    {
        "character": "Kyle",
        "line": "Gay-ass. [Cartman hops on, takes off his hat and quickly strikes a pose]"
    },
    {
        "character": "Photographer",
        "line": "[takes the picture] Very nice. Okay, last one? [hops off laughing as Kenny approaches]"
    },
    {
        "character": "Cartman",
        "line": "Uh oh. [laughs]"
    },
    {
        "character": "Photographer",
        "line": "Okay, have a seat, young man. [both Cartman and Kenny chuckle as Kenny sets himself down] Well, okay, lookin' great. Now where's that smile? Come on, give me a nice, wide smile. Wider. Perfect! [FLASH!]"
    },
    {
        "character": "Cartman",
        "line": "Huh, how long 'til we get the pictures back?"
    },
    {
        "character": "Photographer",
        "line": "Should be about four days."
    },
    {
        "character": "Cartman",
        "line": "Four days?? Oh man, I can't wait that long!"
    },
    {
        "character": "",
        "line": "South Park Elementary, four days later, day. Inside, in Ms. Choksondik's class, Cartman is fidgeting rather loudly in his desk"
    },
    {
        "character": "Cartman",
        "line": "Heh, c'mon! C'mon c'mon c'mon c'mon! C'mon c'mon! C'mon c'mon c'mon!"
    },
    {
        "character": "Ms. Choksondik",
        "line": "Alright, class, I have your school photos to hand out-"
    },
    {
        "character": "Cartman",
        "line": "[bouncing in his seat] YES! YES!"
    },
    {
        "character": "Ms. Choksondik",
        "line": "Most of them are very nice. But, apparently, one of you thinks it's fun to spoil their school pictures [Kenny looks around], and thinks he's a comedian. That person will be spending the afternoon in the principal's office!"
    },
    {
        "character": "Kenny",
        "line": "(Aww, that's bullshit!)"
    },
    {
        "character": "Ms. Choksondik",
        "line": "School photos aren't for joking around, so you aren't getting your photo back, Butters! [thrusts the photo out for a close-up]"
    },
    {
        "character": "Butters",
        "line": "Um-me?? Huh but I didn't do nothin'."
    },
    {
        "character": "Ms. Choksondik",
        "line": "For the rest of you, I think your pictures turned out very nicely."
    },
    {
        "character": "Butters",
        "line": "But, buut, but but what hey! Wait a minute! [the others get their photos and review them]"
    },
    {
        "character": "Cartman",
        "line": "[rushes up and takes Kenny's photos] Let me see! [returns to his seat. Stan and Kyle look at Cartman curiously while Kenny looks on angrily]"
    },
    {
        "character": "Butters",
        "line": "[catches up to Ms. Choksondik as she sits at her chair] Bu-but Teacher, I didn't mean to look stupid in my picture. Honest!"
    },
    {
        "character": "Cartman",
        "line": "[opens Kenny's envelope and looks at the photo, then roars with laughter] Dude, dude! Check it out! This is the sweetest thing I've ever done!"
    },
    {
        "character": "Kenny",
        "line": "(You've ever done?!)"
    },
    {
        "character": "Cartman",
        "line": "[Laughs] Look at how the crap ...is sittin' right in the middle! [laughs some more]"
    },
    {
        "character": "Ms. Choksondik",
        "line": "Eric, calm down. I'm trying to yell at Butters!"
    },
    {
        "character": "Cartman",
        "line": "Okay, hokay, I'm sorry Ms. Chokesonrocks!"
    },
    {
        "character": "Ms. Choksondik",
        "line": "You know very well my name isn't Chokesonrocks, it's Choksondik! Say it right or you can go to the principal's with Butters!"
    },
    {
        "character": "Cartman",
        "line": "I'm sorry Ms. Choksondik."
    },
    {
        "character": "Butters",
        "line": "I tried to make a good picture. Honest."
    },
    {
        "character": "Ms. Choksondik",
        "line": "Your mother is waiting for you in the principal's office. [points towards the door]"
    },
    {
        "character": "Butters",
        "line": "My mom? [turns around and walks out] Oh, sweet Jesus!"
    },
    {
        "character": "Cartman",
        "line": "Hoh, Oh my God! More people have to see this picture, you guys. I'm gonna put it on the Internet or... No, wait! Kenny. [Kenny looks over] I just had the greatest idea... ever!"
    },
    {
        "character": "",
        "line": "Dairy Gold Milk Company, day. A receptionist in blue suit sits at her desk. The doors open and Cartman enters"
    },
    {
        "character": "Receptionist",
        "line": "Welcome to South Park Milk Company. Can I help you?"
    },
    {
        "character": "Cartman",
        "line": "Oh, yes, hello. I am helping out a family who has a missing child, and I was wondering if you could print his photo on your milk carton? [stifles a laugh]"
    },
    {
        "character": "Receptionist",
        "line": "Oh, of course. Printing those photos on our milk really does help. Do you have the photo with you?"
    },
    {
        "character": "Cartman",
        "line": "Yes, I have it right hmya. [shows her Kenny's school photo]"
    },
    {
        "character": "Receptionist",
        "line": "[takes the photo] O-okay, great. We'll print it immediately."
    },
    {
        "character": "Cartman",
        "line": "You will? [tries not to laugh, but some escapes] Ah. [stifles another laugh] Oh, ah, thank you for your help."
    },
    {
        "character": "Receptionist",
        "line": "Sure. If I could get a description of the child to print underneath the photo? [Cartman stops in his tracks and turns around]"
    },
    {
        "character": "Cartman",
        "line": "Oh, yehes. Uh-heh. He has ah, blond hair, aha-and, ah, and a brown eye. [sniggers, then laughs] Brown eye! [laughs some more under his breath]"
    },
    {
        "character": "Receptionist",
        "line": "Okay, brown eye..."
    },
    {
        "character": "Cartman",
        "line": "And, and big rosy cheeks! [laughs some more]"
    },
    {
        "character": "Receptionist",
        "line": "...Full cheeks..."
    },
    {
        "character": "Cartman",
        "line": "[cracks up] Full cheeks! [laughs] Winking brown eye, brown eye winking! [cracks up]"
    },
    {
        "character": "",
        "line": "Stan's house, day. A TV is heard."
    },
    {
        "character": "Reporter",
        "line": "Ms. Hamilton was the fourth person to be run over by a motorcycle this week, leaving a city to ponder, who will be next? [Stan and Kyle are on the sofa eating popcorn. The phone rings, and Kyle answers it]"
    },
    {
        "character": "Kyle",
        "line": "Hello?"
    },
    {
        "character": "Cartman",
        "line": "[between the laughter] You guys! You guys! You guys! [laughs uncontrollably]"
    },
    {
        "character": "Kyle",
        "line": "Hello?"
    },
    {
        "character": "Cartman",
        "line": "[more laughter] ...You guys!... [more laughter]"
    },
    {
        "character": "Kyle",
        "line": "[getting annoyed] Cartman?"
    },
    {
        "character": "Cartman",
        "line": "[more laughter] You guys! You guys! You guys! Hurry. [hangs up]"
    },
    {
        "character": "Stan",
        "line": "What's he want?"
    },
    {
        "character": "Kyle",
        "line": "[pissed off] I don't know. Let's go see. [they walk off]"
    },
    {
        "character": "",
        "line": "Cartman's house, minutes later. Cartman can be heard laughing inside as Stan and Kyle approach his door. Kyle rings the doorbell and Cartman answers, still laughing."
    },
    {
        "character": "Kyle",
        "line": "Why'd you call us?"
    },
    {
        "character": "Cartman",
        "line": "Come on. Come on. [whispers] Come on.[leads the way] Oho, this is so sweet! [still laughing as he walks to the sofa and picks up a milk carton] You guys, seriously, this is sooo sweet!"
    },
    {
        "character": "Stan",
        "line": "Goddamnit Cartman, what?! [Cartman hands him the carton and erupts in laughter as Stan and Kyle look it over]"
    },
    {
        "character": "Kyle",
        "line": "...You put Kenny's picture on a milk carton??"
    },
    {
        "character": "Cartman",
        "line": "Look at, look at the description. Brown eye! [falls to the floor, pounding the carpet with his fists in hysterics]"
    },
    {
        "character": "Stan",
        "line": "That isn't funny, Cartman."
    },
    {
        "character": "Cartman",
        "line": "Oh, it's soo completely funny!! Ahaha this is certainly funny!!"
    },
    {
        "character": "Kyle",
        "line": "No it's not, Cartman. You know, there really are couples out there who are missing children."
    },
    {
        "character": "Cartman",
        "line": "No there aren't. Jesus, grow up, you guys."
    },
    {
        "character": "",
        "line": "A house in Wisconsin. A woman enters her kitchen with some groceries and sets them on the kitchen counter next to the sink. She pulls them out one by one, but stops when she pulls out the milk carton"
    },
    {
        "character": "Martha",
        "line": "[gasps] Oh my God. Oh my God! [holds the carton close. Her face looks like a derriere] Steven! Steven, come quick!"
    },
    {
        "character": "Steven",
        "line": "[rushes in. His face does also.] What is it, Martha?"
    },
    {
        "character": "Martha",
        "line": "Look. It's him! It's... our son."
    },
    {
        "character": "Steven",
        "line": "Our ssson!"
    },
    {
        "character": "",
        "line": "Dairy Gold Milk Company, day, a few days later. The Wisconsin couple are at the Dairy Gold Milk Company, talking to the receptionist. Their \"s\" and sometimes \"th\" comes out sounding like a raspberry"
    },
    {
        "character": "Martha",
        "line": "...and so that's when I called out to my husband. I just knew the boy picture on your milk carton was our little Tommy."
    },
    {
        "character": "Receptionist",
        "line": "[stunned] ... yes, I see. [pics up a milk carton carton] Uh, but the child on the milk carton was reported missing, not found."
    },
    {
        "character": "Steven",
        "line": "We realize that. But we just thought that maybe someone else had found Tommy, and then lost him again. We're pretty certain that it's our boy, considering his physical appearance. Martha and I have the... same condition."
    },
    {
        "character": "Receptionist",
        "line": "...Riiight."
    },
    {
        "character": "Steven",
        "line": "You may not have realized this, but we actually have buttocks where our heads should be."
    },
    {
        "character": "Receptionist",
        "line": "[flatly] ...Really?"
    },
    {
        "character": "Steven",
        "line": "Yes."
    },
    {
        "character": "Martha",
        "line": "Steven and I have a condition called \"torsonic polarity syndrome.\" It's a birth defect that's passed on genetically."
    },
    {
        "character": "Steven",
        "line": "Over eleven people worldwide suffer from TPS."
    },
    {
        "character": "Receptionist",
        "line": "[flatly] Hmm, hmm, that's am-, that's amazing."
    },
    {
        "character": "Steven",
        "line": "Martha and I were lucky enough to meet each other at a TPS convention in France."
    },
    {
        "character": "Receptionist",
        "line": "So... do you have heads down where your rear ends should be?"
    },
    {
        "character": "Steven",
        "line": "No no, don't be silly. You see, with TPS, the birth defect is on the exterior only. Behind this we still have all our vital head organs - tongue, eyes, nasal passages..."
    },
    {
        "character": "Receptionist",
        "line": "Well, Mr. and Mrs..."
    },
    {
        "character": "Steven",
        "line": "Uh, Thompssson."
    },
    {
        "character": "Receptionist",
        "line": "...Thompson. Uh, I'll contact the young boy who gave me the photo, and perhaps we can all visit him together."
    },
    {
        "character": "Martha",
        "line": "Oh, wonderful! Steven, we're goin' to see Tommy again!"
    },
    {
        "character": "Steven",
        "line": "Now, Martha, what did I say about getting our hopesss up?"
    },
    {
        "character": "Martha",
        "line": "You're right. You're right."
    },
    {
        "character": "",
        "line": "Cartman's house, moments later. Cartman is laughing his ass off on the sofa when Stan and Kyle return to see him."
    },
    {
        "character": "Kyle",
        "line": "...Okay Cartman, what do you want this time?"
    },
    {
        "character": "Cartman",
        "line": "[gets up and hops off the sofa] Oho, you guys, you guys! Oh my God. [tries to compose himself] Okay, okay, so get this, get this: The milk company calls me, right? [wipes some moisture from his face] And they call me and say that two people from Wisconsin... saw the picture of Kenny on the milk carton, and they think it's their kid. [cracks up again]"
    },
    {
        "character": "Stan",
        "line": "...Dude, that's not funny if they're missing their son."
    },
    {
        "character": "Cartman",
        "line": "No, nonono! Because apparently these two people... also kind of look like they have butts where their heads should be! [waits a second, then roars with laughter again]"
    },
    {
        "character": "Kyle",
        "line": "...Nuh uh."
    },
    {
        "character": "Cartman",
        "line": "Oh yes! And the best part is... they're coming here, to my house. And it's gonna be sooo funny!! [roars with laughter again. The doorbell rings and all three look at the door] Oh Jesus, that's probably them now! Okay, you guys, just play it cool, just play it-, just-sshh. No, sshh, you guys, sshh. [walks over to answer the door. He stops and stifle a laugh] Just- okay [chuckles] No. [takes a few steps] Okay, okay, no, you guys, sh, sh. [steps to the door, takes a deep breath, and opens it, grinning]"
    },
    {
        "character": "Martha",
        "line": "[greeting] Hello, we're Mr. and Mrs. Thompson. [Cartman stands there grinning, then it disappears into a frown. A few moments later he turns around dejected.]"
    },
    {
        "character": "Cartman",
        "line": "Oh God."
    },
    {
        "character": "Kyle",
        "line": "[starts laughing, but stifles it with his hands over his mouth] Hohly crahap, duhude, heh!"
    },
    {
        "character": "Stan",
        "line": "No way! [Cartman turns around and looks again, frowning]"
    },
    {
        "character": "Steven",
        "line": "We understand you've seen our son. [Cartman looks speechless, then turns around looking lost]"
    },
    {
        "character": "Cartman",
        "line": "[very softly] Oh my... God. [walks away from the door quite afraid, then begins to ascend the stairs stammering nonsense]"
    },
    {
        "character": "Stan",
        "line": "Cartman, where are you going?? [Cartman keeps walking. The Thompsons simply shrug their shoulders, looking at each other]"
    },
    {
        "character": "Martha",
        "line": "[holds up the milk carton] Uh, excuse me, boys, do you know anything about this?"
    },
    {
        "character": "Kyle",
        "line": "[giggles a bit] Uh"
    },
    {
        "character": "Stan",
        "line": "Oh boy."
    },
    {
        "character": "Kyle",
        "line": "Eh-heh. L-look, if you want an explanation, you you'd better go to Kenny's house."
    },
    {
        "character": "Stan",
        "line": "Yeah. He lives about four houses away in the bad side of town."
    },
    {
        "character": "Martha",
        "line": "[Steven puts his arm around her shoulder] Oh thank you. Thank you! [they turn and walk away. The receptionist waits for them on the walkway]"
    },
    {
        "character": "Receptionist",
        "line": "Well?"
    },
    {
        "character": "Steven",
        "line": "They said to inquire four houses down."
    },
    {
        "character": "Martha",
        "line": "Let's hurry! [leads the way down the street. Steven and the receptionist follow]"
    },
    {
        "character": "",
        "line": "Cartman's room, moments later. Cartman is at a loss for words and looks scared. The door opens and Kyle and Stan walk in."
    },
    {
        "character": "Kyle",
        "line": "Ehheh, Cartman, what the hell are you doing?"
    },
    {
        "character": "Stan",
        "line": "Yeah, you missed them turning around."
    },
    {
        "character": "Cartman",
        "line": "You guys, something's wrong."
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Cartman",
        "line": "I think... I.. just.. saw the funniest thing I'll ever see. And I... think... I... blew a funny fuse."
    },
    {
        "character": "Kyle",
        "line": "[quizzically] Blew a funny fuse?"
    },
    {
        "character": "Cartman",
        "line": "[turns to face them] It was just too much and my sense of humor overloaded. [turns away] I don't think anything will ever be funny again. Oh God. What have I got?"
    },
    {
        "character": "",
        "line": "Outside, on the sidewalk. Six kids are walking along: Kyle, Stan, Tolkien, Clyde, Craig, and Tweek"
    },
    {
        "character": "Clyde",
        "line": "You mean they both have butts instead of heads?"
    },
    {
        "character": "Stan",
        "line": "Yeah, dude, we'll show you. They're over at Kenny's."
    },
    {
        "character": "Tolkien",
        "line": "How do they eat?"
    },
    {
        "character": "Stan",
        "line": "How the hell should we know? [the kids stop before a house]"
    },
    {
        "character": "Kyle",
        "line": "Butters! Hey Butters! You have to check this out!"
    },
    {
        "character": "Butters",
        "line": "[opens his bedroom window and looks down] W-what?"
    },
    {
        "character": "Kyle",
        "line": "You gotta come to Kenny's house with us."
    },
    {
        "character": "Stan",
        "line": "There's these two people with asses where their heads should be."
    },
    {
        "character": "Butters",
        "line": "Ahah-I can't, fellas. Ah-I'm grounded for lookin' stupid in my school picture."
    },
    {
        "character": "Stan",
        "line": "But dude, you gotta see it; it's hysterical!"
    },
    {
        "character": "Linda",
        "line": "Butters can't come out and play, boys. He thinks it's funny to look like a jackass in his school pictures that I have to pay for!"
    },
    {
        "character": "Butters",
        "line": "Huh, but I told you mom: ah-I didn't mean to look... like a jackass, eh. It just happened."
    },
    {
        "character": "Linda",
        "line": "You made a goofy face!"
    },
    {
        "character": "Butters",
        "line": "No! That's just what I look like. See?"
    },
    {
        "character": "Linda",
        "line": "[turns around and looks up] ...Don't you make that face at me, young man!"
    },
    {
        "character": "Butters",
        "line": "I'm not makin' a face, mom!"
    },
    {
        "character": "Linda",
        "line": "Stop it!"
    },
    {
        "character": "Craig",
        "line": "...Come on, we wanna see the ass people."
    },
    {
        "character": "Kyle",
        "line": "Alright. [the kids turn left and walk away]"
    },
    {
        "character": "Linda",
        "line": "Fine Butters! If you don't wanna stop making that stupid face at me, you can just stay in your room for another week! [goes inside and shuts the door.]"
    },
    {
        "character": "Butters",
        "line": "Another week? [turns around and drops down] I hate my stupid face."
    },
    {
        "character": "",
        "line": "Mr. Mackey's office, day. Cartman is on the couch laying on his back..."
    },
    {
        "character": "Mr. Mackey",
        "line": "Okay Eric, as your counselor, uh I want you to feel comfortable talking about anything, m'kay?"
    },
    {
        "character": "Cartman",
        "line": "Mr. Mackey, is it possible that you can see something so funny that it ruins your sense of humor forever?"
    },
    {
        "character": "Mr. Mackey",
        "line": "Well, I can't think of anything that would be THAT funny."
    },
    {
        "character": "Cartman",
        "line": "Two people with asses for heads. Ever since I saw them I can't laugh at anything."
    },
    {
        "character": "Mr. Mackey",
        "line": "Oh, I see, well... Well, what did you used to think was funny?"
    },
    {
        "character": "Cartman",
        "line": "You know, all the usual stuff. Dirty jokes, funny movies, seeing someone die... [Mr. Mackey is shocked by the last one] This morning, I even saw a little girl get her fingers caught in a car door and... I couldn't laugh. I mean I... I knew it was funny, but I couldn't laugh."
    },
    {
        "character": "Mr. Mackey",
        "line": "Well Eric, I suppose that, just like everything else, laughter can be relative - in, in other words, sometimes people see somethin' so scary that nothin' else scares them, so, the same could be true for funny things."
    },
    {
        "character": "Cartman",
        "line": "[turns over to look at Mr. Mackey] So does that mean I'll never laugh again?"
    },
    {
        "character": "Mr. Mackey",
        "line": "It's possible, hm'kay? [Cartman turns over and lays on his back again] But you know, if you have completely lost your sense of humor, you can always become a writer for the show, \"Friends\" [laughs at the unexpected humor in his own statement]. Ohokahay, huhuh."
    },
    {
        "character": "Cartman",
        "line": "Ugh."
    },
    {
        "character": "",
        "line": "The McCormick house, later. The Thompsons' car is parked outside, on the street. Inside, the McCormicks, the Thompsons and the receptionist are seated around the coffee table. A brick has replaced two of its legs. Kenny stands beside his mother."
    },
    {
        "character": "Carol",
        "line": "...and so you see, our son was just playing a joke and the little fat kid put it on the carton."
    },
    {
        "character": "Martha",
        "line": "Yes. Yes, I see."
    },
    {
        "character": "Carol",
        "line": "Kenny, don't you think you owe the Thompsons an apology? [Kenny just stares at them]"
    },
    {
        "character": "Martha",
        "line": "...No, it was foolish for us to get our hopes up."
    },
    {
        "character": "Steven",
        "line": "It was just such a coincidence, considering the photo. You may not have realized this, but Martha and I have buttocks where our heads should be."
    },
    {
        "character": "Stuart and Carol",
        "line": "Really?"
    },
    {
        "character": "Receptionist",
        "line": "Mr. and Mrs. Thompson, how long has it been since you've seen your son?"
    },
    {
        "character": "Steven",
        "line": "Tommy disappeared when he was only seven."
    },
    {
        "character": "Martha",
        "line": "[leans into Steven's right shoulder, sobbing, and he comforts her] Oh, Steven, it's like it's all happening all over again. [sobs uncontrollably]"
    },
    {
        "character": "Carol",
        "line": "[rises to soother her also] There there now. [looks around, then walks off]"
    },
    {
        "character": "Receptionist",
        "line": "Please, Mrs. Thompson, it'll be alright. [Martha continues sobbing] Listen, the South Park Dairy Company is the country's largest. We find lost children all the time. [Carol returns with a box of tissues. Martha takes one and blows her \"nose\" with it. Stuart walks off again, and Martha resumes sobbing and blowing her nose] We can help you find Tommy with the company's database![Martha blows her \"nose\" even harder and louder.]"
    },
    {
        "character": "Carol",
        "line": "[holds her arms out as if to keep Martha away] Yes, well, aaah-I'll help you find your son. Just stop cryin', Please, for the love of God, stop cryin'!"
    },
    {
        "character": "Martha",
        "line": "[blows her nose again and sobs some more, then tries to compose herself] Ah, agh, I'm sorry. I'm sorry. [blows her nose]"
    },
    {
        "character": "Receptionist",
        "line": "Mr. Thompson, how did your son become missing? Was he abducted?"
    },
    {
        "character": "Steven",
        "line": "Yes. He was in the care of our nanny at the time."
    },
    {
        "character": "Martha",
        "line": "The nanny that we trusted so much took off with him and we still don't know why. [Stan and Tolkien are now looking in through the window. Kyle joins them. Martha sneezes] We think perhaps she wanted a child of her own. [a couple of hands try to get a grip on the window sill]"
    },
    {
        "character": "Receptionist",
        "line": "And this was back in Wisconsin? [Craig soon rises into view outside]"
    },
    {
        "character": "Steven",
        "line": "Yes, but we last heard the nanny was heading west. [Tolkien, Craig, and Kyle start laughing. Tweek pops up and pushes Craig out of the way to have a good look. Stan laughs, and Craig climbs up on Tweek.] That's why we thought Colorado made sssssense."
    },
    {
        "character": "Martha",
        "line": "We've tried every avenue to find him, [Officer Barbrady happens by and says something. The kids jump] but, we've never tried the milk company. [Stan seems to tell Barbrady to come over and look at the ass people.]"
    },
    {
        "character": "Receptionist",
        "line": "Well you just give us a try. I think you'll find that South Park Milk [Barbrady approaches] is not only the best resource for finding kids, [Barbrady's eyes widen] but also the best producer of the freshest 2% lowfat milk the world can offer. [Barbrady walks away and calls out to some people, then returns to the window]"
    },
    {
        "character": "Martha",
        "line": "Thank you. Thank you so much for helping us. [Mr. Garrison walks by and looks in, then seems to say \"Holy crap!\"]"
    },
    {
        "character": "Steven",
        "line": "This certainly is a friendly town. [Sheila shows up behind Kyle] You've all been sssssso wonderful. [Chef shows up behind Mr. Garrison]"
    },
    {
        "character": "Martha",
        "line": "Yes, I'm so grateful I just wanna cry again."
    },
    {
        "character": "Stuart and wife, and Receptionist",
        "line": "[they hold their palms out] NO!"
    },
    {
        "character": "",
        "line": "The Bijou Theater, day. \"Grossout Comedy 8\" is playing there. Inside, Cartman sits amid a bunch of older folk"
    },
    {
        "character": "Male 1",
        "line": "Dude, why are you wearing Shalayna's panties? [the audience laughs; Cartman sits there, glum, his head resting on his left hand.]"
    },
    {
        "character": "Male 2",
        "line": "I have to wear Shalayna's panties. Lisa's were in the wash. [the audience laughs; Cartman just blinks.] Look, can we just get this over with?"
    },
    {
        "character": "Male 1",
        "line": "But dude, I can't French-kiss him. He's my grandpa! [the audience laughs]"
    },
    {
        "character": "Male 2",
        "line": "Come on, dude."
    },
    {
        "character": "Male 1",
        "line": "Oh, alright Here it goes. Come'ere, Grandpa."
    },
    {
        "character": "Audience",
        "line": "Aww"
    },
    {
        "character": "Cartman",
        "line": "[out of sorts] Oh, dude, oh."
    },
    {
        "character": "Jonesy",
        "line": "[noticing] Dude, what's wrong with you?"
    },
    {
        "character": "Cartman",
        "line": "Nothing's wrong with me. Uh-"
    },
    {
        "character": "Male 1",
        "line": "Well, I'm glad that's over with. We'd better go back to the house now to see how Chris is doing. [Cartman fakes a laugh and the audience turns to look at him. Cartman manages a few weak laughs, then sinks in his seat]"
    },
    {
        "character": "",
        "line": "Dairy Gold Milk Company, day. An official leads the Thompsons through the factory. Cows are lined up in their stalls eating from personal troughs."
    },
    {
        "character": "President",
        "line": "Uh Mr. and Mrs. Thompson, as President of the South Park Milk Company, I want to apologize personally for printing that falsified picture on our milk cartons."
    },
    {
        "character": "Steven",
        "line": "Please, please. It's not your fault."
    },
    {
        "character": "President",
        "line": "Ye-yes, but here at South Park Milk we strive for excellence. For instance, we are now entering the extraction room. [stops] As you can see, we keep it close to the refrigeration room. That way we can get the milk to the container as fast as possible. [commercial music comes up] That's why some say South Park milk tastes like you're suckin' it right from the cow's tits yourself."
    },
    {
        "character": "Martha",
        "line": "Amazing."
    },
    {
        "character": "President",
        "line": "[a worker comes by with some food] Here, try a glass of our cold Vitamin D. And our fresh scones. [the Thompsons take some milk and scones and start eating]"
    },
    {
        "character": "Steven",
        "line": "Delicious."
    },
    {
        "character": "Martha",
        "line": "Oh, excuse me. A little... difficult to drink with our condition. [the couple set their milks back on the tray and the worker walks out.]"
    },
    {
        "character": "Steven",
        "line": "Martha and I actually have buttocks where our heads should be."
    },
    {
        "character": "President",
        "line": "Really? Well. And in here we have our Missing Child Resource Center. [leads them into a large darkened room]"
    },
    {
        "character": "Martha",
        "line": "Oh my, isn't this impressive?"
    },
    {
        "character": "President",
        "line": "Yes. With the Kelrom 4000, Mrs. Garthunk can search a database of over 30 million missing child cases."
    },
    {
        "character": "Mrs. Garthunk",
        "line": "[the receptionist] We'll start the computer on a data search. Now, when did your son turn up missing?"
    },
    {
        "character": "Steven",
        "line": "Well, it was 1982. Tommy was only six at the time."
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Alright then. Computer..."
    },
    {
        "character": "Computer",
        "line": "Workiiing."
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Run a scan of missing children since 1982. Check for physical birth defects called TPS."
    },
    {
        "character": "Computer",
        "line": "TPS. Torsonic Polarity Syndrome. Child missing since 1982. Workiiing."
    },
    {
        "character": "President",
        "line": "So you actually haven't seen your son in over 20 years?"
    },
    {
        "character": "Martha",
        "line": "That's right."
    },
    {
        "character": "Mrs. Garthunk",
        "line": "But then, why did you think the picture of Kenny was him. Wouldn't your son be much older now?"
    },
    {
        "character": "Steven",
        "line": "Yes, but since he appeared to be at least eight in the photo, [takes a bite out of the scone and chews it] we assumed someone had seen him since we did."
    },
    {
        "character": "Martha",
        "line": "[pulls out a baby picture] This is the only photo we have of our little Tommy. [in diapers in a crib, looking like he's just finished eating]"
    },
    {
        "character": "Mrs. Garthunk",
        "line": "It's gonna take quite a while for the computer to do a scan of all missing kids."
    },
    {
        "character": "President",
        "line": "Well, why don't we let Mrs. Garthunk do her work, and I'll take you two out for some good old Colorado chili. [walks out. The Thompsons follow him]"
    },
    {
        "character": "Steven",
        "line": "We don't really like chili; it makes us throw up."
    },
    {
        "character": "",
        "line": "Cartman's house, living room, day. The door bell rings and Eric answers it. Jimmy stands at the entrance"
    },
    {
        "character": "Jimmy",
        "line": "Well, hello, Eric. I was really glad you called me, very much."
    },
    {
        "character": "Cartman",
        "line": "Jimmy! Thank God! Get in here! [goes inside, and Jimmy follows, closing the door]"
    },
    {
        "character": "Jimmy",
        "line": "What's this all about?"
    },
    {
        "character": "Cartman",
        "line": "Jimmy, you've always been my favorite standup comic. You've gotta help me. I've lost my sense of humor."
    },
    {
        "character": "Jimmy",
        "line": "Gee, that's a terrible thing, Eric. Um comedy can be the best therapy, very much."
    },
    {
        "character": "Cartman",
        "line": "I just have to find my funny bone again! Just try and make me laugh."
    },
    {
        "character": "Jimmy",
        "line": "Oh, I don't think that'll be hard. I've been working on my rr... routine."
    },
    {
        "character": "Cartman",
        "line": "Okay, let me have it."
    },
    {
        "character": "Jimmy",
        "line": "Okay. Try this one on for size: Why did the... pigeon cross the road?"
    },
    {
        "character": "Cartman",
        "line": "Okay, why?"
    },
    {
        "character": "Jimmy",
        "line": "Because it was having sex with the chihi... Because it was having sex with the ch-hi-hi... Because it was having sex with the ch-ch-ch-ch-ch-ch-ch... eh, it was having sex with the ch-ch-hiicken. [Cartman doesn't respond]"
    },
    {
        "character": "Cartman",
        "line": "...Naw, see? Somethng's wrong. I'm not laughing."
    },
    {
        "character": "Jimmy",
        "line": "Wow, what a great audience... How about this classic? Knock-knock."
    },
    {
        "character": "Cartman",
        "line": "Who's there?"
    },
    {
        "character": "Jimmy",
        "line": "Orange."
    },
    {
        "character": "Cartman",
        "line": "Orange who?"
    },
    {
        "character": "Jimmy",
        "line": "Orange you glad I didn't say banoo'n? Orange you glad I didn't say banoo'n? Orange you glad I didn't say bbb? Orange you glad I didn't say beh buhuhnnnaana?"
    },
    {
        "character": "Cartman",
        "line": "[stares back] ...naw, that didn't work either."
    },
    {
        "character": "Jimmy",
        "line": "Wow, w-what a great audience... Knock-knock."
    },
    {
        "character": "Cartman",
        "line": "Who's there?"
    },
    {
        "character": "Jimmy",
        "line": "An interrupting ca'ow."
    },
    {
        "character": "Cartman",
        "line": "An interrupting cow who"
    },
    {
        "character": "Jimmy",
        "line": "[interrupting] Moooooo! [...no response.] ...What a terrific audience. [the two of them stand in the middle of the living room looking at each other]"
    },
    {
        "character": "",
        "line": "Dairy Gold Milk Company, day. Mrs. Garthunk is still at the computer doing her search"
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Hah, let's see. The Dallas-Ft. Wroth area. I haven't tried there yet. Computer?"
    },
    {
        "character": "Computer",
        "line": "Workiiing."
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Scan for any children reported found in the Dallas-Ft. Wroth area, with a facial deformity."
    },
    {
        "character": "Computer",
        "line": "Workiiing. [some computer noises] Negative."
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Ugh. This is hopeless! ...Wait a minute, let's try it this way: Computer?"
    },
    {
        "character": "Computer",
        "line": "Workiiing."
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Scan databanks for children who reported their parents missing."
    },
    {
        "character": "Computer",
        "line": "Workiiing. [some computer noises] One million six thousand hits."
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Alright, then break it down to claims in the past twenty years."
    },
    {
        "character": "Computer",
        "line": "Workiiing. [some computer noises] Three hundred twenty-one thousand hits."
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Alright, now run a scan on homogenized versus pasteurized skim milk."
    },
    {
        "character": "Computer",
        "line": "In skim form, homogenized has longer shelf life by 2.3 weeks."
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Okaaay, okay, now give me a breakdown of people who are seeking their parents who also suffer from a disease called T P S."
    },
    {
        "character": "Computer",
        "line": "Torsonic Polarity Syndrome, plus, a claim to not know parents: one match"
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Bingo. Do you have a photo"
    },
    {
        "character": "Computer",
        "line": "Printiiing. [the screen reads \"Processing\". A picture starts appearing on screen]"
    },
    {
        "character": "Mrs. Garthunk",
        "line": "My God. Oh my God!"
    },
    {
        "character": "",
        "line": "Sidewalk, day. Six boys walk down the street again, only Kenny has replaced Tweek among the boys. They stop at Butters' house again,and again, Kyle calls out."
    },
    {
        "character": "Kyle",
        "line": "Butters! Hey Butters!"
    },
    {
        "character": "Butters",
        "line": "[opens his windows; has a paper bag over his head] Hehyeah?"
    },
    {
        "character": "Kyle",
        "line": "They found the butt-face people's son, Butters. They're gonna have a big reunion at the milk company!"
    },
    {
        "character": "Butters",
        "line": "Aw gee, thah-at sounds swell, fellas, but I can't go 'cause I'm still havin' behavioral problems."
    },
    {
        "character": "Stan",
        "line": "Why are you wearing a paper bag on your head?"
    },
    {
        "character": "Butters",
        "line": "Uh, my parents are makin' me wear this paper bag until I learn... to stop makin' silly faces all the time. They've really had it up to [raises his hand high] here with me."
    },
    {
        "character": "Stephen",
        "line": "Butters? Are you ready to stop with the stupid faces?"
    },
    {
        "character": "Butters",
        "line": "[hops down to the floor] I sure am, Dad!"
    },
    {
        "character": "Stephen",
        "line": "Alright, you can take the paper bag off."
    },
    {
        "character": "Butters",
        "line": "[removes the bag] Thanks, Dad! Ah I'm sorry I was bad-"
    },
    {
        "character": "Stephen",
        "line": "Oh, very funny, young man! You think it's clever to make yourself up like a girl?!"
    },
    {
        "character": "Butters",
        "line": "Hububut Dad, ah I didn't lick a-"
    },
    {
        "character": "Stephen",
        "line": "Did you use your mother's makeup?! She's gonna be furious!"
    },
    {
        "character": "Butters",
        "line": "I'm not wearin'  makeup Dad! I uh-"
    },
    {
        "character": "Stephen",
        "line": "Put that bag back on!"
    },
    {
        "character": "Butters",
        "line": "[subdued] Yes, sir. [slips the bag over his head again]"
    },
    {
        "character": "Kyle",
        "line": "Dude, that poor kid. [walks off]"
    },
    {
        "character": "Clyde",
        "line": "Yeah, we gotta remember to kick his ass tomorrow. [turns with the other boys and follows Kyle off. Butters slams his windows shut]"
    },
    {
        "character": "",
        "line": "Cartman's room, day. Cartman sits on his bed dejected. He's unwrapped a box and a gun sits on his bed to his left, a notepad and pencil to his right. He picks up the pad and pencil and writes..."
    },
    {
        "character": "Cartman",
        "line": "Dear Mom: I can no longer stand to be without a sense of humor. Without laughter, the world is a cold and sad place, and I can't go out to face it anymore. Please tell everyone why I won't be at school."
    },
    {
        "character": "",
        "line": "He sets the notepad down and looks at it for a moment, then he reaches over for the gun. He opens his mouth and puts the barrel of the gun in... and bites it off. It's a chocolate gun, and he sets the remainder down on the bed again"
    },
    {
        "character": "Cartman",
        "line": "And please buy me more chocolate guns. I'm starting to run out."
    },
    {
        "character": "",
        "line": "He picks up the chocolate again and takes another bite. Then he looks at the box the gun came in"
    },
    {
        "character": "Cartman",
        "line": "Please get the kind with marshmallow inside. I don't like the peanut-butter filled one.Eric."
    },
    {
        "character": "",
        "line": "Dairy Gold Milk Company, day. A TV 4 news van and crew are present. Some of the factory workers are present in the background as the president of the company stands behind some microphones. The Thompsons stand next to the president. A sign behind them asks, \"Got Missing Kids?\""
    },
    {
        "character": "President",
        "line": "And so it is with great pride that we have flown little Billy Thompson out here, to be reunited with his parents for the first time in twenty years. [Stan, Kyle, Kenny, Craig, Tolkien, and Clyde show up and watch.] Mrs. Garthunk? [moves aside as she steps up]"
    },
    {
        "character": "Mrs. Garthunk",
        "line": "Thank you, Mr. President. I'm proud to be an employee of South Park Milk, [music plays] which to date has found over a hundred thousand missing kids, and, led the way in the fight against curdling. Mr. and Mrs. Thompson, your son grew up not knowing who his parents were. [a shot of the Thompson couple] But he was strong and resilient, [a shot of the crowd] and ended up becoming very successful. I think it will amaze you as it will all of us to learn that your son... is Ben Affleck! [a picture is taken. The people in the crowd look puzzled]"
    },
    {
        "character": "President",
        "line": "Come around here, Ben! [a man makes his way through the crowd as the people clap and cheer. It's Ben Affleck]"
    },
    {
        "character": "Ben Affleck",
        "line": "Mom! Dad!"
    },
    {
        "character": "Steven",
        "line": "[opens his arms] Son!"
    },
    {
        "character": "Martha",
        "line": "[opens her arms] Oh, son! [Ben walks into their embrace as more pictures are taken]"
    },
    {
        "character": "Cartman",
        "line": "[walking up to the other boys] What's goin' on?"
    },
    {
        "character": "Stan",
        "line": "Dude, the ass-faces' son is Ben Affleck!"
    },
    {
        "character": "Steven",
        "line": "Oh, our same ol' Ben!"
    },
    {
        "character": "Martha",
        "line": "Oh, I'm so happy! [starts kissing him with her ass-face cheeks. Ben grimaces]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Wow, I never realized Ben had TPS, but I definitely see the resemblance now. [Mrs. Thompson is still crying and kissing Ben.]"
    },
    {
        "character": "Steven",
        "line": "Aw, son. [begins kissing him, and Ben grimaces again]"
    },
    {
        "character": "President",
        "line": "Isn't this wonderful?"
    },
    {
        "character": "Photographer",
        "line": "[gets into position] Okay gang, give me a big smile. [the Thompsons face the camera with Ben and the picture is taken. The crowd then disperses, and a man behind the boys is writing something on a note pad. He walks away as well.]"
    },
    {
        "character": "Kyle",
        "line": "Well, looks like everything turned out alright for them."
    },
    {
        "character": "Cartman",
        "line": "Yeah, I guess now we'll have to call him Ben Assfleck. [breaks into a grin and starts laughing] Ben Assfleck, say that's funny."
    },
    {
        "character": "Stan",
        "line": "[noticing] Hey, you're laughing, Cartman."
    },
    {
        "character": "Cartman",
        "line": "Hehey, you're right! Oho, this is great! Ben Assfleck! [laughs some more.]"
    },
    {
        "character": "Kyle",
        "line": "Well wait a minute. Don't you see what happened?"
    },
    {
        "character": "Cartman",
        "line": "A-heh, what?"
    },
    {
        "character": "Kyle",
        "line": "Everything turned out okay for those people. And so now you can laugh."
    },
    {
        "character": "Stan",
        "line": "Huh?"
    },
    {
        "character": "Kyle",
        "line": "When Cartman first opened the door, and saw the Thompsons, he felt bad for playing a joke on them. Now that everything's turned out alright, he's able to laugh."
    },
    {
        "character": "Stan",
        "line": "Oh, you're right. Cartman had a feeling of remorse."
    },
    {
        "character": "Cartman",
        "line": "E-heh. No no no, I blew a funny fuse."
    },
    {
        "character": "Kyle",
        "line": "There is no such thing as a funny fuse, Cartman. You felt bad."
    },
    {
        "character": "Cartman",
        "line": "[silent sigh] Whatever. All I know is that I can laugh again. I'm gonna go home and eat another chocolate gun. Come on, Kenny! [Kenny follows Cartman, and they begin to cross the road. Kenny remains behind Cartman, and the sound of a motorcycle draws close]"
    },
    {
        "character": "Motorcycle Driver",
        "line": "[running over Kenny] Dangit! [Cartman spins to see Kenny's bloody body on the road... and roars with laughter]"
    },
    {
        "character": "",
        "line": "Stan and Kyle face Cartman. Behind them the crowd consists of only the camera crew, Mrs. Garthunk, Ben Affleck and the Thompsons, and the workers"
    },
    {
        "character": "Stan",
        "line": " Wow, Cartman actually felt bad for somebody and couldn't laugh at them."
    },
    {
        "character": "Kyle",
        "line": "Our little man is growing up, Stan. He's growing up."
    },
    {
        "character": "Stan",
        "line": "Yeah, I guess we all are. Maybe things are finally gonna start getting a more sophisticated around here."
    },
    {
        "character": "",
        "line": "Close-up of the Thompsons taking turns kissing Ben Affleck. Mrs. Thompson sobs and blows her nose"
    },
    {
        "character": "Steven",
        "line": "Aw son! [kisses him]"
    }
]