[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Denver International Airport, day. Inside the terminal people are in long lines waiting to get their tickets or get on a plane. Mr. Garrison waits in line to have his bags scanned"
    },
    {
        "character": "Mr. Garrison",
        "line": "Jesus Christ, these lines are ridiculous! I'm gonna miss my flight! [sees a guard] E- Excuse me, there are two other security checkpoints. Why can't you open those, too?"
    },
    {
        "character": "Security Guard",
        "line": "Uh I don't know nothin'."
    },
    {
        "character": "Mr. Garrison",
        "line": "But you work for the- [the guard turns around and walks way] uh, God-damnit!!"
    },
    {
        "character": "Voice",
        "line": "[over the PA system] Snooty Airlines announces the arrival of flight 239 from Connecticut."
    },
    {
        "character": "",
        "line": "The Broflovskis stand in front of a perfume shop"
    },
    {
        "character": "Sheila",
        "line": "That's your cousin's flight, Kyle. Hold the sign up nice and high so he can find us."
    },
    {
        "character": "Kyle",
        "line": "What's he look like?"
    },
    {
        "character": "Sheila",
        "line": "He's your age and about your height."
    },
    {
        "character": "Kyle",
        "line": "I'm stoked my cousin is comin' to live with us. It'll be just like having a brother. [Ike flashes an angry look]"
    },
    {
        "character": "Ike",
        "line": "I todd a nurra."
    },
    {
        "character": "Sheila",
        "line": "Oh, there he is. [waving] Over here, Kyle! [a boy wearing a NY cap and a #34 shirt appears. Kyle grins and holds up the sign. The boy looks to his right and walks off. Another boy appears, with bushy hair and a part down the middle and thick glasses]"
    },
    {
        "character": "Kyle Schwartz",
        "line": "Hello, Aunt Sheila."
    },
    {
        "character": "Sheila",
        "line": "How was your flight? [Kyle lowers the sign and looks stunned]"
    },
    {
        "character": "Kyle Schwartz",
        "line": "Oh, it was terrible. They recycled the air on board and it really did a number on my asthma. I-I-e-I asked them to turn up the oxygen and they wouldn't. [walks up and joins the family]"
    },
    {
        "character": "Sheila",
        "line": "You remember Uncle Gerry."
    },
    {
        "character": "Kyle Schwartz",
        "line": "Hi, Uncle Gerry."
    },
    {
        "character": "Sheila",
        "line": "[kneels on one knee] And these are your cousins, Ike and Kyle."
    },
    {
        "character": "Kyle",
        "line": "Hey dude."
    },
    {
        "character": "Kyle Schwartz",
        "line": "It's nice to meet you."
    },
    {
        "character": "Sheila",
        "line": "Let's get down to the baggage claim, Kyle. [rises and moves]"
    },
    {
        "character": "Both Kyles",
        "line": "Okay:"
    },
    {
        "character": "Sheila",
        "line": "[returns and genuflects again] Oooh, that's right! We've got two Kyles now. We'll just call you [to the nephew] Kyle, and you can be Kyle... [to the son] Two! [holds up two fingers and walks off. Kyle Schwartz (Kyle) follows her while Kyle Broflovski (Kyle Two) sorts this out]"
    },
    {
        "character": "Kyle Two",
        "line": "Cool. [follows the others out]"
    },
    {
        "character": "",
        "line": "Ticket counter. Mr. Garrison's turn has come up and he approaches the counter"
    },
    {
        "character": "Clerk",
        "line": "[female] Next?"
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh, I feel like I've run a marathon. [hands her his ticket]"
    },
    {
        "character": "Clerk",
        "line": "[starts typing away] Mmmokay, the 2:30 flight to Cheyenne has boarded. Looks like you didn't make it."
    },
    {
        "character": "Mr. Garrison",
        "line": "What? Well of course I didn't make it. The line to check in was two hours long, and the security line was two hours more!"
    },
    {
        "character": "Clerk",
        "line": "Nnnyeah, no problem, though. We'll get you on the 7 a.m. flight tomorrow morning."
    },
    {
        "character": "Mr. Garrison",
        "line": "I can't go tomorrow, the Jizzfest is tonight!"
    },
    {
        "character": "Clerk",
        "line": "[ignoring comments] Would you like a window or an aisle seat?"
    },
    {
        "character": "Mr. Garrison",
        "line": "This is unbelievable! You know, I seem to remember when the airlines said, \"We need a 15 billion dollar bailout from the taxpayers-\"!"
    },
    {
        "character": "Clerk",
        "line": "Mmokay, and have any of your personal items been out of your possession since you left?"
    },
    {
        "character": "Mr. Garrison",
        "line": "[people in the lines hear him and turn to look] Well we gave them the 15 billion dollar bailout and they fired their employees anyway! So now we have three people to clear 400 passengers!"
    },
    {
        "character": "Man",
        "line": "Hey, he's right!"
    },
    {
        "character": "People",
        "line": "YEAH!"
    },
    {
        "character": "Clerk",
        "line": "Okay, and bags have been with you at all times?"
    },
    {
        "character": "Mr. Garrison",
        "line": "So where did that money go? I'll tell you where it went: it went into the pockets of the presidents and CEOs of the airlines, so they can keep their multimillion-dollar salaries!"
    },
    {
        "character": "People",
        "line": "YEAH!"
    },
    {
        "character": "Clerk",
        "line": "[prints out a pass and hands it out for Garrison to get] And here's your boarding pass for tomorrow morning."
    },
    {
        "character": "Mr. Garrison",
        "line": "You think you can treat us however you want because we HAVE to fly! Well I'll tell you what, Sally Sassalot, I'm gonna come up with a NEW mode of transportation! A ahah brand new vehicle that'll put all you bastards out of business!"
    },
    {
        "character": "People",
        "line": "YEAH! ALRIGHT! GO!"
    },
    {
        "character": "Mr. Garrison",
        "line": "You think I can't do it?! I got a master's degree in mechanical engineering at Denver Community College! You watch me!! [turns and stretches his arms over the crowd] Come on, everybody!"
    },
    {
        "character": "People",
        "line": "YEAH!"
    },
    {
        "character": "Man",
        "line": "[next in line, approaches the clerk] Can I get on that 7:30 a.m. flight?"
    },
    {
        "character": "",
        "line": "The Broflovski house, night. The family is seated around the dining room table as Sheila enters with soup in hand"
    },
    {
        "character": "Sheila",
        "line": "Here we go, Kyle Two. [Kyle Two smiles at the soup he's gotten] And here's yours, Kyle. [Kyle inspects it]"
    },
    {
        "character": "Kyle",
        "line": "[sniffs] Oh, uh, wawawhat is this?"
    },
    {
        "character": "Kyle Two",
        "line": "Mom's special stew. She makes it every Monday and I love it."
    },
    {
        "character": "Kyle",
        "line": "Oh is, is this beef?"
    },
    {
        "character": "Kyle Two",
        "line": "Yeah, dude, it's great! [eats the soup with gusto]"
    },
    {
        "character": "Kyle",
        "line": "Uha, wa, actually, I- I can't eat beef. I have a degenerative problem with my intestinal lining, and beef really gives me gaass."
    },
    {
        "character": "Sheila",
        "line": "Oh, I'm so sorry, Kyle. What else can I fix you?"
    },
    {
        "character": "Kyle",
        "line": "Oh no, I d- I don't want to be a bother, I uh-"
    },
    {
        "character": "Sheila",
        "line": "Nonsense. Can't I make you some nice pasta? Or a frozen fish fillet?"
    },
    {
        "character": "Kyle",
        "line": "We-ull, some fish would be great if it isn't too much trouble."
    },
    {
        "character": "Sheila",
        "line": "[rises and heads for the kitchen] I'll put it in the microwave right away. [heavy breathing is heard. Kyle Two looks at his cousin]"
    },
    {
        "character": "",
        "line": "Kitchen, moments later. Sheila has gotten the fish and breaks it apart on the kitchen counter. Kyle Two appears at the doorway"
    },
    {
        "character": "Kyle Two",
        "line": "Mom?"
    },
    {
        "character": "Sheila",
        "line": "Yes, Kyle Two?"
    },
    {
        "character": "Kyle Two",
        "line": "How am I related to him again?"
    },
    {
        "character": "Sheila",
        "line": "He's your cousin, Kyle Two. I told you already."
    },
    {
        "character": "Kyle Two",
        "line": "Yeah, but like... first cousin or distant cousin?"
    },
    {
        "character": "Sheila",
        "line": "He's my sister's son. That makes him your first cousin."
    },
    {
        "character": "Kyle Two",
        "line": "So we have the same blood?"
    },
    {
        "character": "Sheila",
        "line": "Now Kyle Two, listen to me. Kyle is going through a very tough time in his life. His mother is very sick and he's in a whole new place. He's going to rely on you to make sure he fits in at your school."
    },
    {
        "character": "Kyle Two",
        "line": "What? How the hell am I supposed to do that?"
    },
    {
        "character": "Sheila",
        "line": "I'm sure your friends will love him."
    },
    {
        "character": "Kyle Two",
        "line": "What about Cartman, huh? He rips on me for being Jewish! He's gonna tear this kid apart!"
    },
    {
        "character": "Sheila",
        "line": "Kyle Two, he's your responsibility."
    },
    {
        "character": "Kyle Two",
        "line": "Oh my God."
    },
    {
        "character": "Sheila",
        "line": "I'm sure you two will become great friends with lots of late night pillow talk."
    },
    {
        "character": "Kyle Two",
        "line": "Well what do you mean? [she catches her breath] What room is he sleeping in?"
    },
    {
        "character": "",
        "line": "Kyle's room, past bed time. Both Kyles are in bed, the cousin getting used to the bed."
    },
    {
        "character": "Kyle",
        "line": "What's this comforter filled with? Um, it isn't filled with down, is it?"
    },
    {
        "character": "Kyle Two",
        "line": "I don't know, dude."
    },
    {
        "character": "Kyle",
        "line": "Ih it sure is quiet up here in the mountains and it's dry, too. Do you have a humidi-humidifier?"
    },
    {
        "character": "Kyle Two",
        "line": "I don't think so."
    },
    {
        "character": "Kyle",
        "line": "Uh, can you take my stupid glasses and put them on the night stand. Make sure they're close by, because that fish upset my stomach and I might need them if I have to go to he bathroom later on."
    },
    {
        "character": "Kyle Two",
        "line": "Okay. [reaches for the light and turns it off, then tries to sleep. That distinctive breathing returns as Kyle slowly goes to sleep, and Kyle Two takes a peek. Kyle swallows and turns his head to the left. Kyle Two looks at him, annoyed, then turns his back on Kyle and tries to sleep again]"
    },
    {
        "character": "",
        "line": "Mr. Garrison's house, night. He's working at an artist's desk in his bedroom. On the wall are drawings of various types of aircraft, and on the floor around him are bits and pieces of all kinds of vehicles, including bicycle gears, airplane propellers, car motors, a muffler. To his right is a dresser with a small color TV on top. Mr. Hat is present on his right hand, as always"
    },
    {
        "character": "Mr. Garrison",
        "line": "Now it's got to be simple. Like a moped, but with the ability to travel at much faster speeds. The designs of our electrical moped were altered with a- no, nonono this won't work either!"
    },
    {
        "character": "Mr. Hat",
        "line": "What was wrong with that plan?"
    },
    {
        "character": "Mr. Garrison",
        "line": "It has to be more stable, Mr. Hat! A moped would be too dangerous at those speeds. Damnit! [tries something new] Now, what if the jet power of an aircraft could be scaled down into a personal vehicle?"
    },
    {
        "character": "Mr. Hat",
        "line": "Boy, that Enrique Iglesias can sure gyrate his hot ass around."
    },
    {
        "character": "Enrique Iglesias",
        "line": "[on TV, gyrating his hips around, holding his crotch in his left hand, the back of his head with the right one] ...I think about you day and night. I think about you..."
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh, Mr. Hat! Would you stop drooling over Enrique Iglesias and... wait a minute. What did you say?"
    },
    {
        "character": "Mr. Hat",
        "line": "I said Enrique Iglesias can sure gyrate his hot ass!"
    },
    {
        "character": "Mr. Garrison",
        "line": "That's it. Gyration. [pulls something onto his desk] A gyroscope. [sets it in motion] It would allow for maximum balance and yet... Mr. Hat! You're a genius! [starts writing again] It's so simple and yet genius!"
    },
    {
        "character": "Mr. Hat",
        "line": "Check out his hot bulge, too."
    },
    {
        "character": "",
        "line": "Bus stop, next day. Kenny, Stan and Cartman wait at the stop. The two Kyles walk up to them"
    },
    {
        "character": "Stan",
        "line": "Hey dude."
    },
    {
        "character": "Cartman",
        "line": "What's that thing?"
    },
    {
        "character": "Kyle Two",
        "line": "Cartman, I need to talk to you. [takes him off to one side]"
    },
    {
        "character": "Kyle",
        "line": "[to Stan] Hello, I'm Kyle's cousin Kyle."
    },
    {
        "character": "Kyle Two",
        "line": "Cartman, I'm gonna make you a deal."
    },
    {
        "character": "Cartman",
        "line": "What?"
    },
    {
        "character": "Kyle Two",
        "line": "That kid over there is my cousin from the East Coast. He's having a really hard time right now, so I'm going to offer you forty dollars to not rip on him."
    },
    {
        "character": "Cartman",
        "line": "Forty bucks?"
    },
    {
        "character": "Kyle Two",
        "line": "But you can't make fun of him AT ALL. No smartass comments, nothin'."
    },
    {
        "character": "Cartman",
        "line": "Alright, alright."
    },
    {
        "character": "Kyle Two",
        "line": "And you especially can't say anything about Jews!"
    },
    {
        "character": "Cartman",
        "line": "Aw, Jesus, why don't you just cut off my balls?"
    },
    {
        "character": "Kyle Two",
        "line": "Cartman, no Jew jokes! All you have to do is keep your mouth shut, and you've got forty bucks! Can you do it? [Cartman looks past Kyle Two and sees Kyle talking away at the bus stop]"
    },
    {
        "character": "Kyle",
        "line": "I can't believe how cold it is out here."
    },
    {
        "character": "Cartman",
        "line": "[pulls back and mulls his chances] Could be tough. But I'll give it a shot."
    },
    {
        "character": "Kyle Two",
        "line": "Alright. [both return to the bus stop]"
    },
    {
        "character": "Kyle",
        "line": "It's a really dry cold; that's the problem. It- the cold air makes me wheeze."
    },
    {
        "character": "Kyle Two",
        "line": "[formal introductions] Kyle, this is Cartman, my sort of... friend-ish."
    },
    {
        "character": "Kyle",
        "line": "[goes over to greet Cartman] Ot- Nice to meet you, Cartman. Yuh you know, I saw that same jacket you're wearing at Bosco's for $29.95. How much was yours? Um, I juh- I was just wondering if Bosco's is a ripoff?"
    },
    {
        "character": "Cartman",
        "line": "[weakening] ...Oh, man."
    },
    {
        "character": "Kyle",
        "line": "[observes this and gets angry] Cartman?!"
    },
    {
        "character": "Cartman",
        "line": "[snaps into action] Uh, it's nice to meet you, Kyle. I can certainly tell you're a relative of my good friend Kyle here. [at that moment, a large wheel zips by the bus stop, and the kids cover their eyes]"
    },
    {
        "character": "Stan",
        "line": "What the hell was that?"
    },
    {
        "character": "",
        "line": "Neighborhood, day. Barbrady stops Craig's father in his car and is writing out a ticket when the large wheel zips by them."
    },
    {
        "character": "Officer Barbrady",
        "line": "Uh what the hell was that?"
    },
    {
        "character": "",
        "line": "Downtown South Park. People walk about doing stuff. The giant wheel zips by them as well, but few seem to notice"
    },
    {
        "character": "Stuart",
        "line": "What the hell was that?"
    },
    {
        "character": "Randy",
        "line": "I dunno, it was going so fast I couldn't see it. [looks at Stuart] But I want one."
    },
    {
        "character": "Stuart",
        "line": "Yep, me too."
    },
    {
        "character": "",
        "line": "Garrison's house, curb level. The giant wheel stops and two legs dismount. It's Mr. Garrison, beaming with pride and confidence"
    },
    {
        "character": "Mr. Garrison",
        "line": "We've done it, Mr. Hat. Airline companies be damned. We've invented a whole new mode of transportation! Get some investors on the phone! [Mr. Hat doesn't move] Well what are you waiting for?!"
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Class is now in session."
    },
    {
        "character": "Ms. Choksondik",
        "line": "And I know you'll all be very nice to our new student. [To Kyle] Kyle, why don't you tell us a little about yourself?"
    },
    {
        "character": "Kyle",
        "line": "Oh well, I I grew up in the shity, ah ah I really don't care for it. Ah I come from a Jewish family, which of course you already know, because Kyle's from the same family. [Kyle Two buries his face in his hands] I like to read, and I have these polyps on the backs of my hands - I don't know what they are."
    },
    {
        "character": "Cartman",
        "line": "[resisting an urge] Ohmigod, I'm not gonna make it. I'm not gonna make it."
    },
    {
        "character": "Kyle",
        "line": "...Oh, and I hope one day to be an investment banker."
    },
    {
        "character": "Cartman",
        "line": "[resisting mightily] I... must.. fight it! Need... forty... dollars!"
    },
    {
        "character": "Ms. Choksondik",
        "line": "Okay, why don't you go ahead and take a seat, Kyle? [Kyle goes to the desks, looks around, then runs around]"
    },
    {
        "character": "Kyle",
        "line": "Uh where should I sit? There's no place to sit down here."
    },
    {
        "character": "Ms. Choksondik",
        "line": "Yes, unfortunately the school seems to be completely out of extra desks. So you'll just have to share with your cousin."
    },
    {
        "character": "Kyle Two",
        "line": "What?"
    },
    {
        "character": "Kyle",
        "line": "Eh, oh, alright. [moves to Kyle Two's desk and squeezes in, and that breathing is heard again]"
    },
    {
        "character": "Ms. Choksondik",
        "line": "[turns to the blackboard] Now let's get on with our lesson on the-"
    },
    {
        "character": "Kyle",
        "line": "Ah-ah-ah-are wooden desks all that available? I usually prefer the plastic ones because these give me splinters."
    },
    {
        "character": "Cartman",
        "line": "Ugh, ugh!"
    },
    {
        "character": "Ms. Choksondik",
        "line": "[faces the class] I'm sorry, Kyle. You'll just have to make do. [turns to the blackboard again] Now let's get back to the le-"
    },
    {
        "character": "Kyle",
        "line": "Is it cold in here? I realize we're in the mountains, but do we have to freeze to death?"
    },
    {
        "character": "Ms. Choksondik",
        "line": "[faces the class] Now Kyle, I need you to be quiet. In my class you need to be able to concentrate."
    },
    {
        "character": "Cartman",
        "line": "Oh!"
    },
    {
        "character": "Ms. Choksondik",
        "line": "Concentration is the key to succeeding in my class."
    },
    {
        "character": "Cartman",
        "line": "Maybe we'll have to send him to concentration camp. AWGH! Damnit, damnit, damnit!"
    },
    {
        "character": "Kyle Two",
        "line": "CARTMAN!"
    },
    {
        "character": "",
        "line": "News 4 Newsbreak. An anchor soon appears with a window of Mr. Garrison beside him"
    },
    {
        "character": "Anchor",
        "line": "Kindergarten teacher Herbert Garrison has apparently invented a new vehicle that will give the airlines a run for their money. Mr. Garrison is putting the final touches on his top secret device, which he simply calls \"IT\". [\"IT\" appears in the window] So what exactly is \"IT\"? [\"IT?\" appears in the window] Here with a report is a Hispanic man with some gravy stains on his lapel. [a window with that reporter pops up and soon fills the screen. Behind him is the Garrison house, and a small crowd is standing outside]"
    },
    {
        "character": "Hispanic Reporter",
        "line": "Thanks, Tom, I-oh... [looks at his lapel and brushes some of the stain off] Thanks, Tom. So far, Herbert Garrison hasn't let anyone get a look at his invention. He claims that the vehicle is sooo genius and revolutionary that it could cause one's eyes to bleed if not properly prepared to see it. But earlier today HBC News got footage of some of the country's top investors and richest people who have been invited for a first look, including: Steve Forbes [seen exiting a black limo], Steve Jobs [seen exiting a white limo], Ted Turner [seen exiting a helicopter], Donald Trump [seen exiting a private jet], Bill Gates [seen leaving his own ship, the U.S.S. Bill Gates XP], and Yasmine Bleeth [seen exiting a small dingy car and wiping her nose]. Their curiosity is piqued, Tom, and so is ours. What is \"IT\"? What does \"IT\"do? And when will IT be somewhere where I can buy one? Reporting live, Jeff Arrando [trills the Rs], HBC News."
    },
    {
        "character": "",
        "line": "Playground, day. Kids are on swings, hobby elephants, slides, etc, as the camera pans across. At the end of the pan, Kyle and Kyle Two face each other in a clearing"
    },
    {
        "character": "Kyle Two",
        "line": "You need to learn to play some sports, Kyle. So we're gonna start with a tough one called, \"Catch the Ball.\" I throw the football to you; you throw it back to me."
    },
    {
        "character": "Kyle",
        "line": "Oh, bu- but isn't the cold air making the ball really hard? Ih-it's gonna hurt my hands."
    },
    {
        "character": "Kyle Two",
        "line": "It's fine!"
    },
    {
        "character": "Kyle",
        "line": "Alright then, hu-how do I catch it?"
    },
    {
        "character": "Kyle Two",
        "line": "Ih it's a football, dude. You just- put your arms out and catch it. [Kyle's arms spread out] Alright, here we go. [throws the ball, and it lands in the snow in front of Kyle, who just looks at it]"
    },
    {
        "character": "Kyle",
        "line": "Now what?"
    },
    {
        "character": "Kyle Two",
        "line": "Now throw it back to me."
    },
    {
        "character": "Kyle",
        "line": "But it's down in the snow."
    },
    {
        "character": "Kyle Two",
        "line": "...So dig it out."
    },
    {
        "character": "Kyle",
        "line": "But I'll get snow on my gloves and then it will melt and I'll have wet hands."
    },
    {
        "character": "Kyle Two",
        "line": "...Well, then we'll dry them off!"
    },
    {
        "character": "Kyle",
        "line": "Alright, then. [walks to the ball and digs it out]"
    },
    {
        "character": "Kyle Two",
        "line": "[turns away] Oh my God."
    },
    {
        "character": "Cartman",
        "line": "[offscreen] Kyle, Kyle! [arrives] I just found out that in World War II, some Jewish people were sent to concentration camps."
    },
    {
        "character": "Kyle Two",
        "line": "[Angrily] Yeah! They WERE, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Oh, and see, I didn't realize that. But I understand now how you might've felt what I said in the classroom was a racial slut. But see, I had no idea."
    },
    {
        "character": "Kyle Two",
        "line": "You did, too! You are so full of crap!"
    },
    {
        "character": "Cartman",
        "line": "No, I'm seriously! Because, um, I was, I was talkin' to Craig, and Craig was all like, \"Hey, did you know that in World War II they really HAD concentration camps?\" And I was all like, \"No way!\" And this little light went on in my head like, \"Aw man, no wonder Kyle thought what I said in the class, seemed like it was directed at his cousin.\" But, but I was literally talkin' about a concentration camp, you know, where you go for a week to learn and focus, you know. Oh, mahan. [Kyle Two gets even angrier] What a misunderstanding, huh? [tries to be chummy with Kyle. Kyle brushes him off]"
    },
    {
        "character": "Kyle Two",
        "line": "You blew the deal, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Goddamnit, give me another chance!"
    },
    {
        "character": "Kyle Two",
        "line": "[his cousin walks up behind him with the football] Nuh-uh, I knew you were gonna make fun of my lame cousin, so I paid you the forty bucks NOT to rip on him! You ripped on him, deal's off!"
    },
    {
        "character": "Kyle",
        "line": "Uh you did what? [Kyle Two blanches]"
    },
    {
        "character": "Kyle Two",
        "line": "[puts his mittens up to his cheeks] Oh no."
    },
    {
        "character": "Cartman",
        "line": "Haha, [slaps him on the back] serves you right, asshole. [leaves]"
    },
    {
        "character": "Kyle",
        "line": "You, you paid your friends tuh... [hangs his head] not make fun of me?"
    },
    {
        "character": "Kyle Two",
        "line": "Look, ih it's not because anything's wrong with you."
    },
    {
        "character": "Kyle",
        "line": "Wow uh, you think it takes forty dollars to get people to like me."
    },
    {
        "character": "Kyle Two",
        "line": "Kyle, I-eh I'm sorry."
    },
    {
        "character": "Kyle",
        "line": "Because I m-I mean I really think you could have done it for about $12.50."
    },
    {
        "character": "Kyle Two",
        "line": "What?"
    },
    {
        "character": "Kyle",
        "line": "Well, I mean, you didn't just start at 40, didja? You you gotta low-ball these things so you have a place to go."
    },
    {
        "character": "Kyle Two",
        "line": "Uh-uh-uh oh, dude. Uh [shuffles away]"
    },
    {
        "character": "Kyle",
        "line": "Boy it sure is dry out here."
    },
    {
        "character": "",
        "line": "Mr. Garrison's house, backyard. The invited guest sit in two rows of chairs"
    },
    {
        "character": "Mr. Garrison",
        "line": "Gentlemen, imagine being able to travel safely at incredibly fast speeds, and not having to go to the stupid fartface airports!"
    },
    {
        "character": "Mr. Hat",
        "line": "That sounds incredible, Mr. Garrison."
    },
    {
        "character": "Mr. Garrison",
        "line": "It IS incredible, Mr. Hat. And what makes IT possible [the back gate open and Kyle walks in] is IT's patented gyroscope design. [he backs up and unveils the vehicle] Gentlemen, I give you, IT!"
    },
    {
        "character": "Guests",
        "line": "Whoa."
    },
    {
        "character": "Steve Forbes",
        "line": "Nice."
    },
    {
        "character": "Donald Trump",
        "line": "Sweet."
    },
    {
        "character": "Mr. Garrison",
        "line": "IT gets over 300 miles to the gallon, and is safely capable of speeds of over 200 miles per hour."
    },
    {
        "character": "Guests",
        "line": "Whoa. Wow."
    },
    {
        "character": "Bill Gates",
        "line": "This will change everything."
    },
    {
        "character": "Steve Jobs",
        "line": "We're going to have to rethink cities!"
    },
    {
        "character": "Mr. Garrison",
        "line": "[puts on a helmet] Now, IT is easily operated using four flexigrip handles. Two of them are on each side. Left side for throttle, right side for steering. [operates each one as he describes it] The third flexigrip is gently inserted into the anus, to keep the driver in place. [gets into the wheel and activates the flexigrip. It extends into his anus and he groans as it locks him in.]"
    },
    {
        "character": "Guests",
        "line": "Ugh. Oh."
    },
    {
        "character": "Mr. Garrison",
        "line": "...there we go. Now, the final flexigrip is directly in front of the driver so that its small switches can be operated with the mouth, as such. [begins to suck on the flexigrip, then stops] Put the four together and we're ready to go. [gets the four flexigrips to work in unison and the vehicles takes off, first one way...]"
    },
    {
        "character": "Steve Jobs",
        "line": "Oh my God! [...and then the other. The guests turn to see IT zoom across the yard]"
    },
    {
        "character": "Steve Forbes",
        "line": "Look at it go! [Garrison crashes through the fence and disappears in the distance. Kyle, standing next to the new hole in the fence, isn't hurt]"
    },
    {
        "character": "Bill Gates",
        "line": "But the way it works... do you think people will go through that to travel?"
    },
    {
        "character": "Steve Forbes",
        "line": "Hey, it... still beats what you go through at the airports."
    },
    {
        "character": "Guest 1",
        "line": "True."
    },
    {
        "character": "Guest 2",
        "line": "Yup."
    },
    {
        "character": "Guest 3",
        "line": "Yeah, that's true."
    },
    {
        "character": "Guest 4",
        "line": "Yeap."
    },
    {
        "character": "",
        "line": "The Broflovski house, night. Two lights are on"
    },
    {
        "character": "",
        "line": "Kyle Two's room. Stan is writing in a book as Kyle speaks"
    },
    {
        "character": "Kyle Two",
        "line": "I can't take it anymore, Stan. My cousin's been here for two weeks and he's driving me insane."
    },
    {
        "character": "Stan",
        "line": "I know, dude. Every kid in school wants to kick his ass."
    },
    {
        "character": "Kyle Two",
        "line": "I spent five years in this town making a good name for Jews and this... this... stereotype shows up and wrecks it all! You know what my biggest fear is? That I'll become him. That somehow his mannerisms will start rubbing off on me, and I'll become a stereotype. I mean, I'm a Jew and he's making me hate Jews."
    },
    {
        "character": "Stan",
        "line": "Dude, a self-hating Jew? You are becoming a stereotype."
    },
    {
        "character": "Kyle Two",
        "line": "Ya see?"
    },
    {
        "character": "Kyle",
        "line": "[opens the door] I'm ba-ack!"
    },
    {
        "character": "Kyle Two",
        "line": "[slaps his head] Ugh."
    },
    {
        "character": "Stan",
        "line": "Book. Later, dude. [leaves the desk, walks to the door and around Kyle, and exits. Kyle Two gets out his own writing book and starts writing. Kyle's breathing can be heard, and Kyle Two stops. Kyle eats a bit of cracker and Kyle Two resumes writing. After a while he grimaces, then buries his face in his arms]"
    },
    {
        "character": "",
        "line": "South Park, day. The day for IT's unveiling is here, and it's being offered at Better Buy. Another camera focuses on the Hispanic reporter"
    },
    {
        "character": "Jeff Arrando",
        "line": "Tom, the day is finally here. IT has arrived for retail sale, and people are getting their first look at it."
    },
    {
        "character": "Mr. Garrison:",
        "line": "[showing Craig's father how it works] Okay, good. Just step through here [the man does so] And then this is your steering and here's your throttle."
    },
    {
        "character": "Craig's father",
        "line": "Okay. [starts working the flexigrips]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay, now you're just gonna feel a little pinch."
    },
    {
        "character": "Craig's father",
        "line": "[feeling it] HAAAOW!"
    },
    {
        "character": "Mr. Garrison",
        "line": "It's alright, it's just locking you in. [some more groans from the man] You can take it. [looks up to see another rider] Doing great, Kathy. How's that ride? [she mumbles something, gives a thumbs-up, and continues driving. Garrison goes back to Craig's father] Okay, now use your mouth to operate the turn signals, and you're off. [the man gets all four flexigrips going, and he begins to roll down the street. Two men bring out a new one] Great! Who else wants to give it a spin? [an elderly woman steps forth grinning]"
    },
    {
        "character": "",
        "line": "In front of Better Buy. IT drivers move about as Randy and Stuart look on. Craig's father rolls to a stop next to them"
    },
    {
        "character": "Randy",
        "line": "Oh, man, it that the IT?"
    },
    {
        "character": "Craig's Father",
        "line": "Hehyeah."
    },
    {
        "character": "Stuart",
        "line": "How is it?"
    },
    {
        "character": "Craig's Father",
        "line": "Well, ugh. Ih ih it beats dealing with the airline companies, that's for sure. [rolls on]"
    },
    {
        "character": "",
        "line": "Neighborhood, day. The boys have Kyle on a sled, which is tied to..."
    },
    {
        "character": "Kyle",
        "line": "I don't know about this, guys. I think sleds are dangerous."
    },
    {
        "character": "Kyle Two",
        "line": "Look, Kyle. Sledding is something all kids out here do. You've gotta learn."
    },
    {
        "character": "Kyle",
        "line": "It seems like I might get splinters, though."
    },
    {
        "character": "Kyle Two",
        "line": "[moves to the front of the sled to face his cousin] Remember: Just hold on. No matter how long the sledding run lasts, hold on."
    },
    {
        "character": "Kyle",
        "line": "Hold on. I see. [...a bus. It revs up and leaves, headed for Connecticut. The rope between the bus and sled tightens, and the sled takes off] Oh, Jeezus, this sled is going faaaast."
    },
    {
        "character": "Kyle Two",
        "line": "[calls out] Hang on!"
    },
    {
        "character": "Kyle",
        "line": "I have to watch out for my glasses. Ow! Ow, it's so cold! Oh Jesus! [the bus goes around a corner and is gone]"
    },
    {
        "character": "Kyle Two",
        "line": "How far do you think it is to Connecticut?"
    },
    {
        "character": "Kyle",
        "line": "It's a least a couple of hours."
    },
    {
        "character": "Kyle Two",
        "line": "Think he'll be alright?"
    },
    {
        "character": "Cartman",
        "line": "[leaving] He's faaahn."
    },
    {
        "character": "",
        "line": "Commercial"
    },
    {
        "character": "Announcer",
        "line": "[shot of a plane in the air, then of a full cabin] Are you tired of corporate airline companies treating you like a worthless sardine? [angry faces crowded into each other] Tired of ridiculous lines and horrible security at airports? [angry, vocal crowds yelling at security guards who seem to be taking their time. Next: shot of the plane in midflight again] Well, now there is an alternative to airline travel. [Next shot, an IT zooming down the road. The camera now moves along with IT] IT. [the driver leans to the left a bit to see where he's going] IT has taken the country by storm. [A J-mart is shown, and several ITs are parked out in the lot] And already two million have been sold. [An IT driver is shown going down the street. Another IT driver passes him] Never have another important business trip ruined by airline incompetence. [two elderly women ride to the edge of a canyon] Hey ladies! How did you get to the Grand Canyon? [they answer, but their voices carry and blur in the canyon. Next shot: a woman exits her house with her baby] IT comes in sizes for the entire family."
    },
    {
        "character": "Woman",
        "line": "[putting the baby, Robby, into his own small IT.] Here you go, Robby. [Robby cries]"
    },
    {
        "character": "John Travolta",
        "line": "[in a studio stage, Stage C, somewhere, gets off his chair] Hello, I'm John Travolta. I used to rely on airlines to get me to set, but once I got used to IT, [walks over to IT and gets in] I found it to be a little less painful than dealing with the airline companies. I just power up the flexigrips. [groans in pain as the anal flexigrip takes hold] And I'm ready to go. Thank you, IT. [revs up and takes off.]"
    },
    {
        "character": "Announcer",
        "line": "[a shot of ITs entering and leaving a parking lot] So join the millions of Americans who have felt a little more comfortable with... traveling. [the oral flexigrip squirts something in a driver's eye. The IT logo appears] Order yours today and remember our slogan: IT's better than flying."
    },
    {
        "character": "",
        "line": "Kyle's house, living room. Kyle Two has finished watching the commercial"
    },
    {
        "character": "Kyle Two",
        "line": "...Hm, that was pretty gay. [starts humming, and Sheila enters the room]"
    },
    {
        "character": "Sheila",
        "line": "Kyle Two, where is Kyle?"
    },
    {
        "character": "Kyle Two",
        "line": "[poised] I don't know, Mom. Last time I saw him he was sledding."
    },
    {
        "character": "Sheila",
        "line": "Where on earth could he be? [starts to leave]"
    },
    {
        "character": "Kyle Two",
        "line": "You know, it's just possible he went back to Connecticut."
    },
    {
        "character": "Sheila",
        "line": "[quickly returns] What?"
    },
    {
        "character": "Kyle Two",
        "line": "Well, ah I mean, maybe he got so worried about his mom that found a way to get back and see her."
    },
    {
        "character": "Sheila",
        "line": "Don't be ridiculous, Kyle Two. He's out playing with his new friends."
    },
    {
        "character": "Kyle Two",
        "line": "I'm just throwin' it out there as a possibility. [the doorbell rings and he goes to answer the door]"
    },
    {
        "character": "Kyle",
        "line": "[at the door] I'm ba-ack."
    },
    {
        "character": "Kyle Two",
        "line": "AAA!"
    },
    {
        "character": "Kyle",
        "line": "[enters] I'm sorry. You must've been worried sick. I got your sled tangled up with a bus. [looks at Kyle Two]"
    },
    {
        "character": "Kyle Two",
        "line": "A, a bus. R-really?"
    },
    {
        "character": "Sheila",
        "line": "[rushes up] Kyle, what happened to you??"
    },
    {
        "character": "Kyle",
        "line": "Ah- I was just sledding, and the next thing I knew my sled rope got tangled with a bus, uh. I gut dragged for over a hundred miles before the bus finally stopped for gas. [gives Kyle Two the remains of the sled] I'm sorry about your sled, Kyle."
    },
    {
        "character": "Kyle Two",
        "line": "Oh no- don't worry about it, dude."
    },
    {
        "character": "Sheila",
        "line": "Oh you poor thing! Come upstairs and we'll get you out of those wet clothes. [leads him away. Kyle Two looks dismayed] Are you alright?"
    },
    {
        "character": "Kyle",
        "line": "Oh, my ears feel like they're frozen off, and I think I have a hemorrhoid from sitting on the sled for so long."
    },
    {
        "character": "",
        "line": "IT dealership, day. The IT has grown so popular it's left Better Buy for its own sale space. The camera pans across the showroom floor to Mr. Garrison, seated in front of an IT Motors Inc. sign. He's got a stack of bills to his right and a computer to his left, all on a futuristic desk"
    },
    {
        "character": "Mr. Garrison",
        "line": "We're in the money, Mr. Hat, We're in the money, Mr. Hat... [Jimbo, holding his lower back, walks up to Mr. Garrison] Oh hi, Jimbo. Can I help you?"
    },
    {
        "character": "Jimbo",
        "line": "Yeah, I wanted to order that theft alarm for my IT."
    },
    {
        "character": "Mr. Garrison",
        "line": "[reaches under his desk and pulls out a form] Oh, right, right. Take a seat."
    },
    {
        "character": "Jimbo",
        "line": "Uh, that's okay, I'll stand."
    },
    {
        "character": "Mr. Garrison",
        "line": "[Randy walks up to the desk] What do you think, Mr. Marsh? All set to put a down payment on that baby?"
    },
    {
        "character": "Randy",
        "line": "Well, yeah, but I have one question about the way it works."
    },
    {
        "character": "Mr. Garrison",
        "line": "Sure."
    },
    {
        "character": "Randy",
        "line": "Well, [walks back to IT] it seems all the buttons on these front and rear flexigrips are also found on the side of the vehicle."
    },
    {
        "character": "Mr. Garrison",
        "line": "Yeup."
    },
    {
        "character": "Randy",
        "line": "[returns to the desk] Well... so... they don't really... do anything."
    },
    {
        "character": "Mr. Garrison",
        "line": "Right."
    },
    {
        "character": "Randy",
        "line": "So then, couldn't I just order one that works without going in and out of my ass and mouth?"
    },
    {
        "character": "Mr. Garrison",
        "line": "[thinks about this a moment] Well, I... guess you could. [a view of the showroom]"
    },
    {
        "character": "Man 1",
        "line": "Huh?"
    },
    {
        "character": "Man 2",
        "line": "Whazzat?"
    },
    {
        "character": "Man 3",
        "line": "Wha- what did you- what did he say?"
    },
    {
        "character": "Man 4",
        "line": "What?"
    },
    {
        "character": "",
        "line": "Denver International Airport, day. A plane takes off. Inside the terminal the boys and Kyle stand around"
    },
    {
        "character": "Kyle",
        "line": "I don't know about this guys. I think playing hide and seek in the airport might be dangerous."
    },
    {
        "character": "Kyle Two",
        "line": "Kyle, we told you: Kids in Colorado all play hide and seek at the airport."
    },
    {
        "character": "Stan",
        "line": "Yeah, as soon as we get to the concourse you'll see how fun it is."
    },
    {
        "character": "Kyle Two",
        "line": "[leans towards Stan and in a low voice] Ungh, this is taking too long. The flight to Connecticut is about to leave. [looks at the guard] Ey! Can we speed things up here??"
    },
    {
        "character": "Security Guard",
        "line": "Daaah, sorry, but ever since that IT thing came out the airlines have had to cut back on employees."
    },
    {
        "character": "Kyle Two",
        "line": "Dude, we're the only ones here! How long does it take five people through security?!"
    },
    {
        "character": "Security Guard",
        "line": "Derr, let's see: Twelve people... plus... times... divided... two hours domestic, three hours international."
    },
    {
        "character": "Kyle",
        "line": "Can't we just play hide and seek at home?"
    },
    {
        "character": "Kyle Two",
        "line": "No!"
    },
    {
        "character": "Security Guard",
        "line": "[to Kenny] Dah ha! What's this?! A toenail clipper! [rises to his feet and aims a gun at Kenny] Die, terrorist! [kills him with one shot]"
    },
    {
        "character": "Kyle",
        "line": "Oh, Jesus!! [the corpse starts to bleed]"
    },
    {
        "character": "Security Guard",
        "line": "See, we do these checks for a reason!"
    },
    {
        "character": "Kyle Two",
        "line": "This is ridiculous! Come on! [leaves. The others except Kyle follow. Cartman stops and pulls Kyle away. The boys head through some doors designated for employees only, with security bypass]"
    },
    {
        "character": "",
        "line": "Tarmac, outside. The boys stop at a plane ready to take off"
    },
    {
        "character": "Kyle Two",
        "line": "Okay, Cartman, you're it. Start counting. [Kyle Two pulls Kyle away, Stan follows]"
    },
    {
        "character": "Cartman",
        "line": "[turns toward the landing gear and buried his face in a wheel, then starts counting] 1, 2, 3, 4..."
    },
    {
        "character": "Kyle Two",
        "line": "[Stan and Kyle Two stop at a box] Here, Kyle. You go hide in here. [shows him the box]"
    },
    {
        "character": "Kyle",
        "line": "In there? But it's very confined. I'll get cramps in my legs."
    },
    {
        "character": "Kyle Two",
        "line": "JUST GET IN THE BOX!"
    },
    {
        "character": "Kyle",
        "line": "Uh, alright then. [goes in. Stan and Kyle Two quickly seal the box with wrapping tape and carry it off] Oh, would you look at that? I've got a corn on my ankle. [the two boys toss the box into a luggage cart, an employee tosses the box onto the conveyor, and it falls into the cargo bay with the other luggage] Now where did that one come from? That's the fourth one I've had- [the plane taxis to the runway and is ready to take off]"
    },
    {
        "character": "Kyle Two",
        "line": "I hope he doesn't suffocate."
    },
    {
        "character": "Cartman",
        "line": "[leaving] He's faaahn."
    },
    {
        "character": "Stan",
        "line": "Yeah. He'll be waaay better off back at home. [he and Kyle watch the plane lift off]"
    },
    {
        "character": "Kyle",
        "line": "Oh, Jesus, this bus is going fast! [as the plane climbs, the side of it is shown: Air Antarctica] Oh, I did it again!!"
    },
    {
        "character": "",
        "line": "IT dealership, day. Crowds mill around the dealership. Federal agents raid the building and start hauling ITs away. Mr. Garrison isn't pleased"
    },
    {
        "character": "Mr. Garrison",
        "line": "Excuse me, what the hell are you doing?"
    },
    {
        "character": "Agent 1",
        "line": "It's alright, we're with the government."
    },
    {
        "character": "Agent 2",
        "line": "We're just shutting you down."
    },
    {
        "character": "Mr. Garrison",
        "line": "Shutting me down? Why?"
    },
    {
        "character": "Agent 3",
        "line": "[the first two agents exit with an IT] The airlines are in desperate trouble. Your vehicle is causing them to lose money."
    },
    {
        "character": "Mr. Garrison",
        "line": "Yeah, well that was the point, dingleberry! Ah-t put that down!"
    },
    {
        "character": "Agent 4",
        "line": "Right, so the government is bailing the airlines out again, by shutting you down and making ITs illegal."
    },
    {
        "character": "Mr. Garrison",
        "line": "OH, GOD-DAMNIT! You'd better be kidding! [pounds the desk]"
    },
    {
        "character": "Agent 5",
        "line": "Sir, many people work for the airlines. We can't let them all be fired."
    },
    {
        "character": "Mr. Garrison",
        "line": "THE AIRLINE COMPANIES ARE LOSING MONEY BECAUSE OF THEIR OWN INCOMPETENCE AND THEIR OWN INEFFICIENCY!!"
    },
    {
        "character": "Agent 6",
        "line": "That may be true. But if you build, sell, or ride another IT, \"it\" will be the last time. Have a nice night. [the agent and his partner walk off with the last IT and Garrison is left with a barren showroom]"
    },
    {
        "character": "Mr. Garrison",
        "line": "HWAAAAHHH! Airline motherfuckerrrs! You pieces of shiiit! Cocksucking sons of bitch airlines! [the agents, in their black cars and big rigs, leave]"
    },
    {
        "character": "",
        "line": "The Broflovski house, night. In the living room, Sheila paces the floor as Kyle sits on the sofa"
    },
    {
        "character": "Sheila",
        "line": "Oh, it's been days! Where can he be?"
    },
    {
        "character": "Kyle Two",
        "line": "I dunno, Mom. It's like he vanished into thin air."
    },
    {
        "character": "Sheila",
        "line": "I'm gong to call the police again. Kyle Two, go down to the playground and look there."
    },
    {
        "character": "Kyle Two",
        "line": "[gets off the sofa] I already checked the playground, Ma. [reaches the front door and opens it] I told you, he isn't really- [turns in astonishment to see Kyle back at the front door]"
    },
    {
        "character": "Kyle",
        "line": "I'm back."
    },
    {
        "character": "Kyle Two",
        "line": "GAAAH! [hangs his head in dismay]"
    },
    {
        "character": "Sheila",
        "line": "[offscreen] Kyle! [Kyle enters] You're back!"
    },
    {
        "character": "Kyle",
        "line": "Yeah, it was the craziest thing. I hid myself on a plane to Antarctica. Oh, it was so dry down there."
    },
    {
        "character": "",
        "line": "The Broflovski house, a few days later. Stan and Cartman approach the door. Inside, Kyle is standing in the living room, his arms crossed. He's clearly pissed off. The door opens, and Stan and Cartman walk in."
    },
    {
        "character": "Stan",
        "line": "So dude, did Cartman's idea work?"
    },
    {
        "character": "Kyle Two",
        "line": "No. I tried getting my cousin lost in the woods, but a stupid bear brought him home."
    },
    {
        "character": "Stan",
        "line": "Damn!"
    },
    {
        "character": "Kyle Two",
        "line": "I just have to face facts that I'm goin' to live with my crappy cousin forever."
    },
    {
        "character": "Kyle",
        "line": "[approaching with Sheila, carrying suitcases, ready to go home] Well, Kyle, I I gotta go."
    },
    {
        "character": "Kyle Two",
        "line": "[the boys are stunned] ...What?"
    },
    {
        "character": "Kyle",
        "line": "Yeah, I've gotta get back to Connecticut."
    },
    {
        "character": "Sheila",
        "line": "Now that things have changed for Kyle, his mother needs him back."
    },
    {
        "character": "Kyle Two",
        "line": "[gasps in relief and turns to Kyle] Do you promise?? [steps back] I mean, oh. Thah-uh that's too bad, dude. What, what changed for you?"
    },
    {
        "character": "Kyle",
        "line": "Well, I- I invested in that IT thing, and there was a bailout, so I received a five million dollar bailout clause check, which, which I can use to help my family, so, I- I guess, goodbye, cousin. [heads for the door with Sheila]"
    },
    {
        "character": "Kyle Two",
        "line": "Okay. See ya, cousin. Hope to see ya soon. [once Kyle is out of earshot, says in a low voice] Not too soon, I hope."
    },
    {
        "character": "Stan",
        "line": "Yeah, haha."
    },
    {
        "character": "Cartman",
        "line": "Heheheheheh. [the door is heard opening and they realize what Kyle just told them]"
    },
    {
        "character": "All Three",
        "line": "Five million dollars??? [they quickly rush up to Kyle and block him from leaving the house. Sheila is already outside]"
    },
    {
        "character": "Kyle Two",
        "line": "Dudedudedude! You- you have five million dollars??"
    },
    {
        "character": "Kyle",
        "line": "Yeah, I don't know what to do with it, though. Well, see ya."
    },
    {
        "character": "Kyle Two",
        "line": "[holds his palms out] Wait. Kyle, this may sound crazy, but I think you should stay!"
    },
    {
        "character": "Stan, Cartman",
        "line": "Yeah!"
    },
    {
        "character": "Kyle",
        "line": "Re- really?"
    },
    {
        "character": "Kyle Two",
        "line": "Yeah. You see, I've learned something today. [Sheila watches from outside, waiting for Kyle. Music starts up] Sometimes people have trouble fitting in at, at school and,... [music dies] and um... Let's see, what did I learn about? [voice fading, strokes his chin] What did I learn about today?"
    },
    {
        "character": "Cartman",
        "line": "[steps forth] I- I, I learned that... you shouldn't judge somebody because... that-no, wait."
    },
    {
        "character": "Kyle Two",
        "line": "Nonono, it was good! What were you going to say?"
    },
    {
        "character": "Kyle",
        "line": "Listen, guys, I appreciate you wanting me around, but, the fact of the matter is, well, yeh, you guys are just kind of douche bags."
    },
    {
        "character": "Kyle Two",
        "line": "... Uhwhat?"
    },
    {
        "character": "Kyle",
        "line": "I mean, yeyou people are all just such hick jock rednecks; it's just like you right out of a stereotyped catalog. [picks up his suitcases and goes towards the door] Ah I can't take it. See ya. [walks out and joins his aunt to the car. The boys are left stunned, having been judged and found wanting once again]"
    },
    {
        "character": "Kyle Two",
        "line": "Dude! Weak."
    },
    {
        "character": "Cartman",
        "line": "[turns to Kyle] ...Good job, Jew!"
    }
]