[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Cartman's house, living room, day. Cartman, Stan, and Kyle are on the sofa laughing as Cartman does some prank calls."
    },
    {
        "character": "Cartman",
        "line": "[dialing] Shu- shut up you guys, shut up you guys. [the boys quiet down and cover their mouths as the call goes through to City Wok, a Chinese restaurant.]"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Herro, Shitty Wok, take your order prease."
    },
    {
        "character": "Cartman",
        "line": "[the boys giggle] Hello, is this City Wok?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Yes, this Shitty Wok"
    },
    {
        "character": "Cartman",
        "line": "[the boys giggle harder] Uh, yes, we'd like one order of the City Beef."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "[writing] Shitty Beef..."
    },
    {
        "character": "Kyle",
        "line": "Aha, and I'll have the City Chicken."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "[writing] Shitty Chicken... [the boys bursts in laughter. Cartman rolls back on the sofa]"
    },
    {
        "character": "Stan",
        "line": "Oh, dude, look! [the others look up and the phone falls off Cartman's lap to the floor] It's that commercial with the guy that lost 400 pounds eating at Subway Sandwiches!"
    },
    {
        "character": "",
        "line": "Commercial. The first thing on the screen is a submarine sandwich. It pans across the screen."
    },
    {
        "character": "Singer",
        "line": "\nHe's still lookin' good!\n[a man appears eating a footlong subway sandwich. The name \"JARED FOGLE\" appears on the screen near the bottom]\nHis name is Jared\n[he struts down a sidewalk. \"LOST 262 LBS.\" appears on the screen]\nHis name is Jared and he likes to eat the sandwiches...\n[a side shot of Jared walking smoothly behind a white picket fence in Downtown, then of slices of a party sub, then of the first sandwich]\n\n\n\n"
    },
    {
        "character": "",
        "line": "Cartman living room. Butters walks in."
    },
    {
        "character": "Butters",
        "line": "Uh, hey, fellas."
    },
    {
        "character": "Stan",
        "line": "Hey Kenny."
    },
    {
        "character": "Butters",
        "line": "[upset] Now gosh darnit, my name's not Kenny! Kenny's dead, and you're all gonna have to learn to deal with it!"
    },
    {
        "character": "Kyle",
        "line": "Okay, Not-Kenny."
    },
    {
        "character": "",
        "line": "Commercial continues."
    },
    {
        "character": "Announcer",
        "line": "Hey South Park! [camera switches to the TV. Jared is shown munching away on a sub sandwich behind splash bubbles saying \"JARED LIVE\" \"FREE SUBS\" and \"LOSE WEIGHT\" and \"MEET JARED\" \"SOUTH PARK, COLORADO\"] You can meet Jared IN PERSON March 6 at the Kenny McCormick Memorial Town Square!"
    },
    {
        "character": "Butters",
        "line": "[excited] Woh, boy! Jared's comin' to town!"
    },
    {
        "character": "Kyle",
        "line": "Dude! That's today!"
    },
    {
        "character": "Stan",
        "line": "We've gotta get down there! Come on, Not-Kenny! [Stan and Kyle hop off the sofa and head for the front door]"
    },
    {
        "character": "Butters",
        "line": "[angered] Now gosh darnit, my name's not Not-Kenny!"
    },
    {
        "character": "Cartman",
        "line": "[hops off and follows Stan and Kyle] Okay, come on, Not-Not-Kenny."
    },
    {
        "character": "Butters",
        "line": "Wo-ah I'm getting steamed now. [follows the other three. The phone remains on the floor]"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "[the receiver rattles with his voice] Hello! City Wok! City Wok, I take your order prease!"
    },
    {
        "character": "",
        "line": "Kenny McCormick Memorial Town Square, moments later. A crowd is in front of the stage waiting for Jared, with people holding up signs saying \"We Love Jared\" \"We Love You Jared!!\" \"Jared for President\", etc. The boys walk up to Herbert Garrison. Kyle taps him."
    },
    {
        "character": "Kyle",
        "line": "Excuse me? Could we get through here?"
    },
    {
        "character": "Herbert Garrison",
        "line": "[turns around] Hell no! I've been savin' this spot for six hours! [begins to dance]His name is Garrison, Mr. Garrison. He lost ten pounds takin' Jared's lead-\n\n\n"
    },
    {
        "character": "Randy",
        "line": "Here he comes! [the crowd turns left as one and starts clamoring. Jared struts towards the crowd as his theme song comes up]"
    },
    {
        "character": "Singer",
        "line": "He's still lookin' good, with all those... sub sandwiches... [Jared walks up on stage and takes the podium]"
    },
    {
        "character": "Jared",
        "line": "Thank you all so much. You know what? After a year of eating delicious sub sandwiches, I've proven weight loss is easy! [the crowd cheers] And I promise you, I will always be your faithful leader in easy weight loss!"
    },
    {
        "character": "Some men",
        "line": "Alright! [more cheering]"
    },
    {
        "character": "Cartman",
        "line": "That guy ate all the sandwiches he wanted and lost weight. He is so cool."
    },
    {
        "character": "",
        "line": "South Park, later. A knock is heard and a door opens. Jared is seen eating a sub at a desk. A worker peaks in."
    },
    {
        "character": "Worker",
        "line": "Mr. Fogle, some fans wanted to see if you'd sign their sandwich?"
    },
    {
        "character": "Jared",
        "line": "Sure, let 'em in. [the worker lets the boys in and Jared spins around to face them] Hi kids. [the room Jared is in is a dressing room]"
    },
    {
        "character": "Butters",
        "line": "Wow, Jared!"
    },
    {
        "character": "Kyle",
        "line": "Dude! Did you really lose all that weight eating nothing but sub sandwiches?"
    },
    {
        "character": "Jared",
        "line": "I sure did! And- Well- Well I, I also had a little help on the side."
    },
    {
        "character": "Stan",
        "line": "What kind of help?"
    },
    {
        "character": "Jared",
        "line": "Well, eating sub sandwiches was a big part of it. But the way that I lost so much weight was that I got aides."
    },
    {
        "character": "Cartman",
        "line": "A- AIDS?"
    },
    {
        "character": "Jared",
        "line": "That's right. I got aides about two years ago and I've been losing weight ever since. It's amazing how slim you can get with aides."
    },
    {
        "character": "Stan",
        "line": "I'll bet you can."
    },
    {
        "character": "Jared",
        "line": "Would you like to meet them?"
    },
    {
        "character": "Kyle",
        "line": "[steps backwards] Them?"
    },
    {
        "character": "Jared",
        "line": "My aides. Scott! Tyler! [moves to the door. The two aides come in and Jared stands behind them. Then he looks at the blond to his left] Scott is my personal trainer [looks at the light brunet to his right] and Tyler is my dietitian."
    },
    {
        "character": "Scott, Tyler",
        "line": "Hello."
    },
    {
        "character": "Kyle",
        "line": "Oh, \"A I D E S,\" aides."
    },
    {
        "character": "Jared",
        "line": "Yep. Hooray for aides!"
    },
    {
        "character": "Kyle",
        "line": "Well, that's not really what you say in the commercial."
    },
    {
        "character": "Jared",
        "line": "I know. You kinda have to read the fine print at the bottom of the screen. It says I only ate a half-sized lean turkey sandwich with no mustard or mayo or anything like that and then had proper diet and exercise aides."
    },
    {
        "character": "Kyle",
        "line": "But you're lying to people. If they knew that you didn't eat just all the sandwiches you want, you might not be so popular."
    },
    {
        "character": "Jared",
        "line": "Y- you think so. Well, why... should it matter?"
    },
    {
        "character": "Kyle",
        "line": "It matters, dude. [Jared begins to think...]"
    },
    {
        "character": "Jared",
        "line": "Hmmm."
    },
    {
        "character": "",
        "line": "Main Street, moments later. The boys walk along..."
    },
    {
        "character": "Kyle",
        "line": "That penisbutt didn't lose weight eating sub sandwiches. He lost weight because he ate less of them and exercised."
    },
    {
        "character": "Stan",
        "line": "Yeah, it's only in America that somebody can become famous just because they go from being a big fatass to not being a big fatass."
    },
    {
        "character": "Cartman",
        "line": "Oh-my-god! [turns around] You guys! I think I'm having a genius moment. Yes. Yes! Its coming to me now."
    },
    {
        "character": "Kyle",
        "line": "Tha- that's diarrhea."
    },
    {
        "character": "Cartman",
        "line": "Noo. Don't you see what this all means? Anybody could do what he did. What's to stop someone else from going to say, City Wok, and cutting a deal with them? Say they'll eat nothing but their Chinese food, but then eat only a little tiny bit of it and exercise."
    },
    {
        "character": "Stan",
        "line": "[following] Then City Wok could say their food makes them lose weight."
    },
    {
        "character": "Cartman",
        "line": "[softly] That's right Stan. [bolder] It's a cash cow, I tell you."
    },
    {
        "character": "Kyle",
        "line": "That's a great idea!"
    },
    {
        "character": "Cartman",
        "line": "Lose weight and make money... I tell you this is gonna be the greatest thing that Butters has ever done."
    },
    {
        "character": "Butters",
        "line": "[surprised, steps backwards] Me?!"
    },
    {
        "character": "Cartman",
        "line": "Weh- who do you think I'm talkin' about, Butters? Joyce de Witt?"
    },
    {
        "character": "Butters",
        "line": "Oh, no, I thought you meant you. Eh, you're the fat one."
    },
    {
        "character": "Cartman",
        "line": "I can't lose weight, Butters, 'cause I'm not fat. I'm big-boned. You can't slim down bones, stupid!"
    },
    {
        "character": "Kyle",
        "line": "But Butters isn't fat."
    },
    {
        "character": "Cartman",
        "line": "That's my whole point. First we fatten him up, then we make the deal with City Wok, then take the weight back off."
    },
    {
        "character": "Stan",
        "line": "He's right. If Butters is naturally skinny, he'll be able to take the weight off faster."
    },
    {
        "character": "Butters",
        "line": "But fellas, if I get fat my parents will ground me."
    },
    {
        "character": "Cartman",
        "line": "Oh, come on! Just think about how famous you'll be!"
    },
    {
        "character": "Butters",
        "line": "You mean like Jared?"
    },
    {
        "character": "Kyle",
        "line": "Yeah dude! You'll be just like Jared!"
    },
    {
        "character": "Butters",
        "line": "[angrily] Well the heck with that! You said Jared was a penis-butt!"
    },
    {
        "character": "Stan",
        "line": "You wouldn't be a penis-butt, Butters, you'd be famous. Just think about all those people following you around, singing songs to you just because you lost some weight...His name is Butters, it's Butters. [the boys begin to sway for each line]\n\n"
    },
    {
        "character": "Cartman",
        "line": "He used to be fat but not no more [Butters brightens up]"
    },
    {
        "character": "Kyle",
        "line": "City Wok brought him down to a size 4."
    },
    {
        "character": "Stan",
        "line": "Now, he's got lots of moneys and girls."
    },
    {
        "character": "Cartman",
        "line": "[slowing] and a lifetime of free food at City Wok."
    },
    {
        "character": "Butters",
        "line": "[beaming] Wow."
    },
    {
        "character": "",
        "line": "Le Place Restaurant, night. Jared is dining with a woman inside."
    },
    {
        "character": "Jared",
        "line": "Christine, you know I love you very much, and I, I can't wait for the wedding."
    },
    {
        "character": "Christine",
        "line": "I love you too, Jared. You've changed my whole life.\nHer name is Jonez, Christine Jonez\nShe lost forty pounds when she met Jared-\n\n\n"
    },
    {
        "character": "Jared",
        "line": "Yeh, I know I know, I know. But uh... some young boys were talkin' to me earlier, and... it made me think that people might not be so proud of my weight loss if they knew something."
    },
    {
        "character": "Christine",
        "line": "Jared, what's this all about?"
    },
    {
        "character": "Jared",
        "line": "Uh, Christine, this isn't probably gonna matter to you at all, but... I have aides."
    },
    {
        "character": "Christine",
        "line": "What?!"
    },
    {
        "character": "Jared",
        "line": "Yeah, I have aides. I've had aides since before we were together. [Christine's jaw drops] What, what are you thinking? Are you bummed?"
    },
    {
        "character": "Christine",
        "line": "Am I bummed?! [moves her chair away from Jared and faces him] You've had AIDS all this time and you knew it?!"
    },
    {
        "character": "Jared",
        "line": "Well of course I knew it."
    },
    {
        "character": "Christine",
        "line": "Why the hell wouldn't you tell me?!"
    },
    {
        "character": "Jared",
        "line": "I didn't think it was that big of a deal."
    },
    {
        "character": "Christine",
        "line": "Not that big of a deal?! I slept with you!"
    },
    {
        "character": "Jared",
        "line": "Aren't you overreacting a little bit?"
    },
    {
        "character": "Christine",
        "line": "Well, Jesus Christ! We're supposed to get married!"
    },
    {
        "character": "Jared",
        "line": "We can still get married Christine, I mean, sure, they're my aides now, but after we get married... they'll be our aides [Christine sobs] You'll love having aides, Christine, you really will. And when we have children, they'll have aides. It'll make things so simple! [Christine throws up her arms, rises from her chair, and runs out of the restaurant sobbing] Christine! [rises and moves to follow Christine, but stops to think] Jeez, those boys were right. People really don't like aides. I'd better tell everyone the truth."
    },
    {
        "character": "",
        "line": "South Park Elementary, next day. The boys enter the kitchen to get their meals."
    },
    {
        "character": "Chef",
        "line": "Hello there, children."
    },
    {
        "character": "Kyle",
        "line": "Chef, we need Butters to gain about fifty pounds fast."
    },
    {
        "character": "Chef",
        "line": "Fifty pounds? Why?"
    },
    {
        "character": "Cartman",
        "line": "Uuuh, school project."
    },
    {
        "character": "Chef",
        "line": "Well, if you want him to get really fat as fast as possible, one of you will have to marry him."
    },
    {
        "character": "Stan",
        "line": "Marry him?"
    },
    {
        "character": "Chef",
        "line": "It definitely worked for every woman I ever met."
    },
    {
        "character": "Butters",
        "line": "Oh, no, no, no! I ain't gettin' married; my parents will ground me!"
    },
    {
        "character": "Kyle",
        "line": "Yeah, none of us wanna marry Butters."
    },
    {
        "character": "Butters",
        "line": "[self-conscious] Well, uh, how come? What's wrong with me?"
    },
    {
        "character": "Chef",
        "line": "Well, I guess we're gonna have to do this the old-fashioned way. Come on back, children. [all of them move away from the counter and towards the back]"
    },
    {
        "character": "",
        "line": "The kitchen, food preparation area. The camera pans across the table showing pots, pans, and dishes with food all over the place. It rests on Butters trying to finish off a plate, but struggling."
    },
    {
        "character": "Butters",
        "line": "Ugh. [sets his plate down] Wuh, wuh, I can't eat no more."
    },
    {
        "character": "Kyle",
        "line": "You have to! Here, have some more mayonnaise. [scoops out a tablespoon and hands it to Butters, but Butters doesn't take it. Chef enters and Butters begins to throw up]"
    },
    {
        "character": "Stan",
        "line": "[notices] Chef, we need more food."
    },
    {
        "character": "Chef",
        "line": "I'm runnin' out, children. [leaves. Butters vomits some more]"
    },
    {
        "character": "Cartman",
        "line": "Damnit Butters! Keep eating or I'll kick you till you're deader than Kenny!"
    },
    {
        "character": "Stan",
        "line": "[soberly] Dude, that isn't cool. You shouldn't joke about Kenny being dead. Enough time hasn't passed."
    },
    {
        "character": "Cartman",
        "line": "So how long until we can joke about it?"
    },
    {
        "character": "Kyle",
        "line": "Twenty-two point three years. That's how long it takes for something tragic to become funny."
    },
    {
        "character": "Cartman",
        "line": "Wugh, that's a long time to wait."
    },
    {
        "character": "Butters",
        "line": "Wull I can't eat no more. I-I just keep pukin' it up."
    },
    {
        "character": "Cartman",
        "line": "Then eat your puke."
    },
    {
        "character": "Butters",
        "line": "No!"
    },
    {
        "character": "Cartman",
        "line": "Oh, come on! Japanese girls do it. [Butters looks at Cartman, then at his puke. Reluctantly he scoops it up and eats it.]"
    },
    {
        "character": "",
        "line": "Kenny McCormick Memorial Town Square, later."
    },
    {
        "character": "Subway Representative",
        "line": "Ladies and gentlemen, we at Subway are happy to inform you that Jared has elected to stay in South Park in order to speak to you once again! [the crowd oohs and aaha]"
    },
    {
        "character": "Man 1",
        "line": "He's going to speak with us once again!"
    },
    {
        "character": "Subway Representative",
        "line": "So, here he is, Jared! [the crowd cheers, and Jared is again walking towards them, grinning]"
    },
    {
        "character": "Singer",
        "line": "He's still lookin' good, eatin' them sandwiches all the time...[Jared walks up on stage and takes the podium]"
    },
    {
        "character": "Jared",
        "line": "Thank you-hoo, thank you all. Subway is a healthy way to eat fast food and lose weight!"
    },
    {
        "character": "Subway Representative",
        "line": "All right! [pumps his arm as the crowd reacts]"
    },
    {
        "character": "Jared",
        "line": "But, [the crowd quiets down] I feel like I need to come a little clean about something, uh-... it wasn't just Subway sandwiches that made me thin."
    },
    {
        "character": "Subway Representative",
        "line": "...Huh?"
    },
    {
        "character": "Jared",
        "line": "The reason I was able to lose so much weight so quickly was that I got aides. [grins with relief. The rep's jaw drops.]"
    },
    {
        "character": "Man 2",
        "line": "Huh?"
    },
    {
        "character": "Man 3",
        "line": "What?"
    },
    {
        "character": "Man 4",
        "line": "Did he say AIDS?"
    },
    {
        "character": "Jared",
        "line": "But I still wanna be the leader in a fitter America, and so I'm here to tell you, that you should ALL go out and get aides! [the crowd immediately begins to disperse]"
    },
    {
        "character": "Man 2",
        "line": "Oh my God!"
    },
    {
        "character": "A woman",
        "line": "Is he serious?"
    },
    {
        "character": "Jared",
        "line": "Having aides - is - awesome! With aides you can literally watch the fat melt away! And with the proper mix of aides and Subway sandwiches, anything is possible! [the rep, looking on in dismay, has had enough and pushes Jared out of the way to take the mic]"
    },
    {
        "character": "Subway Representative",
        "line": "Uh, the opinions expressed by Mr. Fogle are not necessarily those of the Subway Company. [Jared soothes his left arm a bit]"
    },
    {
        "character": "",
        "line": "Cartman's living room, some days later. Stan is measuring Butters' girth and grins at the result. Camera zooms out."
    },
    {
        "character": "Kyle",
        "line": "Wow! He looks great!"
    },
    {
        "character": "Stan",
        "line": "How do you feel, Butters?"
    },
    {
        "character": "Butters",
        "line": "W-well, k-kinda like Cartman. [Cartman slaps Butters and shakes him] Aw!"
    },
    {
        "character": "Cartman",
        "line": "Get a hold of yourself, man!"
    },
    {
        "character": "Stan",
        "line": "Alright, now it's time for phase 2."
    },
    {
        "character": "",
        "line": "City Wok, moments later. The boys walk towards it and enter. The owner greets them."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Welcome to Shitty Wok. You rike to try Shitty Chicken today?"
    },
    {
        "character": "Cartman",
        "line": "Sir, we have come to offer you the business deal of a lifetime."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "You want the Shitty Beef?"
    },
    {
        "character": "Kyle",
        "line": "Nope. We wanna show the world how healthy your food is. Our fat friend here is going to lose forty pounds eating at Shitty Wok."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Which one? I see two fat friends."
    },
    {
        "character": "Cartman",
        "line": "[pointing to Butters] The fat one!"
    },
    {
        "character": "Stan",
        "line": "We're gonna take before and after photos, and then, when he gets skinny from eating your food, we'll show the world."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "...Why?"
    },
    {
        "character": "Kyle",
        "line": "Because then you can pay us to use our friend in commercials."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Oh! You mean like-a Jared?!"
    },
    {
        "character": "Cartman",
        "line": "Just like Jared."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "His name is Jared, he lose some weight. Shitty Wok food sure is great. Yeah, okay. That sound good. Saw if he lose weight eating Shitty Wok, I pay use to use him in commercial."
    },
    {
        "character": "The Boys",
        "line": "All right!"
    },
    {
        "character": "Cartman",
        "line": "Sir, we are in business!"
    },
    {
        "character": "",
        "line": "Subway company boardroom, day. Jared has been called in to see the board."
    },
    {
        "character": "Subway Representative",
        "line": "[second from left] Jared, first of all we want to say that all of us here at Subway appreciate everything you've done for our company."
    },
    {
        "character": "Jared",
        "line": "[happily] Well, I appreciate your company doing everything it's done for me."
    },
    {
        "character": "Subway Rep 2",
        "line": "[second from right] Yes, well, it is now the opinion of all of us that perhaps it would be best for you to take your... strange theories on weight loss elsewhere."
    },
    {
        "character": "Jared",
        "line": "[crestfallen] ...'Scuse me... am I being fired?"
    },
    {
        "character": "Subway Rep 3",
        "line": "[center] Jared, it's just that your new take on weight loss is contrary to our commitment to good health."
    },
    {
        "character": "Jared",
        "line": "How so?"
    },
    {
        "character": "Subway Representative",
        "line": "Well, your new slogan, for instance. [clears his throat] \"When it comes to fitness, Subway goes hand in hand with aides.\""
    },
    {
        "character": "Jared",
        "line": "[softly] Ah-hah. [he rises and leaves the \"SANDWICH MARKETING\" building with hands in pockets. He closes the door and walks away dejectedly. He passes a basketball court where a few people are shooting baskets. He looks at them as he passes by. Then he stops, looks at the camera, sighs, and]"
    },
    {
        "character": "Singer",
        "line": "His name is Jared. Jared lost weight eating Subway, now he's cold and alone and with no place to call his home. He liked sandwiches with Philadelphia cream cheese."
    },
    {
        "character": "",
        "line": "Flex Gym Fitness Club, day."
    },
    {
        "character": "Cartman",
        "line": "[heard from the outside] Come on, Butters, you gotta get skinny again! [the camera goes inside. People are exercising on all sorts of equipment. A woman runs by on a track on the second floor. Butters is pulling at a rowing machine as Cartman spots him. Cartman is eating Cheesy Poofs and barking orders] You are such a flabby hunk of crap! Look at those jelly rolls! Jelly rolls I tell ya!! You still got seven chins, boah! You'll never be thin!! Nobody loves you!"
    },
    {
        "character": "Butters",
        "line": "[looks at Cartman] Wuh hey now, they do too! Uh, my mom and dad - love me even if I am fat."
    },
    {
        "character": "Cartman",
        "line": "[normal] Butters, I'm just trying to offer some motivational help here."
    },
    {
        "character": "Butters",
        "line": "Well alright then."
    },
    {
        "character": "Cartman",
        "line": "[barking] Row you fat bitch! Look at those jelly rolls! Nobody loves you! You're not even a person!"
    },
    {
        "character": "",
        "line": "Jared's dressing room, day. Jared paces the room eating a sub sandwich."
    },
    {
        "character": "Jared",
        "line": "I never asked to be famous; now everyone hates me! I almost wish I had never gotten aides! [his aides come in]"
    },
    {
        "character": "Tyler",
        "line": "Hey now, come on. What kind of talk is that?"
    },
    {
        "character": "Jared",
        "line": "I'm sorry, guys, but I...I think I wanna be aides-free for a while."
    },
    {
        "character": "Scott",
        "line": "Come on, Jared, lighten up! People don't hate you."
    },
    {
        "character": "Tyler",
        "line": "Yeah. Maybe they're all just jealous that they can't afford to hire their own aides."
    },
    {
        "character": "Jared",
        "line": "[brightening] Wait a minute... you're right! [moves towards the camera] Yeah! I think I know how to be a celebrity again! [heads for the door]"
    },
    {
        "character": "",
        "line": "City Wok, outside, later. Cartman and Kyle wait on Stan as he arrives."
    },
    {
        "character": "Stan",
        "line": "Did you bring the camera?"
    },
    {
        "character": "Kyle",
        "line": "Yeah, we're all set."
    },
    {
        "character": "Cartman",
        "line": "[steps in between them] Guys, I think this might be a good time to discuss some business."
    },
    {
        "character": "Kyle",
        "line": "Well, what do you mean?"
    },
    {
        "character": "Cartman",
        "line": "Well, when City Wok sees how skinny Butters is, they're not gonna want him to just make one commercial, they're gonna want several."
    },
    {
        "character": "Stan",
        "line": "That's true. Jared did like a hundred for Subway Sandwiches."
    },
    {
        "character": "Cartman",
        "line": "I think we're looking at a non-exclusive two-year fifty-picture deal here. My calculations put that at about four million dollars."
    },
    {
        "character": "Kyle",
        "line": "Wow! [he and Stan are awed]"
    },
    {
        "character": "Cartman",
        "line": "Now, I think the four million should be split evenly among the three of us, except that I should get a twenty percent per negation fee off the gross for having come up with the idea."
    },
    {
        "character": "Butters",
        "line": "[arrives as Cartman speaks] Hey fellas."
    },
    {
        "character": "Stan",
        "line": "Butters?! What the hell are you doing?!"
    },
    {
        "character": "Kyle",
        "line": "Yeah, you're still fat!"
    },
    {
        "character": "Butters",
        "line": "Well, I know, ah I can't seem to lose it."
    },
    {
        "character": "Cartman",
        "line": "Well we're supposed to shoot your commercial today, you fat piece of crap!"
    },
    {
        "character": "Butters",
        "line": "Well ah I don't know what to tell ya. Losin' weight is harder than puttin' it on."
    },
    {
        "character": "Cartman",
        "line": "No it isn't, stupid blubberbutt!"
    },
    {
        "character": "Stan",
        "line": "[Kyle finally produces the camera] Did you eat only one ounce of City Wok like we told you?!"
    },
    {
        "character": "Butters",
        "line": "Well uh yeah, but ah, I don't know..."
    },
    {
        "character": "Kyle",
        "line": "Why are you doing this to us?!"
    },
    {
        "character": "",
        "line": "Butters' house, later. The boys have prepared a makeshift operating table on the coffee table in the living room. Kyle reads from a medical book, Cartman has a suction tube and pail, and Stan is overseeing the operation."
    },
    {
        "character": "Stan",
        "line": "All prepared for liposuction surgery?"
    },
    {
        "character": "Cartman",
        "line": "Check."
    },
    {
        "character": "Butters",
        "line": "Uh, I don't know about this, fellas."
    },
    {
        "character": "Stan",
        "line": "[shoots back] Hey, you're the one who screwed us by not losing weight, Butters. [Cartman makes sure the scalpel is sharp]"
    },
    {
        "character": "Kyle",
        "line": "[faces Stan] Okay, it says here the operation begins with a one-inch incision in the ab-do-men on the left side just above the hip."
    },
    {
        "character": "Cartman",
        "line": "That should blah [babbles a bit] ah- here. [cuts into Butters' abdomen]"
    },
    {
        "character": "Butters",
        "line": "[reacts] Woahhh!"
    },
    {
        "character": "Cartman",
        "line": "Oh stop your bitchin' Butters! Kenny woulda took it like a man!"
    },
    {
        "character": "Kyle",
        "line": "Okay, now put one end of the tube a half an inch into the incision. [Cartman picks up one end of the tube and inserts it into the incision]"
    },
    {
        "character": "Cartman",
        "line": "Alrighty."
    },
    {
        "character": "Butters",
        "line": "Whoa. I think this is a bad idea, fellas. I feel woozy."
    },
    {
        "character": "Cartman",
        "line": "Alright, I think it's in. [turns around]"
    },
    {
        "character": "Kyle",
        "line": "The liposuction is a process of siphoning out the excess fat. [Cartman stalls, then picks up the other end and starts sucking the fat out]"
    },
    {
        "character": "Cartman",
        "line": "[spits out the hose as soon as the fat hits his lips] Bohogh, egh. [puts the hose into the pail for the fat to collect]"
    },
    {
        "character": "Butters",
        "line": "Waaaahh!"
    },
    {
        "character": "Cartman",
        "line": "There it goes."
    },
    {
        "character": "Kyle",
        "line": "Alright, it's working!"
    },
    {
        "character": "Cartman",
        "line": "[wipes away a bit of fat remaining on his lips] Aw man, it tastes like that, um, you know that cream-chipped-beef stuff that Chef makes sometimes."
    },
    {
        "character": "Butters",
        "line": "Aahh heh ahh, I don't feel very good."
    },
    {
        "character": "Stan",
        "line": "Shut up, Butters, it's your own damned fault."
    },
    {
        "character": "Butters",
        "line": "Everything's getting dark..."
    },
    {
        "character": "Stan",
        "line": "We've gotta hurry this up. [moves behind the coffee table to Butter's belly and starts pounding on it. The fat begins flowing out faster]"
    },
    {
        "character": "Cartman",
        "line": "[looks at the fat flowing out] Oh yeah, keep doing that. That's working good."
    },
    {
        "character": "Stan",
        "line": "He's losing weight. [Kyle smiles]"
    },
    {
        "character": "Cartman",
        "line": "Oh, whoa. Whoa! [the fat rushes out so quickly the tube begins to buck, splattering fat and blood all over the place]"
    },
    {
        "character": "Kyle",
        "line": "It's out of control! [Stan has stopped pounding, but the fat is pulsing out and Cartman can't control it.. Butters gets thinner by the second and headed for shock]"
    },
    {
        "character": "Butters",
        "line": "Whoa, everything's getting sparkly. [the sound of a car pulling up is heard]"
    },
    {
        "character": "Stan",
        "line": "Oh no, dude, Butters' parents are home."
    },
    {
        "character": "Cartman",
        "line": "Oh, crap!"
    },
    {
        "character": "Stan",
        "line": "Dude, bail! [the three boys rush out the back door, then the front door opens and Butter's parents walk in. The living room is a mess]"
    },
    {
        "character": "Linda",
        "line": "Butters? Butters?!"
    },
    {
        "character": "Butters",
        "line": "[listlessly] Mom. Dad."
    },
    {
        "character": "Stephen",
        "line": "Butters. Are you having liposuction surgery? Tell me the truth!"
    },
    {
        "character": "Butters",
        "line": "Yes sir."
    },
    {
        "character": "Linda",
        "line": "This is unbelievable! How many times have we told you not to have self-perform liposuction surgery in our house?!"
    },
    {
        "character": "Butters",
        "line": "Four times, mom."
    },
    {
        "character": "Stephen",
        "line": "Well, I guess that wasn't enough! You get up to your room right now, mister!"
    },
    {
        "character": "Butters",
        "line": "Yes, sir. [rises and... struggles. He falls off the coffee table to the floor. Stephen isn't fazed, but Linda is affected]"
    },
    {
        "character": "Stephen",
        "line": "Oh, huh- Don't you give us that look young man! You're gonna get it!"
    },
    {
        "character": "",
        "line": "News 4 News, day. A field reporter stands in front of the Mayor's office. The mayor and her aides are present."
    },
    {
        "character": "Reporter",
        "line": "Tom, I'm standing out in front of the Mayor's office, where the big liar, Jared, is once again about to speak. Apparently, Jared hopes to regain his celebrity hero status, which was lost when he announced that it was AIDS, not sub sandwiches, that caused him to lose weight. Let's listen in."
    },
    {
        "character": "",
        "line": "The podium. Jared stands behind it."
    },
    {
        "character": "Jared",
        "line": "Ladies and gentlemen, a-at first I didn't understand why you felt betrayed by the fact that my aides helped me to lose weight, but now I understand that it isn't fair that- I had aides and most of you don't. And so, with all the money I've made from commercials, I have decided to start the Aides for Everyone Foundation!"
    },
    {
        "character": "Jimbo",
        "line": "What?!"
    },
    {
        "character": "Jared",
        "line": "I am going to personally see to it that each and every one of you gets aides! [a long silence follows as the audience just looks at Jared]"
    },
    {
        "character": "Mayor McDaniels",
        "line": "This guy's insane."
    },
    {
        "character": "Jared",
        "line": "But I won't stop there. I'm gonna seek out all the underprivileged and hungry children of the world, and I'm going to give them aides myself!"
    },
    {
        "character": "Chef",
        "line": "You're gonna give children AIDS?!"
    },
    {
        "character": "Jared",
        "line": "Yes, it is my hope that every beautiful child on this earth has aides by next month! Aides for everyone! [another long silence]"
    },
    {
        "character": "Skeeter",
        "line": "Get him! [the crowd begins to move forward angrily and Jared leaves the podium]"
    },
    {
        "character": "",
        "line": "Butters' house, some days later. Stan, Kyle, and Cartman show up at the front door, and Cartman rings the bell."
    },
    {
        "character": "Stan",
        "line": "Come on, Butters. Time to go."
    },
    {
        "character": "Butters",
        "line": "Uh- go where?"
    },
    {
        "character": "Kyle",
        "line": "To City Wok so we can make our money. God!"
    },
    {
        "character": "Butters",
        "line": "I can't go anywhere, fellas. I've been grounded for havin' liposuction... surgery. [lifts his shorts to show the bandage over the scar]"
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Butters",
        "line": "Wuh well I told you my parents would be sore, and they said for... havin' liposuction surgery, I can't play outside for five days."
    },
    {
        "character": "Cartman",
        "line": "Dude, we just need you to come down to City Wok real quick so they can see how skinny you are!"
    },
    {
        "character": "Butters",
        "line": "[counts off] Well you guys have already got me in Dutch for gettin' fat, and then I got in double-Dutch for... havin' liposuction, and now you're askin' me to be in triple Dutch?! [moves his hands palms down to wash his hands of any more trouble] Huh-uh! I'll never be that Dutch!"
    },
    {
        "character": "Stan",
        "line": "...Kenny would have done it."
    },
    {
        "character": "Kyle",
        "line": "Yep."
    },
    {
        "character": "Cartman",
        "line": "Do you guys remember what a cool friend Kenny was? [whispers] God. [normally] He was always up for helpin' us out; man, he was the best friend ever."
    },
    {
        "character": "Butters",
        "line": "Look, fellas, I can't do it! My mom and dad call in every hour from work to make sure I am here. If I don't answer the ph-phone, it'll know I'm- I'm up to no good!"
    },
    {
        "character": "Cartman",
        "line": "Alright alright, I'll stay here and answer the phone for you."
    },
    {
        "character": "Butters",
        "line": "No- but you don't sound like me."
    },
    {
        "character": "Cartman",
        "line": "[begins sounding something like Butters. Kyle looks on] Well, you don't sound like me. My name is Butters and I'm a little pussy who won't help his friends make money."
    },
    {
        "character": "Kyle",
        "line": "Wow, that was pretty good."
    },
    {
        "character": "Stan",
        "line": "Alright, it's settled. Come on, Butters. [pulls Butters out the door. Cartman enters the house]"
    },
    {
        "character": "Cartman",
        "line": "Don't forget, a third of that four million dollars is mine! [the others leave and he closes the door]"
    },
    {
        "character": "",
        "line": "Stotch living room, inside. Cartman moves to the sofa."
    },
    {
        "character": "Cartman",
        "line": "Eh. [makes himself comfortable on the sofa and turns on the TV. He grunts a bit] Eh. Yeah. [the phone rings; he answers] Well hello?"
    },
    {
        "character": "Stephen",
        "line": "[at an office full of cubicles] I'm just checking in on you, Butters. [a woman walks down the aisle behind him] Uh, do I hear the television? We told you no television while you're grounded!"
    },
    {
        "character": "Cartman",
        "line": "Oh, gee whiz, I'm not.. watchin' television, Dad, I'm just... layin' around jackin' it."
    },
    {
        "character": "Stephen",
        "line": "Jacking it? Jacking what?"
    },
    {
        "character": "Cartman",
        "line": "Well my hot spicy boner, of course, Dad."
    },
    {
        "character": "Stephen",
        "line": "WHAT?! Are you trying to get yourself in more trouble with that kind of language?!"
    },
    {
        "character": "Cartman",
        "line": "Ah, loosen up, you bloody vaginal belch."
    },
    {
        "character": "Stephen",
        "line": "Oh, you're gonna get it, mister! Just wait until I get home!"
    },
    {
        "character": "Cartman",
        "line": "Bring it on, queer bait. [hangs up] Aaaahhhh, yes! [puts his arms behind his head, quite satisfied with himself]"
    },
    {
        "character": "",
        "line": "Day, somewhere. Jared has a bat and is beating the hell out of something..."
    },
    {
        "character": "Jared",
        "line": "...I tell my [paf] girlfriend I have aides and she leaves, I tell the [paf] world to get aides and they think I'm crazy, I offer to give aides to kids and everyone wants me [paf] dead! [the camera pulls back and the thing Jared is beating is a dead horse. Literally] What's wrong with [paf] aides?! Why doesn't anyone want me to give them [paf] aides?! [the crowd arrives with torches, charging noisily]"
    },
    {
        "character": "Herbert Garrison",
        "line": "There he is, beatin' that dead horse!"
    },
    {
        "character": "Man in Crowd",
        "line": "Alright!"
    },
    {
        "character": "Jimbo",
        "line": "Let's get him! [the crowd charges forward and Jared runs away again]"
    },
    {
        "character": "Jared",
        "line": "Aahhh!"
    },
    {
        "character": "",
        "line": "City Wok. Stan, Kyle, and Butters arrive and enter."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Welcome ta Shitty Wok. Take your order prease."
    },
    {
        "character": "Kyle",
        "line": "We have great news! Our friend has lost forty pounds eating your City Wok food. Here's the before and after photos."
    },
    {
        "character": "Tuong Lu Kim",
        "line": "He lose weight eating Shitty Wok?"
    },
    {
        "character": "Stan",
        "line": "That's right! So now you can pay us to use him in your commercials and you'll have your very own Jared!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Oh no, no way! I not putting no Jared in my Shitty Wok commercial!"
    },
    {
        "character": "Kyle",
        "line": "Uh, why not?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Don't you know? Everybody hate Jared. He want everyone in world to have AIDS. He sick in the head."
    },
    {
        "character": "Stan",
        "line": "What?!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "I don't want Shitty Wok have nothing to do with Jared land his AIDS."
    },
    {
        "character": "Stan",
        "line": "Wait. Everyone hates Jared now?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Yah they, they gonna kill him. They gonna kill Jared downtown right now."
    },
    {
        "character": "Stan",
        "line": "Ugh, come on guys, we gotta sort this out. [the boys exit the store]"
    },
    {
        "character": "",
        "line": "Butters' house, living room. Cartman has eaten quite a bit of food (soda, milk, candy, Cheesy Poofs) and is watching TV - a Terrance & Phillip episode. Only their voices are heard."
    },
    {
        "character": "Phillip",
        "line": "Here's a man's fart for ya. [farts, laughs]"
    },
    {
        "character": "Terrance",
        "line": "God no! [laughs again, and Cartman joins in. The phone rings] Oh, Phillip, your anthrax has given me colon cancer!"
    },
    {
        "character": "Cartman",
        "line": "[answering] Hello?"
    },
    {
        "character": "Linda",
        "line": "[calling in from her office] Butters, your father called and said you made him very upset!"
    },
    {
        "character": "Cartman",
        "line": "Yeah, well, Dad's being a little pussy, Mom."
    },
    {
        "character": "Linda",
        "line": "[stunned, then] Butters, where did you get that kind of smart mouth?!"
    },
    {
        "character": "Cartman",
        "line": "Uh not from you dumbasses, that's for sure."
    },
    {
        "character": "Linda",
        "line": "OH, you just WAIT until I get home, mister!"
    },
    {
        "character": "Cartman",
        "line": "Oh, I'll be waiting with horse bells on, you old... horse-bangin' skank. [hangs up] Eh. [resumes eating]"
    },
    {
        "character": "Terrance",
        "line": "Ey! There's some anthrax over there! [farts, then roars with laughter]"
    },
    {
        "character": "Phillip",
        "line": "Oh no, hahahahahahaha."
    },
    {
        "character": "",
        "line": "Downtown, Mayor's office, outside, day. The crowd has captured Jared and taken him back downtown. A gallows is set up and Jared has had the noose placed around his neck. Two men finish and walk off. The Mayor stands off to one side with her aides."
    },
    {
        "character": "Jared",
        "line": "Why did I ever do those stupid commercials?"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Alright, Jared, you sick pervert! Do you have anything to say before you die?!"
    },
    {
        "character": "Kyle",
        "line": "[offscreen] Wait! [the boys run up to the gallows platform] You're all making a mistake!"
    },
    {
        "character": "Chef",
        "line": "Stand back, children! Jared wants to give you AIDS!"
    },
    {
        "character": "Stan",
        "line": "No, you don't understand. Jared doesn't have \"AIDS,\" AIDS, he has assistants. Two guys that help him lose weight that he calls his aides."
    },
    {
        "character": "People in Crowd",
        "line": "[softly] Oh."
    },
    {
        "character": "Mayor McDaniels",
        "line": "You mean, Jared's aides are like my aides?"
    },
    {
        "character": "Jared",
        "line": "Yes. ...Y-you mean you all thought...? Oh my Gosh!"
    },
    {
        "character": "Skeeter",
        "line": "Oh boy, do I feel stupid."
    },
    {
        "character": "Gerald",
        "line": "Oh we're so sorry, Jared."
    },
    {
        "character": "Jared",
        "line": "No no, hey it was my fault. I can't believe I- I, I didn't think of what I was saying! [giggles]"
    },
    {
        "character": "Chef",
        "line": "Eh so he was saying, children should have help like he had! [laughs]"
    },
    {
        "character": "Randy",
        "line": "Yeah! That has got to be about the biggest misunderstanding ever! [several people laugh]"
    },
    {
        "character": "Jared",
        "line": "[laughing] Oh my God! I told my girlfriend I wanted her to share my aides - oh, no wonder she left!"
    },
    {
        "character": "Herbert Garrison",
        "line": "[laughing] Cuh-can you imagine what we thought when you said, \"Aides for Everyone Foundation?\""
    },
    {
        "character": "Jared",
        "line": "Oh, brother!"
    },
    {
        "character": "Skeeter",
        "line": "Aha- [stops and realizes something] ...Hey. We're all laughing. [everyone stops and listens]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh hey, yeah. We, we woulda never laughed about this before."
    },
    {
        "character": "Randy",
        "line": "Well don't you see what this means? It's been 22.3 years, so... AIDS is finally funny!"
    },
    {
        "character": "People in Crowd",
        "line": "Ooo."
    },
    {
        "character": "Mayor McDaniels",
        "line": "He's right. It happened!"
    },
    {
        "character": "Jimbo",
        "line": "Hey everybody! AIDS is finally funny!"
    },
    {
        "character": "People in Crowd",
        "line": "Alright! Yay! Woohoo! [fireworks come up out of nowhere] Hooray!"
    },
    {
        "character": "Mr. Mackey",
        "line": "I knew it would be funny someday! [laughs] AIDS!"
    },
    {
        "character": "Herbert Garrison",
        "line": "Then it's time... We can undo the banner! [fanfare comes up, and a man pulls a curtain away to reveal a huge golden plaque reading \"AIDS IS FINALLY FUNNY\" Ooohs and aaahs follow.]"
    },
    {
        "character": "",
        "line": "Cut to Times Square, where the crawl reads \"3-06-02 AIDS HAS BEEN OFFICIALLY DECLARED FUNNY\""
    },
    {
        "character": "New Yorker",
        "line": "Hooray!"
    },
    {
        "character": "",
        "line": "Cut to Mayor's office, outside. Everyone now has party hats on and are celebrating. The field reporter resumes reporting."
    },
    {
        "character": "Reporter",
        "line": "Tom, I'm standing in the town square where just moments ago it was declared that AIDS... can finally be joked about. What a great day for humanity."
    },
    {
        "character": "Herbert Garrison",
        "line": "[laughs, then] \"AIDS quilt\" [resumes laughing. The crowd disperses and Tuong Lu Kim finds the boys]"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Oh boy, this is fantastic! I so grad AIDS is funny now."
    },
    {
        "character": "Stan",
        "line": "Okay, so now, do you wanna use our friend in your commercials?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Sure 'kay. I pay you fifteen dowlars."
    },
    {
        "character": "Stan",
        "line": "Fifteen dowlar? But... Jared got millions!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Hey, I'm not a-Subway, I Shitty Wok. Shitty Wok don't have... million dollars."
    },
    {
        "character": "Stan",
        "line": "[takes off his hat and throws it on the ground] Oh God-damnit!"
    },
    {
        "character": "Kyle",
        "line": "Aw, just forget the whole thing then!"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "Okay. [walks off, returns] Hey, you kids know why chicken cross the road?"
    },
    {
        "character": "Stan",
        "line": "Why?"
    },
    {
        "character": "Tuong Lu Kim",
        "line": "'Cause it has AIDS. [laughs. The boys just look at him oddly] AIDS so funny! [walks away laughing]"
    },
    {
        "character": "Stan",
        "line": "Well, so much for our money."
    },
    {
        "character": "Kyle",
        "line": "Yeah, but you know, I've learned something today. It would have been wrong to exploit Butters' weight loss. Because then lots of fat people would have believed it. And then gone and eaten a ton of Chinese food instead of dieting properly. They'd still be fat and, we'd be responsible for their shattered dreams."
    },
    {
        "character": "Butters",
        "line": "Yeah, I don't like shattering fat peoples' dreams. Besides, I'd get grounded. [gasps] Oh, Jesus! I'm supposed to be grounded! [rushes away]"
    },
    {
        "character": "",
        "line": "Butters' house, minutes later. Butters rushes to the front door."
    },
    {
        "character": "Butters",
        "line": "Huh. Huh, uh, uh."
    },
    {
        "character": "Cartman",
        "line": "[opens the door in anticipation] There you are, Butters!"
    },
    {
        "character": "Butters",
        "line": "[nervous] Wuh-are my... mom and dad back home yet?"
    },
    {
        "character": "Cartman",
        "line": "No, but they're due home any minute. Come on, you're just in time!"
    },
    {
        "character": "Butters",
        "line": "Hoh boy! Mom and Dad didn't... find out I... left the house, did they?"
    },
    {
        "character": "Cartman",
        "line": "No, I totally covered for you. They completely believed I was you on the phone!"
    },
    {
        "character": "Butters",
        "line": "Hu-oh! Goody!"
    },
    {
        "character": "Cartman",
        "line": "Here you go. [hands Butters some drawings] I drew some pictures with crayons so it looks like you were here all day. And I ate a little food so it looks like you ate, and I fed your cat."
    },
    {
        "character": "Butters",
        "line": "Uh- perfect."
    },
    {
        "character": "Cartman",
        "line": "Alright I'd better get out of here before they get back. [makes his way to the door]"
    },
    {
        "character": "Butters",
        "line": "Uh hey, uh Eric? [Cartman turns around] Uh- thanks for coverin' for me. You're a real pal."
    },
    {
        "character": "Cartman",
        "line": "Butters, it was my pleasure. [pulls out his mittens and opens the door, then puts them on. He heads for the sidewalk humming a late night theme song, then turns around to frame the house with his fingers, then walks away]"
    },
    {
        "character": "",
        "line": "Butters' house, outside. Cartman, still humming, returns with a beach chair, some popcorn, and soda, and sets them up on the front lawn. He then sits down to watch the coming show. Two cars pull up; it's Butters' parents rushing home. They exit their cars and angrily head for the door. They enter..."
    },
    {
        "character": "Butters",
        "line": "Hi, Mom and Dad!"
    },
    {
        "character": "Stephen",
        "line": "Don't you \"Hi, Mom and Dad\" us, you little punk!!! [Punch]"
    },
    {
        "character": "Butters",
        "line": "Ow! Dad?"
    },
    {
        "character": "Linda",
        "line": "You don't even know the trouble you're in, mister!! [Punch]"
    },
    {
        "character": "Butters",
        "line": "Ah! What did I do?! What did I do?!"
    },
    {
        "character": "Stephen",
        "line": "You think you're tough now!!? Answer me!!! [a belt is heard coming off and whipping Butters]"
    },
    {
        "character": "Butters",
        "line": "Aaaa!!! [the beating continues]"
    },
    {
        "character": "Cartman",
        "line": "Aw, man, if I was older, I would totally start jacking off right now."
    }
]