[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Stan's house, night. Stan, Kyle, Cartman and Butters gather some snacks and put them on the coffee table in the Marsh living room."
    },
    {
        "character": "Stan",
        "line": "[pouring chips into a bowl] This is gonna be so awesome!"
    },
    {
        "character": "Kyle",
        "line": "Do we have everything?"
    },
    {
        "character": "Stan",
        "line": "Chips, pop, cookies, Kleenex, toilet paper, flares - we won't have to leave the TV room for anything!"
    },
    {
        "character": "Cartman",
        "line": "All right!"
    },
    {
        "character": "Kyle",
        "line": "Look, it's almost time."
    },
    {
        "character": "",
        "line": "HBC commercial."
    },
    {
        "character": "Announcer",
        "line": "Up next on HBC, the Russell Crowe Show!"
    },
    {
        "character": "",
        "line": "The sofa. The boys climb on it."
    },
    {
        "character": "Stan",
        "line": "Alright, here we go."
    },
    {
        "character": "",
        "line": "Russell Crowe Show intro."
    },
    {
        "character": "Choir",
        "line": "Born in New Zealand in sixty-four\n[Russell sails on a tugboat called \"Tugger\"]\nA hot-headed actor named Russell Crowe\n[Russell holds an Oscar lovingly]\nHe loves to act but he loves one thing more:\n[Russell in a scene from \"Gladiator\"]\nFight-in' Round The World\n[Russell fighting bar patrons at Hap's Bar]\nHe fights his directors and he fights his fans\n[Russell holds a director up in the air by the lapels, then he fights fans in a pool hall]\nIt's a problem no one understands\n[Russell fights people in Paris]\n[spoken by a singer]\nIf there's two things he love it's fighting and,\n[Russell dances Russian before the Kremlin as a camera man follows him at a distance]\nFight-in' Round The World\n[The cameraman takes a picture and Russell beats him up]\nMakin' movies, makin' music and\n[a poster of Russell's new movie, \"A beautiful Mind, by television's Opie\", then a shot of him recording a song]\n[slowing to half-time]\nFight-ing Round The World!\n[a shot of Russell fighting off some Japanese]\n[spoken by a singer as a spinning globe appears behind the show logo]\nRussell Crowe\n\n\n"
    },
    {
        "character": "Russell Crowe",
        "line": "[dressed as a sailor, standing on a dock] Hello, everybody. I'm Russell Crowe, and this is \"Fight-in' Round The World\" [puts up his fists and cycles them around]. We're gonna have lots of fun tuhday as we travel all around, and look for some good- [a man walks through his shot and Russell does a double-take, then goes after the man] Ay! What the hell do yuh think you're doin'?! [Russell's cameraman moves the camera to catch up with him] You walked right through my shot, mate! Do you know who I am?!"
    },
    {
        "character": "Man",
        "line": "Oh, excuse me. I was just- [Russell proceeds to beat the crap out of the man]"
    },
    {
        "character": "Russell Crowe",
        "line": "God-damned smartass! Do you think you could [Shelly comes in and takes the remote, changing the channel. She stops at the WD]"
    },
    {
        "character": "Stan",
        "line": "Shelly, we're watching that! Go back!"
    },
    {
        "character": "Shelly",
        "line": "Shut up, turd. I'm watching Buffy."
    },
    {
        "character": "Stan",
        "line": "[rushes up to her] No! Shelly, we have to watch HBC! [she switches back to HBC]"
    },
    {
        "character": "",
        "line": "Russell Crowe Show."
    },
    {
        "character": "Russell Crowe",
        "line": "Oh! Get up! Get up, you little pussy! [the man crawls along the dock on his belly]"
    },
    {
        "character": "Shelly",
        "line": "The Russell Crowe Show? You turds don't even like that show!"
    },
    {
        "character": "Russell Crowe (off-screen)",
        "line": "Oh ya like that do ya?! [punches heard]"
    },
    {
        "character": "Stan",
        "line": "It's not the show we care about. During one of the commercial breaks of tonight's episode, they're gonna show the exclusive never-before-seen trailer to the new Terrance & Phillip movie!"
    },
    {
        "character": "Kyle",
        "line": "It's the biggest night of the year."
    },
    {
        "character": "Shelly",
        "line": "[switching channels again] That's stupid! See your turdy trailer some other time!"
    },
    {
        "character": "Stan",
        "line": "But all the other kids are gonna watch it and talk about it at school tomorrow."
    },
    {
        "character": "Shelly",
        "line": "No, turds!"
    },
    {
        "character": "Cartman",
        "line": "Shelly, did I ever tell you how hot I think you are?"
    },
    {
        "character": "Shelly",
        "line": "Shut up, fat turd!!"
    },
    {
        "character": "Cartman",
        "line": "I'm not a fat turd, I'm a stocky turd!"
    },
    {
        "character": "Shelly",
        "line": "We're not watching this! [a shot of Russell Crowe and the man]"
    },
    {
        "character": "Russell Crowe",
        "line": "Come on!"
    },
    {
        "character": "Man",
        "line": "Look, I apologize, but I was just--"
    },
    {
        "character": "Stan",
        "line": "But Shelly, it's the Russell Crowe Show! You always said there's nothing you love more than Russell Crowe."
    },
    {
        "character": "Shelly",
        "line": "[softly, voice rising] There is one thing I love more than Russell Crowe, and that is seeing you unhappy. So, Buffy it is!"
    },
    {
        "character": "Stan",
        "line": "Shelly, please, let us watch. We'll do anything. Anything!"
    },
    {
        "character": "Shelly",
        "line": "[glances away, then looks at Stan] All right. I just started my period, and I need tampons. If one of you turds go buy them at the store for me, you can watch your stupid turd show with your stupid turd movie commercial in it!"
    },
    {
        "character": "Stan",
        "line": "[glances down, then answers] O-K, deal."
    },
    {
        "character": "Shelly",
        "line": "And they'd better be here when I come back downstairs, turds! [slaps Stan twice and walks off]"
    },
    {
        "character": "Russell Crowe",
        "line": "Well, that was a lot of fun, wadn't it, kids? But it looks like if we're gonna get in more fights, we're gonna have to go look for 'em."
    },
    {
        "character": "Kyle",
        "line": "[gathers around Stan with the other boys] Dude, why'd you make that deal? If we're out buying tampons, we'll miss the trailer anyway."
    },
    {
        "character": "Butters",
        "line": "Ehyeah!"
    },
    {
        "character": "Stan",
        "line": "[somber] Well, only one of us has to go to the store. The others can watch."
    },
    {
        "character": "Kyle",
        "line": "You'd miss the new trailer?"
    },
    {
        "character": "Stan",
        "line": "Dude, I'm not going."
    },
    {
        "character": "Cartman",
        "line": "Alright, we'll have to play for it. How about... if your name is Butters, you have to go. Okay, so what's your name? [points to Stan]"
    },
    {
        "character": "Stan",
        "line": "Stan."
    },
    {
        "character": "Cartman",
        "line": "Stan, okay. What's your name? [points to Kyle]"
    },
    {
        "character": "Kyle",
        "line": "Kyle."
    },
    {
        "character": "Cartman",
        "line": "Kyle. What's your name? [looks at Butters]"
    },
    {
        "character": "Butters",
        "line": "Butters! Aw, I lose, huh?"
    },
    {
        "character": "Cartman",
        "line": "Aw, yeah, Butters, you lose, sorry, tough break."
    },
    {
        "character": "Kyle",
        "line": "Well just hurry, Butters. You can probably make it back in time before the first commercial break."
    },
    {
        "character": "Butters",
        "line": "Oh, Jesus. Ah, I gotta run like the wind. [heads for the door. The other three go back to the sofa]"
    },
    {
        "character": "Russell Crowe",
        "line": "Seems like no one else here wants to fight."
    },
    {
        "character": "Kyle",
        "line": "Dude, thank God for stupid people [\"...We'll have to go somewhere else...\"]"
    },
    {
        "character": "Cartman",
        "line": "Amen."
    },
    {
        "character": "Russell Crowe",
        "line": "...lets ask our old friend, Tugger. Where should we go fight people next, Tugger?"
    },
    {
        "character": "Tugger",
        "line": "TOOOOOOT"
    },
    {
        "character": "Russell Crowe",
        "line": "Great idea! [runs up to the camera] Tugger thinks we should go to the faaar away country of China. [backs up towards the tug boat] China is one of the oldest civilizations on earth. And from what I understand, they LOVE a good fight! So let's go! [rushes onto the tugboat and sets off.]"
    },
    {
        "character": "Tugger",
        "line": "TOOOT TOOOT [a man and a woman appear]"
    },
    {
        "character": "Man with Mustache",
        "line": "Oh my God! It's Russell Crowe!"
    },
    {
        "character": "Russell Crowe",
        "line": "[taunts back] Oh my God, it's Russell Crowe! Oh my Gmah, bah bah byah byah! [gets out and heads for the man and woman] Why don't you mind your own business, you scrotum?! [punches the man. Cut to a sailing Tugger]Making movies, making songs 'n fight-in' round the world.\n\n"
    },
    {
        "character": "Stan",
        "line": "Dude, why is this guy always beating everybody up?"
    },
    {
        "character": "Russell Crowe",
        "line": "[at the wheel] What a glorious day to spend a way, fight-in' round the world. [whistles and spins the boat's wheel]"
    },
    {
        "character": "Cartman",
        "line": "What's wrong with the colors on your TV, Stan? They're all saturated. [takes a hold of the remote]"
    },
    {
        "character": "Stan",
        "line": "They look fine to me. [another shot of Russell sailing away]"
    },
    {
        "character": "Kyle",
        "line": "Just don't mess with it, Cartman."
    },
    {
        "character": "Cartman",
        "line": "[leaves the sofa] Nah, nah, the cable wire must be loose. [heads for the television]"
    },
    {
        "character": "Kyle",
        "line": "Just just leave it alone."
    },
    {
        "character": "Cartman",
        "line": "Dude, do you wanna see the Terrance & Phillip trailer with messed-up colors? I don't. How's that? [moves the cable, and the vertical goes out of whack]"
    },
    {
        "character": "Stan",
        "line": "That's worse!"
    },
    {
        "character": "Cartman",
        "line": "Okay, how about ... that? [moves it again, and the cathode ray tube pops. The wall behind the TV is blackened, and Cartman slowly peeks]"
    },
    {
        "character": "Stan",
        "line": "Dude!"
    },
    {
        "character": "Kyle",
        "line": "God-dammit Cartman! You broke it!"
    },
    {
        "character": "Cartman",
        "line": "[panicked] It was just... I just... Butters, you asshole!"
    },
    {
        "character": "Stan",
        "line": "Dude, the commercials could start any time!"
    },
    {
        "character": "Cartman",
        "line": "I don't think we're watchin' them on this TV."
    },
    {
        "character": "Kyle",
        "line": "God-dammit! Come on, we can go watch it at my house!"
    },
    {
        "character": "Stan",
        "line": "Get all the stuff! [they gather the snacks and head for the front door. Cartman opens the door and Butters arrives]"
    },
    {
        "character": "Butters",
        "line": "Hey fellas. I got the tampons. Uh, I didn't miss it, did I?"
    },
    {
        "character": "Stan",
        "line": "We're going to Kyle's house to watch! Come on! [the three boys exit]"
    },
    {
        "character": "Butters",
        "line": "Oh Jeez. [follows]"
    },
    {
        "character": "",
        "line": "The neighborhood. The boys run towards Kyle's house. Stan leads the way, with Kyle and Butters following."
    },
    {
        "character": "Butters",
        "line": "Oh boy, uh, Oh Jeez, Oh Jeez!"
    },
    {
        "character": "Stan",
        "line": "Hurry! We can't miss the commercials!"
    },
    {
        "character": "Cartman",
        "line": "[gruffly] Bluh! Aah! You guys! Seriously!"
    },
    {
        "character": "",
        "line": "Kyle's house, moments later. Ike is watching TV."
    },
    {
        "character": "A Voice",
        "line": "[a slow drawl] ...but the Palestinian government uh is not going to see any for future- [the front door opens and the boys run in.]"
    },
    {
        "character": "Stan",
        "line": "Huff, huff"
    },
    {
        "character": "Butters",
        "line": "Huh uh hurry! Hurry! Hurry! [Kyle takes the remore and quickly changes channels, and the Russell Crowe show pops up]"
    },
    {
        "character": "Russell Crowe",
        "line": "And so here we are in history-rich Ch-ooina."
    },
    {
        "character": "Kyle",
        "line": "We made it! It hasn't gone to commercials yet. [the boys sit on the sofa. Ike looks at each of them angrily]"
    },
    {
        "character": "Kyle, Stan, Butters",
        "line": "Phew!"
    },
    {
        "character": "Ike",
        "line": "Hey! Imong telling Dat!"
    },
    {
        "character": "Cartman",
        "line": "[arrives breathless] Huh. Ohmigod! Huh."
    },
    {
        "character": "Ike",
        "line": "Dadadadat!"
    },
    {
        "character": "Kyle",
        "line": "No Ike! They're playing the trailer to the new Terrance & Phillip movie during the show, and we have to watch it! [Ike drops down and walks away, Cartman sits next to Butters]"
    },
    {
        "character": "Russell Crowe",
        "line": "[hiding behind a potted shrub which he carries before him. He sets it down and look at the camera] This is Tiananmen Square. Lots of good foightin' has gone on here throughout the years, including a fan-tastic massacre that took place back in '93. [he turns back to the shrub and peers through it. The Chinese are pleasantly involved in conversations. Russell turns back to the camera] These chinamen can grow to over five feet tall, and in a fight, are known to kick with their legs. Let's see if we can get in for a closer look. [picks up the shrub and goes further into the crowd, then peers through the shrub. The Chinese notice him] Oi! [he looks back at the camera] I've gotten close enough now that they're startin' to get real froigh'ened. You can see the fine hairs on the back of their necks standin' on end. [turns to the shrub and jumps through it, grabbing a man's ankles] Gotcha mate! [the victimized man speaks first, then another man answers. Russell's head turns to see who's speaking, then he jumps up to challenge the second man] Ah, you wanna fight, huh?! [challenges the first] Think you could take me, you little buggers?! [punches the first man and the man sails to the ground a few feet away, knocked out cold. Blood pours from his nose. The man he lands in front of decides to fight, and soon Russell Crowe is punching men away left and right. A policeman arrives, and Russell knocks him away, too]"
    },
    {
        "character": "Cartman",
        "line": "God, when is this gonna get to the commercials? [Gerald arrives with Ike]"
    },
    {
        "character": "Gerald",
        "line": "Kyle, Ike says you kicked him off the TV."
    },
    {
        "character": "Kyle",
        "line": "They're goin' to show the new Terrance & Phillip trailer."
    },
    {
        "character": "Gerald",
        "line": "You know your brother watches MacNeil/Lehrer Report every night at ten!"
    },
    {
        "character": "Ike",
        "line": "Etetheh bunlapala un night."
    },
    {
        "character": "Kyle",
        "line": "But Dad, this is all the never-before-seen footage."
    },
    {
        "character": "Gerald",
        "line": "It doesn't matter! Ten to eleven is Ike's time to watch MacNeil/Lehrer."
    },
    {
        "character": "Kyle",
        "line": "God-dammit. Come on, guys. We gotta go to Butters' house."
    },
    {
        "character": "Stan",
        "line": "Aww! [the boys gather their snacks and head for the door]"
    },
    {
        "character": "Cartman",
        "line": "Argh!"
    },
    {
        "character": "Butters",
        "line": "Whoa, wait fellas. [the boys stop] We can't go to my house."
    },
    {
        "character": "Cartman",
        "line": "We can't go to my house either. It's being fumigated."
    },
    {
        "character": "Stan",
        "line": "AGH! [thinks hard, then] Wait! Chef just got a new plasma screen TV with surround-sound. Let's go to his house! Come on! [they leave. Ike goes back to the sofa and sits, changing the channel]"
    },
    {
        "character": "Lehrer",
        "line": "...taking place there all these years is sure to continue until the governments of these regions can actually come about some..."
    },
    {
        "character": "Ike",
        "line": "It's a birdy fly."
    },
    {
        "character": "",
        "line": "The neighborhood. The boys run towards Chef's house. Stan, Kyle, and Butters run past, huffing and puffing."
    },
    {
        "character": "Cartman",
        "line": "[trailing again] Ey! You guys! I'm seriouslih!"
    },
    {
        "character": "",
        "line": "Chef's house, moments later. The boys are at his front door, and Stan knocks."
    },
    {
        "character": "Kyle",
        "line": "God-dammit! If we miss the commercials, I'll never forgive my brother!"
    },
    {
        "character": "Chef",
        "line": "[answers the door in his nightgown] Oh. Hello there, children."
    },
    {
        "character": "The Boys",
        "line": "[quickly] Hey Chef. [run for his sofa, leaving Chef at the door.]"
    },
    {
        "character": "Chef",
        "line": "Uh, how's it goin'?"
    },
    {
        "character": "",
        "line": "Chef's living room. The boys are seated on the sofa, with Stan trying to get the remote control working."
    },
    {
        "character": "Chef",
        "line": "[arrives] Oh, you wanted to see the new TV, huh? [a new HDTV with side speakers and settop cable box, and a rather large base] Pretty cool, ain't it?"
    },
    {
        "character": "Stan",
        "line": "[impatient] Yeahyeah, how do you change the channels?"
    },
    {
        "character": "Chef",
        "line": "Uh, I don't know. This TV has more features than a space shuttle. [Chef takes the remote and fiddles with it] I can't figure it out at all. [the program pops up immediately]"
    },
    {
        "character": "Russell Crowe",
        "line": "[in India] -bloomin' Taj Mahal."
    },
    {
        "character": "Cartman",
        "line": "There, you got it, you got it!"
    },
    {
        "character": "Russell Crowe",
        "line": "[punching the natives - hits one] Freakin' Indies [hits a second] really put up a [hits a third] fight!"
    },
    {
        "character": "Stan",
        "line": "We made it!"
    },
    {
        "character": "Cartman",
        "line": "Oh, thank God."
    },
    {
        "character": "Chef",
        "line": "Russell Crowe?? Children, you shouldn't be watching this show about a man who beats people up because he's insecure."
    },
    {
        "character": "Cartman",
        "line": "We don't give two craps about Russell Crowe, Chef. We just wanna see the trailer for the new Terrance & Phillip movie, that's supposed to play during the commercials."
    },
    {
        "character": "Russell Crowe",
        "line": "[still punching Indians as they approach] Alright everyone, we're gonna take our first commercial break. But be sure not to go anywhere, because there's lot's more people to beat up!"
    },
    {
        "character": "Stan",
        "line": "Here they come!"
    },
    {
        "character": "Kyle",
        "line": "Heuh, the commercials! [some commercials air, but they're not important, as little sound is heard]"
    },
    {
        "character": "Announcer",
        "line": "And now back to Russell Crowe, Fightin' Around The World!"
    },
    {
        "character": "The boys",
        "line": "[disappointed] Awww!"
    },
    {
        "character": "Butters",
        "line": "Awww, they didn't play it. They didn't show the Terrance & Phillip trailer."
    },
    {
        "character": "Stan",
        "line": "I knew it. I knew they wouldn't play it during the first commercial break."
    },
    {
        "character": "Kyle",
        "line": "Yeah, they want everyone to stick around and watch more of this retarded show."
    },
    {
        "character": "Russell Crowe",
        "line": "Making movies, making songs 'n fight-in' round the world. [cut to Brooklyn, with the Brooklyn Bridge in the background. A lot of brownstones here. Russell has brought his schrub with him again. He approaches the camera] Oi! Now Tugger's brought me to one of the greatest places for foightin' in North America. [backs up] Brooklyn, New York. Lots of minorities here, and they don't take kindly to whitey. [points to himself] Let's get a closer look. Come on, Tugger! [picks up his shrub and runs. Tugger hops after him, tooting along. They end up looking at a pickup basketball game in the shadow of some skyscrapers. Russell peers through the shrub, then turns to the camera] Looks like we got some black people, and some Puerto Ricans. [a quick peek] Notice the colorful rags on their heads, meaning they could be part of a gang, and therefore, [makes a fist] real used to fightin'. [peers through the shrub]"
    },
    {
        "character": "Black player",
        "line": "Hey, look at that guy over there. Ain't that that Gladiator guy?"
    },
    {
        "character": "Puerto Rican player",
        "line": "Where?"
    },
    {
        "character": "Black player",
        "line": "Behind that plant, next to that tugboat? [Russell peers through, but the shows his face]"
    },
    {
        "character": "Puerto Rican player",
        "line": "Oh yeah, I think it is."
    },
    {
        "character": "Russell Crowe",
        "line": "[in condescending falsetto] Oh my God, it's the Gladiator guy! [heads for the basketball court and puts up his fists] Oh my God, I've never seen an actor before! [moves around for anyone to fight] Why don't you choke on some pig vomit, you stupid sobs!"
    },
    {
        "character": "Chef",
        "line": "Why can't this guy control his temper?"
    },
    {
        "character": "Russell Crowe",
        "line": "Well?? You all just gonna stand there or are you gonna fight? [knocks down a black player. Another one punches him in the back of the head] Oi! Crikey, you've done it now!"
    },
    {
        "character": "Cartman",
        "line": "This TV is great, Chef."
    },
    {
        "character": "Chef",
        "line": "Yeah, and it's got all kinds of cool features, too. Check this out. You can watch three channels all at once. I think if you hit this button here- [a menu pops up on a blue screen. He presses more buttons and the default choice changes, but nothing else] No, no wait. You hit this button here [ends up at clock reset function] No, that's not it. Let's see. [presses another button] Menu... [press] Function [screen properties pop up]"
    },
    {
        "character": "Stan",
        "line": "Dude, put it back, Chef. More commercials might come on soon. [looks like Russell is fighting Germans, but the menu windows block the view]"
    },
    {
        "character": "Chef",
        "line": "Let's see. Menu? [screen resolution, manual programming, spectrum density, profiles, audio settings, and so on pop up] Aw, dammit!"
    },
    {
        "character": "Kyle",
        "line": "Get it back to normal, Chef!"
    },
    {
        "character": "Chef",
        "line": "I'm tryin', children! Menu, back, function- [still no success. The blue screen is still there] Enter? No, no. Back? H.E.M?? [selects 'yes']"
    },
    {
        "character": "The TV",
        "line": "[transforms itself into a robot] Human eradication mode, active. [it rises from its base, which becomes its feet. The side speakers re-position themselves as guns, and the cable box becomes the eyes. Chef and the boys are stunned by what they just saw. The TV turns to its right and heads for the front door. It breaks through, goes down the steps, and immediately starts firing at everything in sight.]"
    },
    {
        "character": "Stan",
        "line": "Oh God-dammit!"
    },
    {
        "character": "Kyle",
        "line": "The TV left."
    },
    {
        "character": "Butters",
        "line": "Uh but the next commercials will be on soon."
    },
    {
        "character": "Stan",
        "line": "Come on, we gotta go somewhere else! [the four get off the sofa and head out the door. A car screeches to a halt, and the TV fires at the driver, forcing the couple inside to flee]"
    },
    {
        "character": "",
        "line": "The neighborhood. The boys run towards the bar. Stan, Kyle, and Butters run past, huffing and puffing."
    },
    {
        "character": "Butters",
        "line": "Where do we go? Where do we go?"
    },
    {
        "character": "Stan",
        "line": "The bar! They've got a TV at the bar!"
    },
    {
        "character": "Cartman",
        "line": "Aagh! God-dammit!"
    },
    {
        "character": "",
        "line": "The bar. The boys burst through the door and head for the counter. The TV turns on to the Russell Crowe show."
    },
    {
        "character": "Russell Crowe",
        "line": "[back in Brooklyn, amid the bunch of beat-up basketball players] You fight like Norwegians, ya fairies!"
    },
    {
        "character": "The Boys",
        "line": "Phew!"
    },
    {
        "character": "Stan",
        "line": "We made it."
    },
    {
        "character": "Cartman",
        "line": "[blubbering] This is killing me. The human body was not meant to move quickly like that."
    },
    {
        "character": "",
        "line": "The Russell Crowe show."
    },
    {
        "character": "Russell Crowe",
        "line": "These are the Florida Keys, a remote island chain just a few miles from... Oi! Wait a minute! Wasn't I just in Brooklyn fightin' minorities? What happened with that?"
    },
    {
        "character": "Tugger",
        "line": "Mooooot."
    },
    {
        "character": "Russell Crowe",
        "line": "It's that God-damned editor! He cut the Brooklyn scene short! Tugger, I'm gonna get him!"
    },
    {
        "character": "",
        "line": "The editing room, moments later."
    },
    {
        "character": "Editor",
        "line": "Yeah. Oh I'm just working. I'm probably done around seven. [the door flies open and Russell stomps in there]"
    },
    {
        "character": "Russell Crowe",
        "line": "[lifts the editor up by the collar] Who the hell do you think you are?!"
    },
    {
        "character": "Editor",
        "line": "I'm the editor."
    },
    {
        "character": "Russell Crowe",
        "line": "I know you're the bloomin' editor! I mean, who do you think you are cuttin' one of my foightin' scenes short?!"
    },
    {
        "character": "Editor",
        "line": "Dude, the director said to cut it."
    },
    {
        "character": "Russell Crowe",
        "line": "Moy foightin' is poetry! You don't edit Russell Crowe's poetry, you testicle! [drops him, pauses, then delivers three blows to the belly]"
    },
    {
        "character": "Jimbo",
        "line": "Well that guy's just plain nuts."
    },
    {
        "character": "Barkeep",
        "line": "[rushes over] Hey hey hey, whoa, you kids can't be in here. [the kids are dumbstruck]"
    },
    {
        "character": "Kyle",
        "line": "We're not kids. We're full-grown men with dwarfism! How dare you assume that all midgets are children! We demand an apology!"
    },
    {
        "character": "Barkeep",
        "line": "You ain't midgets, your lips are too full. [the boys stay silent] Now GET OUT!!"
    },
    {
        "character": "Stan",
        "line": "But we have to watch the commercials in this show."
    },
    {
        "character": "Barkeep",
        "line": "Look, this is a bar! We can't have children in here. People come here for debauchery and sin!"
    },
    {
        "character": "Cartman",
        "line": "Butters will give hand jobs in the corner for a dollar."
    },
    {
        "character": "Butters",
        "line": "Sure! I'm good at all kinds of jobs!"
    },
    {
        "character": "Barkeep",
        "line": "GET OUT!!! [walks over and turns the TV to a baseball game]"
    },
    {
        "character": "The Boys",
        "line": "Aaah!"
    },
    {
        "character": "Stan",
        "line": "[the first to head for the door] Come on, we gotta get to a TV! [the others follow]"
    },
    {
        "character": "Cartman",
        "line": "Oh, you've gotta be kidding me!"
    },
    {
        "character": "",
        "line": "Downtown South Park. The TV, now a robot, marches through town blasting holes into buildings. Chef follows behind on a cell phone."
    },
    {
        "character": "Chef",
        "line": "Yes, is this customer service? I'm havin' problems with my new television. It sprouted legs and guns 'n started walkin' around shootin' people. Uh huh. Okay. Ohhh, so I press \"menu,\" then \"function.\" [presses the buttons. The TV shoots at a man locking up a store, making him spill his groceries and fall on his back. The TV stops]"
    },
    {
        "character": "Townsman",
        "line": "Jesus! [gets up and runs] Waaaah! [the TV moves forward again]"
    },
    {
        "character": "Chef",
        "line": "No, that didn't work. Did I set the internal clock? Uh, no. [listens] Oh, really? Well, how do I do that?"
    },
    {
        "character": "",
        "line": "Shady Acres, A Retirement Community. The boys rush in and head for the empty seats in the TV room."
    },
    {
        "character": "Cartman",
        "line": "Find the remote! Find the remote! Hold it! [once the boys are in place, Stan walks over to the TV and turns it on. \"Puppies From Around The World\" comes on, and Stan quickly changes the channel to the Russell Crowe show]"
    },
    {
        "character": "Kyle",
        "line": "We're not too late! [the boys grin]"
    },
    {
        "character": "Russell Crowe",
        "line": "Come on, Tugger ol' mate. Why are you lookin' so down?"
    },
    {
        "character": "Tugger",
        "line": "Mooot, mooot."
    },
    {
        "character": "Russell Crowe",
        "line": "[whispers to the camera] Tugger's in a bit of a sad state. Seems his girlfriend and him had a bit of a row last night."
    },
    {
        "character": "Tugger",
        "line": "Mooooot."
    },
    {
        "character": "Old Man",
        "line": "[everyone watches silently, then] ...What is this?"
    },
    {
        "character": "",
        "line": "The Russell Crowe show."
    },
    {
        "character": "Russell Crowe",
        "line": "Come on. Cheer up, Tugger. How can I make you feel better? I know! [grabs a guitar off-screen and prepares to play it.] How would you like me to sing one of the songs off me new album?"
    },
    {
        "character": "Tugger",
        "line": "[shakes its smokestack with each protest] Nooo! Nooooo!"
    },
    {
        "character": "Russell Crowe",
        "line": "What's that, Tugger? You say you really love the songs on my album?"
    },
    {
        "character": "Tugger",
        "line": "Noooooooooo! [shakes its smokestack]"
    },
    {
        "character": "Russell Crowe",
        "line": "Alright then, Tugger. [begins strumming]"
    },
    {
        "character": "Tugger",
        "line": "Noo, no! [shakes its smokestack]"
    },
    {
        "character": "Russell Crowe",
        "line": "You know that you're my baby. You know I need you now."
    },
    {
        "character": "Tugger",
        "line": "[tries to escape, but can't, as it's tied to the dock] Noooooooooo! [shakes its smokestack]"
    },
    {
        "character": "Russell Crowe",
        "line": "I don't know where I'm goin', I gotta get there some, yeah gotta get there, somehow."
    },
    {
        "character": "Tugger",
        "line": "[returns and tries to rip itself away towards the right with all its might] Noooooooooo! [turns and tries to pull itself away towards the left, but can't]"
    },
    {
        "character": "Russell Crowe",
        "line": "Gotta get there somehow."
    },
    {
        "character": "Tugger",
        "line": "[continues to struggle] Noooooooooo! [turns and tries to pull itself away towards the left, but can't]"
    },
    {
        "character": "Russell Crowe",
        "line": "You can stay away tonight, but I'm gonna sleep here, in my explosive clouds..."
    },
    {
        "character": "Tugger",
        "line": "[returns, then takes out its arms for the first time] NOOOOO! [pulls out some giant earmuffs and places them over the cabin doors. It shakes violently as Russell lunges into a faster rhythm]"
    },
    {
        "character": "Russell Crowe",
        "line": "SHOUT! Think I feel your heartbeat, can you feel mine... lady lookin' lovely, gotta take your love inside, gotta take it..."
    },
    {
        "character": "Tugger",
        "line": "[struggles fiercely] NOOOOO! NOOOOO! [throws its earmuffs off, reaches for a pistol and places it against its smokestack. Tugger fires the gun, and it falls into the water with a splash. Russell stops singing once he hears the gunshot..]"
    },
    {
        "character": "Russell Crowe",
        "line": "[spins around] Tugger! [drops to the edge of the dock and looks down at the water. Tugger is on its side leaking oil] Tugger shot himself!"
    },
    {
        "character": "Announcer",
        "line": "[the show logo pops up] Has Russell lost Tugger for good? Find out after these messages."
    },
    {
        "character": "",
        "line": "Shady Acres TV room."
    },
    {
        "character": "Cartman",
        "line": "Here we go!"
    },
    {
        "character": "Stan",
        "line": "Commercial Break Number Two! [the boys are positively giddy with anticipation]"
    },
    {
        "character": "Announcer",
        "line": "And now back to Russell Crowe, Fightin' Around The World!"
    },
    {
        "character": "Cartman",
        "line": "That's it? That's all the commercials?"
    },
    {
        "character": "Kyle",
        "line": "They didn't play the Terrance & Phillip trailer again!"
    },
    {
        "character": "Stan",
        "line": "I knew it. They're waiting until the very last commercial break."
    },
    {
        "character": "Kyle",
        "line": "Ugh! We're gonna end up watching this whole retarded Russell Crowe show!"
    },
    {
        "character": "",
        "line": "The Russell Crowe show. Russell Crowe is sobbing on a sofa in a hospital hallway."
    },
    {
        "character": "Russell Crowe",
        "line": "Tugger! Why'd you do it, Tugger?! [a doctor approaches him] Doctor! Tell me how he is, doctor!"
    },
    {
        "character": "Doctor",
        "line": "Well, he's a very sick little tugboat."
    },
    {
        "character": "",
        "line": "Shady Acres TV room."
    },
    {
        "character": "Old man",
        "line": "What is this? We wanna watch \"Puppies From Around The World.\""
    },
    {
        "character": "Old woman",
        "line": "Yeah. We don't like this show."
    },
    {
        "character": "Cartman",
        "line": "Shh. Okay?! Old people need to be quiet right now!"
    },
    {
        "character": "",
        "line": "The Russell Crowe show."
    },
    {
        "character": "Russell Crowe",
        "line": "You gotta save him, Doc! Tugger! 'E's my best friend! The only friend in the world who would-"
    },
    {
        "character": "Doctor",
        "line": "He's going to live, but-"
    },
    {
        "character": "Russell Crowe",
        "line": "[lifts the doctor up by the collar] Oi! Don't you interrupt me, you vag-oina! I was givin' a heart-wrenchin' soliloquy about me feelings for Tugger!"
    },
    {
        "character": "Doctor",
        "line": "Sorry."
    },
    {
        "character": "Russell Crowe",
        "line": "[lets the doctor down and crosses the hall to the opposite wall] Oh, Tugger! Tugger, the world won't be as bright without ya, mate! Give it to me straight, doctor! Will Tugger live?! Tell me the truth!"
    },
    {
        "character": "Doctor",
        "line": "...Now?"
    },
    {
        "character": "Russell Crowe",
        "line": "Yes, now's fine."
    },
    {
        "character": "Doctor",
        "line": "Oh. Uh, your tugboat's going to be okay. He just needs an oil change and a new steamstack."
    },
    {
        "character": "Russell Crowe",
        "line": "[quickly brightens and approaches the camera] Ooo, de-lolly! D'you hear that, everybody?! Tugger's gonna be okay! D'you know what that makes me feel like doin'? Foightin'! [turns around and punches the doctor out, then punches a man on crutches out, lifts him up again, and punches him out again.]"
    },
    {
        "character": "",
        "line": "Shady Acres TV room."
    },
    {
        "character": "Old man",
        "line": "This show is too violent! Put the puppies back on!"
    },
    {
        "character": "Old folks",
        "line": "Yeah!"
    },
    {
        "character": "Old woman 2",
        "line": "Please."
    },
    {
        "character": "Cartman",
        "line": "Shut up! Shut the hell up! We're watching this until the next commercial and that's final, old people!"
    },
    {
        "character": "Old man 2",
        "line": "All right, that does it! We know how to get our way! Everyone, on the count of three, release your bowels! One! Two! [everyone farts and the boys are astonished.]"
    },
    {
        "character": "The boys",
        "line": "[bury their noses in their jackets] Awww!"
    },
    {
        "character": "Cartman",
        "line": "Eewww!"
    },
    {
        "character": "Stan",
        "line": "Oh, God, it's horrible! [the boys leave and exit the community]"
    },
    {
        "character": "",
        "line": "Shady Acres entrance."
    },
    {
        "character": "Kyle",
        "line": "That's disgusting, dude!"
    },
    {
        "character": "Cartman",
        "line": "God, I hate old people!"
    },
    {
        "character": "Stan",
        "line": "We have to go to Butters' or Cartman's house! We have nowhere else to go!"
    },
    {
        "character": "Butters",
        "line": "I told you, we can't go to my house!"
    },
    {
        "character": "Cartman",
        "line": "And my house is being fumigated!"
    },
    {
        "character": "Stan",
        "line": "Well, screw it! We'll watch it in your house even if it is being fumigated!"
    },
    {
        "character": "",
        "line": "The neighborhood. The boys rush to Cartman's house."
    },
    {
        "character": "Butters",
        "line": "Oh boy, we gotta hurry, guys! ...Come on! [Cartman struggles to keep up, blubbering all the while]"
    },
    {
        "character": "",
        "line": "Cartman's house and garage, under purple and orange tarps. The boys enter a living room filled with fumigation gas, which makes the room look foggy."
    },
    {
        "character": "Stan",
        "line": "Turn it on! Turn it on!"
    },
    {
        "character": "",
        "line": "The Russell Crowe show."
    },
    {
        "character": "Russell Crowe",
        "line": "Crikey! Ol' Tugger looks healthy, happy, and [does a catcall] fit as a whistle!"
    },
    {
        "character": "",
        "line": "Cartman's living room."
    },
    {
        "character": "Kyle",
        "line": "It's okay, it's still the show."
    },
    {
        "character": "",
        "line": "The Russell Crowe show."
    },
    {
        "character": "Russell Crowe",
        "line": "But you know, Tugger's attempted suicide made me realize that I should take up a cause. Most great actors take up causes, and I'm the greatest of 'em all! So, from now on I'm gonna spend all my spare time ...fighting cancer. [gets into a fighting stance] Right! Where is that pussy cancer anyway?!"
    },
    {
        "character": "",
        "line": "Cartman's living room. the gas is overwhelming them, and they look ready to pass out."
    },
    {
        "character": "Kyle",
        "line": "Oh, dude, I don't know how long I can take it."
    },
    {
        "character": "Stan",
        "line": "Me neither. I'll be dead before the commercials. Wait a minute! I forgot there's a black and white television back at my house!"
    },
    {
        "character": "Kyle",
        "line": "Will your sister let us watch it?"
    },
    {
        "character": "Stan",
        "line": "She has to! [leads the boys out of Cartman's house]"
    },
    {
        "character": "",
        "line": "The neighborhood. The boys rush back to Stan's house."
    },
    {
        "character": "Stan",
        "line": "Hurry! The commercials will be on any minute!"
    },
    {
        "character": "Butters",
        "line": "Aw! Oh man! Uh, uh uh uh..."
    },
    {
        "character": "Cartman",
        "line": "[trailing the other three] Oh my god, eugh! Oh God! Oh, Jesus help me! [stops] Oh! I lost a doughnut! [turns around and heads back] Oooh! Oh oh! [stops] Oh my God! [turns around and tries to catch up with the others] Leave no doughnut behind!"
    },
    {
        "character": "",
        "line": "Stan's house. The boys reach the front door."
    },
    {
        "character": "Butters",
        "line": "Oh Jesus! Wait."
    },
    {
        "character": "Stan",
        "line": "What?"
    },
    {
        "character": "Butters",
        "line": "I never gave Shelly her tampons. She's been this whole time without them. [the boys are scared now. Slowly, Stan reaches up for the knob and turns it. The door flies open and a torrent of blood gushes through the door, flooding the boys back into the street.]"
    },
    {
        "character": "The boys",
        "line": "AAAAAAAaaaaaaaahhhhh. [Kyle shakes the blood off, Stan looks up and then at the front door, Butters sits up. A trail of blood is left from the interior of the house to the street, and Shelly looks out from her window]"
    },
    {
        "character": "Shelly",
        "line": "I told you I needed tampons, tuurrddsss!"
    },
    {
        "character": "Kyle",
        "line": "Look! Crack addicts with a television! [two men and a woman are shown watching a small TV on a box near some buildings. The boys walk up to them and watch the TV as well]"
    },
    {
        "character": "",
        "line": "The Russell Crowe show. Russell is in a hospital room with Tugger."
    },
    {
        "character": "Russell Crowe",
        "line": "Well, we couldn't find cancer, but we found a man with cancer. [he walks off and pulls in an old frail man with cancer, then delivers a blow] Take that, cancer! And that! [punches the old man again]"
    },
    {
        "character": "Tugger",
        "line": "Mooot Mooot! [Russell punches the old man behind the head and sends him to the floor]"
    },
    {
        "character": "Stan",
        "line": "The last commercial break has to be coming any second! [two phaser blasts are seen. One kills the bearded crack addict, another knocks a trash can over. Chef's TV appears and the two remaining addicts and the boys scream]"
    },
    {
        "character": "All",
        "line": "AAAAA! [quickly move away. Chef's TV delivers a double blast to the small TV and destroys it, then moves off to its left.]"
    },
    {
        "character": "Chef",
        "line": "[still following the TV and talking to customer service] ...Yes, I pressed \"menu\" three times! [listens] No! It's givin' me the same error message! [listens] Yes I read the instruction manual!"
    },
    {
        "character": "",
        "line": "Luau's Toys, moments later. The boys run by."
    },
    {
        "character": "The boys",
        "line": "[stopping] Where do we go?!"
    },
    {
        "character": "Kyle",
        "line": "Oh Jesus! Now where do we go??"
    },
    {
        "character": "Stan",
        "line": "We've tried everywhere! Butters, are you absolutely sure we can't go to your house??"
    },
    {
        "character": "Butters",
        "line": "I'm sure! There's no way!"
    },
    {
        "character": "Kyle",
        "line": "Well why not?!"
    },
    {
        "character": "Butters",
        "line": "Uh because! Uh my parents are out of town, and I don't have a babysitter."
    },
    {
        "character": "Cartman",
        "line": "[glares at Butters and slowly gets angry] Oh, God-dammit you better be kidding!"
    },
    {
        "character": "Butters",
        "line": "No! I really don't have a babysitter. That's why I'm stayin' at Stan's."
    },
    {
        "character": "Kyle",
        "line": "This whole time your TV is in a house with nobody in it?!"
    },
    {
        "character": "Stan",
        "line": "Come on, let's just go! We'll kill Butters later! [they run off]"
    },
    {
        "character": "",
        "line": "Butters' house, minutes later. The boys burst through the front door."
    },
    {
        "character": "The boys",
        "line": "AAAAA!!"
    },
    {
        "character": "Cartman",
        "line": "The time has come! Turn it on, turn it on! [Stan is the first to reach the remote control, so he takes it and turn on the TV]"
    },
    {
        "character": "",
        "line": "The Russell Crowe show."
    },
    {
        "character": "Russell Crowe",
        "line": "And so we'll be right back, after these commercials."
    },
    {
        "character": "Stan",
        "line": "We made it! [grins]"
    },
    {
        "character": "Kyle",
        "line": "The last commercial break is starting!"
    },
    {
        "character": "Announcer",
        "line": "[the show logo appears] Don't go anywhere. Russell Crowe will be right back after a few more commercials. [the grins slowly fade to disappointment]"
    },
    {
        "character": "Cartman",
        "line": "These commercials are all so God-damn stupid!"
    },
    {
        "character": "Stan",
        "line": "Jesus Christ, how long is this commercial break gonna be??"
    },
    {
        "character": "Kyle",
        "line": "What if they don't show the Terrance & Phillip trailer at all? What if we went through all of this for nothing?"
    },
    {
        "character": "Butters",
        "line": "They have to show it! They promised they would!"
    },
    {
        "character": "Cartman",
        "line": "You guys, calm down. This is what TV shows always do. They make the last commercial break the longest."
    },
    {
        "character": "Kyle",
        "line": "That's bull-crap! TV shows are gay!"
    },
    {
        "character": "Stan",
        "line": "Wait a minute! Look! [points and reads from the TV] \"The following preview has...\" This is it! This is it!"
    },
    {
        "character": "",
        "line": "The Terrance & Phillip trailer."
    },
    {
        "character": "Announcer",
        "line": "[Terrance & Phillip stand back to back. The camera starts with their legs and pans up] Coming this summer! The greatest Canadian duo of all time is back."
    },
    {
        "character": "",
        "line": "Action music plays as the following words come flying at the viewer from the TV screen: \"THIS........ SUMMER........ TERRANCE........ AND........ PHILLIP........ WILL........ BLOW........ YOU........ AWAY........ AND....... WORDS...... WILL..... FLY.... AT... YOU.. VERY. FAST\" The music stops and Terrance & Phillip appear dressed as cowboys. Terrance farts, Phillip laughs, then \"ASSES OF FIRE\" appears with flames behind the words, then a large \"2\" lands next to the E in FIRE. It is set to come out June 21, 2002. It is rated R. It ends, and the boys take time to absorb it all."
    },
    {
        "character": "Cartman",
        "line": "[tosses his popcorn into the air] Woohoo!!! [the popcorn showers all the boys as they begin to move around happily]"
    },
    {
        "character": "Stan, Kyle, Butters",
        "line": "Yeeeeesss! [begins dancing]"
    },
    {
        "character": "Stan",
        "line": "That looks AWEsome! [Cartman goes to the phone and starting dialing a number]"
    },
    {
        "character": "Kyle",
        "line": "They were wearing cowboy hats! [to Stan] Did you see?? [to Butters] Did you see?? [Butters stops dancing]"
    },
    {
        "character": "Cartman",
        "line": "[on the phone] Clyde, Clyde? Did you see it? [Stan jumps up on the sofa alongside Cartman] Yeah, we- Whoa, we think it's gonna be good, too."
    },
    {
        "character": "Butters",
        "line": "Oh, I'm so glad we didn't miss it! [picks up some popcorn and toses it up into the air]"
    },
    {
        "character": "Cartman",
        "line": "You guys, Clyde said he taped it and kids can come over now to see."
    },
    {
        "character": "Stan",
        "line": "Oh, dude, let's go!"
    },
    {
        "character": "Butters",
        "line": "Yeah. [the kids head for the front door]"
    },
    {
        "character": "Kyle",
        "line": "It looks even better than their first movie, huh?"
    },
    {
        "character": "Cartman",
        "line": "Yeah, it sure does!"
    },
    {
        "character": "Stan",
        "line": "I wonder if it's all a western?"
    },
    {
        "character": "Butters",
        "line": "How far away is June?"
    },
    {
        "character": "",
        "line": "The Russell Crowe show, sunset. The sun is about to drop over the horizon behind Russell and Tugger."
    },
    {
        "character": "Russell Crowe",
        "line": "Well, we sure had a good time today, didn't we, kids? We fought some Chinamen, a few peckers, and a lot of Colombians, to name just a few. But I sure am glad we got ol' Wally B. back. Aren't you? [a wallaby hops into view]"
    },
    {
        "character": "Wally B.",
        "line": "I'm glad to be back, Russey! [a woman and girl walk by, but stop and look]"
    },
    {
        "character": "A girl",
        "line": "Oh my God, it's Russell Crowe!"
    },
    {
        "character": "Russell Crowe",
        "line": "[in the condescending falsetto] Oh my God it's Russell Crowe! Oh my bluh blah bluh!! [gets into his fighting stance] Why don't you go flush yourself down a toilet, you cu- [the girl's mother picks her up and hurries away]"
    },
    {
        "character": "Tugger",
        "line": "Mooo-oooo."
    },
    {
        "character": "Russell Crowe",
        "line": "[puts his hand to his ear and gasps] Uh-oh, Tugger's whistle. You know what that means!\n[the wallaby hops to the boat as Russell backs away from the camera. He begins to sing as Wally B. turns around...]\nTugger's whistle's blowin'\nMeans we must be goin'\nNo more Russell Crowein' for you.\n[does some boxing moves and then hops into the boat]\nBut now don't you start to whine\nI'll see ya again next time.\n'Cause there's plenty a-more a-fightin' left to do.\n[Wally B. hops closer, and finally into Russell's arms. Next shot, a departing Tugger, headed for the sunset. Russell appears and sings the signature line, slowing with every word]\nMakin' movies, makin' songs, an' fightin' round the world.\nSee you next time, everybody!\n[waves to the camera]\n\n\n"
    },
    {
        "character": "",
        "line": "South Park, night. Chef's TV is still walking around, but this time away from town. It's showing the Russell Crowe show. Chef is still trying to shut it down."
    },
    {
        "character": "Chef",
        "line": "So I'm supposed to press \"menu,\" then \"function,\" then \"enter.\""
    }
]