[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Marsh residence, night. Stan, Kyle, and Cartman stand in the living room in costume."
    },
    {
        "character": "Stan",
        "line": "O Great Wizard of Gregendath. What quest do you ask of this Ranger and Paladin?"
    },
    {
        "character": "Cartman",
        "line": "Only one thing can save our kingdom. You must bring me: a piece of pecan pie with toffee ice cream and magic shell. Hurry now!"
    },
    {
        "character": "Kyle",
        "line": "That quest sucks, Cartman! Think of another one!"
    },
    {
        "character": "Randy",
        "line": "[entering] Uh, boys, [the boys look up] Butters' parents want to borrow The Lord of the Rings video we rented. Could you take it over to them?"
    },
    {
        "character": "Stan",
        "line": "You're sending us on... a quest? You ask of us to take the one video to the House of Butters?"
    },
    {
        "character": "Randy",
        "line": "Yeah, whatever."
    },
    {
        "character": "Cartman",
        "line": "It shall be a long journey with many dangers on the way."
    },
    {
        "character": "Kyle",
        "line": "But if the tape must be brought to the House of Butters, who else can do it?"
    },
    {
        "character": "Stan",
        "line": "[reaches out and receives the tape] Very well, we shall embark on this quest immediately, father! Come, warriors!"
    },
    {
        "character": "Stan, Kyle, Cartman",
        "line": "Ho! [they head out the front door. Randy moves away from the stairs and towards Sharon on the sofa]"
    },
    {
        "character": "Randy",
        "line": "[snuggles up to her] Hmmm, that gets rid of them."
    },
    {
        "character": "Sharon",
        "line": "Oooh, you're a little frisky, aren't you?"
    },
    {
        "character": "Randy",
        "line": "Yeah, well uh, The Lord of the Rings wasn't the only thing I rented from the video store. [holds up a VHS case] I also rented... a porno."
    },
    {
        "character": "Sharon",
        "line": "Oho, you little devil."
    },
    {
        "character": "Randy",
        "line": "[softly, sensually] You wanna go watch?"
    },
    {
        "character": "",
        "line": "Neighborhood streets. The boys are well into their quest."
    },
    {
        "character": "Stan",
        "line": "How shall we journey to the house of Butters? Through the mines of Endor or over the mountains of Grog?"
    },
    {
        "character": "Kyle",
        "line": "[notices something and gasps] Look out! Here comes the great dragon of Perengraph!"
    },
    {
        "character": "Cartman",
        "line": "Don't worry! I am the great wizard Motortart. I can shield us from the dragon's fire. [a car passes by and Cartman fires away at it with his staff]"
    },
    {
        "character": "Stan",
        "line": "Good job, wizard."
    },
    {
        "character": "Cartman",
        "line": "And so the party journeyed onward: the great Wizard, the skillful Ranger, and the covetous Jew."
    },
    {
        "character": "Kyle",
        "line": "I'm a Paladin, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Jews can't be Paladins."
    },
    {
        "character": "",
        "line": "Marsh residence; bedroom. Randy waxes his eyebrows with saliva getting ready for a night of porno. Sharon appears in a ruby lingerie, leans suggestively against the doorway of the master bathroom and runs her finger along the bedroom wall. Randy takes the porno to the TV."
    },
    {
        "character": "Sharon",
        "line": "Hey there, cowboy."
    },
    {
        "character": "Randy",
        "line": "[holds up the video and turns to Sharon] You ready for some hot, steamy fun?"
    },
    {
        "character": "Sharon",
        "line": "[smiling, right index finger against her chin] You bet I am."
    },
    {
        "character": "Randy",
        "line": "The guys at the office told me I had to rent this porno. They said, \"this is without a doubt the hottest porno ever made.\" [puts the video into the player]"
    },
    {
        "character": "Sharon",
        "line": "[now reclining on the bed, running her finger along the bedsheets] Mmm, sounds good."
    },
    {
        "character": "Randy",
        "line": "I love that lingerie. [opens his nightgown to reveal a purple cod piece, then in a low voice] Yeah. You like that?"
    },
    {
        "character": "Sharon",
        "line": "Mm, yeah baby."
    },
    {
        "character": "Randy",
        "line": "Yeeaahhh. [reclines on the bed, facing her and holding the remote control] Alright, you ready?"
    },
    {
        "character": "Sharon",
        "line": "Ready."
    },
    {
        "character": "Randy",
        "line": "Oh, yeah. [they turn to the TV. Randy starts the video]"
    },
    {
        "character": "Narrator",
        "line": "[the video begins. Randy massages Sharon's arm] The story begins in ages past, in the deep regions of Middle-earth, where Scorn first thrived in the kingdom of Gelgelar."
    },
    {
        "character": "Randy",
        "line": "Aw man, I hate when pornos try to have a story."
    },
    {
        "character": "Narrator",
        "line": "Seven rings were cast and given to the races of Men."
    },
    {
        "character": "Randy",
        "line": "Oh yeah. [begins caressing Sharon]"
    },
    {
        "character": "Narrator",
        "line": "Seven, to the races of Elves, five to the gloondock villagers of Gelgendor. [Sharon takes a good look at the video]"
    },
    {
        "character": "Sharon",
        "line": "Wow, the production values are really good in this porno. [Randy takes a look]"
    },
    {
        "character": "Randy",
        "line": "Yeah, it almost looks like... The Lord of the-- [jumps up and sits on the bed, aghast] Oh, my God! [quickly rises and turns off the TV, gets the video out, and reads] This is Lord of the Rings!"
    },
    {
        "character": "Sharon",
        "line": "But then that mean..?"
    },
    {
        "character": "Randy",
        "line": "The boys have the hottest porno ever made."
    },
    {
        "character": "",
        "line": "Stotch residence. The boys approach. Kyle knocks, Stephen and Linda open the front door."
    },
    {
        "character": "Stephen",
        "line": "Oh, hello boys."
    },
    {
        "character": "Stan",
        "line": "My father has asked that we bring you this copy of Lord of the Rings."
    },
    {
        "character": "Stephen",
        "line": "Well, thank you very much, kind heroes."
    },
    {
        "character": "Cartman",
        "line": "Perhaps a reward is in order. Gold? Frankensteincense?"
    },
    {
        "character": "Stephen",
        "line": "Oh, but you are noble heroes. We know our thanks is enough. [closes the door. The boys leave]"
    },
    {
        "character": "Cartman",
        "line": "Man, that's crap."
    },
    {
        "character": "",
        "line": "Basement. Butters is drawing something on paper. His parents descend with video in hand."
    },
    {
        "character": "Stephen",
        "line": "Butters, [Butters stands up] look what we have for you to watch: The Lord of the Rings."
    },
    {
        "character": "Butters",
        "line": "[rushes up to meet his parents] Oh, boy! Finally I get to see it!"
    },
    {
        "character": "Linda",
        "line": "Now Daddy and I have to do our taxes, so you can watch this by yourself and not get scared?"
    },
    {
        "character": "Butters",
        "line": "Ah I won't get scared, Mom. Promise!"
    },
    {
        "character": "Stephen",
        "line": "That's our man. Here you go. [hands the tape to Butters, who goes to the VCR and puts the tape in. The parents leave]"
    },
    {
        "character": "Butters",
        "line": "Ooh la lolly! I finally get to see Lord of the Rings. [the video begins to play. A man and a woman are heard]"
    },
    {
        "character": "Evan Stone",
        "line": "[softly] Spank that ass. [a few seconds later, a spanking is heard]"
    },
    {
        "character": "Butters",
        "line": "Whoa. [more sounds from the video] Neat-o. [more sounds, a few spankings] Well, this is good."
    },
    {
        "character": "",
        "line": "Marsh car. Randy drives, Sharon worries. They have donned pajamas and thrown on coats."
    },
    {
        "character": "Sharon",
        "line": "Oh my God, this is gonna be so embarrassing. \"Hi, Chris. Hi, Linda. We were just wondering if we could get our porno back.\" [buries her face in her right hand]"
    },
    {
        "character": "Randy",
        "line": "Calm down, maybe the boys haven't gotten there yet."
    },
    {
        "character": "",
        "line": "The woods. As Randy and Sharon head for Butters' house, the boys walk home through backwoods."
    },
    {
        "character": "Cartman",
        "line": "And so the party returns home after completing their great quest."
    },
    {
        "character": "Stan",
        "line": "The one tape was returned and South Park was again at peace. [a few seconds later some headlights shine on them]"
    },
    {
        "character": "Kyle",
        "line": "Quick! A monster of Rivendell!"
    },
    {
        "character": "Cartman",
        "line": "Prepare for battle! [switch to the car]"
    },
    {
        "character": "Sharon",
        "line": "The boys! [Randy drives up to the boys and stops. Both he and Sharon jump out and rush up to them]"
    },
    {
        "character": "Randy",
        "line": "Boys! Boys! [stops] Where's the videotape?"
    },
    {
        "character": "Stan",
        "line": "We gave it to the parents of Butters as commanded by you."
    },
    {
        "character": "Sharon",
        "line": "Awgh, I guess we have to go talk to 'em now."
    },
    {
        "character": "Randy",
        "line": "Well, wait a minute, uhhh, boys, do you think you can go get that tape back for us really fast? [the boys look at each other]"
    },
    {
        "character": "Cartman",
        "line": "This sounds like a really important quest."
    },
    {
        "character": "Randy",
        "line": "Yes, it is. It is more important than anything I've ever asked you to do. You must retrieve the tape. But do not look at it, uh, for it... holds an evil power! Retrieve the tape, and return it to us at home. [falling into a fantasy accent] Do this, and you will be greatly rewarded."
    },
    {
        "character": "Stan",
        "line": "Woww."
    },
    {
        "character": "Cartman",
        "line": "This... is so cool."
    },
    {
        "character": "Kyle",
        "line": "[turns left] Gentlemen, we are off! [the boys turn back to walk to Butters' house. Randy watches them leave]"
    },
    {
        "character": "Randy",
        "line": "[rises and looks at Sharon] Okay, problem solved."
    },
    {
        "character": "",
        "line": "Stotch residence; basement, moments later. Butters is looking at more of the video. He has a surprised expression on his face. Steamy action is heard."
    },
    {
        "character": "Woman",
        "line": "...Oh my God, I'm so... Mmmm, mmm..."
    },
    {
        "character": "Butters",
        "line": "Oh golly. [his legs part and he points to his crotch] Hey, what's happening down there? [the basement door is heard opening and closing. Butters is fascinated by his body's reaction. Stan, Kyle, and Cartman come down the stairs. Butters reaches for his crotch for tactile inspection]"
    },
    {
        "character": "Stan",
        "line": "We have come to reclaim the one tape! [Butters sits up and Kyle goes for the tape]"
    },
    {
        "character": "Butters",
        "line": "[walks up to Kyle] Wha-wha, what are you doing?! [Kyle removes it and puts it into the LotR case it came in]"
    },
    {
        "character": "Kyle",
        "line": "[walks off. Butters is saddened] The Queen and King of Stan'ses house wish The Lord of the Rings returned to them."
    },
    {
        "character": "Butters",
        "line": "But it's the greatest movie I have ever seen. You guys were right. Lord of the Rings is awesome. Eh, you have to let me finish watching it."
    },
    {
        "character": "Cartman",
        "line": "Nay, Butters! The one tape must be brought back to Stan'ses house. [the boys head up the stairs and out of the house. Butters opens the door and jumps at them]"
    },
    {
        "character": "",
        "line": "Butters' house, outside."
    },
    {
        "character": "Butters",
        "line": "Bwaagghh! [falls on his face, then quickly gets up and retreats]"
    },
    {
        "character": "Kyle",
        "line": "Butters! We said you can't watch it! We have a quest!"
    },
    {
        "character": "Butters",
        "line": "Well, then... then let me go with you."
    },
    {
        "character": "Kyle",
        "line": "Okay, fine, Butters. But if you're gonna hang out with us, you have to play like Lord of the Rings. [Little does Kyle know what Butters' idea of LotR is. The boys turn to walk away]"
    },
    {
        "character": "Butters",
        "line": "Wuh, okay. [Butters jumps on Kyle's left arm and starts making love to it] Ugh, ugh, ugh, ugh, ugh, yeah."
    },
    {
        "character": "Kyle",
        "line": "[glares at Butters] Butters, what the hell are you doing?!"
    },
    {
        "character": "Butters",
        "line": "[a bit surprised] Playing Lord of the Rings. [resumes the love-making] Ugh, wegh, oh yeah."
    },
    {
        "character": "Kyle",
        "line": "[smacks Butters with the tape, causing him to fall off] Get the hell off me! You're a freak, Butters! You can't play with us!"
    },
    {
        "character": "Butters",
        "line": "[on hands and knees, with renewed determination] Let me have the tape!"
    },
    {
        "character": "Stan",
        "line": "[takes the tape from Kyle] No, we have to return it! [the boys turn to walk away again. Butters crawls a few inches]"
    },
    {
        "character": "Butters",
        "line": "My movie! [sorrowfully reaches out for it with left hand] My awesome cool movie. My... precious."
    },
    {
        "character": "",
        "line": "The woods, night. The boys retrace their steps through the backwoods."
    },
    {
        "character": "Cartman",
        "line": "And so the tape was again retrieved to be brought back to Stan'ses house."
    },
    {
        "character": "Kyle",
        "line": "This copy of Lord of the Rings made the young Butters behave quite oddly."
    },
    {
        "character": "Stan",
        "line": "Yeah, and mine parents were acting strange about it, too."
    },
    {
        "character": "Cartman",
        "line": "Perhaps the one videotape has some power we have not foreseen. [three older boys ride up on their bikes and stop before the group. It's the sixth graders]"
    },
    {
        "character": "Sixth grader leader",
        "line": "[gets off his bike and approaches the boys] Well, well, well! If it isn't Robin Hood and his Merry Men!"
    },
    {
        "character": "Kyle",
        "line": "Oh, crap, the sixth graders!"
    },
    {
        "character": "Sixth grader leader",
        "line": "Whatcha got there?"
    },
    {
        "character": "Stan",
        "line": "Nothing. [the sixth grader rips the tape out of Stan's hand] Hey, kid!"
    },
    {
        "character": "Sixth grader leader",
        "line": "[looks at the case] Lord of the Rings? Ha! That movie's gay!"
    },
    {
        "character": "Cartman",
        "line": "You're gay!"
    },
    {
        "character": "Sixth grader leader",
        "line": "[opens the case and looks at the tape] What the--? [reads the title: \"Back Door Sluts 9\" XXX] Whoa! [backs up to show the tape to his friends] Check it out, you guys!"
    },
    {
        "character": "Sixth graders 2 and 3",
        "line": "Whoa!"
    },
    {
        "character": "Stan",
        "line": "Give it back! We're on a quest to return it to my parents!"
    },
    {
        "character": "Sixth grader leader",
        "line": "[approaches menacingly with the tape. Stan backs up] No way! We're keepin' this and watchin' it ourselves!"
    },
    {
        "character": "Kyle",
        "line": "You can't keep it."
    },
    {
        "character": "Sixth grader leader",
        "line": "And what are three little fourth graders gonna do about it, huh?!"
    },
    {
        "character": "Stan",
        "line": "There's four of us! Kenny's soul is still trapped in Cartman's body!"
    },
    {
        "character": "Cartman",
        "line": "Yeah!"
    },
    {
        "character": "Sixth grader leader",
        "line": "Oh man, I can't wait to see this!"
    },
    {
        "character": "Kyle",
        "line": "[aside to Stan] Dude, that video is making people act strange."
    },
    {
        "character": "Cartman",
        "line": "The one tape must be returned! [swats the tape out of the sixth grader's hands with the staff and watches as the tape falls into Stan's hands] Run! [the boys run away from the sixth graders]"
    },
    {
        "character": "Sixth grader leader",
        "line": "Get 'em! [his two friends ride off after the boys. He picks up his bike and joins his friends]"
    },
    {
        "character": "",
        "line": "Stotch residence. Randy and Sharon have arrived, and Randy knocks on the door. Stephen answers the door again."
    },
    {
        "character": "Stephen",
        "line": "Oh, hello, Randy, Sharon."
    },
    {
        "character": "Randy",
        "line": "Uh... Chris, are the boys over here?"
    },
    {
        "character": "Linda",
        "line": "No, just Butters. He's been watching The Lord of the Rings downstairs."
    },
    {
        "character": "Sharon",
        "line": "Oh, dear!"
    },
    {
        "character": "Stephen",
        "line": "What's the matter?"
    },
    {
        "character": "Randy",
        "line": "We... [now nervous] Well, this is really sort of funny, but uh, we, we accidentally put a...porno in The Lord of the Rings box. [Sharon shrugs, and both of them smile sheepishly]"
    },
    {
        "character": "Linda",
        "line": "Ohh God!! [the Stotches panic and rush downstairs. The Marshes follow]"
    },
    {
        "character": "",
        "line": "Basement. Chris, Linda, Randy and Sharon enter. The TV is still on, but there's static. Butters isn't around."
    },
    {
        "character": "Stephen",
        "line": "Butters?"
    },
    {
        "character": "Linda",
        "line": "Butters? [they notice the television] Butters!"
    },
    {
        "character": "Butters",
        "line": "[peeks out from behind the sofa, in the shadow, then speaks in a raspy voice] The precious? [his parents turn to see him] Could you bring back my precious?"
    },
    {
        "character": "Stephen",
        "line": "Butters, where is the movie you were watching?"
    },
    {
        "character": "Butters",
        "line": "[crawls out into view] They took his precious, took it away to watch without him. [sits up and puts his hands on his knees] He was really enjoying that movie, too! My... precious."
    },
    {
        "character": "Randy",
        "line": "The boys must've come and saw what it was and... then taken it away somewhere."
    },
    {
        "character": "Sharon",
        "line": "[gravely] Oh, no. [Stephen and Linda look back at them]"
    },
    {
        "character": "",
        "line": "The woods, later. The camera moves from a clearing to a tree with a large root shading a pocket underneath. The boys come into view."
    },
    {
        "character": "Kyle",
        "line": "We can't let those sixth graders get their hands on this videotape."
    },
    {
        "character": "Cartman",
        "line": "I must say I agree. If this copy of The Lord of the Rings is tainted, it would not be safe in the wrong hands."
    },
    {
        "character": "Sixth grader leader",
        "line": "[nearby, off screen] I smell fourth graders!"
    },
    {
        "character": "Stan",
        "line": "Oh crap, dude!"
    },
    {
        "character": "Kyle",
        "line": "Hide! [they jump over the massive root and hide in the pocket underneath. The lead sixth grader comes into view and sniffs the air. He hops off and looks around over the root. The boys look up in apprehension. The sixth grader sniffs around above them]"
    },
    {
        "character": "Sixth grader 1",
        "line": "[off screen] Hey. [the lead sixth grader whips around and goes to see who it is. It's his friend, in brown cap] I think I see something down the hill. [the lead sixth grader looks in that direction, then the sixth graders take off. The boys express relief after a few seconds]"
    },
    {
        "character": "Stan",
        "line": "Ogh. [Cartman sighs silently]"
    },
    {
        "character": "Kyle",
        "line": "Phew. The one videotape is sought after indeed."
    },
    {
        "character": "Stan",
        "line": "Yeah. Butters, my parents, now the sixth graders."
    },
    {
        "character": "Cartman",
        "line": "[rises and moves off] Come, guys. We must bring this all to the attention of the High Elf of Paragon."
    },
    {
        "character": "Kyle",
        "line": "Yeah, the High Elf. He'll know what to do. [the boys leave the root]"
    },
    {
        "character": "",
        "line": "Broflovski residence, night. The boys' parents are all gathered in the living room."
    },
    {
        "character": "Randy",
        "line": "[debriefing Gerald and Sheila] And so that's the situation. All the boys are out there somewhere with a... pornographic videotape."
    },
    {
        "character": "Sheila",
        "line": "Oh God, this, this is horrible!"
    },
    {
        "character": "Gerald",
        "line": "All right, calm down. Now, just how bad of a porno tape are we talking here? I mean, was it like Crotch Capers 3?"
    },
    {
        "character": "Randy",
        "line": "I'm a...fraid it was... Backdoor Sluts 9. [he and Sharon hang their heads in shame]"
    },
    {
        "character": "Gerald, Stephen",
        "line": "Backdoor Sluts 9?!?"
    },
    {
        "character": "Linda",
        "line": "Is that bad?"
    },
    {
        "character": "Stephen",
        "line": "Backdoor Sluts 9 makes Crotch Capers 3 look like Naughty Nurses 2!"
    },
    {
        "character": "Gerald",
        "line": "I-it is the single most vile, twisted, dark piece of porn ever made. [Sheila gets angrier by the word]"
    },
    {
        "character": "Sheila",
        "line": "[slaps him] How the hell do you know?!"
    },
    {
        "character": "Gerald",
        "line": "[shakily] I, uh, I-I-I read about it in People."
    },
    {
        "character": "Sheila",
        "line": "[now facing the Marshes] Oh, this is just great! How could you two be so careless?!"
    },
    {
        "character": "Sharon",
        "line": "We're sorry."
    },
    {
        "character": "Liane",
        "line": "Well, Sheila, we can't shelter our boys forever from these things. Maybe it's okay for them to see an adult film."
    },
    {
        "character": "Sheila",
        "line": "Not without their parents to put it in a proper context! They won't understand what they're seeing!"
    },
    {
        "character": "Randy",
        "line": "It-it can't hurt 'em that much, can it?"
    },
    {
        "character": "Butters",
        "line": "[pops up outside and taps on a window] Precious. [the adults turn to see the window] Let me see my precious. [slides down the window and out of view] Plee-ee-ee-ease! [the adults just look on]"
    },
    {
        "character": "",
        "line": "Stan, Kyle and Cartman arrive at a house. Stan rings the doorbell twice, but no answer."
    },
    {
        "character": "Cartman",
        "line": "[waves his left hand around] Open. [nothing. He waves his left hand again] Bellog. [the door opens and Clyde appears]"
    },
    {
        "character": "Clyde",
        "line": "What do you guys want?"
    },
    {
        "character": "Stan",
        "line": "We must speak with the High Elf of Paragon."
    },
    {
        "character": "Clyde",
        "line": "Oh. Okay, hang on a second. [steps back and closes the door, then reopens the door. He is now dressed as an elf. His staff is a small hoe] What troubles you?"
    },
    {
        "character": "Kyle",
        "line": "We have in our possession something of great power. [pulls out the videotape] It is... The Lord of the Rings."
    },
    {
        "character": "Clyde",
        "line": "So? I have three copies. And the DVD with twelve hours of extra footage."
    },
    {
        "character": "Stan",
        "line": "Yes, but this is not a-- [stops, then reacts] Wow, twelve hours? ...Yes, but this is not a normal copy. It's making people act really strange. [hands the tape to Clyde]"
    },
    {
        "character": "Cartman",
        "line": "We're seriously, High Elf. Something very evil lurks in this tape."
    },
    {
        "character": "Clyde",
        "line": "Very well, I shall call the council together. Meet me in the Woods of Gathering behind Talangar the Black's house. And don't let my mom see you, 'cause I'll get in trouble."
    },
    {
        "character": "Cartman",
        "line": "Thank you, High Elf of Paragon."
    },
    {
        "character": "Clyde",
        "line": "Faragon, asshole! [closes the door. The boys leave the house and walk off]"
    },
    {
        "character": "Cartman",
        "line": "Clyde's a dick."
    },
    {
        "character": "",
        "line": "A parking lot in town. A bunch of kids are gathered there on their bikes. The lead sixth graders hops onto a car and gets the others' attention."
    },
    {
        "character": "Sixth grader leader",
        "line": "Alright, everybody listen up! There's three snot-nosed little fourth graders out there who have a porno called Backdoor Sluts 9."
    },
    {
        "character": "Other sixth graders",
        "line": "Ooooooh!"
    },
    {
        "character": "Sixth grader leader",
        "line": "I checked it out on the Internet, and it said that Backdoor Sluts 9 is the most hard-core porno ever made."
    },
    {
        "character": "Other sixth graders",
        "line": "Ahhhhh!"
    },
    {
        "character": "Sixth grader leader",
        "line": "I have amassed this army of sixth graders to get the tape by any means necessary. Now, let's go get that porno! [the sixth graders scream and charge out into the night on their bikes]"
    },
    {
        "character": "",
        "line": "Tolkien's mansion, backyard. Very leafy backyard indeed. The camera moves from a shot of the moon to a shot of all the fourth grade boys seated around a small table."
    },
    {
        "character": "Clyde",
        "line": "And so that is the situation. The video may or may not have evil power. Kyle, would you bring it up here, please? [Kyle gets up, walks to the table, and stands the tape on it]"
    },
    {
        "character": "Other Boys",
        "line": "Ahhh."
    },
    {
        "character": "Jimmy",
        "line": "That video could have been made by Sauron's evil f-...forces."
    },
    {
        "character": "Craig",
        "line": "It could hold a mental spell of some kind."
    },
    {
        "character": "Kevin",
        "line": "[wearing a Star Wars Imperial stormtrooper helmet] Perhaps we could use it to strengthen our star cruisers. [the kids look at him. One shot has Tweek wearing a large coffee tin on his head, Pip dressed as an elf, a kindergartner wearing a Fett helmet, then one of Stan, Kyle and Cartman]"
    },
    {
        "character": "Cartman",
        "line": "Kevin, god-damnit..! [Kevin looks around, then hops off his chair and leaves]"
    },
    {
        "character": "Clyde",
        "line": "Look, until we see this tape's power for ourselves, we cannot risk giving it to anybody."
    },
    {
        "character": "Stan",
        "line": "But if we watch it, we could fall under its spell, too."
    },
    {
        "character": "Clyde",
        "line": "That is true. Only a Paladin with a high constitution should watch the tape. Therefore, I think it is a job for you, Talangar the Black."
    },
    {
        "character": "Tolkien",
        "line": "[thinks about this, then leaves his seat] I am not scared. I'll go inside and watch the tape, [reaches the table and gets the tape] just for a few seconds. If I do not return in two minutes, send a party in after me. [walks towards the house] The fate of Middle-earth... is in my hands. [reaches the sliding door and enters the house, closing the door behnd him]"
    },
    {
        "character": "",
        "line": "The neighborhood. The sixth graders come into view on their bicycles making all sorts of noise."
    },
    {
        "character": "Sixth grader leader",
        "line": "Fourth graders! Give us that porn-o! [they go out of view. A moment later the Marsh car comes into view]"
    },
    {
        "character": "Sharon",
        "line": "Boys? [the Broflovskis are in the back seat]"
    },
    {
        "character": "Sheila",
        "line": "[with her head out the window] Boys, we're not mad at you. We just wanna talk to you. [behind them is the Stotch car]"
    },
    {
        "character": "",
        "line": "Tolkien's mansion, backyard. The boys wait for Tolkien's verdict."
    },
    {
        "character": "Cartman",
        "line": "Talangar the Black returns from watching the video. [the other boys stir]"
    },
    {
        "character": "Clyde",
        "line": "What vice did you see on the videotape, Talangar? Is it the work of Sauron's magic? [Tolkien returns to the table and places the tape there]"
    },
    {
        "character": "Tolkien",
        "line": "I'm not playing anymore. [walks off]"
    },
    {
        "character": "Stan",
        "line": "[steps forward] Uh, well—Wait, what'd you see?"
    },
    {
        "character": "Tolkien",
        "line": "[stops and turns] I don't know, I don't wanna know. I'm out. [claps his hands, then walks back into the house, sliding the door open and closed. The boys look on]"
    },
    {
        "character": "Cartman",
        "line": "My God, this thing must really be powerful. [the boys turn to look at the tape]"
    },
    {
        "character": "Kyle",
        "line": "This tape makes people freak out wherever it goes."
    },
    {
        "character": "Stan",
        "line": "What do we do with it?"
    },
    {
        "character": "Clyde",
        "line": "One thing for sure, this tape cannot be trusted with anybody. It must be returned to the video store from whence it came."
    },
    {
        "character": "Jimmy",
        "line": "Well, where is the videotape rented from?"
    },
    {
        "character": "Kyle",
        "line": "[picks up the tape and looks for the store name] Two Towers Video Store. I-in Conifer."
    },
    {
        "character": "Tweek",
        "line": "Conifer? Walking there would take hours!"
    },
    {
        "character": "Craig",
        "line": "There's no alternative. We have to return the tape before it causes more damage!"
    },
    {
        "character": "Kindergartner",
        "line": "I'll go."
    },
    {
        "character": "Craig",
        "line": "Ha! We cannot trust something of that much power to a dwarf! Especially a kindergartner dwarf. [all the boys begin to chatter, nominating who should return the video]"
    },
    {
        "character": "Craig",
        "line": "You're too young."
    },
    {
        "character": "Cartman",
        "line": "Quiet!"
    },
    {
        "character": "Jimmy",
        "line": "You guys, this is stupid."
    },
    {
        "character": "Cartman",
        "line": "You're acting like a bunch of assholes!"
    },
    {
        "character": "Stan",
        "line": "I will take it! [the boys quiet down and Stan approaches the table. He takes the tape in hand. Cartman closes his eyes in meditation] I will walk to the video store."
    },
    {
        "character": "Clyde",
        "line": "It is too far and too dangerous to go alone. Take with you the wizard [Cartman], the dwarf [the kindergartner], the warrior [Craig], the cleric [Jimmy], and the Jew [Kyle]."
    },
    {
        "character": "Kyle",
        "line": "[flashes anger] Paladin!"
    },
    {
        "character": "Clyde",
        "line": "Very well. You shall be the Fellowship of The Lord of the Rings. Good luck. I have to go home now before I get in trouble."
    },
    {
        "character": "Tweek",
        "line": "Me too."
    },
    {
        "character": "Other boys",
        "line": "[agreeing] Yeah, yeah, yeah."
    },
    {
        "character": "Craig",
        "line": "Only the six of us are to go?"
    },
    {
        "character": "Stan",
        "line": "No, no, there's seven of us. Kenny's soul is still trapped in Cartman's body, remember?"
    },
    {
        "character": "Cartman",
        "line": "Yeah, stupid. [higher pitch] Yeah. Luckily, Cartman's big enough for the both of us. [a bit lower] Shut up, Kenny."
    },
    {
        "character": "",
        "line": "Kenosha Pass, snowing. The boys walk along the highway through the pass."
    },
    {
        "character": "Narrator",
        "line": "So it was that the heroes traveled many miles to return The Lord of the Rings to the video store."
    },
    {
        "character": "Kyle",
        "line": "We have reached the Great Pass of Mount Ururalak."
    },
    {
        "character": "Craig",
        "line": "Look out! [a small avalanche of snow appears in front of them]"
    },
    {
        "character": "Kyle",
        "line": "[gasps a little] We were almost killed."
    },
    {
        "character": "Cartman",
        "line": "A dark wizard must be trying to stop us!"
    },
    {
        "character": "Stan",
        "line": "True. Someone or something doesn't want this video returned to the video store."
    },
    {
        "character": "",
        "line": "Tolkien's mansion. The boys' parents are at the front door. The front door opens and Tolkien's parents appear."
    },
    {
        "character": "Steve",
        "line": "Oh. Hello everybody."
    },
    {
        "character": "Gerald",
        "line": "Steve, uh, we heard that a bunch of the kids were over here a little while ago."
    },
    {
        "character": "Linda Black",
        "line": "Well yes, I believe they were, but they've gone. What's the matter?"
    },
    {
        "character": "Randy",
        "line": "We think our boys might be showing other children a, uh... pornographic tape."
    },
    {
        "character": "Steve",
        "line": "What? But Tolkien's never seen a porno before. He wouldn't know what to—Oh God! [rushes to look for Tolkien]"
    },
    {
        "character": "Linda Black",
        "line": "Tolkien! [the other parents rush in]"
    },
    {
        "character": "",
        "line": "The dining room table. Tolkien sits alone on one of the many seats there. The adults arrive."
    },
    {
        "character": "Linda Black",
        "line": "Tolkien? Did the boys come over and... show you a movie? [no answer]"
    },
    {
        "character": "Steve",
        "line": "Tolkien? [no answer, long pause] Alright, Tolkien. We know you must be very confused about what you saw. [no response, long pause]"
    },
    {
        "character": "Randy",
        "line": "[kneels next to Tolkien] Yes, uh... you see, Tolkien... that was called a pornographic film. I-it shows adult men and adult women having sexual intercourse. [no response, long pause] Well, y-you see, when a, when a man and a woman fall in love, the man puts his penis in the woman's vagina. It's called love-making, and it's part of being in love."
    },
    {
        "character": "Tolkien",
        "line": "[no response, long pause] ...And when the woman has four penises in her at the same time, then stands over the men and pees on them, is that part of being in love too? [no response] Five midgets, spanking a man... covered with Thousand Island dressing. Is that making love?"
    },
    {
        "character": "Steve",
        "line": "Jesus, what kind of porno is that?"
    },
    {
        "character": "Gerald",
        "line": "It was Backdoor Sluts 9."
    },
    {
        "character": "Steve",
        "line": "Oh, Jesus, not that one! [his wife gives him an angry look]"
    },
    {
        "character": "Sheila",
        "line": "Oh, Gerald, poor Kyle must be just as confused and scared as this poor kid."
    },
    {
        "character": "Gerald",
        "line": "Uh, Tolkien, this is very important: do you know where the boys went with the naughty tape?"
    },
    {
        "character": "",
        "line": "Bailey, town limit. The boys arrive there."
    },
    {
        "character": "Craig",
        "line": "We're entering the limits of Bailey. Everyone stay close."
    },
    {
        "character": "Stan",
        "line": "Perhaps the Great Ringworm of Bailey is about."
    },
    {
        "character": "Kindergartner",
        "line": "Ringworms are no match for a dwarf."
    },
    {
        "character": "Cartman",
        "line": "Yes, we shall slay the Ringworm and take his bounty of treasure! [they pass a yard on which some kids are playing] For that is the way of the--"
    },
    {
        "character": "Boy 1",
        "line": "I shall put a magic spell on you!"
    },
    {
        "character": "Boy 2",
        "line": "I have blocked your spell, wizard!"
    },
    {
        "character": "Kyle",
        "line": "Hey, what are you guys doing? [the Bailey kids turn and look]"
    },
    {
        "character": "Boy 3",
        "line": "We're playing Harry Potter."
    },
    {
        "character": "Cartman",
        "line": "[after a few moments of thought] Ha!! Fags! [the boys move on. They soon pass a Country Café]"
    },
    {
        "character": "Kyle",
        "line": "[suddenly wary] You guys. Somebody is following us."
    },
    {
        "character": "Cartman",
        "line": "It's Butters."
    },
    {
        "character": "Kyle",
        "line": "Butters?"
    },
    {
        "character": "Cartman",
        "line": "Yes. He's been following us for like two hours. [behind the six boys, at some distance, is Butters, skulking along in the shadows]"
    },
    {
        "character": "Butters",
        "line": "The precious videotape. L-let the Butters see it."
    },
    {
        "character": "Cartman",
        "line": "Just ignore him; maybe he'll go away."
    },
    {
        "character": "Jimmy",
        "line": "Hey fellas, mind if we take a little re-rest?"
    },
    {
        "character": "Cartman",
        "line": "There's no time for rest, sorcerer! Keep up! [the sound of sixth graders is heard in the distance. The boys look around to find the direction of the sound. The sixth graders appear in the horizon behind them and ride in quickly, screaming all the while]"
    },
    {
        "character": "Jimmy",
        "line": "They are coming. [a shot of the sixth graders] You guys go on ahead."
    },
    {
        "character": "Kyle",
        "line": "Jimmy, are you sure?"
    },
    {
        "character": "Jimmy",
        "line": "Go! [the other five boys take off, leaving Jimmy to face the sixth graders alone. He turns and stares down the approaching throng] You shall not...pah..? You shall not..puh... [the sixth graders draw closer] You shall not paah... [a shot of the young bikers, then a distance shot of Jimmy, then a shot of the young bikers, a shot of Jimmy, a shot of the young bikers, a quick shot of Jimmy, then the sixth graders as they reach Jimmy] You shall not pa--! [the sixth graders take shots at him as they pass by. He falls and gets up] You shall not paah--! [struck down again, rises, is struck down, rises...] You shall not puh-uh-uh-- [falls again. The last of the sixth graders passes by, and Jimmy stands up, all beat up, with tire tracks and bruises on his face and a black eye] You shall not pass. [falls down]"
    },
    {
        "character": "",
        "line": "A river, further along the quest. Stan looks back to see about Jimmy."
    },
    {
        "character": "Stan",
        "line": "Jimmy didn't stop them!"
    },
    {
        "character": "Kyle",
        "line": "They're gonna take The Lord of the Rings from us."
    },
    {
        "character": "Cartman",
        "line": "Quick! Cross the river! Sixth graders can't stand water!"
    },
    {
        "character": "Craig",
        "line": "What? That's stupid."
    },
    {
        "character": "Cartman",
        "line": "I'm a high-ranking white wizard, Craig, and I say sixth graders are opposed to water!"
    },
    {
        "character": "Craig",
        "line": "Whatever. I'm going back to play with the Harry Potter kids. [walks off]"
    },
    {
        "character": "Kindergartner",
        "line": "Me too. [follows Craig]"
    },
    {
        "character": "Cartman",
        "line": "Go ahead and play Harry Butthole Pussy Potter!"
    },
    {
        "character": "Stan",
        "line": "Just get across the river! They're coming! [the three remaining boys scramble across the river. The sixth graders arrive. Two of them stop their tires by performing wheelies and landing their bikes back on the road. The lead sixth grader rides up between them]"
    },
    {
        "character": "Sixth grader leader",
        "line": "What the hell is wrong with you guys?! Get the tape!"
    },
    {
        "character": "Sixth grader 3",
        "line": "Dude, I don't wanna get wet."
    },
    {
        "character": "Sixth grader 4",
        "line": "Yeah, I don't really like the water."
    },
    {
        "character": "Sixth grader 1",
        "line": "Besides, if our bikes get wet, their chains'll rust."
    },
    {
        "character": "Sixth grader leader",
        "line": "Oh, god-damnit. Alright, come on. We'll find a bridge. [the bikers ride off]"
    },
    {
        "character": "",
        "line": "The woods, later. The boys walk through it."
    },
    {
        "character": "Narrator",
        "line": "The quest continued to return The Lord of the Rings to the video store."
    },
    {
        "character": "Stan",
        "line": "Man, we should have never crossed that stupid river."
    },
    {
        "character": "Kyle",
        "line": "Yeah. Good job, wizard fat ass! Now we're totally lost."
    },
    {
        "character": "Cartman",
        "line": "We're not lost, Jewgar of Jewlingrad, we just don't know where we are! [twitched] That's what \"lost\" means, stupid! Kenny, shut your goddamned mouth!"
    },
    {
        "character": "Stan",
        "line": "This is great! We're in the middle of nowhere and nobody knows what direction the video store is in!"
    },
    {
        "character": "Butters",
        "line": "[crawls up to them] The Butters knowses."
    },
    {
        "character": "Kyle",
        "line": "Oh brother!"
    },
    {
        "character": "Butters",
        "line": "The video store. Yesss. Not far from here. We can show you wheres it is."
    },
    {
        "character": "Stan",
        "line": "Where?!"
    },
    {
        "character": "Butters",
        "line": "First, just let Butters sseee the precious."
    },
    {
        "character": "Kyle",
        "line": "No, Butters. Look what it's done to you. It's made you even lamer than before."
    },
    {
        "character": "Cartman",
        "line": "If that was possible."
    },
    {
        "character": "Stan",
        "line": "Tell us how to get to the video store, Butters, or else we're gonna kick your ass!"
    },
    {
        "character": "Butters",
        "line": "[puts up his arms to shield himself] Ha-a-a. No hurtses the Butters. [squats with his arms hanging over his knees] We will show you the way. Yesss. This way it is. [walks forward in a squatting manner]"
    },
    {
        "character": "",
        "line": "The road. Randy, Sharon, Gerald and Sheila ride in the Marsh car, with Randy driving, and Stephen drives the Stotch car."
    },
    {
        "character": "Sheila",
        "line": "This is awful! I just know with every passing minute, little Kyle is seeing more and more depraved sex acts!"
    },
    {
        "character": "Gerald",
        "line": "Well, we'll find them. A-and then we'll try to put what they saw into context."
    },
    {
        "character": "Sharon",
        "line": "Look! There's one of the boys now! [before them is Jimmy, fallen and asleep in the middle of the road. Randy steps on the brakes] Jimmy!"
    },
    {
        "character": "Randy",
        "line": "[the adults jump out of their cars and approach him] Jimmy! Jimmy! [Jimmy awakens and looks up] Where did the boys go with the porno tape?"
    },
    {
        "character": "Jimmy",
        "line": "They're taking it to the vi... the vi... the vii..."
    },
    {
        "character": "Stephen",
        "line": "Come on Jimmy, we don't have a lot of time."
    },
    {
        "character": "Jimmy",
        "line": "They took it back to the video s... the video s..."
    },
    {
        "character": "Randy",
        "line": "The video sandwich?"
    },
    {
        "character": "Stephen",
        "line": "The video stockyard."
    },
    {
        "character": "Randy",
        "line": "What's a video stockyard, Jimmy?"
    },
    {
        "character": "Jimmy",
        "line": "No, the video suh... the video s...tih..."
    },
    {
        "character": "Gerald",
        "line": "Stinger?"
    },
    {
        "character": "Stephen",
        "line": "Staples. They went to the video Staples. Where's that, Jimmy?"
    },
    {
        "character": "Jimmy",
        "line": "N-n-no, you retards! The video s...tore!"
    },
    {
        "character": "Adults",
        "line": "The video store! [they go to their cars]"
    },
    {
        "character": "Sheila",
        "line": "Hurry! Hurry!"
    },
    {
        "character": "Randy",
        "line": "I know where it is! [they get in their cars and peel off. (\"When did the Broflovski station wagon arrive?\") Jimmy is left where he was when they arrived]"
    },
    {
        "character": "",
        "line": "Two Towers video store. The boys arrive out of breath and head for the front door."
    },
    {
        "character": "Kyle",
        "line": "Oh no! They're closed!"
    },
    {
        "character": "Stan",
        "line": "Closed?"
    },
    {
        "character": "Sixth grader leader",
        "line": "[off screen] There they are!"
    },
    {
        "character": "Sixth grader 5",
        "line": "[the throng of sixth graders approach] Don't let them turn it back into the video store!"
    },
    {
        "character": "Cartman",
        "line": "We're screwed."
    },
    {
        "character": "Stan",
        "line": "[seeing a way out of this mess] Wait. A drop box. [goes to it and pulls down the door] Quick, Kyle, drop the movie in!"
    },
    {
        "character": "Kyle",
        "line": "Finally. [he and Cartman move towards the box. Butters looks on] It's over."
    },
    {
        "character": "Butters",
        "line": "[now moving] Precious. Must have our precious. Waagh! [jumps on Kyle and runs off with the tape]"
    },
    {
        "character": "Kyle",
        "line": "Butters! No!"
    },
    {
        "character": "Butters",
        "line": "[now in the middle of the parking lot] Now wees hases it! [the sixth graders close in]"
    },
    {
        "character": "Stan",
        "line": "They're coming!"
    },
    {
        "character": "Kyle",
        "line": "[goes after Butters and tries to wrest the tape from him] It has to go back!"
    },
    {
        "character": "Butters",
        "line": "It wantses to stay with the Butter kid."
    },
    {
        "character": "Sixth grader leader",
        "line": "[a foot away] There it is! Give me that tape! [Butters holds on tight to the tape, smiling wide.]"
    },
    {
        "character": "Kyle",
        "line": "[picks Butters up and carries him off] Let go of the tape, Butters!"
    },
    {
        "character": "Butters",
        "line": "I'll never let go! [Stan opens the drop box and holds the door open]"
    },
    {
        "character": "Kyle",
        "line": "Fine! [tosses him into the drop box]"
    },
    {
        "character": "Butters",
        "line": "Precious! [Stan closes the door. The lead sixth grader leaps off his bike and rushes to the drop box]"
    },
    {
        "character": "Sixth grader leader",
        "line": "Nooo! [reaches in and fishes around for it] No, nooo! [walks off in disgust and hits the window] Damnit! [the other sixth graders arrive]"
    },
    {
        "character": "Sixth grader 1",
        "line": "Aw man, now we'll never see the hot action."
    },
    {
        "character": "Sixth grader leader",
        "line": "You stupid little fourth graders!"
    },
    {
        "character": "Cartman",
        "line": "The tape is returned to which it came. Its power over you shall fade as well."
    },
    {
        "character": "Kyle",
        "line": "Middle-earth is again safe."
    },
    {
        "character": "Sixth grader leader",
        "line": "Yeah? Well, that's not gonna stop us from kicking your asses!"
    },
    {
        "character": "Stan",
        "line": "Uh-oh."
    },
    {
        "character": "",
        "line": "The lead sixth grader approaches punching his left fist into his right hand. The other sixth graders move in alowly. Headlights appear and a car horn sounds. The sixth graders look at the cars, as do the boys. The cars pull to a stop short of the boys."
    },
    {
        "character": "Randy",
        "line": "Boys! Boys!"
    },
    {
        "character": "Sixth grader leader",
        "line": "Crap! Parents! [gets on his bike and turns away] Come on, guys. [the sixth graders leave] We'll see you next time, fourthies!"
    },
    {
        "character": "Cartman",
        "line": "And perhaps they would. But for now the sixth grader army was defeated."
    },
    {
        "character": "Randy",
        "line": "There you are!"
    },
    {
        "character": "Sheila",
        "line": "Oh, Kyle! You're safe!"
    },
    {
        "character": "Stan",
        "line": "Oh hey guys, uh... We were just about to come home. We had to return the video."
    },
    {
        "character": "Randy",
        "line": "A-alright, now, now listen, kids. There's some things we need to put into context for you. You see, a man puts his penis into a woman's vagina for both love and pleasure. But sometimes the woman lays on top of the man facing the other way so that they can put each other's genitals in their mouths. [the boys are stunned] Uh, this is called \"69ing\" and it's normal."
    },
    {
        "character": "Sharon",
        "line": "See boys, a woman is sensitive in her vagina and it... feels good to have a man's penis inside of it."
    },
    {
        "character": "Sheila",
        "line": "That's right, but sometimes a woman chooses to use other things. Telephones, staplers, magazines. It's because the nerve endings in the vagina are so sensitive, it's like a fun tickle."
    },
    {
        "character": "Gerald",
        "line": "Now, on to double penetration, boys. You see, sometimes when a woman has sex with more than one man, each man makes love to a different orifice."
    },
    {
        "character": "Randy",
        "line": "That's right. It's something adults can do with really good friends in a comfortable setting."
    },
    {
        "character": "Sheila",
        "line": "It's also important that you understand why some people choose to urinate on each other."
    },
    {
        "character": "Randy",
        "line": "Going number 1 or number 2 on your lover is something people might do, but you must make sure your partner is okay with it before you start doing it."
    },
    {
        "character": "Gerald",
        "line": "Okay, boys. Do you have any questions? [the boys are still stunned, but one of them finally speaks]"
    },
    {
        "character": "Stan",
        "line": "...Wow. [another long moment of stunned silence]"
    },
    {
        "character": "Randy",
        "line": "Well, let's all get going."
    },
    {
        "character": "Sheila",
        "line": "Yeah, come on boys. Time to get home. [the adults head for their cars, but the boys stay frozen in place]"
    },
    {
        "character": "Stephen",
        "line": "[turns around. Linda does as well] Wait a minute. Where's Butters?"
    },
    {
        "character": "",
        "line": "Two Towers video store, inside the bin behind the drop box."
    },
    {
        "character": "Butters",
        "line": "[rises from the batch of videotapes that buried him] Wu-u-wees hases our preciouseses! Hases it... Hases it..."
    }
]