[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "Cartman's house, day. In his room, Cartman has Kyle's cousin, Kyle Schwartz, tally up his good and bad deeds to see where he will end up this year. Kyle Schwartz is seated at Cartman's desk with piles of paper to go through and an adding machine to keep it all current."
    },
    {
        "character": "Kyle Schwartz",
        "line": "Ah-a-a-alright, I'm done."
    },
    {
        "character": "Cartman",
        "line": "You're done?"
    },
    {
        "character": "Kyle Schwartz",
        "line": "Ye-yes, I-I've tallied up all the times you've been naughty and deducted the times you've been nice."
    },
    {
        "character": "Cartman",
        "line": "Yeah, so how's it look?"
    },
    {
        "character": "Kyle Schwartz",
        "line": "It doesn't look good, Eric. It doesn't look good."
    },
    {
        "character": "Cartman",
        "line": "But I'll still be getting presents this year, right?"
    },
    {
        "character": "Kyle Schwartz",
        "line": "A-a-aactually it looks like this year you're gonna owe Santa three hundred and six presents."
    },
    {
        "character": "Cartman",
        "line": "What?!"
    },
    {
        "character": "Kyle Schwartz",
        "line": "Four thousand three hundred and twelve instances of being naughty against three deductions of being nice, is, is bad."
    },
    {
        "character": "Cartman",
        "line": "Three?? You didn't deduct all my nice invoices! Look look! What about this one? [lifts up a sheet from the desk]"
    },
    {
        "character": "Kyle Schwartz",
        "line": "Yes, wa-a-I didn't think \"hitting Clyde in the balls with slingshot\" really counted as nice."
    },
    {
        "character": "Cartman",
        "line": "It was nice for Tolkien; he laughed for like 20 minutes."
    },
    {
        "character": "Kyle Schwartz",
        "line": "Ye you can't deduct things like that, Eric. Santa will know and then he'll come after you."
    },
    {
        "character": "Cartman",
        "line": "[lunges at Kyle Schwartz and grabs him by the left arm] God-damnit I have to get that Haibo robot doll, you sonofabitch!"
    },
    {
        "character": "Kyle Schwartz",
        "line": "Hey hey, [Cartman lets go] I'm just your naughty-and-nice accountant! Don't blame me for the numbers!"
    },
    {
        "character": "Cartman",
        "line": "Haven't you seen the Haibo doll? It's like a pet, a robot pet. You have to feed it and pet it or else it dies, and it's the coolest thing ever! Santa has to bring me one!"
    },
    {
        "character": "Kyle Schwartz",
        "line": "But what, look, aren't there any other nice things you've done recently we can write off here?"
    },
    {
        "character": "Cartman",
        "line": "[thinks a minute] Uh... Oh! I brushed my teeth last night!"
    },
    {
        "character": "Kyle Schwartz",
        "line": "Eh... brushing your teeth isn't naughty or nice... Eric, it just, it falls more into the category of... brushing your teeth."
    },
    {
        "character": "Cartman",
        "line": "Well there's still time before Christmas! Can't I still make up for it?"
    },
    {
        "character": "Kyle Schwartz",
        "line": "If you cured cancer... and AIDS next week, you would still owe two presents."
    },
    {
        "character": "Cartman",
        "line": "Jesus Christ!"
    },
    {
        "character": "Kyle Schwartz",
        "line": "Ah I'm afraid you're gonna have to find a way to do... the nicest, greaatest thing anyone has ever done. Ever. [sets his glasses right]"
    },
    {
        "character": "",
        "line": "South Park city hall, outside, night. A decorated Christmas tree stands at one side of the entrance as the Mayor stands at the dais."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Good evening, everyone. In a moment we'll be lighting the South Park Christmas Tree to kick off the holidays!"
    },
    {
        "character": "Townsfolk",
        "line": "Hooray!! Christmas Tree! Christmas Tree! [Everyone in town is there, and some out of towners too. Seen in the crowd are Mr. and Mrs. Stotch, Mr. and Mrs. Marsh, Shelly, Mr. Mackey, Principal Victoria, Chef and his parents, Mr. and Mrs. Broflovski, Skeeter, Dr. Mephesto and Kevin, a Visitor, Fr. Maxi, Big-Gay Al, Mr. Adler, The Thompsons, a freak, Lolly, Mr. and Mrs. McCormick, and Kevin McCormick] Christmas Tree!"
    },
    {
        "character": "Cartman",
        "line": "[walks up to Stan and Kyle, who are holding candy canes] Hi guys! [\"Christmas Tree!\" Cartman is feeling quite cheerful. He hugs both Stan and Kyle] A very Merry Christmas to you. God bless us, everyone! [he lets go]"
    },
    {
        "character": "Kyle",
        "line": "[naturally weary of Cartman's cheer] What are you doing, Cartman?"
    },
    {
        "character": "Cartman",
        "line": "I'm just letting you guys know how special you are to me."
    },
    {
        "character": "Mayor McDaniels",
        "line": "But now, before we light the tree, I think we should all reflect for a moment on those who are less fortunate than us. [That gets the boys' attention] Right now in Iraq there are children who fear us and what we might do to their country. The threat of war touches us all, but over in Iraq, there is no Christmas. They have nothing."
    },
    {
        "character": "Jimbo",
        "line": "[to Ned] Ah I hate when the Mayor uses Christmas for her own political agenda. [uses his hands to make a megaphone and yells] Light the damn tree!"
    },
    {
        "character": "Townsfolk",
        "line": "YEAH! Christmas Tree! Christmas Tree!"
    },
    {
        "character": "Cartman",
        "line": "Oh my God, that's it!"
    },
    {
        "character": "Kyle",
        "line": "What's it?"
    },
    {
        "character": "Cartman",
        "line": "Don't you see? This time of year we should be bringing Christmas to the less fortunates! Follow me! [leaves in high spirits, then returns] You guys, come on! Right now! [Stan and Kyle shrug, then follow Cartman.]"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Ahalright, here to light the Christmas Tree is a very special young man who shows us all the true meaning of Christmas. Jimmy. [aide 2 sets up a small mic for Jimmy to sing into. The crowd cheers as Jimmy approaches the mic.]"
    },
    {
        "character": "Jimmy",
        "line": "Wow, what a terrific audience. Thank you for giving me this great honor, Mayor. B-before I l, l.. light the tree, I was wondering if I could sing... my favorite ...Christmas song, real quick."
    },
    {
        "character": "Townsfolk",
        "line": "[sympathizing] Awww."
    },
    {
        "character": "Mayor McDaniels",
        "line": "Well, we'd love a Christmas song, wouldn't we, folks?"
    },
    {
        "character": "Townsfolk",
        "line": "Christmas songs! Christmas songs! Christmas songs!"
    },
    {
        "character": "Jimmy",
        "line": "Alright, h-here it goes. On the first day of C-...c...c.. chrih.. stmas my tr... t-tru-true love g-geh... g-g-geh... gave... to... m..m-m-m...m-mm-m-m... me... a pa... a pa... pah..."
    },
    {
        "character": "Mr. Garrison",
        "line": "Oh no. [Mr. Slave, dressed in Santa bondage suit, stands next to him]"
    },
    {
        "character": "",
        "line": "Cartman's house, night. Cartman is rushing out of his house with all sorts of presents. Stan and Kyle just stand there looking at him run around."
    },
    {
        "character": "Cartman",
        "line": "[breathlessly, comes out with the box and sets it down near the driveway] ...and here's some old toys that I don't need anymore. [rushes back inside] And here! Here's some Christmas cookies! [comes out with the box of cookies and sets it down] And some holly and mistletoe! [rushes in to get it, then comes out with the box, setting it next to the box of toys] Oh, this'll be the happiest Christmas the Middle East has ever seen! Guys, get those lights down from the door. We'll give them to the needy Iraqis, too."
    },
    {
        "character": "Stan",
        "line": "Cartman, why are you doing this?"
    },
    {
        "character": "Cartman",
        "line": "They don't have Christmas there, guys. We have to give it to them."
    },
    {
        "character": "Kyle",
        "line": "That's a retarded idea that won't work. Why are you really doing this?"
    },
    {
        "character": "A Voice",
        "line": "[the boys look up and to their right] Hoooowwwwdy ho! [Mr. Hankey skips into view, from a house rooftop, to a garage rooftop, to hovering in front of the boys. Magic dust accompanies him]"
    },
    {
        "character": "Kyle",
        "line": "Mr. Hankey! [an instrumental of Mr. Hankey's theme song plays]"
    },
    {
        "character": "Cartman",
        "line": "[annoyed, softly] Oh I hate this stupid Christmas poo. [in normal voice] Hello, Mr. Hankey! A Merry Christmas to you!"
    },
    {
        "character": "Mr. Hankey",
        "line": "Gee whiz, things sure look Christmasy out here. What are you boys doin'?"
    },
    {
        "character": "Kyle",
        "line": "Cartman is trying to bring Christmas to Iraq."
    },
    {
        "character": "Cartman",
        "line": "The people of Iraq deserve a good Christmas just like everyone else."
    },
    {
        "character": "Mr. Hankey",
        "line": "Well, gosh, Eric, looks like you really have the Christmas spirit! [Cartman bounces around joyously] I know someone who can help. Santa Claus!"
    },
    {
        "character": "Cartman",
        "line": "Really?"
    },
    {
        "character": "Stan, Kyle",
        "line": "Really?"
    },
    {
        "character": "Mr. Hankey",
        "line": "Sure. We should take this stuff to him right away!"
    },
    {
        "character": "Kyle",
        "line": "But how are we gonna get to the North Pole?"
    },
    {
        "character": "Mr. Hankey",
        "line": "Oh, that's no problem! We just need a little Christmas magic. [raises his little arms and stirs up some magic dust. He unleashes it on a manhole cover in the middle of the street, which begins to rumble. The sewer underneath the manhole cover bubbles up and blows the cover off, and the poo spread and swirls around. A small tornado moves from side to side, then clears away, revealing a small train made of poo.] All aboard the Poo Choo Express!"
    },
    {
        "character": "Cartman",
        "line": "Wow!"
    },
    {
        "character": "Stan",
        "line": "Wuh, that smells. [lifts the front of his jacket over his nose]"
    },
    {
        "character": "Kyle",
        "line": "Yeah. [does the same]"
    },
    {
        "character": "Mr. Hankey",
        "line": "Next stop, the North Pole!"
    },
    {
        "character": "Cartman",
        "line": "[grabs the box of holly and mistletoe and heads for the train] Get the rest of the stuff you guys!"
    },
    {
        "character": "Stan",
        "line": "Uh, I don't really wanna get on there. [Cartman stops]"
    },
    {
        "character": "Kyle",
        "line": "Me neither."
    },
    {
        "character": "Cartman",
        "line": "You guys, we have to bring Christmas to those less fortunates! [moves on] Now come on!"
    },
    {
        "character": "Mr. Hankey",
        "line": "Let's go, Poo Choo Train! [pulls on the whistle cord]"
    },
    {
        "character": "Whistle",
        "line": "Poo Choo! [the trains lurches forward and leaves a train of poo behind. Soon it's running smoothly]"
    },
    {
        "character": "Mr. Hankey",
        "line": "Poo Choo Train's layin' down its tracks with a"
    },
    {
        "character": "Whistle",
        "line": "Poo Choo!"
    },
    {
        "character": "Mr. Hankey",
        "line": "All the way and back!"
    },
    {
        "character": "Cartman",
        "line": "Poo Poo Train is my favorite thing, spreading Christmas joy as we ride and sing!"
    },
    {
        "character": "Kyle",
        "line": "Dude, what the hell has gotten into Cartman??"
    },
    {
        "character": "Stan",
        "line": "I don't know."
    },
    {
        "character": "Mr. Hankey",
        "line": "Christmastime wouldn't be the same without hugs and kisses and a Poo Choo Train. [from a view in space, the train is seen making its way to the North Pole]"
    },
    {
        "character": "",
        "line": "South Park. Jimmy is still singing."
    },
    {
        "character": "Jimmy",
        "line": "...and a par-tridge in a... p...pear t...t...tree. On the third day of C...Chrihhh...Chriiii..."
    },
    {
        "character": "",
        "line": "The North Pole. The Poo Choo Train pulls into view, then stops."
    },
    {
        "character": "Mr. Hankey",
        "line": "Here we are, kids. The North Pole. [Stan and Kyle run off the train and put some distance between it and themselves]"
    },
    {
        "character": "Stan",
        "line": "Awww! [both of them release their breath and start coughing]"
    },
    {
        "character": "Kyle",
        "line": "Finally!"
    },
    {
        "character": "Stan",
        "line": "God, it took forever!"
    },
    {
        "character": "Cartman",
        "line": "Wow, is that where Santa lives?"
    },
    {
        "character": "Mr. Hankey",
        "line": "That's it. Santa's Fortress of Solitude. [The fortress is shown in all its icy glory. The boys and Mr. Hankey head for the entrance. Two icy door slide apart and a gnome appears]"
    },
    {
        "character": "Gnome 1",
        "line": "Mr. Hankey!"
    },
    {
        "character": "Mr. Hankey",
        "line": "We need to see Santa right away on urgent Christmas business."
    },
    {
        "character": "Gnome 1",
        "line": "Sure thing!"
    },
    {
        "character": "",
        "line": "The workshop. The group enters. Gnomes are busy everywhere, moving gifts around, decorating Christmas trees."
    },
    {
        "character": "Kyle",
        "line": "Hey. Aren't you guys the underpants gnomes?"
    },
    {
        "character": "Gnome 1",
        "line": "Ten months out of the year. But this time of year we help Santa! [leads the group out of the workshop] Here he is! [the group comes across Santa at his desk reading a list of names]"
    },
    {
        "character": "Santa",
        "line": "[turns around] Ho ho hoo! Merry Christmas!"
    },
    {
        "character": "Stan, Kyle, Cartman",
        "line": "[impressed] Wow!"
    },
    {
        "character": "Mr. Hankey",
        "line": "Howdy ho, Santa!"
    },
    {
        "character": "Santa",
        "line": "[with open arms, approaches] Mr. Hankey, how are you?"
    },
    {
        "character": "Mr. Hankey",
        "line": "All ready for Christmas?"
    },
    {
        "character": "Santa",
        "line": "I was just starting to look over the new naughty and nice list the gnomes prepared for me."
    },
    {
        "character": "Cartman",
        "line": "Oh, heh. Are the uh tabulations all closed up then?"
    },
    {
        "character": "Santa",
        "line": "Oh no, they keep it open until midnight of Christmas Eve. Some kids actually try to cram in a lot of niceness right at the end."
    },
    {
        "character": "Cartman",
        "line": "[brushes it off] Oh, that's so lame of them. [Stan looks at him]"
    },
    {
        "character": "Mr. Hankey",
        "line": "Santa, my friends are trying to do something very special this Christmas. Tell him, Eric."
    },
    {
        "character": "Cartman",
        "line": "[with hands behind his back] Well Santa, it's just that... I was thinking about the people in Iraq who are afraid that we might bomb them and I just thought, well, maybe it wouldn't hurt to send them a little bit of our Christmas spirit as well."
    },
    {
        "character": "Santa",
        "line": "You know you're right. Santa hasn't been to that of the world in a looong time. Perhaps Santa could bring peace to this whole situation."
    },
    {
        "character": "Cartman",
        "line": "That's what I thought."
    },
    {
        "character": "Santa",
        "line": "Gnomes! [the gnomes gather around him] Load up the sleigh with toys! Santa's going to make a special run!"
    },
    {
        "character": "Mr. Hankey",
        "line": "All right!"
    },
    {
        "character": "Santa",
        "line": "And you boys can all watch me from our flight control room."
    },
    {
        "character": "Cartman",
        "line": "Hooray!"
    },
    {
        "character": "",
        "line": "South Park. Jimmy is still singing."
    },
    {
        "character": "Jimmy",
        "line": "...and a par-tridge in a... p...pear tree. On the ...fourth day of C...C...Ca...Chriiiistmas my t-true love g-ge-gave to me-mee..."
    },
    {
        "character": "",
        "line": "The North Pole Flight Control Room. The gnomes and boys enter the room, which is fully decorated in Christmas cheer."
    },
    {
        "character": "Gnome 1",
        "line": "This is Santa's flight control center. From here, we can monitor Santa from satellite as he travels the globe delivering presents."
    },
    {
        "character": "Kyle",
        "line": "Wow, cool!"
    },
    {
        "character": "Mr. Hankey",
        "line": "Hey, it looks like Santa has already made it to Baghdad. [four camera angles show Santa arriving in Baghdad: two side angles, one overhead, one front]"
    },
    {
        "character": "",
        "line": "Baghdad, Iraq. Santa sails over the city."
    },
    {
        "character": "Santa",
        "line": "Ho ho hoo! Merry Christmas, everyone! [the Iraqi adults stop and look up. Two presents drop down before a house, the door opens, and two kids look at the gifts with saucer eyes. They come out and pick up the gifts, grinning brightly. They glance up at Santa, then look back at their gifts] Ho ho hoo! A Merry Christmas to all!"
    },
    {
        "character": "Iraqi man 1",
        "line": "[black beard] Paka klakalaka."
    },
    {
        "character": "Iraqi man 2",
        "line": "[white beard] Anah kakadakadaka."
    },
    {
        "character": "Santa",
        "line": "Merry Christmas! [An Iraqi man shows up with a shoulder-mounted bazooka, aims at Santa, and fires the rocket. The sleigh is hit and Santa loses control of it.] I'm hit! I'm hit! [switch to North Pole]"
    },
    {
        "character": "Gnome 1",
        "line": "Sleigh is hit! I repeat! Sleigh is hit! [switch to Baghdad]"
    },
    {
        "character": "Gnome 2",
        "line": "Ultimate failure at o-sixhundred feet! [the sleigh swings around violently, tossing Santa off. Santa holds on to one of the skids]"
    },
    {
        "character": "Santa",
        "line": "Hold on! [climbs up to the sleigh cab] Sleigh is going down! [switch to North Pole]"
    },
    {
        "character": "Gnome 1",
        "line": "Sleigh is going down! I repeat! Sleigh is going down!"
    },
    {
        "character": "Stan",
        "line": "Hang on, Santa! [switch to Baghdad]"
    },
    {
        "character": "Gnome 3",
        "line": "[heard on the sleigh's radio] Sleigh 1 is going down! We are going down! [more chatter is heard as the sleigh heads for a crash landing. The sleigh strikes the edge of a building's rooftop and knocks away some of the façade]"
    },
    {
        "character": "Gnome 4",
        "line": "[on the sleigh's radio] Don't look down! Don't look down! Repeat! Don't look down! [the sleigh crashes and everyone who's on the ground looks for a place to hide. Presents are spilled all over. The area is soon empty save for Santa and the sleigh. Color vanishes. Switch to North Pole]"
    },
    {
        "character": "Gnome 1",
        "line": "[on the sleigh's radio] We got a red sleigh down. We got a red sleigh down. [Arabic music is heard as the boys look at the devastation] Red Sleigh 1, this is North Pole. [no response. The boys are in shock] Red Sleigh 1, this is North Pole. [no response] Mr. Kringle? [after a moment, turns around]"
    },
    {
        "character": "Gnome 5",
        "line": "Jesus Christ, they killed him!"
    },
    {
        "character": "Cartman",
        "line": "No! Santa Claus can't be dead. He... He can't."
    },
    {
        "character": "Stan",
        "line": "Why would Iraqis do that? Why?"
    },
    {
        "character": "Mr. Hankey",
        "line": "It certainly doesn't seem very Christmasy of them."
    },
    {
        "character": "Santa",
        "line": "[over the radio] North Pole. This is Santa."
    },
    {
        "character": "Mr. Hankey",
        "line": "Santa! Are you alright?"
    },
    {
        "character": "Gnome 2",
        "line": "What is your status?"
    },
    {
        "character": "Santa",
        "line": "[on screen] Sleigh is down. Reindeer... all dead. Both Santa's legs are broken. Santa's... very sad. Santa will have to... oh no. They're coming for me! [the other gnomes begin to stream into the control room] Stay back, you bastards! Stay back! [the communications link is lost]"
    },
    {
        "character": "Stan",
        "line": "Oh no."
    },
    {
        "character": "Cartman",
        "line": "Well what are you gnomes sitting there for?! You have to go rescue him!"
    },
    {
        "character": "Gnome 5",
        "line": "What the hell are we supposed to do?! We're like nine inches tall!"
    },
    {
        "character": "Cartman",
        "line": "[blubbering] Now I'm never gonna get my Haibo robot doll!"
    },
    {
        "character": "Kyle",
        "line": "Is that what this is all about?! [Stan shoots a quizzical stare] You came up with this whole idea so you could get a stupid toy?! [Stan is angry now]"
    },
    {
        "character": "Cartman",
        "line": "It's not stupid! It's a toy that you can starve! If you don't feed it, it dies. It's sooo cool."
    },
    {
        "character": "Stan",
        "line": "Well good going, asshole! Thanks to you, there's not gonna be any Christmas, and there's no one left to help us!"
    },
    {
        "character": "Cartman",
        "line": "Oh, Christ."
    },
    {
        "character": "Stan, Kyle, Cartman",
        "line": "[gasp] Jesus!"
    },
    {
        "character": "Mr. Hankey",
        "line": "Hey, that's right. Jesus can save anybody."
    },
    {
        "character": "Gnome 2",
        "line": "Follow me. You can take Santa's backup sleigh. [walks off. Mr. Hankey, the other gnomes, and the boys follow him]"
    },
    {
        "character": "",
        "line": "South Park City Hall. Jimmy is still singing Twelve Days of Christmas."
    },
    {
        "character": "Jimmy",
        "line": "On the fifth... day... day of... Christmas, [the townsfolk have begun to fall asleep] ...my t-true love gave to... uh... me. Five g-g-g... golden ruh-ring... rings. [one of the mayor's aides falls asleep on her shoulder] Fuhgom... don... t-t... don... four cal...ling buh-irr..."
    },
    {
        "character": "",
        "line": "The North Pole, Fortress of Solitude."
    },
    {
        "character": "Gnome 2",
        "line": "We fed Jesus Christ's data into the autopilot. This sleigh should be able to take you right to him."
    },
    {
        "character": "Stan",
        "line": "I hope so, or else Santa Claus is as good as dead."
    },
    {
        "character": "Gnome 2",
        "line": "Here it is. Red Sleigh 2. [shown with its own team of reindeer]"
    },
    {
        "character": "Cartman",
        "line": "Come on, gang, it's up to us to save Christmas!"
    },
    {
        "character": "Mr. Hankey",
        "line": "Tell Santa's workers to keep making toys. We'll have Santa back in no time!"
    },
    {
        "character": "Kyle",
        "line": "Uhhh, how d- how do we start this thing?"
    },
    {
        "character": "Gnome 2",
        "line": "You just have to call out the reindeer's names."
    },
    {
        "character": "Cartman",
        "line": "Oh yeah! On Dasher, on Prancer, on Comet-"
    },
    {
        "character": "Gnome 2",
        "line": "No, no, they're all dead. You have to call out the new ones. [each reindeer is highlighted as its name is called] On Steven, on Fluffy, on Horace, on Chantel. On Skippy, on Rainbow, on Patches, on Montel. [the reindeer move forward and the sleigh soon rises into the sky] Good luck finding Jesus! [waves goodbye after them]"
    },
    {
        "character": "",
        "line": "The night sky. The boys sail along the winds."
    },
    {
        "character": "Cartman",
        "line": "Wow, look, you guys! We're riding in Santa's sleigh!"
    },
    {
        "character": "Mr. Hankey",
        "line": "We should be able to find Jesus in no time!"
    },
    {
        "character": "Cartman",
        "line": "I'm riding in Santa's sleigh. So high above the trees at Christmastime. With candy-cane wishes and smiles-"
    },
    {
        "character": "Kyle",
        "line": "What are you doing?"
    },
    {
        "character": "Cartman",
        "line": "[looks at Kyle, then lowers his eyelids a bit] I'm having a precious Christmastime moment, Kyle, if you don't mind."
    },
    {
        "character": "Kyle",
        "line": "Singing a Christmas song isn't gonna get you nice deductions, Cartman! Don't forget: it's because of you that Santa's sleigh got shot down!"
    },
    {
        "character": "Cartman",
        "line": "[draws close to Kyle] Hey, it isn't my fault that Iraqis are filled with hate!"
    },
    {
        "character": "Kyle",
        "line": "All I'm saying is that it's gonna take a lot of singing to make up for that!"
    },
    {
        "character": "Cartman",
        "line": "[resumes his position in back of the sleigh and speeds up his song] It's Christmas magic time, inside the sleigh, so high in the sky, eh with candy canes and chimney smiles, eh..."
    },
    {
        "character": "",
        "line": "South Park City Hall. Jimmy is still singing Twelve Days of Christmas. The townsfolk get sleepier."
    },
    {
        "character": "Jimmy",
        "line": "Six geese are laying... fu...five go-oldenh ...uhrings. Fodom... dom... du...du...t...du... Four calling biiirds..."
    },
    {
        "character": "",
        "line": "Baghdad. Santa is being hauled down a hall by three Iraqi soldiers. He's got bruises here and there, a bloody nose, a black eye. They enter a room."
    },
    {
        "character": "Santa",
        "line": "Where are you taking me?? [one soldier seems to order the other two to strap Santa into a chair] You are all being very naughty. [a general enters]"
    },
    {
        "character": "Iraqi general",
        "line": "[soft-spoken] Why you come to Iraq, my main man?"
    },
    {
        "character": "Santa",
        "line": "[a soldier ladles some water onto Santa] To bring happiness and joy to the children."
    },
    {
        "character": "Iraqi general",
        "line": "And this is...? [carries a toy train and dangles a car in front of Santa] This is what you think brings happy? [walks behind Santa] This is material... [thrusts the toy train at Santa over the shoulder] This is commercialism! Your country is sick. Sick! [throws the toy train onto Santa's body and walks away]"
    },
    {
        "character": "Santa",
        "line": "No, your country has just lost all its Christmas spirit. [a soldier approaches and opens Santa's pants.] What's going on here?!"
    },
    {
        "character": "Iraqi general",
        "line": "America wants to bomb my house, my main man. They want to kill my wife and children. We need to know... what is their plan?"
    },
    {
        "character": "Santa",
        "line": "I don't know, I live in the North Pole. [the general leaves, then soon returns with two rods attached to cables. A soldier cranks up the device they're connected to] What are you doing??"
    },
    {
        "character": "Iraqi general",
        "line": "They say that the Chinese were the first to experiment with an electroshock to the testicles."
    },
    {
        "character": "Santa",
        "line": "Oh no. Not Santa's balls! [The general descends on Santa's balls and makes them glow. This part is not shown, save for a shot of Santa's back and a glow coming from the front side. A few seconds later the general removes the rods and rises, and the glow fades. Santa coughs]"
    },
    {
        "character": "Iraqi general",
        "line": "What else is America planning?!"
    },
    {
        "character": "Santa",
        "line": "[coughs some more, spits, and faces the general] I'm gonna fucking kill you!"
    },
    {
        "character": "Iraqi general",
        "line": "You're not in a position to kill anyone, my main man! I just want you to tell me America's plan!"
    },
    {
        "character": "Santa",
        "line": "Then we're in for a long night, because I don't know shit! [the general glances at the soldier, who ratchets the charger up higher. Santa screams in pain]"
    },
    {
        "character": "",
        "line": "An Italian church. Jesus stands at the altar receiving parishioners, blessing them for one thing or another."
    },
    {
        "character": "Jesus",
        "line": "[blessing an elderly man with a few drops of wine] In nome del mio padre, siete guarito. [\"In the name of my Father, you are healed.\"]"
    },
    {
        "character": "Elderly Man",
        "line": "[as he is led away] Benedicali! Benedicali! [\"Bless you! Bless you!\"]"
    },
    {
        "character": "Woman",
        "line": "Jesus, mio bambino no puoi sentirsi. [\"Jesus, my son can't feel himself.\" (he's numb)]"
    },
    {
        "character": "Jesus",
        "line": "[blesses the infant] Il vostro bambino se arguisto. [\"Your son ...\"]"
    },
    {
        "character": "Woman",
        "line": "Bene, Benedicali! [\"Bless, bless you!\" The boys' voices are now heard inside the church and the congregants look around. The sleigh crashes though a window and glass showers down over Jesus and the other people present] La morte rossa! [\"The red death!\" The sleigh alights and stops]"
    },
    {
        "character": "Mr. Hankey",
        "line": "Hooowdy ho! [the churchgoers panic and run out of the church.]"
    },
    {
        "character": "Cartman",
        "line": "Jesus!"
    },
    {
        "character": "Jesus",
        "line": "Stan, Kyle, Mr. Hankey and Eric Cartman. What are you doing here, my children?"
    },
    {
        "character": "Stan",
        "line": "Jesus, Santa's sleigh was shot down over Iraq!"
    },
    {
        "character": "Jesus",
        "line": "Santa? Is he alright?"
    },
    {
        "character": "Kyle",
        "line": "We don't know. They lost all contact with him."
    },
    {
        "character": "Jesus",
        "line": "We have to get him out of there."
    },
    {
        "character": "Mr. Hankey",
        "line": "Do you know a way?"
    },
    {
        "character": "Jesus",
        "line": "Yes. Yes, I think I do. [approaches an ornate cabinet] We need a little Christmas miracle. [slides the door open to reveal an armory. He starts taking out an Uzi] Lock and load! We're goin' in!"
    },
    {
        "character": "",
        "line": "South Park City Hall. Jimmy is still singing Twelve Days of Christmas. The townsfolk get sleepier."
    },
    {
        "character": "Jimmy",
        "line": "On the s...seventh day of Christmas my t...true love..."
    },
    {
        "character": "",
        "line": "The interrogation room. The general continues shock treatment on Santa's balls."
    },
    {
        "character": "Iraqi general",
        "line": "You're a sick capitalist dog, my main man! [jabs the balls again, and Santa howls in pain]"
    },
    {
        "character": "",
        "line": "Baghdad. Jesus, Mr. Hankey, and the boys arrive and sail over the city."
    },
    {
        "character": "Cartman",
        "line": "This is Baghdad? God, what a shithole! [Jesus looks over, Cartman notices] I mean, oh wow, these poor unfortunate people."
    },
    {
        "character": "Gnome",
        "line": "Red Sleigh 2, come in."
    },
    {
        "character": "Stan",
        "line": "We're here."
    },
    {
        "character": "Gnome",
        "line": "You're coming up on the source of the signal. You're right on top of him!"
    },
    {
        "character": "Jesus",
        "line": "He must be in that building below us. Land it on the roof, Mr. Hankey."
    },
    {
        "character": "Mr. Hankey",
        "line": "Howdy ho, Jesus. [the sleigh lands and a rooftop door opens.]"
    },
    {
        "character": "Soldier 1",
        "line": "[clean-shaven] Gankueda!"
    },
    {
        "character": "Jesus",
        "line": "[steps off the sleigh and holds his arms up] Wait here, I can handle this."
    },
    {
        "character": "Soldier 2",
        "line": "[bearded] Kinkeda? Kinkakueda!"
    },
    {
        "character": "Jesus",
        "line": "Yay, look upon me, and know me."
    },
    {
        "character": "Soldier 1",
        "line": "Halak balah!"
    },
    {
        "character": "Soldier 2",
        "line": "Kli malah!"
    },
    {
        "character": "Jesus",
        "line": "My children, you should know something. [a dagger shoots out and gets into position by his left arm] I'm packing. [quickly jabs the clean-shaven soldier in the throat, and the soldier gags to death. A gun with silencer descends along Jesus' right arm. He takes that and quickly kills the bearded soldier. He calls out to the others on the sleigh] Let's go! [Mr. Hankey and the boys leave the sleigh]"
    },
    {
        "character": "Cartman",
        "line": "This is such a magical Christmas adventure, you guys."
    },
    {
        "character": "",
        "line": "South Park City Hall. Jimmy is still singing Twelve Days of Christmas. The townsfolk get sleepier."
    },
    {
        "character": "Jimmy",
        "line": "On the el- el- el- eleventh day of C- Christmas my t...true love gave to me, e-eleven p-p-pipers p-pu-p-piping..."
    },
    {
        "character": "",
        "line": "The interrogation room. The general is now making Santa swallow a can of oil."
    },
    {
        "character": "Iraqi general",
        "line": "Drink it! Drink the oil! This is all you Western capitalists want! [Jesus bursts through the door.]"
    },
    {
        "character": "Santa",
        "line": "Jesus Christ! [Jesus kills the soldier at the charging station, then the other soldier. The general holds up his hands. Jesus shoots him on the left know and he falls.]"
    },
    {
        "character": "Iraqi general",
        "line": "Ach!"
    },
    {
        "character": "Santa",
        "line": "Oh! Thank! Thank God for you, Jesus! [Jesus walks up to Santa and unties him]"
    },
    {
        "character": "Jesus",
        "line": "Here. [hands him a gun] Can you walk?"
    },
    {
        "character": "Santa",
        "line": "Santa's legs are broken. [Jesus moves his hands over them, then steps back]"
    },
    {
        "character": "Jesus",
        "line": "They are healed. [walks off. Santa follows, but turns around to face the general, who is cowering now. Santa fixes his gaze on the general and aims the gun. After a few intense moments Santa moves the gun off and fires twice. Jesus comes up behind Santa] Santa..."
    },
    {
        "character": "Santa",
        "line": "I just couldn't do it. [Santa didn't miss after all. The general got one bullet to the brain, another one that split his head open] I just couldn't let him live. He shocked Santa's balls! [sirens go off]"
    },
    {
        "character": "Mr. Hankey",
        "line": "More soldiers are coming!"
    },
    {
        "character": "Jesus",
        "line": "Let's move. Move!"
    },
    {
        "character": "",
        "line": "South Park City Hall. Jimmy is still singing Twelve Days of Christmas."
    },
    {
        "character": "Jimmy",
        "line": "Eight... maids are... milking..."
    },
    {
        "character": "",
        "line": "A hallway. Jesus leads the others out."
    },
    {
        "character": "Jesus",
        "line": "[stops at the foot of a stairway and turns around] Get up the stairs! The sleigh is on the roof! [a soldier comes down the stairs]"
    },
    {
        "character": "Kyle",
        "line": "Jesus, behind you! [Jesus looks at the boys. The soldier shoots Jesus in the back]"
    },
    {
        "character": "Stan, Kyle, Cartman",
        "line": "[in slow motion] Jesus! [in slow motion, Jesus wobbles a bit and then falls]"
    },
    {
        "character": "Santa",
        "line": "[in slow motion] No! [fires away with his gun, killing the soldier. He then approaches Jesus and holds him] Jesus. Jesus! [Jesus stammers, but nothing comes out of his mouth] No... don't worry, Jesus, it's nothing. It's just a scratch."
    },
    {
        "character": "Jesus",
        "line": "You're a... bad liar. [the boys are speechless] Hey. B-but we sure gave them one hell of a fight, huh?"
    },
    {
        "character": "Santa",
        "line": "We sure did, Jesus."
    },
    {
        "character": "Stan",
        "line": "[finding his voice] Dude, this is pretty fucked up right here."
    },
    {
        "character": "Jesus",
        "line": "Uh Santa?"
    },
    {
        "character": "Santa",
        "line": "[quickly answers] I'm here, Jesus."
    },
    {
        "character": "Jesus",
        "line": "Don't... don't ever... let them take away... our... Christmas spirit. [Jesus takes his last breath and expires. His halo disappears]"
    },
    {
        "character": "Stan",
        "line": "Oh my God. Iraqis killed Jesus."
    },
    {
        "character": "Kyle",
        "line": "You bastards. [behind them, soldiers mass at the other end of the hall]"
    },
    {
        "character": "Santa",
        "line": "[with a gun on each arm] Come on, kids! [turns around and rushes up the stairs. The kids follow]"
    },
    {
        "character": "",
        "line": "The building's rooftop. Santa leads the boys out while firing at the pursuing Iraqi soldiers."
    },
    {
        "character": "Santa",
        "line": "Get to the sleigh! Get to the sleigh! [the boys run by screaming as Santa mows the soldiers down with both semiautomatics. More soldiers pour out, more bodies pile up. The boys sit down in the sleigh, and Stan and Kyle take the reins]"
    },
    {
        "character": "Mr. Hankey",
        "line": "Start the sleigh!"
    },
    {
        "character": "Stan",
        "line": "Uh, on Steven, on Fluffy, on Horace, on Chantel. Uhh..."
    },
    {
        "character": "Kyle",
        "line": "On Skippy, on Rainbow, on Patches, on Montel. [the sleigh begins to move forward and Santa runs out of ammo. He drops the guns and heads for the moving sleigh. He hops in and the remaining soldiers fire at the departing sleigh. The sleigh goes up and away]"
    },
    {
        "character": "Cartman",
        "line": "Look at me, I'm riding high in Santa's sleigh. It's Christmas special time for me-"
    },
    {
        "character": "Kyle",
        "line": "Oh shut up, Cartman! Your Sweet Christmas act isn't fooling anybody!"
    },
    {
        "character": "Cartman",
        "line": "Eh, it's not an act, Kyle! All I wanted was for these people to understand what Christmas means."
    },
    {
        "character": "Santa",
        "line": "You're right, kid. [turns the sleigh around]"
    },
    {
        "character": "Mr. Hankey",
        "line": "What are you doin', Santa?"
    },
    {
        "character": "Santa",
        "line": "I came to bring Christmas to Iraq and by God I'm gonna do it! [presses a button on his dashboard.]"
    },
    {
        "character": "",
        "line": "Panels on either side of the sleigh body open up to reveal bombs and a controller rises up in front of Santa. He releases the reins and fires a rocket. It heads for a building and Iraqis move out of the way. It hits its target, but instead of destroying it, the bomb decorates the building in Christmas cheer. Strings of lights decorate the windows and a Christmas tree appears at the door. \"Joy To The World\" plays as snow comes down from the sky. The Iraqis approach in wonder."
    },
    {
        "character": "Santa",
        "line": "Hohoho! Merry Christmas! [the sleigh sails above a street and Santa strafes the buildings on either side with more bombs. Each of the buildings is decorated with lights and Christmas trees, and presents appear under the trees. The sleigh goes down another street and bombs another building. It too is decorated]"
    },
    {
        "character": "Soldier",
        "line": "[directing another soldier with a bazooka ready to fire] Dakadaka!"
    },
    {
        "character": "Stan",
        "line": "RPG, four o'clock!"
    },
    {
        "character": "",
        "line": "Santa activates a laser, which rises over the boys and fires at the soldier's bazooka. It becomes a giant candy cane. The soldiers are surprised. Santa fires at a group of people holding baskets of bread and a woman holding a chicken. The baskets become gifts, while the chicken becomes a large gingerbread man. A rifle in one man's hands becomes a Christmas wreath."
    },
    {
        "character": "Mr. Hankey",
        "line": "Boy, things are starting to look Christmasy now!"
    },
    {
        "character": "Santa",
        "line": "Merry Christmas! Hohoho!"
    },
    {
        "character": "",
        "line": "Santa makes another pass down a decorated street and drops five more bombs. They leave behind five snowmen. The Iraqis are surprised and confused by all these presents. The kids are terribly pleased with theirs."
    },
    {
        "character": "Santa",
        "line": "Merry Christmas to all, and to all a good night! Hohohohoho!"
    },
    {
        "character": "",
        "line": "South Park City Hall. Jimmy is still singing Twelve Days of Christmas. The mayor's assistants are asleep and the mayor is getting sleepy."
    },
    {
        "character": "Jimmy",
        "line": "And a p-p-par-tridge in a p-peeeaaar treeee. [a moment of silence follows. No more is heard from Jimmy]"
    },
    {
        "character": "Mayor McDaniels",
        "line": "That's it? That's it! The song's over! We can light the tree! [heads for the dais. Her aides follow. The townsfolk rouse themselves.]"
    },
    {
        "character": "Townsfolk",
        "line": "[cheering heartily] Hurrah! Woohoo! Yay!"
    },
    {
        "character": "Jimbo",
        "line": "Oh, finally!"
    },
    {
        "character": "Mayor McDaniels",
        "line": "Go on, Jimmy! There's only five more seconds until Christmas! [hands him the detonator by which to light the tree. The townsfolk are glad with anticipation, making fists. Jimmy lowers the trigger, the tree lights up and goes dark, and then a bulb explodes]"
    },
    {
        "character": "Townsfolk",
        "line": "Awwww!"
    },
    {
        "character": "Randy",
        "line": "Christmas is ruined again! [they begin to disperse, but jingle bells stop them in their tracks]"
    },
    {
        "character": "Santa",
        "line": "[heard over the jingle bells] Ho ho ho! [Santa flies over the gathering and drops a bomb on the tree. It blazes forth with bright lights]"
    },
    {
        "character": "Townsfolk",
        "line": "WOW!!! [cheering and applause follow. The sleigh lands and the occupants disboard]"
    },
    {
        "character": "Randy",
        "line": "Stan!"
    },
    {
        "character": "Sheila",
        "line": "Kyle!"
    },
    {
        "character": "Kyle",
        "line": "[runs up to his parents] Mom! Dad! We rode on Santa's sleigh!"
    },
    {
        "character": "Stan",
        "line": "[runs up to his parents] We brought Christmas to Iraq!"
    },
    {
        "character": "Santa",
        "line": "[approaches the dais] Everyone! Everyone, can I please have your attention? [Cartman approaches his mom; they hug each other] Christmas is a very special time of year, but... this year it almost didn't happen. There's a man named Jesus who gave his life to save me. And so I declare that every year on Christmas Day, we should remember Jesus for what he did, and thank him for it. From now on, Christmas will be a day for remembering a brave man named Jesus."
    },
    {
        "character": "Townsfolk",
        "line": "[cheering heartily] Hooray!"
    },
    {
        "character": "Santa",
        "line": "Now, if you'll all excuse me, I've got a lot of work to do. [leaves the dais]"
    },
    {
        "character": "Mr. Hankey",
        "line": "I'll help you, Santa!"
    },
    {
        "character": "Santa",
        "line": "[gets into his sleigh and looks over at the boys] Oh, and boys, you might want to check under the Christmas tree. [the boys are surprised, then happy. Stan leads them to the presents. Santa takes the sleigh off the ground and away] Ho ho ho! Merry Christmas! [the boys reach their presents and check them over. For a moment they look like the Iraqi kids. Their looks change back to normal as they rip off the wrapping. They all get the same gift]"
    },
    {
        "character": "Stan",
        "line": "Wow! Look, you guys! Santa got us all Haibo dolls! [Cartman's joy vanishes]"
    },
    {
        "character": "Cartman",
        "line": "Oh, God-damnit!"
    },
    {
        "character": "Kyle",
        "line": "Cartman, I thought all you wanted was a Haibo doll!"
    },
    {
        "character": "Cartman",
        "line": "Yeah, but not if you guys have one, too! Now it's worthless and gay! God-damnit I'll never try to be nice again! [kicks the toy away. The camera zooms out enough for a fourth person to walk into the shot]"
    },
    {
        "character": "Stan",
        "line": "Well, all in all, I have to say this was a pretty special Christmas. [Kenny walks into the frame.]"
    },
    {
        "character": "Kenny",
        "line": "(Hey guys. What's goin' on?)"
    },
    {
        "character": "Stan",
        "line": "Oh, hey Kenny."
    },
    {
        "character": "Kyle",
        "line": "Dude, where have you been?"
    },
    {
        "character": "Kenny",
        "line": "(Oh, I've just been hanging out.)"
    },
    {
        "character": "Kyle",
        "line": "Well come on! We gotta tell you what happened. I'm sure glad it's over with. [walks away with his Haibo doll. Stan follows with his Haibo doll, and Cartman follows with an angry look]"
    },
    {
        "character": "Stan",
        "line": "Yeah, but I feel like things are finally back to normal."
    },
    {
        "character": "Kenny",
        "line": "(Yeah.)"
    }
]