[
    {
        "character": "",
        "line": ""
    },
    {
        "character": "",
        "line": "South Park Elementary, day. A new classroom. As the camera follows a new teacher around, the following kids are seen working with clay. Clyde presses the pottery wheel pedal as Bebe molds a vase on the wheel. Wendy watches. Tweek, Red, and Pip work on clay on the table near the wall. In the foreground, Tolkien presses the pottery wheel pedal as Annie molds a vase. Butters, Kevin, and Francis work on their own projects. Kenny, Stan, Kyle, and Cartman are laughing at their project, which didn't require the use of the pottery wheel."
    },
    {
        "character": "Teacher",
        "line": "[walks through the class] Okay. Good, children, good. Remember to feel the clay. Be one with the clay. Nice. Uh huh. [the boys still laugh at their monument]"
    },
    {
        "character": "Cartman",
        "line": "[laughing] Put more clay on the balls."
    },
    {
        "character": "Teacher",
        "line": "[noticing] Boys! [they stop laughing as she points] What is that?"
    },
    {
        "character": "Kyle",
        "line": "A reindeer?"
    },
    {
        "character": "Teacher",
        "line": "You know, I've had it! You four boys never take art class seriously!"
    },
    {
        "character": "Cartman",
        "line": "[retorts] What a crime. [the three others chuckle, then laugh out loud]"
    },
    {
        "character": "Teacher",
        "line": "[displeased, with arms crossed] You think art is not important?"
    },
    {
        "character": "Stan",
        "line": "Weelll, art is just kinda... for gaywads."
    },
    {
        "character": "Butters",
        "line": "[pipes up] I love art class!"
    },
    {
        "character": "Stan",
        "line": "See?"
    },
    {
        "character": "Teacher",
        "line": "[reaches for their creation and grabs it by the shaft] Do you think this is funny?! [shakes it around for effect] Do you think this is funny, huh?! [ends up looking at the head, as if she's about to suck on it. The boys cover their mouths to hold their laughter, knowing how she looks with their creation like that, but soon they burst out laughing. The teacher now cradles the project] Well, you four can just spend your afternoon after school here making new pottery! [the laughter stops and the boys' jaws drop.]"
    },
    {
        "character": "Cartman",
        "line": "You can't do that!"
    },
    {
        "character": "Teacher",
        "line": "I certainly can! I'm your teacher!"
    },
    {
        "character": "Cartman",
        "line": "You're an art teacher!"
    },
    {
        "character": "Teacher",
        "line": "Make it two hours!"
    },
    {
        "character": "",
        "line": "Cut to after school in detention. The art teacher sits at her desk watching over the boys work on a proper vase on the pottery wheel. Kyle is pressing the pedal. The boys are angry at their teacher"
    },
    {
        "character": "Stan",
        "line": "Mrs. Streibel thinks she's so cool!"
    },
    {
        "character": "Kyle",
        "line": "How dare she talk to us like that?!"
    },
    {
        "character": "Kenny",
        "line": "(Yeah, how the fuck is that?!)"
    },
    {
        "character": "Cartman",
        "line": "We can't let her get away with this! [voicing dropping to almost a whisper] I think tonight we need to do something drastic."
    },
    {
        "character": "Stan",
        "line": "Like what?"
    },
    {
        "character": "Cartman",
        "line": "Like find out where Mrs. Streibel lives, and go over there, and... TP her house."
    },
    {
        "character": "Kenny",
        "line": "(Yeah!)"
    },
    {
        "character": "Kyle",
        "line": "TP her house?"
    },
    {
        "character": "Cartman",
        "line": "Toilet paper! Cover her house in toilet paper."
    },
    {
        "character": "Kyle",
        "line": "Oh."
    },
    {
        "character": "Cartman",
        "line": "[sensing Kyle's reluctance] What's the matter, Kyle? You chicken? [begins strutting like a chicken and making chicken noises. Kyle kicks Cartman in the balls in anger] Ugh! [drops to his knees, then gets one leg up]"
    },
    {
        "character": "Teacher",
        "line": "Quiet, boys. This isn't playtime, you're being punished!"
    },
    {
        "character": "Stan",
        "line": "[glares back at her, then softly] Fine! But we'll have the last laugh tonight, art-whore!"
    },
    {
        "character": "Cartman",
        "line": "[in pain] Yeah! Payback time, you ugly skank!"
    },
    {
        "character": "",
        "line": "Henry's Supermarket, day. A woman watches her son ride in a coin-operated ride outside the store. Inside, the four boys approach checkout line 3 with two carts stacked high with packages of Kush Tush toilet paper."
    },
    {
        "character": "Stan",
        "line": "D'you think that's enough?"
    },
    {
        "character": "Cartman",
        "line": "Should be fine."
    },
    {
        "character": "Kyle",
        "line": "Don't you guys think this is a little suspicious? We should buy something else so it doesn't look obvious."
    },
    {
        "character": "Cartman",
        "line": "Okay. [reaches behind the other boys and grabs something] Here we go, pack of chewing gum. [tosses it into the first cart. They approach the cash register]"
    },
    {
        "character": "Cashier",
        "line": "Hello boys. Find everything you need?"
    },
    {
        "character": "Cartman",
        "line": "Yep. All set."
    },
    {
        "character": "Cashier",
        "line": "[begins scanning the packages] Mkay', let's see here. Toilet paper [\"beep\" $1.50 for a four-pack] Toilet paper [\"beep\"] Toilet paper [\"beep\"] Toilet paper [\"beep\"] Toilet paper [\"beep\"] So, what are you kids up to tonight? [\"beep\"]"
    },
    {
        "character": "Cartman",
        "line": "Oh, we're just gonna watch some TV, maybe play a board game."
    },
    {
        "character": "Cashier",
        "line": "Nice relaxing night at home, huh? Toilet paper [\"beep\"] Toilet paper [\"beep\"] Aaand toilet paper [\"beep.\" He picks up the gum] Eh, hey. [holds up the gum] Now you kids be careful with this chewing gum. Don't go sticking it under tables."
    },
    {
        "character": "Stan",
        "line": "Okay"
    },
    {
        "character": "Cashier",
        "line": "Okay. Toilet paper [\"beep\"] Toilet paper [\"beep\"] Toilet paper [\"beep.\"] You know, son, I remember you comin' in last week and buying this much toilet paper. [\"beep\"]"
    },
    {
        "character": "Cartman",
        "line": "Heh yeah, that that's right."
    },
    {
        "character": "Cashier",
        "line": "... Toilet paper [\"beep\"] Toilet paper [\"beep\"]"
    },
    {
        "character": "Kyle",
        "line": "You TP'ed a house last week, Cartman?"
    },
    {
        "character": "Cartman",
        "line": "No. Last Thursday night was fajitas night."
    },
    {
        "character": "Kyle",
        "line": "Oh. [flashes disgust] Uuugh."
    },
    {
        "character": "",
        "line": "Mrs. Streibel's house, later, that night. The boys walk up to the house carrying black trash bags of toilet paper."
    },
    {
        "character": "Stan",
        "line": "Is this the right house?"
    },
    {
        "character": "Cartman",
        "line": "It's the right address-wait! Look there! [the teacher prepares the dining-room table] There's Mrs. Streibel! This is the place. [loosens the drawstring on his back and lets the sides fall away. In the dining room, a boy and girl arrive and sit at table]"
    },
    {
        "character": "Kyle",
        "line": "Oh wait, wait, there's kids inside."
    },
    {
        "character": "Cartman",
        "line": "So?"
    },
    {
        "character": "Kyle",
        "line": "So we're not TP'ing a house with kids inside it!"
    },
    {
        "character": "Stan",
        "line": "Kyle, we all agreed to do this!"
    },
    {
        "character": "Kyle",
        "line": "We didn't say nothin' about no kids, man!"
    },
    {
        "character": "Cartman",
        "line": "Kyle, you're being an asshole! Now let's do this thing and get out of m'yeah. [takes out a roll and advances a bit] Here's what I think of your art class, you God-damned bitch! [unleashes the first roll]"
    },
    {
        "character": "Kenny",
        "line": "(Yeah! Fuck you!)"
    },
    {
        "character": "",
        "line": "Majestic music plays as Kenny unleashes his roll. Stan unleashes a roll. Cartman tosses off another one and grins. More rolls of paper fly onto the roof. Kyle tosses up a roll, unsure of doing so. Stan unleashes another one, and his glee is unabashed. Kenny tosses off another one. More and more rolls fly over the roof. Kyle freezes in awe of their vandalism. Toilet paper covers the house, the garage, and the trees around the house. The boys head for the sidewalk."
    },
    {
        "character": "Cartman",
        "line": "Come on, let's go! [he and Kenny cross the road and drop down to a ditch on the other side. Stan follows]"
    },
    {
        "character": "Kyle",
        "line": "What have we done? [Stan looks back and gets Kyle]"
    },
    {
        "character": "Stan",
        "line": "Let's go, Kyle! [drags him off. Kyle is transfixed for a bit, then turns to follow Stan. A last shot of the house, and then the boys reach their bus stop gasping for air.]"
    },
    {
        "character": "",
        "line": "The bus stop"
    },
    {
        "character": "Kyle",
        "line": "We're, we're in trouble. We're in sooo much trouble."
    },
    {
        "character": "Cartman",
        "line": "Aw man, that was sooo awesome! [smiles]"
    },
    {
        "character": "Kyle",
        "line": "How can you say that? Did you see what we did to their house?! It'll take them days to clean that up!"
    },
    {
        "character": "Cartman",
        "line": "Who cares??"
    },
    {
        "character": "Kyle",
        "line": "Well, YOU don't, because you're a non-caring asshole, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Me?? [takes a couple steps forward] There's toilet paper on your hands, too, Kyle. [Kyle blanches]"
    },
    {
        "character": "Stan",
        "line": "Cartman's right, Kyle. We're all in this together."
    },
    {
        "character": "",
        "line": "Kyle's house, after bedtime. Kyle's room. He is asleep, but begins to have nightmares."
    },
    {
        "character": "Kyle",
        "line": "Noo! No. [visions of flying toilet paper fill his head.] Noo! [an image of Mrs. Streibel's house being vandalized further, then of Mrs. Streibel running in horror.]"
    },
    {
        "character": "Mrs. Streibel",
        "line": "AAAAAAAAA!"
    },
    {
        "character": "Mr. Streibel",
        "line": "Honey, what is it?? Oh, Jesus no! Our house!"
    },
    {
        "character": "Streibel daughters",
        "line": "[crying] Mommy! Mommy!"
    },
    {
        "character": "Mr. Streibel",
        "line": "[with her family around her] Whyyy? Whyyy?"
    },
    {
        "character": "Kyle",
        "line": "[wakes up, startled] Ah! Oh God! Oh God!"
    },
    {
        "character": "",
        "line": "South Park Elementary, next day. The kids are in their regular classroom chatting, waiting for class to begin."
    },
    {
        "character": "Butters",
        "line": "Hey, uh, you guys here what happened last night? Mrs. Streibel's house got covered with toilet paper."
    },
    {
        "character": "Clyde",
        "line": "Yeah. They say it's gonna take three weeks to get it all down."
    },
    {
        "character": "Cartman",
        "line": "Yeah? Well, Ol' Mrs. Streibel probably had it comin' to her."
    },
    {
        "character": "Butters",
        "line": "I don't know. I don't think anybody deserves that kind of brutality."
    },
    {
        "character": "Cartman",
        "line": "Well, I understand the people who did it weren't caught, so-o... Looks like nobody will ever know the geniuses who masterminded that perfect crime. [the bell rings and Mr. Garrison enters with some books.]"
    },
    {
        "character": "Mr. Garrison",
        "line": "Okay children, let's take our seats. Oh, uh, Stan, Kyle, Eric, and Kenny, the counselor wants to see you in his office, now."
    },
    {
        "character": "Cartman",
        "line": "[snaps his fingers] Damn!"
    },
    {
        "character": "Kyle",
        "line": "Oh God!"
    },
    {
        "character": "",
        "line": "Outside the counselor's office. The boys sit on chairs next to the door - the bench is gone. Kyle looks around nervously."
    },
    {
        "character": "Kyle",
        "line": "How the hell did they find out it was us that TP'ed that house?"
    },
    {
        "character": "Cartman",
        "line": "Will you relax, Kyle?! They have nothing on us! As long as we all stick to our story, we'll be fine."
    },
    {
        "character": "Stan",
        "line": "We'd better go over our story again so we don't screw it up."
    },
    {
        "character": "Cartman",
        "line": "Okay. Last night, all four of us were at the bowling alley until about 7:30, at which time we noticed Ally Sheedy, the Goth chick from the Breakfast Club, was bowling in the lane next to us, and we asked her for her autograph, but she didn't have a pen, so we followed her out to her car, but on the way we were accosted by five Scientologists who wanted to give us all personality tests, which were administered at the Scientology Center in Denver until 10:45, at which time we accidentally boarded the wrong bus home and ended up in Rancho de Burritos Rojos, south of Castle Rock, and finally got a ride home with a man who was missing his left index finger, named Gary Bushwell, arriving home at 11:46."
    },
    {
        "character": "Kyle",
        "line": "I'm confused. Did Ally Sheedy take that personality"
    },
    {
        "character": "Stan",
        "line": "Yes, dude!"
    },
    {
        "character": "Cartman",
        "line": "Kyle, it's very simple: we followed Ally Sheedy out to her car, but on the way we were accosted by five Scientologists who wanted to give us all personality tests, which were administered at the Scientology Center in Denver until 10:45, at which time we accidentally boarded the wrong bus home and ended up in Rancho de Burritos Rojos, south of Castle Rock, and finally got a ride home with a man who was missing his left index finger, named Gary Bushwell, arriving home at 11:46, you got it??"
    },
    {
        "character": "Kyle",
        "line": "Ah, Ah I, ah I thought..."
    },
    {
        "character": "Cartman",
        "line": "[exasperated] Oh, for Christ's sake!"
    },
    {
        "character": "Stan",
        "line": "Look, Kyle, just let Cartman do all the talking, okay? He's better at being in trouble than anybody."
    },
    {
        "character": "Cartman",
        "line": "Thank you, Stan. [the doorknow begins to turn] Sh sh, here they come, here they come. [the door opens and Mr. Mackey appears] \"And so I said, 'That's a terrific joke, Wendy. Tell us another one.'\" Oh, hello, Mr. Mackey. Are you ready to see us now?"
    },
    {
        "character": "Mr. Mackey",
        "line": "We're gonna talk to you one at a time, boys, m'kay? Kenny, will you step into my office, please?"
    },
    {
        "character": "Kenny",
        "line": "(Me??)"
    },
    {
        "character": "Mr. Mackey",
        "line": "Come on, Kenny, let's go, 'k? [Kenny hops off and enters the office, and Mr. Mackey closes the door. The other boys' jaws drop a bit.]"
    },
    {
        "character": "Cartman",
        "line": "Touchй, Mr. Mackey, touchй."
    },
    {
        "character": "Kyle",
        "line": "Why are they doing us one at a time?"
    },
    {
        "character": "Cartman",
        "line": "They want to see if we mix the story up, and see if someone will rat out the other three for a better deal."
    },
    {
        "character": "Kyle",
        "line": "[brightens up] I can get a better deal?"
    },
    {
        "character": "Cartman",
        "line": "Kyle, so help me God, if you Jew us out on this one, I will fucking kill you!"
    },
    {
        "character": "",
        "line": "The Streibel house. Mr. Streibel is removing the toilet paper from the trees and house with a broom. He's already filled two trash bags of toilet paper and is filling a third."
    },
    {
        "character": "Mr. Streibel",
        "line": "There we go. That should be about the last of it. [Officer Barbrady passes by with police tape, stretching it out from tree to tree. The camera pulls back to show the house is also covered in police tape] Ex- excuse me, uh, wha-what are you doing?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Crime scene investigation! [pulls out a small tape recorder and starts speaking into it] There are several footprints in the snow. Perhaps more than one perpetrator? [turns it off]"
    },
    {
        "character": "Mr. Streibel",
        "line": "Ah... look, we really don't wanna make a big deal out of this."
    },
    {
        "character": "Officer Barbrady",
        "line": "[noticing the trash bags] Is that the toilet paper there? I'll need to take those bags as evidence."
    },
    {
        "character": "Mr. Streibel",
        "line": "Look it's just not that big a deal, I mean, I toilet-papered houses myself when I was a kid."
    },
    {
        "character": "Officer Barbrady",
        "line": "You?! So where were you last night at around 9?!"
    },
    {
        "character": "Mr. Streibel",
        "line": "I was here."
    },
    {
        "character": "Officer Barbrady",
        "line": "Aha!! Got you!"
    },
    {
        "character": "Mr. Streibel",
        "line": "Officer, why would I TP my own house?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Insurance?"
    },
    {
        "character": "Mr. Streibel",
        "line": "It wasn't me, okay? Now, if you don't mind, I just wanna get my yard back to normal."
    },
    {
        "character": "Officer Barbrady",
        "line": "[grabs him by the collar] Now you listen to me! Whoever TP'ed your house is still out there roaming the streets. It's only a matter of time before another house and another family is victimized! I have to stop that from happening."
    },
    {
        "character": "Mr. Streibel",
        "line": "You really have nothing better to do, do you?"
    },
    {
        "character": "Officer Barbrady",
        "line": "No I do not."
    },
    {
        "character": "",
        "line": "Kyle's house, after bedtime. Kyle's room. He is asleep, but the nightmares return."
    },
    {
        "character": "Kyle",
        "line": "Noo! No. [visions of flying toilet paper fill his head.] Noo! [an image of Mrs. Streibel's house being vandalized further, then of Mrs. Streibel running in horror.]"
    },
    {
        "character": "Mrs. Streibel",
        "line": "AAAAAAAAA!"
    },
    {
        "character": "Mr. Streibel",
        "line": "Oh, Jesus no! Our house!"
    },
    {
        "character": "Streibel daughters",
        "line": "[crying] Mommy! Mommy!"
    },
    {
        "character": "Nancy Kerrigan",
        "line": "[being treated on the ice rink] Whyyy? Whyyy? Whyyy?"
    },
    {
        "character": "Kyle",
        "line": "[wakes up, startled] Oh God! Oh God! I have to tell the truth! [hops off the bed and runs to the bedroom door] Mooooomm! [opens the door and finds Cartman in the hallway]"
    },
    {
        "character": "Cartman",
        "line": "[in rave tones] Hello, Kyle. Going somewhere?"
    },
    {
        "character": "Kyle",
        "line": "I was... I was just going to get a drink of water."
    },
    {
        "character": "Cartman",
        "line": "No need. I have one for you right here. [presents a glass of water to him]"
    },
    {
        "character": "Kyle",
        "line": "[takes the glass] Oh. Okay. Thanks."
    },
    {
        "character": "Cartman",
        "line": "Is there anything else I can get for you?"
    },
    {
        "character": "Kyle",
        "line": "Noo, I'll just... be... going back to bed now."
    },
    {
        "character": "Cartman",
        "line": "You do that. Goodnight, Kyle. [closes the door]"
    },
    {
        "character": "",
        "line": "Park County Juvenile Hall, day. Inside, the warden leads Officer Barbrady to Cell Block 4."
    },
    {
        "character": "Warden",
        "line": "Josh Meyers TP'ed over six hundred houses in less than a year. [fumbles for his keys.] He's a real monster."
    },
    {
        "character": "Officer Barbrady",
        "line": "I just need to talk to someone who knows how toilet paperers think."
    },
    {
        "character": "Warden",
        "line": "Just remember: he'd toilet-paper you in a second if he had the chance. [finally opens the door] He's the last cell on your left. [Barbrady enters and finds himself in an old part of the Hall. He walks past the prisoners and arrives at Josh's cell. It is a brick cell with a thick glass wall where prison bars would normally be. Holes in the glass allow for conversation. Josh has paintings of toilet paper around the cell.]"
    },
    {
        "character": "Officer Barbrady",
        "line": "Hello, Josh. My name is Officer Barbrady. I'm with the South Park police."
    },
    {
        "character": "Josh",
        "line": "[affecting a Hopkins accent] That's a terrible cologne you're wearing, officer. You should try something more... casual."
    },
    {
        "character": "Officer Barbrady",
        "line": "I was hoping you could help me solve a toilet-papering case?"
    },
    {
        "character": "Josh",
        "line": "And why would I do that? Because I'm such a charming fella?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Uh please, I need your help. What would you want in return?"
    },
    {
        "character": "Josh",
        "line": "[turns away] Due to the harsh nature of my crimes they don't allow me to have toilet paper in my cell. You can imagine how bothersome that becomes."
    },
    {
        "character": "Officer Barbrady",
        "line": "You... know I can't give you toilet paper, Josh."
    },
    {
        "character": "Josh",
        "line": "[turns back] No, but it was worth a try, wasn't it? [a closeup of Josh's face] Tell me something, officer: why is it that you police such a small town. You must have had larger inspirations. What happened to those... big-city dreams?"
    },
    {
        "character": "Officer Barbrady",
        "line": "[reflecting] Well, that's kind of personal."
    },
    {
        "character": "Josh",
        "line": "[extreme closeup] Quid pro quo, officer. Tell me what I want to know. And I'll help you catch whoever toilet-papered that house."
    },
    {
        "character": "Officer Barbrady",
        "line": "Look kid, I have very little time to catch whoever toilet-papered that house. Tell me what you know."
    },
    {
        "character": "Josh",
        "line": "Are those the crime scene photos? Let me see them. [approaches the drop slot as Barbrady slides the packet of photos in, then walks back and takes them out for review.] Yes. Yes. Not bad work, not bad at all. These toilet-paperers are professionals...at least one of them is."
    },
    {
        "character": "Officer Barbrady",
        "line": "So you think there was more than one. Why?"
    },
    {
        "character": "Josh",
        "line": "[puts the photos behind his back] Tell me something first. When you went to the academy you had something to prove. You wanted to protect and serve, but mostly you wanted to protect yourself. Who were you protecting yourself from, Officer Barbrady?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh all right, all right, my uncle Charles used to hit me with a belt! [cries uncontrollably]"
    },
    {
        "character": "Josh",
        "line": "[closes his eyes, satisfied.] Thank you. Your toilet-paperers are most like males between the ages of 8 and 10 and probably virgins. Parents notice that much toilet paper missing, so they would have to have bought it themselves. Find out where the toilet paper came from, officer, and you just might catch your man."
    },
    {
        "character": "",
        "line": "South Park Elementary, day. Kids are moving towards their classes, passing each other in the process. Stan and Kenny are talking with Clyde, Craig, and Kevin."
    },
    {
        "character": "Cartman",
        "line": "Stan, Kenny, can I talk to you guys for a second? [Stan waves bye to Clyde, Craig, and Kevin, and they leave. He and Kenny approach Cartman talks in hushed tones] I think we have the counselor and the principal fooled, but we need to talk about Kyle."
    },
    {
        "character": "Stan",
        "line": "What about him?"
    },
    {
        "character": "Cartman",
        "line": "Come on, you know. He's losing it. He's gonna crack."
    },
    {
        "character": "Kenny",
        "line": "(I think so too.)"
    },
    {
        "character": "Cartman",
        "line": "Kyle can't take the heat; he's gonna sing like a canary. Then we're all gonna take the fall for what we did."
    },
    {
        "character": "Butters",
        "line": "[walks up] Ha-ey fellas. [Cartman and Kenny avoid eye contact with Butters]"
    },
    {
        "character": "Stan",
        "line": "Butters. [looks down, then away, then sniffs, then clears his throat. After a while, Butters just walks off]"
    },
    {
        "character": "Cartman",
        "line": "[a few seconds later] Look you guys, all it takes is for one of us to crack, and we all know who the weakest link is!"
    },
    {
        "character": "Stan",
        "line": "So what should we do?"
    },
    {
        "character": "Cartman",
        "line": "We have no choice. We have to kill Kyle."
    },
    {
        "character": "Stan",
        "line": "[just looks at Cartman] ... Dude, we're not killing Kyle!"
    },
    {
        "character": "Kenny",
        "line": "(Yeah!)"
    },
    {
        "character": "Cartman",
        "line": "Why not?"
    },
    {
        "character": "Stan",
        "line": "Kyle's not gonna say anything, alright?"
    },
    {
        "character": "Cartman",
        "line": "He almost spilled the beans in the counselor's office! He can't even keep the story straight! I'm telling you guys, he's weak. He's weak, and he'll be the end of all of us. [walks off]"
    },
    {
        "character": "",
        "line": "South Park Police Department."
    },
    {
        "character": "Cashier",
        "line": "You wanted to see me, Officer Barbrady?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Yes, thanks for coming, Mr. Bell. A house was TP'ed in South Park and I need to see if you can identify the toilet paper I recovered from the scene. [walks up to a body bag] I'm... sorry I have to do this. [unzips the bag and recoils with Bell at the apparent foul odor. They both cough]"
    },
    {
        "character": "Mr. Bell",
        "line": "Oh my God."
    },
    {
        "character": "Officer Barbrady",
        "line": "Is this toilet paper from your store?"
    },
    {
        "character": "Mr. Bell",
        "line": "It's... difficult to tell, it's... so decayed, I... wait a minute, yes. Yes, I recognize the floral pattern now."
    },
    {
        "character": "Officer Barbrady",
        "line": "[takes out the tape recorder, turns it on, and speaks into it] Positive ID on the toilet paper. [turns it off and puts it away]"
    },
    {
        "character": "Mr. Bell",
        "line": "Who would... do this to toilet paper? Who?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Mr. Bell, do you remember anyone suspicious buying toilet paper in the last few days?"
    },
    {
        "character": "Mr. Bell",
        "line": "Suspicious like how?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Well, like someone who was black or Mexican or Middle Eastern."
    },
    {
        "character": "Mr. Bell",
        "line": "Nnoo, the only Mexican guy I recall bought toasted tarts and chips and... we don't allow Middle Eastern people in the store. [arrives at a realization] Oh my God! [vomits]"
    },
    {
        "character": "",
        "line": "Stark's Pond, night. A low fog moves over the surface of the water."
    },
    {
        "character": "Kyle",
        "line": "What's this all about, Cartman?"
    },
    {
        "character": "Cartman",
        "line": "I just wanted to see how you're doing, Kyle. Why don't we go out for a little boat ride?"
    },
    {
        "character": "Kyle",
        "line": "A boat ride?"
    },
    {
        "character": "Cartman",
        "line": "I just thought we should find a private place to... talk."
    },
    {
        "character": "Kyle",
        "line": "Well, okay."
    },
    {
        "character": "Cartman",
        "line": "Could you help me put this cement block and chain in the boat? [Kyle walks over and helps Cartman load the block and chain onto the boat. Kyle then hops in. Cartman retrieves a bat, loads it onto the boat, and hops in. The boat begins to float away from the shore.] Okay, let's go. [starts to row. The boat heads for the middle of the pond, and eerie music plays] So how are things, Kyle?"
    },
    {
        "character": "Kyle",
        "line": "Terrible. Every time I close my eyes I see the house we TP'ed. I see the tears of our art teacher and hear the screams of her daughters."
    },
    {
        "character": "Cartman",
        "line": "And you feel like you have to confess."
    },
    {
        "character": "Kyle",
        "line": "I don't know what to do. [Cartman reaches for the bat while Kyle has his back to him] Part of me feels like I wanna end it all now. [Cartman takes aim] Tell people what heppened. You know, I never knew how beautiful this pond was before. [Cartman moves the bat around, measuring Kyle] So cold. The world can feel like that. [Cartman moves forward, ready to whack him] So calm on the outside, as if nothing bad ever happens. [Cartman takes a whack at Kyle's head, but all Kyle does is blink] Ow. [rubs his head and turns around] What the hell are you doing, Cartman?!"
    },
    {
        "character": "Cartman",
        "line": "I'm killing you. But unfortunately I could only afford a wiffle ball bat, so it's gonna take a while. [whacks him again]"
    },
    {
        "character": "Kyle",
        "line": "Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Don't fight it, Kyle, it will only take longer. Just slip into sweet unconsciousness. [whacks him twice more]"
    },
    {
        "character": "Kyle",
        "line": "You wanna kill me?! Fine! [turns around and crosses his arms] I can't live like this anymore! Go ahead! Do it! [Cartman lowers the bat and thinks a bit, then resumes whacking Kyle. Once. Then eight more times.]"
    },
    {
        "character": "Cartman",
        "line": "Won't be long, Kyle. [whacks him three more times.]"
    },
    {
        "character": "",
        "line": "Juvenile Hall, day. Barbrady returns to Cell Block 4."
    },
    {
        "character": "Officer Barbrady",
        "line": "Josh, I need your help."
    },
    {
        "character": "Josh",
        "line": "The answer is right in front of you, but you can't see it."
    },
    {
        "character": "Officer Barbrady",
        "line": "How do you mean?"
    },
    {
        "character": "Josh",
        "line": "Tell me, the toilet paper. Was it quilted?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Yes."
    },
    {
        "character": "Josh",
        "line": "Single-sheet?"
    },
    {
        "character": "Officer Barbrady",
        "line": "No, two-ply. [Josh closes his eyes and thinks hard] What? What does that tell you?"
    },
    {
        "character": "Josh",
        "line": "Why does one toilet-paper houses"
    },
    {
        "character": "Officer Barbrady",
        "line": "To get revenge."
    },
    {
        "character": "Josh",
        "line": "No, that is incidental. Your toilet-paperers wanted to transform the art teacher's house, thus transforming her entire occupation."
    },
    {
        "character": "Officer Barbrady",
        "line": "What do you mean?"
    },
    {
        "character": "Josh",
        "line": "Your uncle, who hit you with a belt. Was he a large man?"
    },
    {
        "character": "Officer Barbrady",
        "line": "I don't have time for this, kid."
    },
    {
        "character": "Josh",
        "line": "Did he stink like bayer when he came home from work all powoor from playin' down at the pool house?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Alright alright my dad dressed me up like a little girl on poker nights and he made me sit on all my uncles' laps! [cries uncontrollably]"
    },
    {
        "character": "Josh",
        "line": "Whoa. Uh, oh. Thank you. Your toilet-paperers are most likely students in the art teacher's class, students who aren't very good at art."
    },
    {
        "character": "Officer Barbrady",
        "line": "Oh. Of course! One of her students!"
    },
    {
        "character": "Josh",
        "line": "Fly along now, Officer Barbrady. You've got some arrests to make. [turns around and whispers to himself] Fly fly flyyy. Fly fly flyyy."
    },
    {
        "character": "Warden",
        "line": "[arrives at Josh's cell] Josh, [the smile vanishes from Josh's face] were you doing the silly voice for the policeman again?"
    },
    {
        "character": "Josh",
        "line": "[normal voice] No, sir."
    },
    {
        "character": "",
        "line": "Stark's pond, night. Cartman is still whacking away at Kyle, in vain. Stan and Kenny come up in a pedal-powered boat. Both of them are pedaling. Stan looks over."
    },
    {
        "character": "Stan",
        "line": "Cartman, what are you doing?"
    },
    {
        "character": "Cartman",
        "line": "I'm getting rid of our problem. Kyle will be dead in a matter of hours."
    },
    {
        "character": "Stan",
        "line": "You don't have to kill Kyle, dude. The police made an arrest. And the person confessed!"
    },
    {
        "character": "Cartman",
        "line": "They did?"
    },
    {
        "character": "Kyle",
        "line": "They did?"
    },
    {
        "character": "Stan",
        "line": "They say they got the guy that did it down at the police station."
    },
    {
        "character": "Kyle",
        "line": "Who confessed? That doesn't make any sense."
    },
    {
        "character": "Cartman",
        "line": "But can I still kill Kyyyle?"
    },
    {
        "character": "",
        "line": "South Park Police Department, day. The boys head for the station and enter."
    },
    {
        "character": "Officer Barbrady",
        "line": "Hello boys. How are you?"
    },
    {
        "character": "Stan",
        "line": "We heard that you have the person who TP'ed the art teacher's house? Is that true?"
    },
    {
        "character": "Officer Barbrady",
        "line": "It sure is!"
    },
    {
        "character": "Cartman",
        "line": "Uh, can we see them-him-her?"
    },
    {
        "character": "Officer Barbrady",
        "line": "Right over here. [takes the boys over to the one jail cell] Yeah, we interrogated the suspect for over forty hours, and he finally cracked. [the boys turn right to see the suspect]"
    },
    {
        "character": "Butters",
        "line": "Hey fellas!"
    },
    {
        "character": "Stan",
        "line": "Butters?"
    },
    {
        "character": "Butters",
        "line": "Yep. I'm in jail."
    },
    {
        "character": "Kyle",
        "line": "You con-fessed?"
    },
    {
        "character": "Butters",
        "line": "Uh huh. Unh, they said I TP'ed the art teacher's house. [thoughtful] I don't seem to remember it, [normal] but they're pretty sure it was me. [approaches the bars and grabs them] I just can't get my behavior under control!"
    },
    {
        "character": "!Officer Barbrady",
        "line": "His parents are on their way down now."
    },
    {
        "character": "Butters",
        "line": "Yeah. And boy, are they gonna uh let me have it! Just wait till my father gets here!"
    },
    {
        "character": "Kyle",
        "line": "[turns away, and the other boys huddle around him] You guys, we can't let him do this!"
    },
    {
        "character": "Cartman",
        "line": "What are you talking about? This is a gift from God. An early Easter present all wrapped up in a pretty ribbon from Jesus Christ himself!"
    },
    {
        "character": "Butters",
        "line": "Well I'm just a little asshole, is what I am. When God made me, he must have not been payin' very close attention, 'cause I turned out wrong! Just plain wrong!"
    },
    {
        "character": "Kyle",
        "line": "Officer Barbrady, Butters didn't TP that house."
    },
    {
        "character": "Officer Barbrady",
        "line": "Why do you say that?"
    },
    {
        "character": "Kyle",
        "line": "Because it was-"
    },
    {
        "character": "Cartman",
        "line": "[rushes up and intervenes] Wiffle ball, anyone? [glares at Kyle] Anyone care for a nice game of Wiffle ball?"
    },
    {
        "character": "Butters",
        "line": "You know, it's not my parents I'm worried about. It's my girlfriend, Carrie. Why, she lives in Michigan. But when she finds out about this, woooo smokey, is she gonna be sore! She might even break up with me. And it would serve me right, too."
    },
    {
        "character": "Officer Barbrady",
        "line": "All right, boys, visiting time is over. Thanks for stopping by."
    },
    {
        "character": "",
        "line": "South Park Police Department, outside. The boys leave the station."
    },
    {
        "character": "Cartman",
        "line": "You see guys, it all worked itself out. Tadow, tadow, how you like me now? Feel a little silly now, Kyle? Tadow, how you like me now?"
    },
    {
        "character": "Kyle",
        "line": "I still feel bad, Cartman"
    },
    {
        "character": "Cartman",
        "line": "What? Hu- How can you feel bad? Somebody else is gonna pay for our crime."
    },
    {
        "character": "Kyle",
        "line": "Yeah. That makes it even worse."
    },
    {
        "character": "Cartman",
        "line": "Bu... ...eh... Kyle, you don't seem to understand. We're we're not gonna get punished for this. Ever."
    },
    {
        "character": "Kyle",
        "line": "I know."
    },
    {
        "character": "Cartman",
        "line": "So... so then, how can you feel bad?"
    },
    {
        "character": "Stan",
        "line": "He feels guilty for doing it and for letting someone else pay for it."
    },
    {
        "character": "Cartman",
        "line": "...But he's not gonna get in trouble."
    },
    {
        "character": "Stan",
        "line": "It doesn't matter if you get in trouble of not, you can still feel bad. [to Kyle] I think you're right, Kyle. Maybe we should confess."
    },
    {
        "character": "Kenny",
        "line": "(Yeah, maybe we should.)"
    },
    {
        "character": "Cartman",
        "line": "What?? Eh... [tries to be upbeat] hey you guys! There's nothing to feel bad about! We're, we're off scot-free!"
    },
    {
        "character": "Kyle",
        "line": "We feel bad for other people."
    },
    {
        "character": "Cartman",
        "line": "[looks at the other boys in disbelief] For oth-er... [winces] Uh. Oww. ...Ih ...Ih, ih, is it that ...you think you might get in trouble later?"
    },
    {
        "character": "Stan",
        "line": "Tomorrow in school we'll all tell the teacher it was us, and let her decide what to do. [points an accusing finger at Cartman] And Cartman, if you had any thread of a conscience at all, you'll do the same! [He, Kyle, and Kenny leave]"
    },
    {
        "character": "Cartman",
        "line": "Eh buh... eh... eh... Freakin' weirdos, man!"
    },
    {
        "character": "",
        "line": "South Park Police Department. The Stotches arrive at the police station and charge in."
    },
    {
        "character": "Stephen",
        "line": "Well well well! I had to see it to believe it! [approaches the jail cell]"
    },
    {
        "character": "Butters",
        "line": "Hi, Dad."
    },
    {
        "character": "Stephen",
        "line": "Don't you \"Hi, Dad\" me! Look at you! Standing behind prison bars! Again!"
    },
    {
        "character": "Butters",
        "line": "Yeah."
    },
    {
        "character": "Linda",
        "line": "What fibs have you been telling this policeman, Butters?! You know damn well you didn't toilet-paper that house!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Huh??"
    },
    {
        "character": "Stephen",
        "line": "Butters was with us all night, Officer Barbrady."
    },
    {
        "character": "Linda",
        "line": "Butters, what have we told you about confessing to crimes you didn't commit?! We have had it, mister!"
    },
    {
        "character": "Butters",
        "line": "Well, he kept accusin' me for hours, and then he shot me up with sodium pentathol."
    },
    {
        "character": "Stephen",
        "line": "And that's your excuse?!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Well, looks like I made a mistake. I... guess I'd better let you out now. [goes to the cell door and opens it]"
    },
    {
        "character": "Stephen",
        "line": "Just wait till we get you home, you little fibber!"
    },
    {
        "character": "Butters",
        "line": "[steps back from the door] Officer, can I stay in jail, please?"
    },
    {
        "character": "",
        "line": "The woods near Stark's Pond, evening. Eric appears and calls out to people behind him."
    },
    {
        "character": "Cartman",
        "line": "Come on, you guys! Hurry! [steps forward and looks back to his friends] Guys, hurry!"
    },
    {
        "character": "Stan",
        "line": "[appears] What is it, Cartman? [Kyle and Kenny trail Stan]"
    },
    {
        "character": "Cartman",
        "line": "It's over this way! Come on!"
    },
    {
        "character": "",
        "line": "Stark's Pond, later. Cartman rows the small boat to the middle of the lake, as he did before with Kyle. Lonely music plays, as before."
    },
    {
        "character": "Cartman",
        "line": "So how are things, guys?"
    },
    {
        "character": "Stan",
        "line": "Cartman, we're confessing tomorrow in school, and that's final."
    },
    {
        "character": "Cartman",
        "line": "I'm afraid I can't let that happen."
    },
    {
        "character": "Kyle",
        "line": "You can't kill all three of us, Cartman!"
    },
    {
        "character": "Cartman",
        "line": "Can't I? [pulls out the Wiffle ball bat and starts whacking the other three. They just look at each other.]"
    },
    {
        "character": "",
        "line": "South Park Elementary, next day. Officer Barbrady enters the principal's office."
    },
    {
        "character": "Officer Barbrady",
        "line": "Excuse me, everyone. [Mr. Mackey and Mrs. Streibel turn around. Principal Victoria sits at her desk] I have someone with me who can tell us all who toilet-papered the art teacher's house! [the door opens and Josh is rolled in tied up to a dolly by a policeman. He quickly looks to his left] Josh insisted he be able to tell you the names of the toilet paperers in person. [on top of a file cabinet near the door is a roll of toilet paper. Josh smiles]"
    },
    {
        "character": "Mr. Mackey",
        "line": "Uh, that's nice, Officer Barbrady, but we actually don't need to know-"
    },
    {
        "character": "Kyle",
        "line": "[rushes in] Hold it! [Stan and Kenny rush in behind him] Principal Victoria, Mr. Mackey, Mrs. Streibel. We have something we need to tell you."
    },
    {
        "character": "Principal Victoria",
        "line": "All right. Will you people stop barging into my office, please?"
    },
    {
        "character": "Josh",
        "line": "What's the matter, Principal Victoria? Was your mother abusive? Did she spank your thighs with cold cuts and stick umbrellas up your ass?"
    },
    {
        "character": "Principal Victoria",
        "line": "[pointing] Get him out of here!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Uh, Policeman Brown, will you take Josh outside, please?"
    },
    {
        "character": "Josh",
        "line": "[being rolled out] Ooh, Policeman Brown, never quite made officer. Why is that, Policeman Brown? [the roll of toilet paper is now gone...]"
    },
    {
        "character": "Kyle",
        "line": "We have to confess that we were the ones that-"
    },
    {
        "character": "Mr. Mackey",
        "line": "It's too late, boys, m'kay? We already know everything."
    },
    {
        "character": "Stan",
        "line": "You, you do? How?"
    },
    {
        "character": "Cartman",
        "line": "[steps forward from the back of the room] Hi guys."
    },
    {
        "character": "Kyle",
        "line": "Cartman??"
    },
    {
        "character": "Cartman",
        "line": "I told them everything, you guys. It's over."
    },
    {
        "character": "Principal Victoria",
        "line": "Luckily for us, one of you had enough of a conscience to come forward."
    },
    {
        "character": "Cartman",
        "line": "My consciences just caught up with me."
    },
    {
        "character": "Kyle",
        "line": "That's not fair!"
    },
    {
        "character": "Mr. Mackey",
        "line": "You all get two weeks of detention, except Eric, who gets one week for being brave."
    },
    {
        "character": "Kyle",
        "line": "But, but he's lying! He doesn't have a conscience!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Well, I guess my work here is done. After all this, I'm gonna need a long vacation. [turns and exits the room]"
    },
    {
        "character": "Kyle",
        "line": "This was supposed to be my story! My coming to terms with a guilty conscience! This isn't fair!"
    },
    {
        "character": "",
        "line": "South Park Elementary, hallway outside the principal's office."
    },
    {
        "character": "Officer Barbrady",
        "line": "Okay, Josh, time to go back to the... [sees Policeman Brown covered in toilet paper and Josh's dolly empty] Oh no!"
    },
    {
        "character": "Policeman Brown",
        "line": "He... He was too fast for me. He ran out the door!"
    },
    {
        "character": "Officer Barbrady",
        "line": "Couldn't you have gone after him?"
    },
    {
        "character": "Policeman Brown",
        "line": "Well, ah I'm covered in toilet paper. I'd look silly."
    },
    {
        "character": "",
        "line": "South Park Elementary cafeteria, after school. Mr. Mackey addresses the detained. The boys are there, as well as two of the sixth graders, and Craig and Bebe."
    },
    {
        "character": "Mr. Mackey",
        "line": "Welcome to detention. You will be here till five o'clock, so make good study use of your time. M'kay?"
    },
    {
        "character": "Stan",
        "line": "Wugh! Two weeks of this!"
    },
    {
        "character": "Kyle",
        "line": "Yeah. But I have to say, I feel a lot better now."
    },
    {
        "character": "Cartman",
        "line": "I know what you mean, Kyle. I realize now that even though you might not get caught doing something bad, you can still get caught later."
    },
    {
        "character": "Kyle",
        "line": "Oh Jesus! [buries his face in his hands, then raises it as Cartman talks]"
    },
    {
        "character": "Cartman",
        "line": "I didn't feel bad before, but now I just feel terrible."
    },
    {
        "character": "Kyle",
        "line": "You just feel bad for yourself that you're in detention!"
    },
    {
        "character": "Cartman",
        "line": "Right. I guess I learned today that sometimes you-"
    },
    {
        "character": "Kyle",
        "line": "Oh, stop it, Cartman! You didn't learn anything! Not a God-damned thing!"
    },
    {
        "character": "Cartman",
        "line": "Hm."
    },
    {
        "character": "",
        "line": "South Park Police Department, afternoon. Barbrady stands at his desk. The phone rings and he answers it."
    },
    {
        "character": "Officer Barbrady",
        "line": "Police station."
    },
    {
        "character": "Josh",
        "line": "[over the earpiece] Hello Officer Barbrady."
    },
    {
        "character": "Officer Barbrady",
        "line": "Josh? Josh, where are you?!"
    },
    {
        "character": "",
        "line": "An undisclosed location, day."
    },
    {
        "character": "Josh",
        "line": "I'm afraid that giving away my location might be harmful to my freedom, officer. I just wanted to thank you for helping me get out of that dingy cell."
    },
    {
        "character": "",
        "line": "South Park Police Department."
    },
    {
        "character": "Officer Barbrady",
        "line": "Josh, you have to go back to Juvenile Hall. You only have a three-week sentence."
    },
    {
        "character": "",
        "line": "Washington DC, day."
    },
    {
        "character": "Josh",
        "line": "Sorry, officer, gotta run. There's something I've been meaning to do for quite some time. Ciao. [hangs up. Next to him are two boxes full of toilet paper. He picks them up and leaves the phone. The camera zooms out to reveal the location to be a park across the street from the White House. Josh heads for the White House, but stops at the curb to gaze at it.]"
    }
]